{
    "id": "2019-Navy-PB-1319-MJBOOK-2-0-1cb3285e5eb3096a00efd774d79545d93ed7b90effed5e9c90908e9fa9d3e340-61",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605215N"
        },
        "ProgramElementTitle": {
            "val": "(U)Mission Planning"
        },
        "R1LineNumber": {
            "val": "164"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "32.876"
            },
            "CurrentYear": {
                "val": "33.430"
            },
            "BudgetYearOne": {
                "val": "32.714"
            },
            "BudgetYearOneBase": {
                "val": "32.714"
            },
            "BudgetYearTwo": {
                "val": "42.194"
            },
            "BudgetYearThree": {
                "val": "35.634"
            },
            "BudgetYearFour": {
                "val": "33.840"
            },
            "BudgetYearFive": {
                "val": "34.564"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY 2019 funding request was reduced by $0.312 million to account for the availability of prior year execution balances."
        },
        "ProgramElementMissionDescription": {
            "val": "The Mission Planning PE is used to develop automated mission planning systems to support Naval Aviation.  \n\nThe Joint Mission Planning System (JMPS) is the designated automated mission planning system for the Navy, supporting over 40 Type\/Model\/Series (T\/M\/S) of U.S. Navy and Marine Corps aircraft and expeditionary forces.  JMPS-M (Maritime) enables weapon system employment by providing the information, automated tools, and decision aids needed to rapidly plan aircraft, weapon, or sensor missions, load mission data into aircraft and weapons, conduct mission rehearsal, execute missions, and conduct post-mission analysis.  JMPS-E (Expeditionary) is a scalable, tailorable, and collaborative web-based mission planning and execution monitoring tool for Amphibious Squadron (PHIBRON) staffs embarked with each Amphibious Ready Group (ARG) and Expeditionary Strike Group (ESG). Electronic Kneeboard (EKB) is a mobile device configured with various software applications and features to support aircrew during pre-flight planning, in-flight re-planning and mission execution, and post-mission debriefing and analysis. Common Munitions BIT\/Reprogramming Equipment (CMBRE) provides USN\/USMC forces the critical capability to preform built-in test and programming\/reprogramming of various weapons.  FY20 and out includes funding for the research and the development in order to develop upgrades to the CMBRE system to support advanced operational capabilities, address system obsolescence, meet cyber security requirements, and meet mission readiness requirements.  \n\nThe Stores Planning and Weaponeering Module, also referred to as Weaponeering and Stores Planning (WASP), is an integrated software product that allows aircrew to determine the best combinations of weapons and delivery conditions to achieve the desired level of target damage, eliminate weapon delivery solutions that violate aircraft T\/M\/S specific safety-of-flight envelopes, and perform detailed weapons employment planning for F\/A-18 and E\/A-18G aircraft.   \n\nCommon Helicopters is used to develop unique planning capabilities and tools for helicopters (e.g. Weight and Power Calculators (WPC), Common Mission Data Loader (CMDL), Weapon Employment Zone Overlays Tool (WEZOT) and Point Selection Tool (PST)) for integration into JMPS Mission Planning Environments (MPE). Starting in FY19, Common Helicopters RDT&E funding in PU 2312 is being consolidated with JMPS-M Mission Planning funding in PU 2213.  \n \n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under MISSION PLANNING because it includes those projects that have passed Milestone B approval and are conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production decision."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.570"
                },
                "CurrentYear": {
                    "val": "33.430"
                },
                "BudgetYearOne": {
                    "val": "33.570"
                },
                "BudgetYearOneBase": {
                    "val": "33.570"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.876"
                },
                "CurrentYear": {
                    "val": "33.430"
                },
                "BudgetYearOne": {
                    "val": "32.714"
                },
                "BudgetYearOneBase": {
                    "val": "32.714"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.694"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.856"
                },
                "BudgetYearOneBase": {
                    "val": "-0.856"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.690"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.312"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.312"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.544"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.544"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.004"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2019 funding request was reduced by $0.312 million to account for the availability of prior year execution balances.\n\nTechnical: N\/A\n\nSchedule:\n\n2213:\n\nClarified names of Mission Planning Environment (MPE) Integration and Test events and extended framework development period through 4th QTR 2020 to include latest USAF schedules. Changed Increment 4 IOC date to 1st QTR 2020 to align with the program APB. Extended 32-bit MPE integration and test out to 4th QTR 2020 to align with platform needs. \n\n2311:\n\nDue to the incorporation of agile software development into the WASP program, the Systems Development and Test and Evaluation periods for each WASP version are concurrent, thus accelerating IOCs of each version by at least one quarter to meet emerging warfighter requirements within available budget.\n\n2312:\n\nCommon Helicopter efforts are consolidated under PU 2213 Mission Planning FY 2019 and out."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2213"
                    },
                    "ProjectTitle": {
                        "val": "Mission Planning"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "21.415"
                        },
                        "CurrentYear": {
                            "val": "21.580"
                        },
                        "BudgetYearOne": {
                            "val": "21.868"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.868"
                        },
                        "BudgetYearTwo": {
                            "val": "30.889"
                        },
                        "BudgetYearThree": {
                            "val": "24.155"
                        },
                        "BudgetYearFour": {
                            "val": "22.272"
                        },
                        "BudgetYearFive": {
                            "val": "22.744"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "JMPS-Maritime (JMPS-M) is the designated automated mission planning system for naval aviation, supporting over 40 T\/M\/S of U.S. Navy and Marine Corps aircraft. JMPS-M enables weapon system employment by providing the information, automated tools, and decision aids needed to rapidly plan aircraft, weapon, or sensor missions, load mission data into aircraft and weapons, conduct mission rehearsal, and conduct post-mission analysis. JMPS-M is a mission critical system which is a co-development effort between the United States Navy (USN) and United States Air Force (USAF). Common requirements are identified and core JMPS-M capabilities are developed and prioritized in an evolutionary approach. An individual JMPS-M Mission Planning Environment (MPE) requires the JMPS framework, common components, unique planning components (UPCs), federated applications, and the necessary system hardware required to satisfy mission planning objectives. Most tactical naval aviation platforms are dependent solely on JMPS-M to plan precision guided munitions, sensor systems, tactical data links, secure voice communications, and basic Safety of Flight functions. Common helicopter functionality will be developed for implementation in Joint Mission Planning System (JMPS). Common Helicopter components include, Weight and Power Calculators (WPC), Common Mission Data Loader (CMDL), Weapon Employment Zone Overlays Tool (WEZOT) and Point Selection Tool (PST).\n\nThe JMPS-M Increment 4 release transitions JMPS-M from Windows 7\/32-bit Operating System (OS) (JMPS-M Increment 3) to Windows 10\/64-bit OS. Transition to 64-bit allows for memory space expansion to accommodate future Microsoft Operating Systems, emerging technologies, and meet critical required cyber security mandates. Increment 4 development requires software conversion and refactoring to address memory limitations and system errors resulting in JMPS-M computer crashes. The transition from the current 32-bit architecture to a 64-bit architecture provides additional memory access, increased planning efficiencies, and creates an increased stability in the architecture resulting in fewer system crashes and improved cyber security. JMPS-M 64-bit transition efforts (Increment 4) also support platform capability enhancements that require increased amounts of data and processing power.\n\nNext Generation Naval Mission Planning will provide a new mission planning system which supports future multi-domain mission planning, execution, management, and mission analysis capabilities required by the 21st century warfighter. Next Generation Naval Mission Planning will modernize system architecture to address technological obsolescence, deliver collaboration and automation capabilities, and leverage service-oriented architecture to provide affordable revolutionary improvements in workflow, usability, cybersecurity, portability of mission planning, mission execution, and mission analysis functions.\n\nFY20 and out includes funding for Common Munitions BIT\/Reprogramming Equipment (CMBRE) which provides the USN\/USMC the critical capability to perform built-in-test and programming\/reprogramming of various weapons. Funding will provide research and the development in order to develop upgrades to the CMBRE system to support advanced operational capabilities, address system obsolescence, meet cyber security requirements, and meet mission readiness requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Mission Planning System Expeditionary (JMPS-E)"
                                    },
                                    "Description": {
                                        "val": "JMPS Expeditionary (JMPS-E): JMPS-E provides a scalable, tailorable, mission planning and execution monitoring tool for Amphibious Squadron staffs. The primary focus of this system is to provide an automated capability to assist planners with mission analysis, course of action development and automated creation of doctrinal orders based on planning data in the system. JMPS-E provides a digital map enabling better response times to changing plans, easier distribution of planning artifacts and a reduction in human error during the planning process. The variety and geographically separated nature of forces involved with Ship to Objective Maneuver (STOM) amplifies the need for web-based technologies to enable collaborative planning, improve overall situational awareness and enable the monitoring of mission execution from different locations. The primary outputs are tasking orders, route plans, battlespace geometries and decision briefs. The system will also incorporate modeling and simulation tools to rehearse and deconflict mission plans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.908"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete testing of JMPS-E MPE Version 2.0.2.  Development, integration and testing of JMPS-E MPE Version 3.0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.946"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue integration and testing of JMPS-E MPE Version 3.0."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.953"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.953"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Field JMPS-E MPE Version 3.0. Begin development, integration and testing of JMPS-E MPE Version 3.1 which updates the JMPS-E UPC and required Common Components, Federated Applications, COTS and GOTS software products to maintain current capabilities and required cyber posture."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.007M from FY 2018 to FY 2019 due to additional efforts required to support fielding and development of multiple JMPS-E versions (3.0 and 3.1)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Planning Environment Program Mgmt, Integration, and Test"
                                    },
                                    "Description": {
                                        "val": "Mission Planning Environment (MPE) Integration and Test efforts support the Navy's developmental testing\/operational testing, integration and system of system testing for MPE fielding, integrating, testing, and managing Electronic Kneeboard (EKB) efforts.  Life-cycle management efforts consist of integration of components provided by various developers into a platform-centric MPE and testing of the integrated MPE.  MPE integration and testing results in a consistent and repeatable system configuration that enables stability and reliability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.107"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue integration and testing, project management and systems engineering for current MPEs as well as supporting future releases of JMPS and Electronic Kneeboard (EKB) software to the fleet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.744"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue integration and testing, project management and systems engineering for current MPEs.  Continue integration for three new variants of the C\/KC-130J, wireless JMPS, and EKB efforts.  These wireless efforts will require additional testing and integration to meet cyber mandates.  Continue supporting future releases of JMPS and Electronic Kneeboard (EKB) software to the fleet.  Begin Next Generation Naval Mission Planning requirement analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.687"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.687"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue mission planning integration and testing, project management and system engineering for over 40 T\/M\/S to include fielding of Windows 10.  Test and verify capabilities to support multi-ship mission coordination and update\/validate fleet requirements in support of Next Generation Naval Mission Planning MPEs. Conduct integration and test of EKB to the fleet for functionality and cyber security mandates."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $0.057M from FY 2018 to FY 2019 due to reduced MPE integration and test efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JMPS Framework (FW) and Common Components (CC) Development"
                                    },
                                    "Description": {
                                        "val": "Continue development and integration of JMPS 64-bit FW which provide additional capabilities for all naval aircraft to include airdrop, air refueling, and enhanced installations. Common component development include Common Mission Data Loader (CMDL), Weapon Employment Zone Overlays Tool (WEZOT) and Point Selection Tool (PST). FW support tasks include: system engineering processes, management interface controls, software architectural analysis, requirements management and a centralized website for Mission Planning Environment (MPE) developers.  As platform(s) requirements emerge for new and enhanced mission planning capabilities, the demand for more complex integrated applications and software products increases.  The transition to a 64-bit architecture provides the volume of integrated mission planning capability required by complex integrated combat operations.  Common Components software updates augment core mission planning capabilities across multiple T\/M\/S.  The JMPS FW and Common Components will also transition to Windows 10."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue implementation of the Increment-4 JMPS Framework Core 64-bit development transition activities.  Major events include the development of Cybersecurity safeguards addressing IA mandates, development of additional JMPS help features, and code conversion for the JMPS Core Framework (Basic Flight Planning Capabilities) and Common Components for MPE\/UPCs including significant efforts for the F\/A-18 A-F and E\/A-18G platforms.  In addition, efforts include initiation of 64-bit transition development for JMPS Common Components used by multiple platforms.  The transition of the JMPS Common Components are aligned to meet platform(s) requirements for new and enhanced mission planning capability in a 64-bit environment.  The 64-bit transition is required to address system performance issues (RAM) with the fielded Mission Planning Environment (MPE); thus reducing system crashes while improving mission planning performance for the fleet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.890"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the Increment-4 JMPS Framework Core 64-bit development transition activities. Major activities include completing the 64-bit development and continuation of transitioning Windows 10 operating system used by multiple platforms. The transition of the JMPS Common Components are aligned to meet platform(s) requirements for new and enhanced mission planning capability in a 64-bit environment. The 64-bit transition is required to address system memory requirements for fielded Mission Planning Environments (MPEs); thus reducing system crashes while improving mission planning performance for the fleet. All Common Components software updates across multiple T\/M\/S will be completed to support Increment 4. Integration activities will continue as platforms deliver their 64-bit Unique Planning Capabilities to NavMPS for integration, testing and fielding."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.228"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and initiate the fielding of JMPS-M Increment 4 to include co-development with the Air Force for 64 bit Frameworks. This effort will result in Increment 4 being aligned with the Air Force for improved joint service affordability while also enhancing the systems cyber security. Continue development activities for NGNMPS framework which include implementing a modular, scalable architecture to support cyber security implementations for compliance with cyber mandates. Continue development and integration of common components to meet platform(s) requirements for new and enhanced mission planning capability required in a 64-bit environment.  Integration activities will continue as platforms deliver their 64-bit Unique Planning Capabilities for integration, testing and fielding."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.338M from FY 2018 to FY 2019 due to additional efforts required to initially field Increment 4 and the consolidation of Common Helicopter PU into this Mission Planning PU."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The initial Joint Mission Planning System (JMPS) development effort was a phased evolutionary approach. JMPS is a post Milestone III program and Initial Operational Capability (IOC) occurred in December 2005.  Cost Plus Award Fee (CPAF) and Cost Plus Incentive Fee (CPIF) contracts were awarded during initial development. During the down-select process, one contractor was selected to develop the JMPS architecture work and Version 1.0 basic flight planning components. Additional phases focused on strike planning requirements (i.e., support Precision Guided Missions and other tactical data intensive missions) in order to migrate platforms from legacy mission planning systems to JMPS. The USAF and USN continued the joint development of JMPS Frameworks via the USAF Mission Planning Enterprise Contract, which is used for JMPS Framework software development. The USN integration and fielding strategy supports a Mission Planning Environment (MPE) focus, where the JMPS Framework and other software components are integrated, tested, and fielded by T\/M\/S. As platforms plan their migration to newer versions of JMPS, the acquisition strategy, plan, and program baseline will be updated in order to divest legacy mission planning systems, meet the evolving requirements for integrated mission planning, and lower total life cycle cost. JMPS End of Life (EOF) is scheduled for 2027.  This necessitates the development of a replacement system, Next Generation Naval Mission Planning System (NGNMPS).  NGNMPS will provide a new mission planning system which supports future multi-domain mission planning, execution, management, and mission analysis capabilities required by the 21st century warfighter. NGNMPS will modernize system architecture to address technological obsolescence, deliver collaboration and automation capabilities, and leverage service-oriented architecture to provide affordable revolutionary improvements in workflow, usability, cybersecurity, portability of mission planning, mission execution, and mission analysis functions.  NGNMPS requirements and acquisition documentation development will start in 2018."
                        },
                        "PerformanceMetrics": {
                            "val": "Average time to plan a flight:  Threshold value is  < 1 hour average time to plan a flight that includes a Military Training Route (MTR), routing to and from the MTR, kneeboard card production, Instrument Flight Rules (IFR) flight planning materials and a Data Transfer Device (DTD) Load.  Objective value is < 30 minutes average time to plan a flight that includes a MTR, routing to and from the MTR, kneeboard card production, IFR flight planning materials and a DTD Load. \n\nInteroperability:  Threshold value is 100% of top level Interoperability Exchange Requirements (IERs) designated critical will be satisfied.   \nObjective value is 100% of top level IERs will be satisfied."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Prior to FY17, the Mission Planning PU 2213 was funded under PE 0604231N."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "FY19 continues to support incremental funding for the Primary Software Development Framework (FW) efforts awarded via a competitive 2nd Qtr. FY18 contract award. The performing activity and location are currently TBD to support a competitive contracting strategy. Once awarded, the performing activity and location will be updated to reflect the selected contractor."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Primary Software Development\/JMPS Expeditionary"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.650"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.665"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.665"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary Software Development, FW"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Long Beach, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary Software Development\/(Human Factors)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Georgia Technical Research Institute (GTRI)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Atlanta, GA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.890"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary Software Development (SEIC)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.918"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.728"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.728"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Integrated Logistics Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCWD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Point Mugu, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.208"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.212"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.216"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.216"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Eng & Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCWD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Point Mugu, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.487"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.324"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.320"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.320"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.136"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.326"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.326"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "The increase in FY18 COMOPTEVFOR Operational Test (OT) support is due to increased testing for new platforms transitioning to JMPS, increased testing requirements required for new cyber requirements, and additional testing required for the incorporation of new wireless technologies for multiple JMPS platforms"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCWD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Point Mugu, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.311"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.579"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.343"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.343"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "COMOPTEVFOR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.046"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.377"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.377"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support and Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxtent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.704"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.704"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ausley Associates"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington Park, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.509"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.675"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.689"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.689"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2019PB_0605215N_2213_FILE1.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Joint Mission Planning Systems (JMPS)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisition Milestone: JMPS-E 3.0 Initial Operational Capability (IOC)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisition Milestone: JMPS-M Increment 4\/ 64-Bit Initial Operational Capability (IOC)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisition Milestone: JMPS-E 4.0 Initial Operational Capability (IOC)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Primary Software Development: Framework and Common Component Development: Increment 4 64-Bit Architecture Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Primary Software Development: Framework and Common Component Development: NGNMPS Framework Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Primary Software Development: Framework and Common Component Development: JMPS-E 3.0\/3.1 Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Primary Software Development: Framework and Common Component Development: JMPS-E 4.0 Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Primary Software Development: Framework and Common Component Development: CMBRE Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Planning Environment (MPE) Development: MPE Integration and Test: 32 bit MPE Integration (V1.3.5)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Planning Environment (MPE) Development: MPE Integration and Test: 64 bit MPE Integration (V1.5)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Planning Environment (MPE) Development: MPE Integration and Test: NGNMPS Integration and Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Planning Environment (MPE) Development: MPE Integration and Test: JMPS-E 3.0\/3.1 Integration and Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Planning Environment (MPE) Development: MPE Integration and Test: JMPS-E 4.0 Integration and Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2311"
                    },
                    "ProjectTitle": {
                        "val": "Stores Planning and Weaponeering Module"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "10.847"
                        },
                        "CurrentYear": {
                            "val": "11.185"
                        },
                        "BudgetYearOne": {
                            "val": "10.846"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.846"
                        },
                        "BudgetYearTwo": {
                            "val": "11.305"
                        },
                        "BudgetYearThree": {
                            "val": "11.479"
                        },
                        "BudgetYearFour": {
                            "val": "11.568"
                        },
                        "BudgetYearFive": {
                            "val": "11.820"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Prior to FY17, Stores Planning and Weaponeering Module (PU 2311) was budgeted under Standards Development (PE 0604215N)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Weaponeering and Stores Planning (WASP) components are integrated software products that allow aircrew to determine the best combinations of weapons and delivery conditions to achieve the desired level of target damage, eliminate weapon delivery solutions that violate aircraft Type\/Model\/Series (T\/M\/S) specific safety-of-flight envelopes, and perform detailed weapons employment planning. WASP is approved by the Air Warfare Division (OPNAV N98) as the flight clearance implementation system for the F\/A-18 A, A+, B, C, D, D (RC), E, F, EA-18G; and includes potential support for other platforms, to include F-35.  WASP components will alert pilots if their planned weapon release conditions meet flight clearance limits, will result in bomb-to-bomb collisions, bomb-to-aircraft collisions, aircraft overstress, or excessive risk of aircraft loss\/damage in the event of fuze early bursts. Weapon employment planning is fundamental to the Joint Capability Area of Force Application and joint mission areas of Strike and Amphibious Warfare.  WASP provides the Navy and Marine Corps with weaponeering capabilities that are critical requirements for Interdiction, Armed Reconnaissance and Close Air Support mission planning.  WASP is critical to successful employment of the Joint Mission Planning System (JMPS-M)  for the F\/A-18 A-F and EA-18G Mission Planning Environments (MPEs).  WASP also affordably leverages a multitude of Government Furnished Information software components and tools including aircraft target maneuver simulations, and weapon flyout models.  WASP requires updates as emergent requirements for new aircraft T\/M\/S, stores and weapons are approved, new flight clearances and flight restrictions are issued by Naval Air Systems Command Headquarters (NAVAIRSYSCOM), and cyber security mandates are released."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Includes associated system engineering design, development, installation, integration and software development for Weaponeering and Stores Planning (WASP) components to support F\/A-18 A-F and EA-18G. Provide domain engineering support for weapons separation, aircraft loads, flutter, fuzing and safe escape for application to WASP. Provide analysis of new requirements, allocation of requirements, design oversight, and life cycle management of the WASP program. Develop new aircraft configuration, aircraft loading, weapon optimization, store release and delivery planning components for F\/A-18 A-F and EA-18G new flight clearances and flight restrictions issued by NAVAIRSYSCOM. Provide configuration management, system administration, quality assurance, documentation, metrics and software risk management for WASP. Acquire, integrate and modify numerous Government Furnished Information (GFI) software components and tools (aircraft target maneuver simulations, weapon flyout models, etc.) that are used for the WASP software development. Integrate WASP with Joint Standoff Weapon\/Joint Direct Attack Munitions\/Standoff Land-Attack Missile - Expanded Response and other weapons mission planning systems as required."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue WASP v4.0 development and release multiple database updates. Further define requirements for WASP v4.1"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.803"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete WASP v4.0 development.  Begin the development of WASP v4.1 and the release of multiple database updates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.685"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.685"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue WASP v4.1 development and release of multiple database updates to WASP v4.0."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $0.118M from FY2018 to FY2019 due to accounting for the availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation (T&E)"
                                    },
                                    "Description": {
                                        "val": "Provide test and evaluation for unit and system level testing; functional qualification testing; safety of flight certification testing; integration and standards compliance testing for WASP versions.  Provide JMPS MPE Integration test support. Provide testing and test support to ensure all components (to include internally developed software, externally developed GFI) comply with Department of Navy (DoN) and Department of Defense (DoD) software mandates and directives. These include Integrated Shipboard Network System IT-21, Cyber Risk Management Framework (RMF), and Navy Marine Corps Intranet (NMCI). All Fleet released software must comply with DoN and DoD software directives to permit execution on ship Local Area Networks or NMCI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete test and evaluation of WASP major v3.3 and release to the Fleet.  Begin testing of WASP major v4.0.  Complete test and evaluation of multiple database updates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.194"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete test and evaluation of WASP major v4.0 to support an FY19 release to the Fleet.  Complete test and evaluation of multiple database updates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.020"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.020"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue test and evaluation of WASP v4.1 and complete test and evaluation on multiple database updates to WASP v4.0."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $0.147M from FY2018 to FY2019 due to accounting for the availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management\/Systems Engineering"
                                    },
                                    "Description": {
                                        "val": "Provide program management and systems engineering support, which includes requirements definition and analysis, compliance with Naval Air Systems Command systems engineering technical review processes, acquisition documentation development, cost, schedule and performance management, and compliance with external directives.  Provide travel for government personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.037"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue project management and systems engineering support to the WASP for future software releases to the fleet.  Additional support will be required for multiple database releases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.188"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue project management and systems engineering support to the WASP for future software releases to the fleet.  Additional support will be required for multiple database releases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue project management and systems engineering support to the WASP for future software releases to the fleet.  Provide continued support for multiple database releases."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $0.047M from FY2018 to FY2019 due to accounting for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Weaponeering and Stores Planning (WASP) products, delivered annually, are developed in-house by NAVAIR consisting of Naval Air Warfare Center Aircraft Division and Naval Air Warfare Center Weapons Division engineers and support contractors.  The team has migrated to a smaller government team that provides functional expertise in aircraft safety-of-flight (air-vehicle stores compatibility, weapons separation, aircraft aerodynamic flutter, ground\/flight loads, authorized fuze arm times, aircraft safe escape), guided weapons employment and weapons effects against targets, with the majority of the software development conducted by various contractors. The Government, engineering, test, and support teams (test facilities, functional qualification testing and certification\/accreditation test) are supplemented with contractor labor."
                        },
                        "PerformanceMetrics": {
                            "val": "Average time to plan a flight: Threshold value is < 1 hour average time to plan a flight that includes full aircraft loadout and weapons delivery safe escape planning. Objective value is < 15 minutes average time to plan a flight that includes full aircraft loadout and weapons delivery safe escape planning. End product is a pilot's z-diagram kneeboard card.  \n\nInteroperability:  Threshold value is 100% stand alone value. \nObjective value is 100% stand alone value."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Prior to FY17, PU 2311 was budgeted under PE 0604215N."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "The FY19 Product Development (V4.X) effort increase from FY18 is accounting for costs associated with the development of WASP V4.1 and multiple minor builds to support WASP v4.0. In FY18, the minor build costs were budgeted under the Primary Software Development line and the major build costs were budgeted under Product Development (V4.X).  There is no cost increase for WASP development efforts in FY19."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Naval Air Warfare Center Aircraft Division NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.177"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.102"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Air Force Seek Eagle"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hill Air Force Base, UT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.083"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.085"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.085"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.085"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Primary Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.781"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.721"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.502"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.502"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development (V4.X)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.895"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test & Evaluation (Gov't)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.185"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.303"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.190"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.190"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test & Evaluation (Contractor)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.084"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.891"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.830"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.830"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.805"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.805"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Engineering and Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.003"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.219"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Ausley"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington Park, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.441"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.307"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.307"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.198"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.341"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Engineering Support: Guided Weapons"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Naval Air Warfare Center Weapons Division NAWCWD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "China Lake, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.023"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.223"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Wyle"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.250"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.950"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.950"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Govt Engineering Support: Mission Planning Environment Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCWD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Point Mugu, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVAIR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.015"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.015"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.015"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2019PB_0605215N_2311_FILE1.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Stores Planning and Weaponeering Module"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Systems Development: WASP v4.0 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Systems Development: WASP v4.1 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Systems Development: WASP v5.0 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Systems Development: WASP v5.1 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Systems Development: WASP v5.2 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test & Evaluation Milestones: WASP v3.3 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test & Evaluation Milestones: WASP v4.0 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test & Evaluation Milestones: WASP v4.1 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test & Evaluation Milestones: WASP v5.0 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test & Evaluation Milestones: WASP v5.1 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test & Evaluation Milestones: WASP v5.2 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G):"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Milestones: WASP v3.3 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G) IOC::"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Milestones: WASP v4.0 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G) IOC::"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Milestones: WASP v4.1 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G) IOC::"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Milestones: WASP v5.0 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G) IOC::"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Milestones: WASP v5.1 (F\/A-18A\/B\/C\/D\/E\/F, EA-18G) IOC::"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Milestones: Ongoing Database Updates:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2312"
                    },
                    "ProjectTitle": {
                        "val": "Common Helicopters"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.614"
                        },
                        "CurrentYear": {
                            "val": "0.665"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.279"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Prior to FY17, Common Helicopters (PU 2312) was budgeted under Standards Development (PE 0604215N).  FY19 and out Common Helicopters (PU 2312) was consolidated under PU 2213 Mission Planning in this PE."
                        },
                        "ProjectMissionDescription": {
                            "val": "Automated mission planning systems have focused on developing planning capabilities for fixed-wing aircraft, while the unique planning requirements for helicopters are not yet fully addressed. The unique and enhanced automated mission planning requirements that must be developed and implemented for helicopters include: data loading, an enhanced route editor (serpentine routing, hover), manipulation of higher fidelity (smaller scale) maps and imagery, enhanced performance tools (performance in and out of ground effect, performance degradation due to atmospheric conditions & elevation), and enhanced fidelity of landing zone, target zone, and threat analyses. The following type\/model\/series aircraft are supported by this PU: AH-1W\/Z, UH-1N\/Y, H-46\/E, H-53D\/E, H-60H\/R\/S and V-22. Common helicopter functionality will be developed for implementation in Joint Mission Planning System (JMPS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Development of Common Helicopter functionality and integration with JMPS Framework Versions and 64-bit Operating System. Common Components include Common Mission Data Loader (CMDL), Weapon Employment Zone Overlays Tool (WEZOT) and Point Selection Tool (PST)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.614"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of Common Mission Data Loader (CMDL), Point Selection Tool (PST), and Weapon Employment Zone Overlays Tool (WEZOT)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of Common Mission Data Loader (CMDL), Point Selection Tool (PST), and Weapon Employment Zone Overlays Tool (WEZOT)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $0.400M from FY2018 to FY2019 due to consolidating Common Helicopter efforts under PU 2213 Mission Planning."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Integration and test of Common Helicopter functionality with JMPS Framework Versions and 64-bit Operating System. Common Components include Common Mission Data Loader (CMDL), Weapon Employment Zone Overlays Tool (WEZOT) and Point Selection Tool (PST)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.265"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide integration and test support for Common Mission Data Loader (CMDL), Point Selection Tool (PST), and Weapon Employment Zone Overlays Tool (WEZOT) for the 64-bit transition to JMPS framework 1.5.x."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $0.265M from FY2018 to FY2019 due to consolidating Common Helicopter efforts under PU 2213 Mission Planning."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Export Mission Data to Data Transfer Device: Threshold value is < 12 minutes to transfer navigation, communication, weapon system initialization settings and intelligence data. Interoperability: Threshold value is 100% of top level Information Exchange Requirements (IERs) designated critical will be satisfied. Objective value is 100% of top level IERs will be satisfied."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Primary Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Joint Technology Engineering"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Valparaiso, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.614"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.014"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.014"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Integration and Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCWD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Point Mugu, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.265"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.265"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2019PB_0605215N_2312_FILE1.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Common Helicopters"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "System Development: Common Mission Data Loader (CMDL): CMDL 3.3.1"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System Development: Common Mission Data Loader (CMDL): CMDL 3.3.2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System Development: Weapons Employment Zone Overlay Tool (WEZOT): WEZOT 1.3.1"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System Development: Weapons Employment Zone Overlay Tool (WEZOT): WEZOT 1.3.2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System Development: Point Selection Tool (PST): PST 1.3.1"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System Development: Point Selection Tool (PST): PST 1.3.2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Common Helo Test and Evaluation:"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}