{
    "id": "2019-Navy-PB-1319-JBOOK-537288bb42cd06b820f36efcf65b2a737491c736bab4820c1757960e05e3c4ff-4",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Applied Res"
        },
        "R1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "192.579"
            },
            "CurrentYear": {
                "val": "125.557"
            },
            "BudgetYearOne": {
                "val": "124.049"
            },
            "BudgetYearOneBase": {
                "val": "124.049"
            },
            "BudgetYearTwo": {
                "val": "121.889"
            },
            "BudgetYearThree": {
                "val": "121.896"
            },
            "BudgetYearFour": {
                "val": "124.342"
            },
            "BudgetYearFive": {
                "val": "126.868"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The activities described in this program element (PE) address future Navy and Marine Corps capabilities needed to maintain maritime superiority and ensure national security.  They are based on input from Naval Research Enterprise stakeholders (including the Naval enterprises, the combatant commands, OPNAV and Headquarters Marine Corps) and are designed to exploit breakthroughs in science and technology in order to deliver maximum warfighting benefit to our sailors and marines.  These efforts are aligned with shared priorities throughout the whole of RDT&E in order to quickly advance new capabilities from discovery to deployment across the warfighting domains.\n\nThis PE addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy.  It supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms.  The goal is to provide the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage while preserving operational capability.  Within the Naval Transformational Roadmap, this investment directly supports the Theater Air and Missile Defense transformational capability required by Sea Shield and the Ship to Objective Maneuver key transformational capability.  This is accomplished by improvements in platform offensive performance, stealth, and self-defense.  \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "158.745"
                },
                "CurrentYear": {
                    "val": "125.557"
                },
                "BudgetYearOne": {
                    "val": "124.007"
                },
                "BudgetYearOneBase": {
                    "val": "124.007"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "192.579"
                },
                "CurrentYear": {
                    "val": "125.557"
                },
                "BudgetYearOne": {
                    "val": "124.049"
                },
                "BudgetYearOneBase": {
                    "val": "124.049"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "33.834"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.042"
                },
                "BudgetYearOneBase": {
                    "val": "0.042"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-4.537"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.596"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.169"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.169"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.127"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.127"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.033"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "43.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding decrease from FY 2018 to FY 2019 is due to a phasing down of the applied research effort in the areas of Advanced Energetics Materials and Aircraft Propulsion Technologies.\n\nThe FY 2019 funding request was reduced by $0.756 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "150.992"
                        },
                        "CurrentYear": {
                            "val": "125.557"
                        },
                        "BudgetYearOne": {
                            "val": "124.049"
                        },
                        "BudgetYearOneBase": {
                            "val": "124.049"
                        },
                        "BudgetYearTwo": {
                            "val": "121.889"
                        },
                        "BudgetYearThree": {
                            "val": "121.896"
                        },
                        "BudgetYearFour": {
                            "val": "124.342"
                        },
                        "BudgetYearFive": {
                            "val": "126.868"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy.  It supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms.  The goal is to provide the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage while preserving operational capability.  Within the Naval Transformational Roadmap, this investment directly supports the Theater Air and Missile Defense transformational capability required by Sea Shield and the Ship to Objective Maneuver key transformational capability by virtue of improvements in platform offensive performance, stealth, and self-defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AIRCRAFT TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The Aircraft Technology activity develops technologies for reduced observables technology and enhanced capability of naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, saleable naval air vehicle technologies, such as - autonomous air vehicle command and control, helicopter and tilt rotor systems, aerodynamics, propulsion systems, materials, structures and flight controls for future and legacy air vehicles. \n\nVariable Cycle Advanced Technology (VCAT) will identify and mature critical, relevant variable\/adaptive cycle propulsion system technologies for the next generation carrier-based Tactical Aircraft (TACAIR)\/Intelligence, Surveillance and Reconnaissance (ISR) systems. The Sea-Based Aviation National Naval Responsibility (SBA NNR) Structures and Materials program will develop the next generation structural capability and material response science for aircraft technology in fixed and rotary wing, manned and unmanned airframe technology to achieve reduced weight, increased durability, strength, streamlined manufacturability, reduced life-cycle cost and maintenance\/readiness gaps improvements. Program payoffs include increased availability\/readiness, reduced sustainment requirements, fatigue\/loads life enhancement, reduced weight and improved range, and advanced prognostics design tools. \n\nThese efforts addresses unique attributes to propulsion and power technologies for Naval Aviation, as well as those having higher importance to Naval Aviation and some that are more pervasive to all of military aviation. Related basic research efforts are addressed under 0601153N Defense Research Sciences."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "64.126"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued new efforts on high confidence\/Safe Autonomous Control in naval environments and on supervisory control of\ndecentralized heterogeneous Unmanned Aerial System (UAS).\n- Continued SBA NNR related projects in Virtual Ship\/Aircraft Dynamic Interface, Manned\/Unmanned Handling Qualities\nand Control, Automated Deck Operations, High Lift Aerodynamics and Vertical\/Short Takeoff and Landing (V\/STOL)\nOperations.\n- Continued applied research efforts under the Sea-Based Aviation National Naval Responsibility Propulsion thrust area.\n- Continued development of rotorcraft\/VTOL systems automated launch and recovery technology.\n- Continued mixed-mode mechanical\/environmental failure prediction research.\n- Continued advanced composite durability technology.\n- Continued material degradation risk prediction and operational environment-driven materials selection methods.\n- Continued demonstration of initial core software, sensor, air vehicle, and capability applications for AACUS.\n- Continued the advanced technology demonstration portion of the VCAT Program.  \n- Continued critical technology development efforts with major engine manufactures and system contractors to develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based TACAIR\/ISR systems.\n- Continued VCAT Phase I variable cycle engine\/propulsion subsystem technology development efforts through\ncompletion.\n- Continued to explore and evaluate future aircraft concepts and their associated enabling technologies.\n- Continued development of survivability\/reduced observables technology. Metrics are classified.\n- Continued new efforts on safe-perception based autonomous control in complex naval environments and on autonomy to\nsupport combined unmanned and manned air systems\/units.\n- Continued airplane launch and recovery component and subsystem technology developments to enable medium size long\nendurance, long range Unmanned Aerial Vehicles (UAVs) to be launched and recovered on short deck ships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "39.461"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Pursue research related to Sea-Based Aviation National Naval Responsibility (SBA NNR) priorities in Aviation, Propulsion, and Structures and Materials.\n- Examples of research in Aircraft Technology include efforts in Virtual Ship\/Aircraft Dynamic Interface, Manned\/\nUnmanned Handling Qualities and Control, Automated Deck Operations, High Lift Aerodynamics and Vertical\/Short Takeoff and Landing (V\/STOL) Operations, the development of rotorcraft\/VTOL systems automated launch and recovery technology and mechanical\/environmental failure prediction research.\n- Examples of research in Propulsion include the VCAT Program. Major engine manufacturers and system contractors will develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based TACAIR\/ISR systems.\n- Examples of research in Structures and Materials include advanced composite durability technology.\n- Expanding material degradation risk prediction and operational environment-driven materials selection methods.\n- Pursue research related to Autonomy including efforts on high confidence\/Safe Autonomous Control in naval environments and on supervisory control of decentralized heterogeneous Unmanned Aerial System (UAS). \n- Expanding efforts on safe-perception based autonomous control in complex naval environments and on autonomy to support combined unmanned and manned air systems\/units."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Ongoing research related to SBA NNR priorities in Aviation, Propulsion, and Structures and Materials.\n\nOngoing research in Aircraft Technology, examples of research\/efforts include Virtual Ship\/Aircraft Dynamic Interface, Manned\/Unmanned Handling Qualities and Control, Automated Deck Operations, High Lift Aerodynamics and V\/STOL Operations, the development of rotorcraft\/VTOL systems automated launch and recovery technology and mechanical\/environmental failure prediction research. \n\nOngoing research in Propulsion, examples of research\/efforts include the VCAT Program. Major engine manufacturers and system contractors will develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based TACAIR\/ISR systems. \n\nOngoing research in Structures and Materials, examples of research\/efforts include advanced composite durability technology, new materials development, process-property relationship analysis, improved material selection tools, structural life prediction, multi-functional surfaces, and structural optimization for lightweighting.. \n\nExpanding material degradation risk prediction and operational environment-driven materials selection methods. \n\nOngoing research related to Autonomy, examples of research\/efforts include high confidence\/Safe Autonomous Control in naval environments and on supervisory control of decentralized heterogeneous UAS. Expand efforts on safe-perception based autonomous control in complex naval environments and on autonomy to support combined unmanned and manned air systems\/units."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 is due to a phasing down of the applied research effort in the areas of Advanced Energetics Materials and Aircraft Propulsion Technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FLEET FORCE PROTECTION AND DEFENSE AGAINST UNDERSEA THREATS"
                                    },
                                    "Description": {
                                        "val": "Fleet Force Protection and Defense against Undersea Threats efforts include applied research for complementary sensor and processing technologies for platform protection.  Current small platforms (both surface and airborne) have little to no situational awareness (SA) or self-protection against air, surface, and asymmetric threats.  A goal of this activity is to provide these platforms with effective self-protection.  The technology areas specific to platform protection will develop individual, multispectral electro-optical (EO), infrared (IR), radio frequency (RF), electro-magnetic (EM), visual and acoustic or chemical sensors\/biosensors and associated processing.  To defend platforms from current and advanced threats in at-sea littoral environments and in port, these technologies must improve multispectral detection and distribution of specific threat information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.476"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing: \n- Continued electrochemical sensors for the distributed, remote detection of explosives\n- Completed efforts in biomimetic sonar systems for operation in air and aquatic environments based on bat echolocation\nneurophysiology and information processing algorithms.\n- Completed efforts in biomimetic signal processing: panoramic periscope for submarines and temporal pattern recognition\nfor Systems for Security Breaching Noise Detection.\n- Completed efforts in bioinspired quiet, efficient and maneuverable self-propelled line array using high-lift propulsors based on insect biomechanics.\n- Completed studies to develop catalytic activity profile of bioactive coatings against chemical agents.\n- Completed design and initiated fabrication of coatings to degrade both, chemical and biological agents.\n- Completed efforts to design microfabricated system for 3-color fluorescence measurements using integrated waveguides.\n- Completed effort to develop new, highly selective, preferential oxidation catalysts for the generation of power from the reformate gas purification process.\n- Completed effort to develop aspheric gradient index optics.\n- Continued effort to develop an implosion-resistant hydrogen storage technology for use in undersea fuel cells.\n- Continued development of wide area standoff detection of explosives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.754"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing: \n-Finish Sensors & Associated Processing related efforts to develop an implosion-resistant hydrogen storage technology for use in undersea fuel cells, development of wide area standoff detection of explosives, and study of Electrochemical sensors for the distributed, remote detection of explosives.\n\nUndersea Warfare:\n-Conduct undersea storage capacity of hydrogen by developing an implosion-resistant, safe, and inexpensive hydrogen storage technology that addresses powering autonomous systems, such as autonomous undersea vehicles and distributed autonomous underwater networks, for persistent force protection and defense against undersea threats.  \n\nMaterials and Chemistry:\n-Design and develop, utilizing room temperature ionic liquids to demonstrate and fabricate inexpensive, miniaturized, low power electrochemical sensors for use in autonomous as well as distributed sensor networks.  \n-Develop real time, standoff, moving target, laser based detection for explosives and hazardous chemicals with the intent of shifting the paradigm of trace chemical detection through surface contact swabbing to a faster, more flexible wide area, standoff method for significant enhancement of force protection. \n-Develop and design a new class of safe high performance rechargeable zinc air batteries to supplant state of lithium-ion batteries.  \n-Develop chemical vapor sensing strategy for application in marine environment, significantly different than terrestrial environment.   \n-Demonstrate electrochemical detection elements incorporated into electronic integrated circuits. \n-Demonstrate efficiency of zinc sponge anode in an electrochemical cell."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Warfare:\nOngoing research in Undersea Warfare, examples of research include conceptualizing and performing laboratory and field studies to: developing acoustics technology and associated signal processing for the detection of small unmanned aerial vehicles (UAVs); continued development of a pressure tolerant, inexpensive hydrogen storage based on hydrogenated graphene to increase undersea storage capacity.\n\nMaterials and Chemistry: \nOngoing research in Materials and Chemistry, examples of research include design and development, utilizing room temperature ionic liquids, to demonstrate and fabricate inexpensive, miniaturized, low power electrochemical sensors for use in autonomous as well as distributed sensor networks; developing real time, standoff, moving target, laser based detection for explosives and hazardous chemicals with the intent of shifting the paradigm of trace chemical detection through surface contact swabbing to a faster, more flexible wide area, standoff method for significant enhancement of force protection; development and design of a new class of safe high performance rechargeable zinc air batteries to supplant state of lithium-ion batteries; development of chemical vapor sensing strategy for application in a marine environment, significantly different than terrestrial environment; performance demonstrations of highly sensitive electrochemical detection elements incorporated into electronic integrated circuits; and demonstrations of high efficiency of zinc sponge anode in an electrochemical cell."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ADVANCED ENERGETICS"
                                    },
                                    "Description": {
                                        "val": "Advanced Energetics efforts address technology development to provide substantial improvements in energetic material systems and subsystems, primarily in terms of performance, but also addressing safety, reliability, and affordability concerns.  Goals include: advanced energetic materials for warheads, propellants, and reactive material based subsystems for both defensive and offensive applications.  Efforts include: development of new fuels, oxidizers, explosive ingredients and formulations; and reliable simulation tools and diagnostics to develop and design superior-performance, and\/or reduced-vulnerability systems tailored to specific warfighter missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.231"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued process research and development of Ammonium Nitrotetrazolate-2N-oxide (AONT).\n- Continued the processing optimization design of material compositions for Reactive Material explosive fragment\napplications.\n- Continued optimization and refinement studies of Poly NitratoOxetane (3-PNO) process for solid rocket motor\npropellants.\n- Continued the development of a reliable chemical scale-up and material specification process techniques.\n- Continued research in development and evaluation of advanced explosive\/propellant\/reactive\ningredients and formulations for the next generation higher performing systems.\n- Continued non-traditional energy conversion studies with columbic and cluster material investigations.\n- Continued research in development of advanced directed hydro-reactive material warhead concepts\nto enhance performance of undersea warheads.\n- Continued proof of concept efforts to develop insensitive explosives, propellants, and munitions without compromising\nperformance. This work involves development of high quality, small particle energetic ingredients, novel processing\ntechniques, and advanced energy conversion concepts; and involves both theoretical and experimental efforts.\n- Continued research in advanced multiphase blast concepts employing dense metalized explosives to\nenhance performance of air and underwater blast warheads.\n- Continued research in development and diagnostics of novel energy conversion concepts to enhance\nperformance, more efficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead application\n- Continued research in technology development for the next generation reactive material warhead concepts formulations,\nmaterial properties, and energy release experiments for highly reactive materials, high density reactive materials and novel reactive structural materials. Transition application specific target interaction, lethality modeling and ordnance specific experiments and demonstrations to Electromagnetic Rail Gun, RDT&E Program Element 0603114N.\n- Continued development and evaluation of energetic ingredients and formulations for next generation higher performance\napplications. Concluded scale-up development and testing.\n- Continued the processing optimization design of material compositions for Reactive Material explosive fragment\napplications.\n- Continued the development of a reliable chemical scale-up and material specification process techniques.\n- Continued research on new caged nitramines\n- Initiated electric on\/off propulsion system studies for advanced solid and liquid rocket compositions\n- Initiated process research and development of Dihydroxylammonium Dinitramino Azoxy Furazan (DDAF)\n- Initiated process research and development of Ammonium-3,4,5,-trinitropyrazolate (ATNPz) \n- Completed ultra-high density reactive material investigations (13 - 15 grams\/cc) for the next generation reactive material warhead material (formulations, material properties, target interaction, lethality models, and experiments)\n- Completed process research and development of 1,1'-Diamino4,4',5'5'-Tetranitro-2,2'-Biimidiazole (DATNBI) \n- Completed process research and development of 1-Fluoro-4,5-Dinitroimidazole."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.329"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Pursue research related to Advanced Energetics including development and evaluation of advanced explosive\/propellant\/ reactive ingredients and formulations for the next generation higher performing systems.\n\nPursue research in proof of concept efforts to develop insensitive explosives, propellants, and munitions without compromising performance. This work involves development of high quality, small particle energetic ingredients, novel processing techniques, and advanced energy conversion concepts; and involves both theoretical and experimental efforts.\n\nExpand research in development and diagnostics of novel energy conversion concepts to enhance performance, more efficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead application."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Ongoing research related to Advanced Energetics including development and evaluation of advanced explosive\/propellant\/reactive ingredients and formulations for the next generation higher performing systems.\n \nOngoing research in proof of concept efforts to develop insensitive explosives, propellants, and munitions without compromising performance. This work involves development of high quality, small particle energetic ingredients, novel processing techniques, and advanced energy conversion concepts; and involves both theoretical and experimental efforts.\n\nOngoing research focused on chemical processing technologies. Incorporate molecular design and crystal morphology technology into scale-up and process development.  New compliant commodity energetic ingredients will be transitioned to the industrial base as appropriate.\n \nContinue research in development and diagnostics of novel energy conversion concepts to enhance performance, more efficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead application."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change form FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURFACE SHIP & SUBMARINE HULL MECHANICAL & ELECTRICAL (HM&E)"
                                    },
                                    "Description": {
                                        "val": "Technology programs focused on providing technologically superior warfighting capabilities at reduced total ownership costs for surface and subsurface platforms through investments in applied research and advanced technology development of programs in:  a) Advanced Naval Power b) hydrodynamics, c) structures d) autonomy for unmanned surface vehicles (USV) and e) platform survivability. This element also includes the National Naval Responsibility in Naval Engineering (NNR-NE).  The NNR-NE supports early applied research in the areas of propulsion, platform structures, hydrodynamics, automation control and system engineering, design tools, naval power systems and ensuring a strong and healthy academic infrastructure.  Specific research themes are:\n\nAdvanced Naval Power Systems Technology:\nEfforts address electrical and auxiliary system and component technology to dramatically improve energy and power density, operating efficiency, and recoverability from casualties. A major investment focus is providing the power and energy required for directed energy weapons on current and future surface combatants. Advanced Naval Power efforts include: developing technologies for high-power, cyber-secured energy networks, distribution and control of power, providing warfighting capability with more energy efficient systems; mitigate adverse impacts of alternative fuel on Naval platforms and equipment; and utilizing the Electric Ship Research and Development Consortium (ESRDC) efforts to develop modeling and simulation tools to provide critical design and operational capabilities for the all-electric ship program, accelerate development and demonstration of technologies, reduce risk of new technology insertion, and address the national shortage of electrical power engineers. \n\nDevelop new machinery integration concepts. Develop simulation based Verification, Validation and Accreditation (VV&A) methods and technologies.  Contribute to system reconfiguration.  Design a ship electrical system architecture based on a main bus that distributes \"rough\" Direct Current (DC) power throughout the ship at nominally 10 KV.  Development of macro- and atomic-scale multi-physics models is being pursued to enhance understanding of materials processing and performance, energy conversion mechanisms, cyber-physical energy concepts, and power management.  System-level studies focus on the scalability and reliability of component technologies.  Another thrust is the development of tools to model heat transfer at multiple length scales allowing for simulation of heat flow through the ship in order to evaluate the impact of power conversion electronics, sensors, and weapons on the overall thermal balance of the vessel.\n\nAdvanced Sea Platform Technology:\nHydrodynamics: Critical platform design for surface ships hydrodynamics that is focused on the theory, computation, and lab and at-sea experimentation to develop understanding and prediction capabilities for all hydrodynamic phenomena associated with surface ships and small craft, their effects on vessel performance, and concepts for modification.  Propulsor hydrodynamics is focused on understanding the physics of flow around propulsors and their interactions to improve propulsor performance, mobility, efficiency, and affordability, as well as prediction and control of various types of cavitation on propulsors and appendages. This also includes predictive capability of cavitation inception, thrust breakdown, and erosion phenomenon and scaling laws. Technology efforts in the area of Subsurface Hydrodynamics include identifying, understanding, predicting, and controlling flow physics, as well as turbulence and stratified wakes.  This is further applied to Subsurface Maneuvering Technologies, and understanding the Dynamics of Interacting Platforms. Additionally hydrodynamic technologies focused on the signature aspects of the hull-propulsor interaction and maneuvering.\n\nPlatform Structures: Focused on time-varying, structural reliability analysis and prediction for a ship structural system with uncertainty quantification and propagation. Specific topics include novel structural configurations across composite and metallic materials and prediction methods for advanced global hull strength, local panel and component strength, fatigue and fracture strength, and seaway loads and load effects for high-speed\/high-performance ships and vessels.  Hull life assurance addresses development of new structural system approaches for surface ships and submarines, including the management of weapons effects to control structural damage and the improvement of structural materials.\n\nUnmanned Surface Vehicles (USV): Autonomy for USVs and related mission functions aligned with Naval S&T strategic focus on autonomy and unmanned vehicles. Unmanned Sea Surface Vehicle (USSV) applied research includes short-term motion forecasting for recovery of USSVs on a host ship in higher sea states and determination of slamming loads on high-speed planing hulls for structural weight reduction Distributed intelligence for automated survivability addresses both the basic technology of automating machinery control systems, as well as, distributed control of systems utilizing autonomy for mission context based reconfiguration.\n\nSea Platform Survivability Technology:\nAligned with survivability S&T strategic focus area, research investigates electromagnetic (EM) sources (including major ferro and non-ferromagnetic sources, eddy currents, and Corrosion Related Magnetic Fields (CRM)) that are associated with naval platforms.  Develop understanding of EM field propagation relationships and analysis aids, and technologies to predict the electromagnetic properties of a naval platform.  Advance physics based understanding of platform acoustics. Discover and develop algorithms and methods that will enable the development of improved design, analysis, and prediction tools for enhanced acoustic performance. Understand, design and develop optical and acoustic metamaterials to control light and sound propagation over a large frequency range.  New architectures to overcome challenges associated with loss, bandwidth, and scalability are being explored.  Design and develop models, algorithms, and integrated development environments for simulation and control of complex, interdependent, distributed shipboard machinery systems to enable integrated, autonomous operation and reconfiguration of shipboard machinery systems.  Efforts also include: signature reduction, hull life assurance, hydromechanics, distributed control for automated survivability (includes damage control), and advanced naval power systems. Signature reduction addresses electromagnetic, infrared, structural acoustics and acoustic signature tailoring, both topside and underwater. Develop and advance time critical stealth technologies for SSBN and SSN programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "74.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Survivable Platforms - Reduced Signatures: \n- Continued advanced numerical acoustic codes (and gridding methods for those codes) for submarines.\n- Continued Alternating Current (AC) propagation experiments.\n- Continued the next generation Infrared\/Electro-Optic\/Visual (IR\/EO\/VIS) model for surface ships by development of\nmitigation strategy supporting low observable infrared platforms, development of supporting physics, and prototype\nmeasurement techniques.\n- Continued development of quiet control surface design tool based on control surface flow noise studies.\n- Continued IR and radar detectability prediction capability.\n- Continued surface ship super-conductive degaussing with laboratory demonstration loop for EM field accuracy measurements and control methods.\n- Continued testing on Advanced Electric Ship Demonstrator (AESD) to assess energy propagation and acoustic radiation\nmechanisms and to develop mitigation concepts for surface ships.\n- Continued CRM Field Prediction Model to design compensation systems to\nreduce ship's CRM signature. \n- Continued assessment of ship bi-static Radar Cross Section (RCS).\n- Continued experimental effort to characterize electric drive motor signature mechanisms and verify modeling and\nsimulation approaches for signature prediction.\n- Continued development of modeling methods and noise control concepts for modular\/reconfigurable submarine\narchitectures.\n- Continued development of Low Probability Intercept (LPI) technologies for surface ship emissions including\ncommunication, navigation, electronic warfare, and combat systems.\n- Continued advanced EM modeling tools development and validation.\n- Continued modeling of hydroacoustics of turbulence-propulsor interaction.\n- Continued joint effort with United Kingdom Ministry of Defence (UK\/MoD) on adhesively joined aluminum in lieu of welding of marine structures and thus reduce cost.\n- Continued joint effort with the Netherland Royal Navy (NLRN) on adhesive joined composite to metals in lieu of bolting\nof marine structures and thus reduce cost for topside structures.\n- Continued efforts on shock mitigation and shock diversion for ship hulls to reduce cost of machinery mounts and\nequipment, based on successful results from the Explosion Resistant Coatings (ERC) helmets for protection against\nTraumatic Brain Injury (TBI)\n- Continued development of signature monitoring and management capability of a surface ship propulsion system for\nunderwater acoustic signatures.\n- Continued development of global optimization of damped structures.\n- Continued to develop improved processing techniques for acoustics experiments.\n- Continued development of a prediction and monitoring tool for underwater signatures.\n- Continued planning at-sea experiments to determine principal offenders for small craft airborne and underwater acoustic signatures.\n- Continued development of high fidelity airborne acoustic propagation and detection model for surfzone and littoral detection of small craft.\n- Continued development of radar absorbing ballistic composite materials for small craft hull and superstructures.\n- Continued study of graphene based magnetic tunnel junctions.\n\nSurvivable Platforms - Hull Life Assurance: \n- Continued efforts on combinations of highly rate-sensitive materials through experiment and modeling for extreme hyper\nvelocity threat conditions.\n- Continued development of global surface wave measurement capability for ship models.\n- Continued Dynamic Behavior of Composite Ship Structures (DYCOSS) (joint effort with Dutch Navy).\n- Continued development of structural analysis codes describing failure mechanism of sandwich composites.\n- Continued effort on an advanced class of polymers as a follow-on to current ERC for application against advanced threats.\n- Continued Payload Implosion and Platform Damage Avoidance efforts.\n- Continued development of advanced analytical, numerical and experimental methods in support of platform signature\nreduction.\n- Continued effort on exploitation of polymers for the deflection and dissipation of shock wave impact on ship and\nsubmarine hull structures.\n- Continued development of lightweight low-cost protection system for specific platforms for protection against specific\nlarge threats.\n- Continued development of lightweight protection system for vehicles (MTVR) for protection against specific small arms\nand IEDs for the ERC program.\n- Continued Ship modifications using blisters for application to DDG51 Flight III to gain larger displacement for Air and Missile Defense Radar (AMDR) and at the same time achieve higher fuel efficiency.\n- Completed ERC effort, providing US input to trilateral agreement with UK and Australia \n- Completed composite and composite-metal hull performance characterization and testing including structural loading, thermal stress and signatures.\n- Initiated ERC effort with The Technical Cooperation Program (TTCP) countries.\n- Initiated development of testing methodologies to validate computational codes and constitutive models for glassy\nmaterials.\n\nSurvivable Platforms - Distributed Intelligence for Automated Survivability: \n- Continued development of modeling and simulation methods for robust design and virtual testing of integration of\nshipboard auxiliary systems including their control systems.\n- Continued research into advanced HM&E system reconfiguration approaches, including agent-based control systems and\nalgorithms, and model-based reasoning.\n- Continued demonstration of Genetic Algorithm(s) for determining optimal distributed system control strategy.\n- Continued development of Survivability Analysis Algorithms Operable on a Total Ship Modeling Environment.\n- Continued the transition of the small scale hardware-in-the-loop demonstrator to the academic community for challenge\nproblem formulation.\n- Continued demonstration of the developed model based reasoning control algorithms on full scale hardware test beds.\n- Continued development of underwater signature modeling.\n- Continued development of advanced underwater mission autonomy.\n\nAdvanced Platforms - Advanced Platform Concepts and Designs: \n- Continued validation of asymmetric hull forms with experimental data.\n- Continued development of analytical models to further define submarine modular hull concepts.\n- Continued development of reliability based design and structural analysis code development.\n- Continued development of design tools for integrated antenna and composite topside.\n- Continued circulation control analysis for three-dimensional flow effects.\n- Continued aperstructures microwave communication system.\n- Continued concept for Ultra High Frequency (UHF)\/Very High Frequency (VHF) aperstructures opportunistic array\nAdvanced Hull-form Inshore Demonstrator - (AHFID).\n- Continued development of methods for determining reliability and vulnerability of aluminum ship structures.\n- Continued large scale demonstration efforts of advanced mitigation technologies.\n- Continued efforts to model platform performance and stability as well as propulsor performance in ice environments. \n\nAdvanced Platforms - Hydromechanics: \n- Continued experimental database\/computational tools development for extreme submarine maneuvers (e.g., crashback).\n- Continued the validation of circulation control and advanced control surfaces with experiments.\n- Continued to investigate improved maneuvering simulation capability for submarines.\n- Continued numerical prediction method(s) of waterjet cavitation.\n- Continued modeling and simulation of rough-wall boundary layer noise.\n- Continued development of podded propulsor design\/analysis tools.\n- Continued prediction and validation of damaged stability and capsize.\n- Continued non-body-of-revolution tool development for advanced submarine configurations.\n- Continued the multi-platform interaction analysis and tool development.\n- Continued modeling of performance of composite propellers in extreme maneuvers.\n- Continued cavitation erosion modeling on compliant surface.\n- Continued a research on design\/analysis methods of ice-capable propellers.\n- Continued a research on the effect of propeller on bubbly flows. \n- Continued efforts to model platform performance and stability as well as propulsor performance in ice environments. \n\nAdvanced Naval Power Systems: \n- Continued demonstration of dynamic stability of an advanced intelligent, reconfigurable, solid-state-based, zonaielectrical-power system that reconfigures within 10 milliseconds.\n- Continued designing software for the system manager for the Universal Control Architecture (UCA).\n- Continued development of thermal management technology for shipboard power distribution.\n- Continued investigation of potential applications of silicon-carbide in future high voltage and high power applications.\n- Continued improvements in electrical component and device technology allowing a reduction in motor propulsion and\nmotor controllers weight and volume.\n- Continued development of technologies to support dynamic reconfiguration of shipboard systems under conditions of\nstressing scenarios and\/or system degradation.\n- Continued studies of alternative cooling systems for future shipboard radar systems.\n- Continued control surface actuator project focused on the technologies needed to define the design space for control\nsurface actuators supporting submarines.\n- Continued development of automated HVAC system architectures for future Naval platforms.\n- Continued ship service fuel cell development.\n- Continued program to develop and demonstrate 3 - 50 kW class solid oxide fuel cell onboard mobile power generation\ncapabilities having compatibility with future logistics fuels to enable rapid recharge of batteries and direct power for Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) equipment.\n- Continued analytical model and reduced scale component development of power conversion technologies for multifunction motor drives, bi-directional power conversion modules, and power management controllers focusing on closing technology gaps associated with Alternative Integrated Power System (IPS) Architectures.\n- Continued studies of advanced heating, ventilation, and air-conditioning architectures, including studies of alternative nonvapor-compression) refrigeration systems and concepts for waste heat reuse, to enhance ship cooling and provide thermal energy storage.\n- Continued research into the development of fuel chemistries, materials, and energy conversion technologies for optimal\nperformance in Naval power systems.\n- Continued development of fuel cell components needed to make robust, compact, lightweight fuel cell systems for use in\nunmanned vehicles.\n- Continued development of low cost, light weight, flexible solar cells.\n- Continued effort to make significant impact in high voltage power electronics technology to enable compact power\nconverters, medium voltage distributed power architectures, new weapons and sensor systems for Navy and Marine\napplications.\n- Completed development of robotic Hull Bio-mimetic Underwater Grooming (BUG) and coating technologies to reduce hull biofouling over current Navy operating conditions which will reduce drag and provide significant power\/fuel\/cost savings.\n\nSurface Ship & Submarine HM&E Applied Research: \n- Continued efforts to implement the results from hybrid composite blisters \/appendages and their effect on ship drag\nresistance and fuel saving performance, motion and stability in ship models to verify computations and adapt shapes of\nappendages.\n- Continued to increase emphasis of the Science Advisor engagement within the joint S&T community across DOD, which\nwill focus on addressing the operational and strategic needs of the Fleet.\n- Continued applied research into short-term motion forecasting for recovery in higher sea states.\n- Continued applied research into determination of slamming loads on high-speed planing hulls for structural weight\nreduction.\n- Continued the ONR Applied Research Challenge (ARC) to stimulate new, high-risk applied research projects in areas not\ncurrently addressed by the current ONR core applied research programs.\n- Continued MDUSV program applied research supporting a highly\nautonomous control and payloads supporting mine warfare, anti-submarine warfare and electronic warfare.\n- Continued USV Swarm program applied research which will allow unmanned Navy vessels to overwhelm an adversary.\n\nCounter Improvised Explosive Devices (C-IED): \n- Continued research to analyze and understand enemy threat organizations and networks (both cultural networks and IT\nnetworks)\n- Continued research in directed energy weapons with the goal of reducing size, weight, and power requirements for\nsystems in the detection and neutralization of IEDs.\n- Continued research in the mitigation of C-IED effects (blast, blunt trauma, ballistics) on personnel.\n- Continued research in Route Reconnaissance and Clearance methodologies to provide standoff detection, neutralization,\nand marking of buried and surface laid, on and off route, pressure plate, command wire and radio frequency initiated\nexplosive obstacles using directed energy and mechanical means on autonomous or semi autonomous platform\n- Completed efforts to expand C-IED enhancement to support urgent operational needs. \n- Completed research to analyze and understand enemy threat organizations and networks (both cultural networks and IT networks) \n- Initiated research and development of modular, reconfigurable, integrated multi-modal stand-off detection and neutralization of explosive hazard (IED & Mines) system.\n\nApplied Research Challenge (ARC): \n- Continued all base program efforts including network information sciences, long-range high-resolution imaging, ocean surface scatter in RF propagation, wake measurement technologies, thermal management systems, high power control modules for ship application, decision support\/uncertainty analysis for operational environments, and reactive composite materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "70.382"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced Naval Power Systems Technology:\nPursue research related to the Next Generation Integrated Power System (NGIPS) and Distribution\/Control of Power Advanced Power Systems with a focus on power and energy requirements for directed energy weapons on current and future surface combatants. \nConduct applied research related to critical S&T to investigate efforts related to Power & Energy Technology, including alternative power sources, UAV fuel cell development and power and energy outreach and sustainability efforts.\nFinish effort to make significant impact in high voltage power electronics technology to enable compact power converters, medium voltage distributed power architectures, new weapons and sensor systems for Navy and Marine applications. \n\nAdvanced Sea Platform Technology:\nConduct applied research related to critical S&T to investigate platform design efforts related to propulsor and subsurface hydrodynamics; structural reliability science; and structural acoustics. \n\nExpand research related to the unmanned sea surface vehicle and Medium Displacement Unmanned Surface Vehicle (MDUSV)  and USV Swarm efforts.  \n\nPursue research related to naval engineering and platform design, including Ohio Replacement Program efforts.\n \nSea Platform Survivability Technology:\nConduct applied research related to critical S&T to investigate efforts related to signature reduction; machinery autonomy; and platform survivability. \n\nScience & Technology to Address Complex Hybrid WarfareThreats: \n- Continue and expand efforts related to directed energy weapons, Route Reconnaissance and Clearance methodologies, and development of modular, reconfigurable, integrated multi-modal stand-off detection and neutralization of explosive hazard (IED & Mines) system. \n- Complete research in the mitigation of Counter Improvised Explosive Devices (C-IED) effects (blast, blunt trauma, ballistics) on personnel.\n- Initiate projects to counter complex hybrid warfare threats. S&T technologies will address a broad range of multi-faceted threats that employ both conventional and unconventional forces.\n\nApplied Research Challenge (ARC): \n- Continue base program efforts including network information sciences, long-range high-resolution imaging, ocean surface scatter in radio frequency (RF) propagation, wake measurement technologies, thermal management systems, high power control modules for ship application, decision support\/uncertainty analysis for operational environments, and reactive composite materials.  Continued development of advanced undersea autonomy for Naval missions.\n\nMaterials and Chemistry:\nUnderstanding methods for fabricating nickel\/graphene\/cobalt magnetic tunneling junctions to develop new tunnel barrier materials technology for fast low power radiation hard memory and magnetic sensors.  This effort will be a paradigm shift for magnetic tunnel junction technology, which is significantly different than use of conventional oxides such as magnesium oxide (MgO) and aluminum oxide (Al2O3). Successful accomplishments have been made to show that graphene can be used as a tunnel barrier material.\n\nElectronics:\nCreate and explore new high voltage, high efficiency wide bandgap and ultra-wide bandgap power switches for electric propulsion and electric weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "72.772"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "72.772"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced Energy Systems Research:\nOngoing applied research related to critical S&T in Power & Energy Technology related to energy systems.  This research in energy systems provides innovative energy technologies and system designs to increase mission capability.  Areas of research include all scientific and engineering aspects of the production, conversion, delivery, and use of energy for installation critical infrastructure, forward operating and remote bases, humanitarian assistance and disaster relief operations, manned and unmanned platforms, and general energy network applications. Primary objectives are to improve warfighting readiness, effectiveness, and flexibility through research projects focused on enhancing energy cyber-security, resiliency and efficiency.  Research programs often include activities that purposely incorporate veterans and other military personnel into projects to enhance military applicability and to provide a sustainable source of military-experienced professionals for the DoN energy workforce.\n\nAdvanced Naval Power Systems Technology: \nOngoing research related to the NGIPS and Distribution\/Control of Power Advanced Power Systems with a focus on power and energy requirements for directed energy weapons on current and future surface combatants. \n\nAdvanced Sea Platform Technology: \nOngoing applied research related to critical S&T to investigate platform design efforts related to propulsor and subsurface hydrodynamics; structural reliability science; and structural acoustics. Expand research related to the unmanned sea surface vehicle. \n\nOngoing research related to naval engineering and platform design, including Ohio Replacement Program efforts. \n\nSea Platform Survivability Technology: \nOngoing applied research related to critical S&T to investigate efforts related to signature reduction; machinery autonomy; and platform survivability. \n\nScience & Technology to Address Complex Hybrid Warfare Threats: \nOngoing projects to counter complex hybrid warfare threats. S&T technologies will address a broad range of multi-faceted threats that employ both conventional and unconventional forces. The S&T technologies will continue to expand and emphasize various compact platforms in multi-environments.\n\nApplied Research Challenge (ARC):\n\nOngoing base program efforts, initiated in FY 2017 and FY 2018, including network information sciences, long-range high-resolution imaging, ocean surface scatter in RF propagation, wake measurement technologies, thermal management systems, high power control modules for ship application, decision support\/uncertainty analysis for operational environments, and reactive composite materials. In particular, continue research to develop and test autonomy for Unmanned Undersea Vehicle (UUV) missions including understanding of counter-UUV autonomy options; implementations and testing. \n\nMaterials and Chemistry: \nOngoing research for understanding methods for fabricating nickel\/graphene\/cobalt magnetic tunneling junctions to develop new tunnel barrier materials technology for fast low power radiation hardened memory and magnetic sensors.  This continuing effort will be a fundamental shift for magnetic tunnel junction technology, which is significantly different than the use of conventional oxides such as MgO and Al2O3. Favorable accomplishments have been made to show that graphene can be used as a tunnel barrier material.\n\nElectronics: \nOngoing research to create and explore new high voltage, high efficiency wide bandgap and ultra-wide bandgap power switches for electric propulsion and electric weapons."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2018 to FY 2019 reflects an increase in the Advanced Energy Systems Research area."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVAL RESEARCH ENTERPRISE"
                                    },
                                    "Description": {
                                        "val": "The Independent Applied Research (IAR) R2 activity was stood up in FY 2013 as the Naval Research Enterprise (NRE) to consolidate all NRE related IAR investments. Projects funded in this R2 Activity are intended to be approximately 2-3 years in length.  Based on historical trends approximately 30% of these projects will turn over each year.  The Naval Research Enterprise (NRE) encompasses the IAR efforts focused on solving a wide range of Naval Science and Technology (S&T) fleet issues utilizing unique Naval Warfare Center (WC) laboratory capabilities. Efforts under this activity address the full spectrum of the Naval Research and Development Framework using focus areas which engage Naval aviation, sea surface, undersea, space, weapons, communication, information, and human systems. The IAR Program provides participating WCs with in-house funding for applied research to support the execution of their assigned missions by: \n-Developing and maintaining a cadre of active researchers who can distill and extend results from worldwide research and apply them to solve Naval problems.\n-Promoting the hiring and development of talented new scientists and engineers (S&E) with the insurance of proper mentoring with senior personnel.\n-Encouraging collaboration with universities, private industry, and other Navy and Department of Defense laboratories. \n\nFunded projects are chosen through rigorous internal competition by each WC's selection committee and typically last two to three years.  IAR projects are generally designed to promote investment in high-risk\/high-payoff research and also allow young S&Es to manage Navy relevant research projects. A limited number of successful efforts developed under the In-House Laboratory Independent Research (ILIR) basic research Program Element 0601152N are matured and further developed under the IAR program with the goal of transitioning these technologies to the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.453"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research for the repair and repair process of Navy aircraft and ship alloys such as titanium and high-strength low-alloy steels, composites, and metamaterials.\n- Continued research for highly accurate autonomous unmanned undersea vehicles (UUV) communication and navigation.\n- Completed FY 2015 IAR projects which were three years in duration.\n- Initiated FY 2017 IAR projects that are intended to be approximately three years in length."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.631"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete FY 2016 IAR projects which were three years in duration.\n- Continue IAR projects initiated in FY 2017.\n- Initiate FY 2018 IAR projects that are intended to be approximately three years in length."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.586"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.586"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Independent Applied Research (IAR) shall align with the CNR's framework priorities (IAR projects which were three years in duration); Augmented Warfighter, Integrated & Distributed Forces; Operational Endurance, Sensing and Sense-Making, and Scalable Lethality.  FY19 IAR projects will expand efforts in the areas of physics, chemistry, biotechnology, earth sciences, mathematics, and other hard and soft sciences.  Representative projects include; Life Preserver Performance in Waves, Electronic Warfare Activity Recognition, Boron-Based Solid Fuel Development for Ramjet Application, Modularization Algorithm for Additive Manufactured Parts, Data Visualization Support for Creation of a Numerical Table: Effects on Training and Performance, Development of a Fully Integrated Ignition System for Multiple Pulse Hybrid Rocket Motor Firings, Active Sonar-based Cooperative UUV Interception, HFA Tactical Oceanography, and Ultra Short Pulse Laser Induced Plasma Filaments for Extended Covert Communications."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial and air) and the protection of those platforms.  Each PE Activity has unique goals and metrics, some of which include classified quantitative measurements.  Overall metric goals are focused on achieving sufficient improvement in component or system capability such that the 6.2 applied research projects meet the need of or produce a demand for inclusion in advanced technology that may lead to incorporation into acquisition programs or industry products available to acquisition programs.  Efforts funded in this PE also include energy programs in support of Navy energy guidance and efforts in support of the Ohio Replacement program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "41.587"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "41.587"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14.507"
                                        },
                                        "Text": {
                                            "val": "Funding used to advance research and facilitate technology adoption for lithium-ion battery safety and electrical grid resiliency, reliability and security."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "19.343"
                                        },
                                        "Text": {
                                            "val": "Funding used to continue to carryout alternative energy research in several areas including modeling and simulation tools for energy efficient ship design, unmanned vehicle power systems, cyber-secure and resilient micro-grids, marine-derived renewable energy, and a variety of shore-based energy efforts addressing energy challenges in the Asia-Pacific regions, including Hawaii, Guam, California, and Australia."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Littoral Threat Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.836"
                                        },
                                        "Text": {
                                            "val": "Conducted studies to characterize littoral battlespace environments including continental shelf, slope and deepsea environments having complex bathymetry and geophysical properties."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battery Storage and Safety"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.901"
                                        },
                                        "Text": {
                                            "val": "Funding used to continue the development of safer battery technologies, including non-flammable electrolytes and safe cell technology.  This funding continued and expanded the on-going competitively awarded efforts that improve Li-ion battery safety."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}