{
    "id": "2019-Navy-PB-1319-MJBOOK-0-0-1cb3285e5eb3096a00efd774d79545d93ed7b90effed5e9c90908e9fa9d3e340-10",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602651M"
        },
        "ProgramElementTitle": {
            "val": "JT Non-Lethal Wpns Applied Res"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "6.146"
            },
            "CurrentYear": {
                "val": "6.425"
            },
            "BudgetYearOne": {
                "val": "6.349"
            },
            "BudgetYearOneBase": {
                "val": "6.349"
            },
            "BudgetYearTwo": {
                "val": "6.346"
            },
            "BudgetYearThree": {
                "val": "6.343"
            },
            "BudgetYearFour": {
                "val": "6.468"
            },
            "BudgetYearFive": {
                "val": "6.600"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DOD Non-Lethal Weapons (NLW) Program was established by the Office of the Secretary of Defense, which designated the Commandant of the Marine Corps (CMC) as the DoD NLW Executive Agent (EA). The EA exercises centralized responsibility for joint research and development of non-lethal weapons and technology through the Joint Non-Lethal Weapons Program (JNLWP).  The Office of the Under Secretary of Defense for Acquisition, Technology and Logistics (AT&L) provides direct oversight of the JNLWP.\n\nThe efforts described in this Program Element (PE) reflect science and technology (S&T) investment decisions provided by the Joint Non-Lethal Weapons (NLW) Integrated Product Team, a multi-service flag level corporate board that provides executive oversight and management for the JNLWP for the CMC. This direction is based on the needs and capabilities of the Services, the Special Operations Command, and the Coast Guard, as identified in the DoD's Non-Lethal Weapons Joint Capabilities Based Assessment Document. This coordinated joint S&T development approach addresses mutual capability gaps and assures the best non-lethal technologies, capabilities and equipment are provided to the operating forces while eliminating duplicative service S&T investment.  These applied research initiatives feed non-lethal capabilities which directly support the three pillars of the 2014 Quadrennial Defense Review and comprise a fundamental part of DoD's security cooperation efforts to build partner capacity.  The resulting capabilities will facilitate a fully integrated non-lethal competency as a complement to lethal firepower, providing force application options for short-of-lethal scenarios.  \n\nThis program funds the applied research, study, assessment, and demonstration of technologies that could provide a non-lethal capability or target effect. Investment areas include applied research related to: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal acoustic and optical technologies; advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications); associated human effects and effectiveness for new non-lethal stimuli; injury potential and effectiveness of directed energy, electric stun, ocular, and acoustic based non-lethal technologies; and developing models of crowd behavior and dynamics. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.327"
                },
                "CurrentYear": {
                    "val": "6.425"
                },
                "BudgetYearOne": {
                    "val": "6.425"
                },
                "BudgetYearOneBase": {
                    "val": "6.425"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.146"
                },
                "CurrentYear": {
                    "val": "6.425"
                },
                "BudgetYearOne": {
                    "val": "6.349"
                },
                "BudgetYearOneBase": {
                    "val": "6.349"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.181"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.076"
                },
                "BudgetYearOneBase": {
                    "val": "-0.076"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.161"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.076"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.076"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.020"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "JT Non-Lethal Wpns Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.146"
                        },
                        "CurrentYear": {
                            "val": "6.425"
                        },
                        "BudgetYearOne": {
                            "val": "6.349"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.349"
                        },
                        "BudgetYearTwo": {
                            "val": "6.346"
                        },
                        "BudgetYearThree": {
                            "val": "6.343"
                        },
                        "BudgetYearFour": {
                            "val": "6.468"
                        },
                        "BudgetYearFive": {
                            "val": "6.600"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the applied research, study, assessment, and demonstration of technologies that could provide a non-lethal capability or target effect. Investment areas include applied research related to: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal acoustic and optical technologies; advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications); associated human effects and effectiveness for new non-lethal stimuli; injury potential and effectiveness of directed energy, electric stun, ocular, and acoustic based non-lethal technologies; and developing models of crowd behavior and dynamics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "(U) JOINT NON-LETHAL WEAPONS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.146"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued academic research into technology areas with relevance to non-lethal weapon capabilities.\n- Continued investigations of alternative technologies with potential to address emerging capability gaps.\n- Continued to evaluate methodologies for measuring directed energy effects (millimeter - wave, high powered microwave, etc.)\n- Continued investigations of advanced materials and emergent technologies suitable for extended range non-lethal weapon payload applications.\n- Continued transition of foundational effects associated with advanced electro-muscular disruption technologies to higher levels of technology development and demonstration.\n- Continued feasibility assessment and evaluation of candidate technologies with potential to mitigate technology challenges impeding Non-Lethal Effects (NLE) capability gap resolution.\n- Continued applied research into characterization of non-lethal phenomena and assessment of human effects and weapon effectiveness, including development of dose response and injury correlates.\n- Continued investigation of component High Power Microwave (HPM) technologies and transition results to higher levels of technology development and demonstration.\n- Completed human effects investigation of alternative physical phenomena to non-lethally suppress humans beyond small arms range.\n- Completed applied research to develop a framework to analyze behavioral response to non-lethal weapons.\nCompleted evaluation of the feasibility and practicality study of advanced vehicle stopping design concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.425"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue academic research into technology areas with relevance to non-lethal weapon capabilities.\n- Continue investigations of alternative technologies with potential to address emerging capability gaps.\n- Continue to evaluate methodologies for measuring directed energy effects (millimeter - wave, high powered microwave, etc.)\n- Continue investigations of advanced materials and emergent technologies suitable for extended range non-lethal weapon payload applications.\n- Continue transition of foundational effects associated with advanced electro-muscular disruption technologies to higher levels of technology development and demonstration.\n- Continue feasibility assessment and evaluation of candidate technologies with potential to mitigate technology challenges impeding Non-Lethal Effects (NLE) capability gap resolution.\n- Continue applied research into characterization of non-lethal phenomena and assessment of human effects and weapon effectiveness, including development of dose response and injury correlates.\n- Continue investigation of component High Power Microwave (HPM) technologies and transition results to higher levels of technology development and demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.349"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.349"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue research and investigation of emergent technologies and effects with the potential to address non-lethal counter-personnel and counter-materiel capability gaps. Some examples of counter-personnel research include feasibility studies and development of advanced electro-muscular incapacitation and directed energy technologies (e.g., lasers, millimeter-waves) suitable for extended range applications. Investigation and initial design of component high power microwave system technologies and advanced materials for counter-materiel applications will continue in order to enable reduced system sizes, increased energy efficiency, improved performance, and increased delivery and employment options. Target susceptibility studies and evaluation of methodologies for measuring directed energy effects will also continue. Continue applied research to characterize non-lethal phenomena and assess target human effects and weapon effectiveness, including development of dose response and injury correlates for flash-bangs, millimeter-waves, blunt impact and electro-muscular incapacitation. Initiate exploration of new non-lethal effects and evaluation of innovative applications of existing technology to address future non-lethal capability needs.  Transition results to higher levels of technology development and demonstration as feasibility is determined."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this Program Element is the development of technologies that lead to the next-generation of Non-Lethal Weapons. The program consists of a collection of projects that range from studies and analyses to the development and evaluation of feasibility demonstration models. Individual project metrics reflect the technical goals of each specific project. Typical metrics include both the effectiveness of the technology, human effects and effectiveness, and potential for compliance with policy and legislation. Overarching considerations include the advancement of related Technology Readiness Levels and Human Effects Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}