{
    "id": "2019-OperationalTestandEvaluationDefense-PB-0460-JBOOK-e40630d982f6236f71d945944a5f5d65ba0f1cce299886d483962c5e0b1236c8-2",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OTANDE-U_RDTE_JustificationBook_Operational_Test_and_Evaluation__Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Operational_Test_and_Evaluation__Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Operational Test and Evaluation, Defense",
        "appropriation_code": "0460",
        "appropriation_name": "Operational Test and Evaluation, Defense"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605814OTE"
        },
        "ProgramElementTitle": {
            "val": "Operational Test Activities and Analyses"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "AppropriationCode": {
            "val": "0460"
        },
        "AppropriationName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "63.763"
            },
            "PriorYear": {
                "val": "59.566"
            },
            "CurrentYear": {
                "val": "67.897"
            },
            "BudgetYearOne": {
                "val": "70.992"
            },
            "BudgetYearOneBase": {
                "val": "70.992"
            },
            "BudgetYearTwo": {
                "val": "59.650"
            },
            "BudgetYearThree": {
                "val": "59.748"
            },
            "BudgetYearFour": {
                "val": "61.443"
            },
            "BudgetYearFive": {
                "val": "54.121"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Operational Test Activities and Analyses (OTA&A) programs are continuing efforts that provide management and oversight of test and evaluation functions and expertise to the Department of Defense (DoD).  The OTA&A programs consist of three activities:  Joint Test and Evaluation (JT&E); Threat Systems (TS); and Center for Countermeasures (CCM).\n\nJoint Test and Evaluation projects are test and evaluation activities conducted in a joint military environment that develop process improvements.  These multi-Service projects, chartered by the Office of the Secretary of Defense and coordinated with the Joint Staff, appropriate combatant commanders, and the Services, provide non-materiel solutions that improve:  joint interoperability of Service systems, technical and operational concepts, joint operational issues, development and validation of joint test methodologies, and test data for validating models, simulations, and test beds.  The JT&E projects address relevant joint war fighting issues in a joint test and evaluation environment by developing and providing new tactics, techniques, and procedures to improve joint capabilities and methodologies.   \n\nThreat Systems, based on a memorandum of agreement between the Director, Operational Test and Evaluation (DOT&E) and the Defense Intelligence Agency, provides DOT&E support in the areas of threat resource analysis, intelligence support and threat systems investments.  Threat Systems provides threat resource analyses on the availability, capabilities and limitations of threat representations (threat simulators, targets, models, U.S. surrogates and foreign materiel) and analysis of test resources used for operational testing to support DOT&E’s assessment of the adequacy of testing for those programs designated for oversight by DOT&E and the Office of the Under Secretary of Defense for Acquisition, Technology and Logistics.  Threat Systems provides DOT&E assessment officers and other DOT&E activities with program specific threat intelligence support.  Threat Systems also funds management, oversight, and development of common-use threat specifications for threat simulators, threat representative targets, and digital threat models used for test and evaluation.\n\nThe Center, a Joint Service Countermeasure (CM) T&E Activity, directs, coordinates, supports, and conducts independent countermeasure\/counter-countermeasure (CCM) T&E activities of U.S. and foreign weapon systems, subsystems, sensors, and related components. The Center accomplishes this work in support of DOT&E, Deputy Assistant Secretary of Defense (DASD) for Developmental Test and Evaluation (DT&E), weapon system developers, and the Services.  The Center’s testing and analyses directly supports operational effectiveness and suitability evaluations of CM\/CCM systems, such as missile warning and aircraft survivability equipment (ASE), used on rotary-wing and fixed-wing aircraft.  The Center develops unique CM\/CCM test equipment to support testing in operationally realistic environments. The Center determines effectiveness of precision guided weapon (PGW) systems and subsystems when operating in an environment degraded by CMs.  Analysis and recommendations on CM\/CCM effectiveness are provided to Service Program Offices, DOT&E, DASD (DT&E), and the Services.  The Center also supports Service member exercises, training, and pre-deployment activities with expertise on CM\/CCM technology and capabilities.\n\nThis Program Element includes funds to obtain Federally Funded Research and Development support and travel funds."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "52.631"
                },
                "CurrentYear": {
                    "val": "67.897"
                },
                "BudgetYearOne": {
                    "val": "63.641"
                },
                "BudgetYearOneBase": {
                    "val": "63.641"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.566"
                },
                "CurrentYear": {
                    "val": "67.897"
                },
                "BudgetYearOne": {
                    "val": "70.992"
                },
                "BudgetYearOneBase": {
                    "val": "70.992"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "6.935"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.351"
                },
                "BudgetYearOneBase": {
                    "val": "7.351"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.065"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "8.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Joint Standard Instrumentation Suite (JSIS) Full Operational Capability"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "7.351"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.351"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 reduction of $1.065 was congressional directed FFRDC reduction.\nFY 2017 Congressional Add was for, \"Program increase - threat resource analysis\".\n\nFY 2019 change for Joint Standard Instrumentation Suite (JSIS) Full Operational Capability provides threat measurement capabilities necessary for test and evaluation modelling and simulation.  This enhancement provides an integrated suite of radiometric instruments along with related equipment to measure and record threat munitions signatures, Time Space Position Information (TSPI), and other ground truth data."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "000920"
                    },
                    "ProjectTitle": {
                        "val": "OTA&A"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "63.763"
                        },
                        "PriorYear": {
                            "val": "59.566"
                        },
                        "CurrentYear": {
                            "val": "67.897"
                        },
                        "BudgetYearOne": {
                            "val": "70.992"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.992"
                        },
                        "BudgetYearTwo": {
                            "val": "59.650"
                        },
                        "BudgetYearThree": {
                            "val": "59.748"
                        },
                        "BudgetYearFour": {
                            "val": "61.443"
                        },
                        "BudgetYearFive": {
                            "val": "54.121"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Operational Test Activities and Analyses (OTA&A) programs are continuing efforts that provide management and oversight of test and evaluation functions and expertise to the Department of Defense (DoD).  The OTA&A programs consist of three activities:  Joint Test and Evaluation (JT&E); Threat Systems (TS); and, the Center for Countermeasures (CCM)."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Threat Resource Analysis"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "- Developed and demonstrated a prototype system to support threat EW-enabled cyber operations for T&E for lab\/anechoic chamber use by collecting classified and open-source data on C\/EW threats, analyzed DoD and Service requirements for C\/EW testing, and acquired U.S. targeted systems for lab test articles (ARC-231).\n- Developed a Cyber Cloud that addresses many of the pitfalls Intelligence Analysts face today.\n- Identified the lack of a clearly defined cyber threat folder development processes to address the lack of a standardized folder structure across the Cyber community and the absence of a centralized storage location for threat folders.\n- Expanded our understanding of “wireless” cyber threats, which includes wireless cyber threats to support US weapon system testing. \n- Utilized investments on U.S. weapon systems that blend cyber and EW capabilities comparable to threat T&E assets.\n- Supported DT\/OT programs with documented Cyber Electronic Warfare threat shortfalls such as Tactical Communications, Datalinks, Radio Communications, Networking, Data transportation and C4ISR Sensors and Systems.\n- Initiated actions to embrace the growing and evolving DOT&E Cyber Threat requirements and analyzing the convergence of Cyber and Electronic Warfare effecting the baseline required for Operational Test. \n- Continued to identify initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, representative threat offensive and defensive cyber operations capabilities, and scalable cyberspace threat test environments that can interface with cyber test networks.\n\nThreat Systems also continued efforts to maintain a standard set of threat performance models. These activities helped DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test Activities and Analyses"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "51.566"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E) \n\nIn FY 2017 JT&E plans on closing two projects that were started in FY 2015. One, the Joint Pre-\/Post-Attack Operations Supporting Survivability & Endurability Joint Test, expected to close in February 2017, will develop and test procedures for protective posturing and mobile support that will mitigate the effects of an electromagnetic-pulse on mission critical functions. The other project to close in FY 2017 is the Joint Advanced Sensor to Shooter Joint Test, which is looking to develop, test and evaluate tactics, techniques, and procedures to more efficiently and effectively gain and maintain battle space awareness through integration of rapidly developed capabilities to support combat operations in anti-access and active denial environments\n\nTwo projects that started in FY 2016 will continue through FY 2017.\n\nFour new feasibility studies are expected to be conducted in FY 2017, two of which will be selected to conduct joint tests.\n\nThreat Systems\n\nIn FY 2017, Threat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions based on the availability of funding. Threat Systems will:\n\n- Provide intelligence support to DOT&E staff to address specific questions on threat systems affecting programs on the OSD T&E Oversight list and provide briefings and special intelligence reports when necessary.\n- Provide DOT&E representative support at the Threat Steering Group (TSG) in the transitioning of the System Threat Assessment Reports (STARS) to the new Validated Online Lifecycle Threat (VOLT) report process.\n- Continue to represent DOT&E interests on Acquisition\/Intelligence\/ Requirement Task Force (AIRTF) and Executive Steering Group (AIRESG) and provide access to the Intelligence Mission Data Management Analysis & Reporting System (IMARS).  \n- Support the US warfighter by providing threat intelligence to ensure operational and developmental testing occurs against realistic threat representations.\n- Sustain and manage threat M&S to support test and evaluation by overseeing and coordinating intelligence community developed threat models, performing threat model anomaly resolution resolving differences from live fire testing, integrating threat models into T&E facilities and distributing performance and signature models to T&E users.\n- Review validation reports to independently ensure that correct threat data and critical parameters are presented in the report to assessment the threat representation’s capabilities to replicate a real world threat system.\n- Continue identifying initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, representative threat offensive and defensive cyber operations capabilities, and scalable cyberspace threat test environments that can interface with cyber test networks.\n- Manage Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) efforts supporting programs on the OSD T&E Oversight List by conducting intelligence “deep dives” to produce intelligence in sufficient detail to develop new threat test assets.\n- Initiate new ITEAMS efforts leading to the development of new threat systems for T&E.\n- Represent DOT&E at foreign material exchanges, inter-agency coordinating groups, and non-proliferation groups to raise awareness of T&E needs for foreign material, coordinate service requirements, and de-conflict and prioritize foreign material requirements for T&E.\n- Represent DOT&E at the Intelligence Mission Data Oversight Board responsible for development, production and sharing issues affecting the intelligence data supporting weapons systems acquisition.\n- Oversee legacy DOT&E investments and continue management and oversight of legacy and new Test Resource Management Center-funded threat system investments.\n\nThese activities will ensure DOT&E carries out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs.\n\nThe Center\n\nThe Center has received 47 requests for support in FY17, which exceeds our capacity to support.   The Center will assess the requests based on priority and schedule. The Center will test, analyze, and report on more than 30 systems, with emphasis on rotary wing survivability, CM\/CCM employment, warning and targeting systems, and PGWs. Each program supported will receive an independent assessment of our data\/findings and test support for CM\/CCM evaluations. The Center will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 weapons systems, aircraft survivability and hostile fire initiatives. The Center will continue to conduct ongoing investigations towards determining and filling the gaps in EW and multimode system testing. In addition to these test activities, the Center will continue to provide CM expertise in pre-deployment events and training, as well as CM\/CCM-focused tactics, techniques and procedures (TTP) development. Our support will be distributed across all the Services, as well as intelligence agencies and research and development activities.\n\nThe Center will complete the initial development of JSIS and the High-Power Portable Radar Threat Simulator (HPRTS), which will be used in support of testing for both Title 10 programs and ASE urgent operational needs. The Center will complete the development of a new test van to support more remote threat live fire testing. The Center will continue working with the Threat Simulator Working Group (TSWG)-sponsored HSIG model. \n\nThe Center will provide expertise to many organizations and will continue to be actively involved in the following panels: JECM Integrated Product Team, Joint Infrared Countermeasures Multi Sensing Symposia Working Group (MSS IRCM WG), JASP, Foreign Material Exploitation Working Group, Foreign Material Program T&E Subcommittee, JCMT&E WG, and JCMT&E WG HFI subgroup lead.\n\n5th Generation Aerial Target (5GAT)\n\nIn FY17, the 5th Generation Aerial Target program will complete the government owned air vehicle and subsystems layout.  The program will begin tooling and parts fabrication using carbon composite manufacturing methods.  In addition, the program will begin the electronic attack equipment integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "67.897"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E)\n\nIn FY 2018, JT&E plans to close one project that was started in FY 2016.  The Digitally Aided Close Air Support Joint Test is anticipated to close in May 2018.  It is developing and testing procedures so Joint Terminal Attack Controllers, Joint Fires Observers, and Close Air Support aircrew can realize the advantage of digital communications, including shared situational awareness, increased confidence prior to weapons release, and improved kill chain timeliness.  Two projects that started in FY 2017 will continue through FY 2018.  Four new feasibility studies are expected to be conducted in FY 2018 of which two will be selected to conduct joint tests.\n\nThreat Systems\n\nFY 2018, Threat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions based on the availability of funding. Threat Systems will:\n- Provide intelligence support to DOT&E staff to address specific questions on threat systems affecting programs on the OSD T&E\nOversight list and provide briefings and special intelligence reports when necessary.\n- Provide DOT&E representative support at the Threat Steering Group (TSG) in the transitioning of the System Threat Assessment\nReports (STARS) to the new Validated Online Lifecycle Threat (VOLT) report process.\n- Continue to represent DOT&E interests on Acquisition\/Intelligence\/ Requirement Task Force (AIRTF) and Executive Steering\nGroup (AIRESG) and provide access to the Intelligence Mission Data Management Analysis & Reporting System (IMARS).\n- Support the US warfighter by providing threat intelligence to ensure operational and developmental testing occurs against realistic threat representations.\n- Sustain and manage threat M&S to support test and evaluation by overseeing and coordinating intelligence community developed threat models, performing threat model anomaly resolution resolving differences from live fire testing, integrating threat models into T&E facilities and distributing performance and signature models to T&E users.\n- Review validation reports to independently ensure that correct threat data and critical parameters are presented in the report to assessment the threat representation’s capabilities to replicate a real world threat system.\n- Continue identifying initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, representative threat offensive and defensive cyber operations capabilities, and scalable cyberspace threat test environments that can interface with cyber test networks.\n- Manage Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) efforts supporting programs on the OSD\nT&E Oversight List by conducting intelligence “deep dives” to produce intelligence in sufficient detail to develop new threat test assets.\n- Initiate new ITEAMS efforts leading to the development of new threat systems for T&E.\n- Represent DOT&E at foreign material exchanges, inter-agency coordinating groups, and non-proliferation groups to raise awareness of T&E needs for foreign material, coordinate service requirements, and de-conflict and prioritize foreign material requirements for T&E.\n- Represent DOT&E at the Intelligence Mission Data Oversight Board responsible for development, production and sharing issues affecting the intelligence data supporting weapons systems acquisition.\n- Oversee legacy DOT&E investments and continue management and oversight of legacy and new Test Resource Management\nCenter-funded threat system investments.\n\nThreat Systems continues its efforts to maintain a standard set of threat performance models.  These activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs.\n\nThe Center\n\nThe Center has received 46 requests for support during FY18, which exceeds our support capacity.  The Center will assess the requests based on priority and schedule.  The Center will test, analyze, and report on more than 30 systems\/platforms, with emphasis on rotary wing survivability.  High priority test events will receive an independent assessment of our data\/findings for CM\/CCM evaluations.  The Center will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 weapons systems, aircraft survivability and hostile fire initiatives.\n\nThe Center will continue to conduct ongoing investigations towards determining and filling the gaps in EW and multimode system testing.  In addition to these test activities, the Center will continue to provide CM expertise in pre-deployment events and training, as well as CM\/CCM-focused tactics, techniques and procedures (TTP) development. Our support will be distributed across all the Services, as well as intelligence agencies and research and development activities.\n\nThe Center will complete the initial development of the RLS turret upgrade, which will be used in support of testing for both Title 10 programs and ASE urgent operational needs.  The Center will continue to improve and expand the JSIS to meet program data collection requirements.  Also, emitter upgrades are planned for the missile plume simulators to better replicate threat missile launches.  The Center will provide expertise to many organizations including program offices and other T&E agencies.  The Center will continue to be actively involved in the following panels:  JECM Integrated Product Team, Joint Infrared Countermeasures Multi Sensing Symposia Working Group (MSS IRCM WG), JASP, Foreign Material Exploitation Working Group, Foreign Material Program T&E Subcommittee, JCMT&E WG, and JCMT&E WG HFI subgroup lead."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "70.992"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "70.992"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E)\n\nIn FY 2019, JT&E plans to close one project that was started in FY 2016 and two projects that were started in FY 2017.  The first is the Joint Counterair Integration Joint Test, which is anticipated to close in November 2018.  It is developing and testing TTP for counterair shooter and C2 operators to effectively integrate joint defensive counterair resources in a contested, degraded, and operationally limited environment to protect defended assets from expected threats.  The other project expected to close in FY 2019 is the Joint Cyber Insider Threat Joint Test, which is anticipated to close in November 2018.  It is developing and testing procedures to proactively detect and respond to cyber insider threats before they have an adverse impact on military operations.  Two projects that will start in FY 2018 will continue through FY 2019.  Four new feasibility studies are expected to be conducted in FY 2019 of which two will be selected to conduct joint tests.\n\nThreat Systems\n\nIn FY 2019, Threat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions based on the availability of funding. Threat Systems will:\n- Continue to provide intelligence support to DOT&E staff to address specific questions on threat systems affecting programs on the OSD T&E Oversight list and provide briefings and special intelligence reports when necessary.\n- Continue providing DOT&E representative support at the Threat Steering Group (TSG) in the transitioning of the System Threat\nAssessment Reports (STARS) to the new Validated Online Lifecycle Threat (VOLT) Report process.\n- Continue to represent DOT&E interests on Acquisition\/Intelligence\/ Requirement Task Force (AIRTF) and Executive Steering\nGroup (AIRESG) and provide access to the Intelligence Mission Data Management Analysis & Reporting System (IMARS).\n- Continue identifying initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, and scalable cyberspace threat test environments that can interface with cyber test networks.\n- Continue identifying initiatives to conduct offensive cyber operations (OCO) and defensive cyber operations (DCO) without significantly impacting critical operational capabilities.\n- Continue initiatives to improve satellite and space threat representations.\n- Support the US warfighter by providing threat intelligence to ensure operational and developmental testing occurs against realistic threat representations.\n- Sustain and manage threat M&S to support test and evaluation by overseeing and coordinating intelligence community developed threat models, performing threat model anomaly resolution resolving differences from live fire testing, integrating threat models into T&E facilities and distributing performance and signature models to T&E users.\n- Manage Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) efforts supporting programs on the OSD\nOversight T&E List by conducting intelligence “deep dives” to produce intelligence in sufficient detail to develop new threat test assets.\n- Represent DOT&E at foreign material exchanges, inter-agency coordinating groups, and non-proliferation groups to raise awareness of T&E needs for foreign material, coordinate service requirements, and de-conflict and prioritize foreign material requirements for T&E.\n- Review validation reports to independently ensure that correct threat data and critical parameters are presented in the report to assessment the threat representation’s capabilities to replicate a real world threat system.\n- Represent DOT&E at the Intelligence Mission Data Oversight Board responsible for development, production and sharing issues affecting the intelligence data supporting weapons systems acquisition.\n- Oversee legacy DOT&E investments and continue management and oversight of legacy and new Test Resource Management\nCenter-funded threat system investments.\n- Continue ITEAMS efforts leading to the development of new threat systems for T&E.\n\nThreat Systems will continue its efforts to maintain a standard set of threat performance models.  These activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs.\n\nThe Center\n\nThe Center will test, analyze, and report on more than 30 systems\/platforms, with special emphasis on aircraft survivability, CM\/CCM employment, warning and targeting systems, and PGWs.  High priority programs will receive an independent assessment of our data\/findings for CM\/ CCM evaluations.  The Center will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 weapons systems, aircraft survivability and hostile fire initiatives.  Furthermore, the Center will continue to provide CM expertise in pre-deployment events and training, as well as CM\/CCM-focused TTP development.  Our support will be distributed across all the Services, as well as intelligence agencies and research and development activities.\n\nThe Center will continue Improvement and Modernization (I&M) efforts to improve T&E capabilities.  The Center plans to continue upgrades to the JSIS system and missile plume simulator emitters.  \n\nThe Center will provide expertise to many organizations including program offices and other T&E agencies.  The Center will continue to be actively involved in the following panels: JECM Integrated Product Team, Joint Infrared Countermeasures Multi Sensing Symposia Working Group (MSS IRCM WG), JASP, Foreign Material Exploitation Working Group, Foreign Material Program T&E Subcommittee, JCMT&E WG, and JCMT&E WG HFI subgroup lead."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2018 to FY 2019 of $3.095 Million is consistent with planned program increases in Joint Standard Instrumentation Suite (JSIS), Full Operational Capability (FOC), a program that provides threat measurement capabilities necessary for test and evaluation modelling and simulation; as well as planned program decreases in Fifth Generation Aerial Targets."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance Measure:  Percentage of required products, such as test planning documents, tactics, techniques, procedures, threat characteristics, assessments, and reports that are developed and delivered to program managers and customers on time.  The on-time completion rate was computed on the basis of the number of required products that were submitted within established time standards relative to the total number of such products that fell due during the fiscal year."
                        }
                    }
                }
            ]
        }
    }
}