{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2493f0919bca3c9887c2149e77e4bc805cb5ac3396a194d2f3cb8b6ccd5038c5-19",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605027D8Z"
        },
        "ProgramElementTitle": {
            "val": "OUSD(C) IT Development Initiative"
        },
        "R1LineNumber": {
            "val": "126"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "47.124"
            },
            "PriorYear": {
                "val": "16.131"
            },
            "CurrentYear": {
                "val": "21.353"
            },
            "BudgetYearOne": {
                "val": "9.590"
            },
            "BudgetYearOneBase": {
                "val": "9.590"
            },
            "BudgetYearTwo": {
                "val": "8.157"
            },
            "BudgetYearThree": {
                "val": "8.206"
            },
            "BudgetYearFour": {
                "val": "8.306"
            },
            "BudgetYearFive": {
                "val": "8.458"
            }
        },
        "ProgramElementNote": {
            "val": "BUDGET REQUEST JUSTIFICATION:  +$8.090 million is required to support Next Generation Resource Management System (NGRMS).\n\nNo additional funds are requested for Financial Management Certification Tracking and Reporting Tool (FM-CTRT).\n\n+$1.500 million is required to support Universe of Transactions."
        },
        "ProgramElementMissionDescription": {
            "val": "As the Department of Defense strategic, operational, and tactical plans and objectives transform the war fighter with new capabilities and doctrine, the budgeting and accountability of funds used to pursue the Department objectives will become more complicated and detailed for senior leaders to make decisions with supporting rationale for the taxpayer.  Incorporating information technology toward current and emerging business processes manifesting into a state-of-the art system of systems will result in increasing efficiencies, timely diagnostics, and reducing lifecycle costs to maintain, sustain and repair.\n\nThis initiative exploits emerging technology, processes, trends, capabilities, and techniques to incorporate state-of-the-art information technology enabling the ability, agility, and level of fidelity to collect, process, administrate and report resource management data and to automate business processes within a more robust analytical environment within the Office of the Under Secretary of Defense (Comptroller) OUSD(C).\n  \nNEXT GENERATION RESOURCE MANAGEMENT SYSTEM:\nThe Department’s budget focuses on institutionalizing and financing our capabilities to fight the wars we are in today and the scenarios we are most likely to face in the years ahead, while at the same time mitigating risk and providing for contingency operations. It also includes a fundamental overhaul of the DoD’s approach to procurement, acquisition, and contracting.  As such, the complex details of budgeting and tracking of funds become increasingly critical to senior leader decision making and to provide accountability to the taxpayer.  Incorporating information technology toward current and emerging business processes manifesting into a state-of-the art system of systems will result in increasing efficiencies, timely diagnostics, and reducing lifecycle costs to maintain, sustain and repair.\n\nToday, the Office of the Under Secretary of Defense Comptroller OUSD(C) and the Cost Analysis and Program Evaluation (CAPE) use various distinct automated systems (Comptroller Information System (CIS), Program Resource Collection Process (PRCP), Supplemental Resource Collection Process (SRCP), Budget Exhibits Generator and Standard Data Collection System (SDCS)) to formulate, justify, and execute DoD budgets.  These six or more systems interact with at least several computer-based systems controlled by external organizations and agencies.  These systems manage very similar financial information, yet each uses its own scheme for representing information.  Much of the information managed by these systems is redundant.  Cross-system data representations and redundancies make it difficult to exchange and to reconcile information.  The capabilities provided by Comptroller systems, in some cases, fail to deliver services needed by its users, or fail to operate in ways that complement current and emerging business practices.  They fail to give executives information in a comprehensible form, making it difficult to draw conclusions.  Data disparities and functional redundancy make these systems more costly to maintain than they need to be.\n\nThere is a critical need for the development of a state-of-the-art information technology system to modernize and replace multiple, antiquated legacy systems and processes used to formulate, justify, present and defend the entire Department of Defense Budget in the Office of the Under Secretary of Defense (Comptroller) (OUSD(C)) to meet Title 10 and Title 31 mission and reporting requirements.  The Comptroller’s plan for mitigating the deficiencies and capability gaps associated with current systems is development of the Next Generation Resource Management System.\n\nThis initiative exploits emerging technology, processes, trends, capabilities, and techniques to incorporate state-of-the-art information technology enabling the ability, agility, and level of fidelity to collect, process, administer and report resource management data and to automate business processes within a more robust analytical environment within the Office of the Under Secretary of Defense (Comptroller) OUSD(C). Funded efforts will improve the timeliness of resource management reviews and decisions for senior leaders and Congress.\n\nFINANCIAL MANAGEMENT CERTIFICATION TRACKING AND REPORTING TOOL:\n\nNo RDT&E funds are requested.  \n\nThe Defense Financial Management Certification Program (DFMCP) meets the business requirement to comply with section 1051 of the FY 2012 National Defense Authorization Act (NDAA), Public Law 112-81, authorizing the Secretary of Defense to establish a certification program for the 54,000 Financial Management (FM) workforce in order to improve audit readiness and analytic capability.  \n\nThe Department of Defense has a requirement to strengthen the professional development of the DoD financial management workforce and to ensure that DoD financial managers are properly trained to meet current and future requirements to support the Warfighter.  The DFMCP is the approved strategy to meet this requirement.  The DFMCP needs a tracking and reporting tool for web-based course training and exams, a robust reporting capability for standard and ad hoc reports, a course search capability, sort filtering capability, and a capability to attach multiple documents once the training certification requirements are completed.  The tool will self-guides users through the policies and procedures required by the program, without the burden of extensive training on how to use the system itself.  The tool will enable program operations, with embedded business rules, that represent policy and procedures, and have internal controls that prevent improper actions.  The tool will be intuitive, track and record activities, and enable users to perform correct actions the first time.  The tool will provide a reporting tool that furnishes leadership with near real time management reports concerning FM Workforce Certification Qualifications and be adaptable to reasonable changes in DFMCP policies and procedures.\n\nUNIVERSE OF TRANSACTIONS:\n\nFunding will support financial audit. A Universe of Transaction (UoT) inclusive of all Department of Defense (DoD) Wide Appropriation General Fund (TI-97) information is needed to support reconciliation of fifteen General Fund accounting systems, reconciliation of eighteen business feeder systems to general fund accounting system, and validating UoT capabilities through the audit examinations of DCMA and DoDEA.\n\t\nThe DoD TI-97 UoT requires:\n• All supporting TI-97 data that rolls up to the DoD financial statement (detailed accounting data reconciled to the financial statement)\n• Proof of the completeness of all transactional data reported within the UoT (detailed accounting data reconciled to business events)\n• Ability to extract subset populations\n• Ability to secure and protect the data within the UoT\n\nThe failure to meet these requirements will result in the Department unable to successfully conduct and pass an audit.\n\nTo achieve these requirements, the Office of the Under Secretary of Defense (Comptroller) is creating a tool called the Auditable Universe of Data Intelligence Tool (AUD-IT).  This tool has the potential to significantly improve DoD’s capability and capacity to handle large volumes of standard and non-standard financial data.  Both an application and analytical platform, the AUD-IT leverages an open-source software framework for storing data and running applications to deliver a complete UoT for TI-97.  \n\nThe first phase of AUD-IT implementation is a proof of concept with the U.S. Special Operations Command (USSOCOM) systems to develop a baseline application and configuration.  When the first phase has been successfully completed, the second phase will integrate into the full solution any remaining accounting and business feeder systems that execute TI-97 funds and be the solution for DATA Act. The current timeline for the proof of concept is estimated to be completed by December 2017.\n\nAUD-IT is a joint effort between Office of the Deputy Chief Financial Officer (ODCFO), Office of the Deputy Chief Management Officer (ODCMO), Office of the Chief Information Officer (OCIO), USSOCOM, and the Defense Finance and Accounting Service (DFAS).\n\nThe FY19 funds will be used to develop and implement a SIPR environment for Cost Accounting Framework to meet Operations Security (OPSEC) and Information Security (INFOSEC) requirements"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.831"
                },
                "CurrentYear": {
                    "val": "21.353"
                },
                "BudgetYearOne": {
                    "val": "9.590"
                },
                "BudgetYearOneBase": {
                    "val": "9.590"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.131"
                },
                "CurrentYear": {
                    "val": "21.353"
                },
                "BudgetYearOne": {
                    "val": "9.590"
                },
                "BudgetYearOneBase": {
                    "val": "9.590"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.300"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY17 Supplemental Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "7.300"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 BUDGET REQUEST JUSTIFICATION: +$8.090 million is required to support Next Generation Resource Management System (NGRMS) and $1.500 million is required to support Universe of Transactions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "927"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Resource Management System"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "38.474"
                        },
                        "PriorYear": {
                            "val": "8.831"
                        },
                        "CurrentYear": {
                            "val": "8.853"
                        },
                        "BudgetYearOne": {
                            "val": "8.090"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.090"
                        },
                        "BudgetYearTwo": {
                            "val": "8.157"
                        },
                        "BudgetYearThree": {
                            "val": "8.206"
                        },
                        "BudgetYearFour": {
                            "val": "8.306"
                        },
                        "BudgetYearFive": {
                            "val": "8.458"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department’s budget focuses on institutionalizing and financing our capabilities to fight the wars we are in today and the scenarios we are most likely to face in the years ahead, while at the same time mitigating risk and providing for contingency operations. It also includes a fundamental overhaul of the DoD’s approach to procurement, acquisition, and contracting.  As such, the complex details of budgeting and tracking of funds become increasingly critical to senior leader decision making and to provide accountability to the taxpayer.  Incorporating information technology toward current and emerging business processes manifesting into a state-of-the art system of systems will result in increasing efficiencies, timely diagnostics, and reducing lifecycle costs to maintain, sustain and repair.\n\nToday, the Office of the Under Secretary of Defense Comptroller OUSD(C) and the Cost Analysis and Program Evaluation (CAPE) use various distinct automated systems (Comptroller Information System (CIS), Program Resource Collection Process (PRCP), Supplemental Resource Collection Process (SRCP), Budget Exhibits Generator and Standard Data Collection System (SDCS)) to formulate, justify, and execute DoD budgets.  These six or more systems interact with at least several computer-based systems controlled by external organizations and agencies.  These systems manage very similar financial information, yet each uses its own scheme for representing information.  Much of the information managed by these systems is redundant.  Cross-system data representations and redundancies make it difficult to exchange and to reconcile information.  The capabilities provided by Comptroller systems, in some cases, fail to deliver services needed by its users, or fail to operate in ways that complement current and emerging business practices.  They fail to give executives information in a comprehensible form, making it difficult to draw conclusions.  Data disparities and functional redundancy make these systems more costly to maintain than they need to be.\n\nThere is a critical need for the development of a state-of-the-art information technology system to modernize and replace multiple, antiquated legacy systems and processes used to formulate, justify, present and defend the entire Department of Defense Budget in the Office of the Under Secretary of Defense (Comptroller) (OUSD(C)) to meet Title 10 and Title 31 mission and reporting requirements.  The Comptroller’s plan for mitigating the deficiencies and capability gaps associated with current systems is development of the Next Generation Resource Management System.  \n\nThis initiative exploits emerging technology, processes, trends, capabilities, and techniques to incorporate state-of-the-art information technology enabling the ability, agility, and level of fidelity to collect, process, administer and report resource management data and to automate business processes within a more robust analytical environment within the Office of the Under Secretary of Defense (Comptroller) OUSD(C). Funded efforts will improve the timeliness of resource management reviews and decisions for senior leaders and Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Resource Management System"
                                    },
                                    "Description": {
                                        "val": "Plan, develop, test and evaluate the system components (i.e. unified database, expert system, cross domain security, enterprise service bus, applications, services) and supportability requirements in modernizing the budget formulation, programming execution and reporting capabilities for the Department of Defense.  Activities will include, but not be limited to, the preparation of all documentation required for Clinger-Cohen Compliance and acquisition regulations, developing requests for proposals, and oversight and management of contracts and deliverables."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.831"
                                            },
                                            "Text": {
                                                "val": "The initial plan was to move funding to DLA starting in FY2017 for more efficient execution.  However, due to delays in the NGRMS environment and no significant progress in the program execution by the DLA Program Management Office, the funding should move back to OUSD(C) to allow Comptroller to get the project back on track and determine a way forward."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.853"
                                            },
                                            "Text": {
                                                "val": "After the NGRMS program funding was transferred from DLA to OUSD(C) in FY2017, the Comptroller staff has begun work on developing a comprehensive, integrated plan as part of acquisition planning activities that will describe the business, technical, and support strategies to manage program risks and meet program objectives.  OUSD(C) has taken the first step in getting the program back on track.  OUSD(C) and CAPE are working on a joint spiral development effort to improve the effectiveness and efficiency of the DoD budget formulation process by consolidating multiple budget data collection points into a prototype for programming and budget data.  This would combine the collection of data performed by the existing applications Standard Data Collection System (SDCS) (Manpower, Forces, Pay Rates, DWCF), Comptroller Information System (CIS), Program Resources Collection Process (PRCP) (Procurement, Research Development Test & Development, Military Construction and Procurement) and the Comptroller Information System (CIS).  This serves as an important proof-of-concept for future development of NGRMS.  Certain elements of agile development and the waterfall method are applied to provide incremental, staged improvements in functionality.\n\nThe prototype will provide a single, centralized user interface for the DoD components and agencies to submit their budget requests using a common, integrated budget structure, improving efficiency and effectiveness by removing redundancy and need for data reconciliation across multiple budget systems.  This initial phase will support capabilities to collect and feed the budget request data back to existing Comptroller and CAPE legacy systems (CIS, PRCP, and SDCS) to be further processed as part of the President's Budget submission process.  This effort is intended to expand into the next development phase of the NGRMS.\n\nTo prove the concept, OUSD(C) and CAPE have begun to capture and process Manpower (Military End Strength and Civilian FTEs) data.  The purpose of this prototype is to prove that budget submission data can be captured with a commonly defined data structure, transformed, and exchanged back to CIS, PRCP and SDCS in a seamless manner.  OUSD(C) and CAPE are currently working to define a standard set of submission data elements for collection of Manpower data.  The single submission prototype effort is intended to expand to include capture of all budget transaction types and will lead to NGRMS, the modernization and consolidation of multiple budget systems, implementation of next generation capabilities, and eventually, retirement of multiple legacy systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.090"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.090"
                                            },
                                            "Text": {
                                                "val": "Continue work on the prototype for programming and budget data.  The development of a web-based user interface to support the submission process and the to-be process flow for the centralized collection of other budget program data, and conceptual design for program collection are in the plan for FY2019.  Additional systems will be brought on as soon as there is success with proof of concept."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease was due to the changes in the scope of NGRMS requirements.  The program was brought in house from DLA which reduced program management support."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop prototype on a smaller scale to replace legacy mission system by leveraging existing resources to explore possible contract awards."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon & Contractor Off-site Facility"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "38.474"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.831"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.853"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.090"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.090"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "NGRMS - Milestone Schedule_20171228.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "NGRMS Prototype"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "929"
                    },
                    "ProjectTitle": {
                        "val": "Financial Management Certification Tracking and Reporting Tool"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Investment Review Board approved the Department of Defense Financial Management Certification Program (DFMCP) Problem Statement on July 28th, 2016. The DFMCP meets the business requirement to comply with section 1051 of the FY 2012 NDAA, Public Law 112-8 for improved audit readiness and analytic capability of the 54,000-strong Financial Management (FM) workforce. \n\nThe Department of Defense continues to use the Washington Headquarter Services Learning Management System (LMS) DFMCP system of record. LMS has performed barely adequately in implementing the certification program. A fair assessment by the program office is that despite three years of providing, improving and proliferating training, most FM LMS users and administrators cannot use the LMS proficiently. The result from the users’ perspectives is that the program is flawed, that achievement of certification is unnecessarily difficult, and that instead of enabling the DFMCP, the FM LMS is an obstacle to be surmounted. The FM workforce’s frustration with the FM LMS was raised by the Military Department Comptrollers and the Directors of the DFAS and DCAA as the most significant issue with the new FM Certification Program and an issue requiring immediate resolution.  This culminated with an Under Secretary of Defense (Comptroller) decision to explore other alternatives to the current FM LMS.  The existing FM LMS is a cumbersome and expensive system.\n\nThis effort is to plan, develop, test and implement the DoD Financial Management Certification Tracking and Reporting Tool (FM-CTRT) as a more efficient and cost effective solution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Financial Management Certification Tracking and Reporting Tool"
                                    },
                                    "Description": {
                                        "val": "Plan, develop, test and implement the DoD Financial Management Certification Tracking and Reporting tool (FM-CTRT).  This tool implements the internal controls outlined in DODI 1300.26, Financial Management Certification Program.  The tool will provide the DoD Financial Management workforce with the on-line capability to work toward and track their FM certification.  Further it must promote the efficiency and effectiveness of the DoD FM workforce to meet the requirements the FY12 NDAA authorizing the Certification of the DOD FM community."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Pre-contract award in Q2 through Q3.\nAward contract in Q4."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Pre-contract award in Q2 through Q3.\nAward contract in Q4."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Development of tool."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The contract will be awarded in FY18 and the tool will be developed in FY19.  No additional RDT&E is needed in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Pre-contract award in Q2 through Q3.\nAward contract in Q4."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "No FY19 RDT&E funds are requested."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "FM CTART Milestone chart_20170405.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "FM-CTRT Milestone"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisiiton"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Implementation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "930"
                    },
                    "ProjectTitle": {
                        "val": "Universe of Transactions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.650"
                        },
                        "PriorYear": {
                            "val": "7.300"
                        },
                        "CurrentYear": {
                            "val": "10.500"
                        },
                        "BudgetYearOne": {
                            "val": "1.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.500"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Without a single UoT to support the TI97 General Fund for the 4th Estate the Department will be incapable of asserting readiness for an independent audit of the consolidated financial statements.   All DoD organizations are pursuing the current statutory goal of achieving the state of audit readiness (target September 30, 2017) that supports entry into a full financial statement of audit in FY 2018 (target start date March 2018) with an initial opinion rendered in mid-FY 2019.  Without an automated capability to provide a transactional universe for sampling and evidentiary proof the department will not be in compliance with public law. \n\nThe requested funds will be used to buy “Big Data” software and hardware infrastructure and required contractor services to implement the technology to meet the UoT requirement. \nThis UFR includes subject matter expertise costs for DCFO and funds to be placed on a contract for hardware, software, and labor.  This will not result in hiring additional government personnel. \n\nThe UoT will have the capability to:\n•\tIngest data from multiple accounting and financial feeder systems\n•\tNormalize data from multiple sources providing a common data architecture\n•\tReconcile transactional details to summary financial data\n•\tProvide auditor’s the ability to sample TI-97 detailed transactions\n•\tBusiness Analytics\/Reporting\n•\tDATA Act which is a statutory requirement to be completed by May 2017\n•\tProvide NIPR and SIPR capability for non-sensitive and sensitive data\n\nThis effort is a proof of concept focused on USSOCOM, but will apply to all TI-97 general fund entities.  The scope is to bring in data from an estimated 50 systems and demonstrate existence and completeness of business and accounting transaction data, which are capabilities required for audit readiness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Universe of Transactions Defense Wide Appropriation General Fund"
                                    },
                                    "Description": {
                                        "val": "Plan, develop, test and evaluate the system components (i.e. unified database, cross domain security, applications, services) and supportability requirements in creating a universe of transactions for the Defense Wide General Fund Appropriation financial audit.\n\nThe funds will be used to support increments three, four, five, and six per the schedule."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.300"
                                            },
                                            "Text": {
                                                "val": "Reconcile fifteen General Fund accounting systems\nReconcile eighteen business feeder systems to general fund accounting system.\nValidate UoT capabilities  through the audit examinations of DCMA and DoDEA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "Reconcile fifteen General Fund accounting systems\nReconcile eighteen business feeder systems to general fund accounting system.\nValidate UoT capabilities  through the audit examinations of DCMA and DoDEA"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Develop and implement a SIPR environment for Cost Accounting Framework to meet Operations Security (OPSEC) and Information Security (INFOSEC) requirements"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "As we began planning the design of the long-term IT solution for the Cost Accounting Framework, we incorporated funding requirements into the Universe of Transaction FY18 budget to cover a NIPR solution.  Since that budgeting exercise, it has become apparent that we will need funds in the FY19 budget for a SIPR environment to meet project Operations Security (OPSEC) and Information Security (INFOSEC) requirements.  The FY19 funds are needed to support the additional scope of a SIPR implementation for the Cost Accounting Framework database and visualization application."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Leveraging existing contracts to develop and implement SIPR environment."
                        },
                        "PerformanceMetrics": {
                            "val": "97% of the Defense Agencies accounting systems reconcile to the unadjusted trial balance"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Production"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.847"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.150"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.803"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "UoT PoC Schedulev5_Page_1.jpg"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "UoT PoC Schedulev5_Page_2.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Acquisiiton Milestone"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Pilot to Production Decision"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Begin Full Acquisiton Prep"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Development of SIPR Environment for Cost Accounting Framework"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}