{
    "id": "2019-DefenseThreatReductionAgency-PB-0400-JBOOK-bf68c82cd3f91617db25d8e39cf586d94f70da3ccd1feef55140850f55488f14-1",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DTRA-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602718BR"
        },
        "ProgramElementTitle": {
            "val": "*Counter Weapons of Mass Destruction Applied Research"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "959.906"
            },
            "PriorYear": {
                "val": "151.028"
            },
            "CurrentYear": {
                "val": "157.908"
            },
            "BudgetYearOne": {
                "val": "161.151"
            },
            "BudgetYearOneBase": {
                "val": "161.151"
            },
            "BudgetYearTwo": {
                "val": "163.576"
            },
            "BudgetYearThree": {
                "val": "165.678"
            },
            "BudgetYearFour": {
                "val": "165.879"
            },
            "BudgetYearFive": {
                "val": "170.045"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "*Program Element 0602718BR name changes from WMD Defeat Technologies to Counter Weapons of Mass Destruction Applied Research beginning in FY 2018.\n**Project RR title changed from Combating WMD Test and Evaluation to Countering WMD Test and Evaluation beginning in FY 2017."
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Threat Reduction Agency (DTRA) Counter Weapons of Mass Destruction (WMD) Applied Research program element funds the expansion and application of basic scientific knowledge in order to develop novel materials, devices, systems, and methods supporting next generation concepts and technologies that enable advances in WMD surveillance, detection, defeat, prevention, nonproliferation, counterproliferation, consequence management, and treaty verification.\n\nThis Applied Research portfolio is aligned with strategic planning objectives and Science and Technology (S&T) investment direction established annually by DTRA.  The objectives directly support policy and planning guidance from the Office of the President, the Department of Defense (DoD), and the broader WMD threat reduction community.\n\nThe portfolio advances DTRA’s Countering WMD (CWMD) mission by balancing the following imperatives: invest in DTRA’s applied research capabilities and increase the CWMD technology base to maximize future pay-off; capitalize on opportunities to deliver innovative, cost-effective solutions to technical challenges that must be resolved prior to system-specific technology investigations and development; and ensure applied research efforts are directly aligned to mission-specific capability requirements of DTRA, the Military Departments, Combatant Commanders, other DoD and federal agencies, and international partners."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "154.857"
                },
                "CurrentYear": {
                    "val": "157.908"
                },
                "BudgetYearOne": {
                    "val": "160.417"
                },
                "BudgetYearOneBase": {
                    "val": "160.417"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "151.028"
                },
                "CurrentYear": {
                    "val": "157.908"
                },
                "BudgetYearOne": {
                    "val": "161.151"
                },
                "BudgetYearOneBase": {
                    "val": "161.151"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.829"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.734"
                },
                "BudgetYearOneBase": {
                    "val": "0.734"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.506"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.323"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.960"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.960"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Programmatic Increase"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.306"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.306"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in FY 2019 is due to the net effect of increased investment to counter Improvised Explosive Device\/small Unmanned Aerial Systems (IED\/sUAS) (i.e., Tier 1 and 2 UAS, including rotary and fixed winged), a realignment of funding to program element 0603160BR for CWMD terrorism support, a realignment to DTRA's Operations and Maintenance portfolio in support of the Defense Threat Reduction Analysis Center (DTRIAC), and lower economic assumptions for inflation.  The funding level in this program element continues to reflect the impact of incremental Service Requirement Review Board reductions, as part of the Department of Defense reform agenda, for consolidation and reduction of service contracts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RA"
                    },
                    "ProjectTitle": {
                        "val": "Information Sciences and Applications"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "189.420"
                        },
                        "PriorYear": {
                            "val": "35.048"
                        },
                        "CurrentYear": {
                            "val": "30.270"
                        },
                        "BudgetYearOne": {
                            "val": "31.830"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.830"
                        },
                        "BudgetYearTwo": {
                            "val": "29.977"
                        },
                        "BudgetYearThree": {
                            "val": "30.167"
                        },
                        "BudgetYearFour": {
                            "val": "30.412"
                        },
                        "BudgetYearFive": {
                            "val": "31.270"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Information Sciences and Applications project develops concepts and technologies in the areas of high-speed information processing, modeling and simulation, signal detection, and data-driven decision analysis in support of the Defense Threat Reduction Agency's (DTRA's) technical reachback teams.  This project develops and maintains continuously improving collaborative architectures and Chemical, Biological, Radiological, Nuclear and High-yield Explosives (CBRNE) modeling and simulation codes that drive an integrated suite of decision support tools serving the Combatant Commands, other Department of Defense (DoD) agencies, and national and international Countering Weapons of Mass Destruction (CWMD) partners.  This effort funds research activities that benefit the public through analysis and engagement to reduce and counter the threats posed by WMD\/Weapons of Mass Effects (WME) via the Project on Advanced Systems and Concepts for Countering WMD (PASCC). PASCC cultivates national and international research community partnerships across domains, brings scientific, technical, and social science faculty\/experts together, and looks ahead to help understand and anticipate WMD\/WME capabilities and threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RA:  Information Sciences and Applications"
                                    },
                                    "Description": {
                                        "val": "Project RA develops concepts and technologies in the areas of high speed information processing, modeling and simulation, signal detection, and data-driven decision analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.048"
                                            },
                                            "Text": {
                                                "val": "- Initiate development of concepts and explore capabilities for enabling data collection, fusion, and analysis supporting DTRA’s Technology-Driven WMD Threat Forecasting program.\n- Continue to conduct a large-scale test series in collaboration with interagency on dense gas release and to develop models to improve atmospheric hazard predictions and consequence management.  Develop enhancements and modifications to codes supporting analysis of test results.\n- Continue to develop and integrate a CWMD sensor framework in collaboration with the Night Vision Laboratory and Common CBRN Sensor Interface sponsors (DTRA's Nuclear Technologies and Counterterrorism Technologies Divisions and the Joint Program Executive Office for Chemical and Biological Defense) to enable real-time data fusion of deployed sensors with modeling and simulation tools.\n- Continue to develop environmental degradation parameters of airborne non-traditional chemical agents to better characterize collateral effects after a strike on a WMD facility.\n- Continue to develop high fidelity Force-on-Force (phenomenology and effects) computational modeling and simulation capabilities integrated with real and virtual sensor responses.\n- Continue to develop and enhance high fidelity radiation detection training applications for use in mobile devices.\n- Continue to develop augmented reality displays for mobile devices to enable training with virtual radiation source surrogates.\n- Continue to develop data anomaly detection and analysis technology as part of DoD Distributed Common Ground\/Surface System and Intelligence Community Information Technology Enterprise-compliant architectures.\n- Continue to develop enhancements to modeling, simulation, and data architecture capabilities for analysis of higher order effects from nuclear detonation, to include physical infrastructure, political, and economic impacts.\n- Continue to develop automated methods to consolidate multiple geospatial terrain types into a single virtual globe capable of supporting multiple modeling and simulation platforms.\n- Continue to develop mobile device-based route planning, force tracking, and geo-tagging applications to support warfighter- unique CWMD missions.\n- Continue to develop faster-than-real-time analysis code for use in large-scale nuclear physical security threat and vulnerability assessments, and conduct independent validation and verification for DoD level accreditation.\n- Continue to manage and support the Threat Reduction Advisory Committee.  The Committee will be completing a top to bottom review of the chemical, biological, and nuclear issues on the Korean Peninsula.\n- Continue Project on Advanced Systems and Concepts for Countering WMD through the Naval Postgraduate School, and grant 20 to 25 research awards that support CWMD efforts.\n- Continue NextGen activities.  The effort will attempt to expand interest in the nuclear enterprise by engaging the French nuclear non-governmental organizations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.270"
                                            },
                                            "Text": {
                                                "val": "- Continue to pursue methodologies and explore capabilities for enabling data collection, toolset automation, and distributed analysis \/ synthesis of emerging and disruptive technology information that supports the Technology-Driven WMD Threat Forecasting program.\n- Continue to develop data anomaly detection and analysis technology as part of DoD Distributed Common Ground\/Surface System and Intelligence Community Information Technology Enterprise-compliant architectures.\n- Continue to develop enhancements to modeling, simulation, and data architecture capabilities for analysis of higher order effects from nuclear detonation, to include physical infrastructure, political, and economic impacts.\n- Continue maturation of DTRA Experimental Laboratory capabilities in support of whole-of-government CWMD research and development mission areas.  \n- Enhance the software stack to include a minimum of two new nuclear effects phenomenology code capabilities in support of the Mission Planning Analysis System (MPAS) allowing the use of the user interface and web services to acquire effects assessments within the U.S. Strategic Command (USSTRATCOM) operational environment.\n-Initial integration and deployment of two new nuclear effect phenomenology codes for fire spread and electro-magnetic pulse (EMP) modeling  within the Integrated Weapons of Mass Destruction Toolset (IWMDT) architecture to support the MPAS at US USSTRATCOM by providing prototype orchestrated effects modeling for combined effects.\n- Continue to develop high fidelity Force-on-Force (phenomenology and effects) computational modeling and simulation capabilities integrated with real and virtual sensor responses.\n- Continue to conduct a large-scale test series interagency on dense gas release and to develop enhancement of models to improve atmospheric hazard predictions; improvement of models reduces uncertainty of analyses used by staff planners and first responders.  Develop enhancements and modifications to codes supporting analysis of test results.\n- Complete development of environmental degradation parameters of airborne non-traditional chemical agents to characterize collateral effects after a strike on a WMD facility; improvement of models reduces uncertainty in collateral effects from WMD in support of combat operations. \n- Continue to develop and integrate a CWMD sensor framework in collaboration with the Night Vision Laboratory and Common CBRN Sensor Interface sponsors (DTRA's Nuclear Technologies and Counterterrorism Technologies Divisions and the Joint Program Executive Office for Chemical and Biological Defense) to enable real-time data fusion of deployed sensors with modeling and simulation tools.   \n- Continue to develop and enhance high fidelity radiation detection training applications for use in mobile devices.\n- Continue to develop augmented reality displays for mobile devices to enable training with virtual radiation source surrogates.\n- Continue to develop automated methods to consolidate multiple geospatial terrain types into a single virtual globe capable of supporting multiple modeling and simulation platforms.\n- Continue to develop mobile device-based route planning, force tracking, sensor integration, and geo-tagging applications to support warfighter- unique CWMD missions.\n- Continue to conduct a series of WMD studies via the Project on Advanced Systems and Concepts for Countering WMD (PASCC) and grant 20 to 25 research awards that support CWMD efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.830"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.830"
                                            },
                                            "Text": {
                                                "val": "- Release software update for Force-on-Force Evaluation and Analysis of Key Performance Parameters (FREAK), which provides Integrated Force-on-Force Models for Course of Action Analysis, CONOPS Development, and Sensor Performance Prediction.\n- Release software update for Virtual Radiation Training through Ubiety System (VIRTUS), which provides a mobile phone based radiation sensor emulator for search training.\n- Release software update for Android Tactical Assault Kit (ATAK), which incorporates CWMD capabilities into a mobile phone based tactical common operating picture - for customers to support new, emerging and updated modeling and simulation requirements.\n- Continue to sustain a shared, rapidly configurable computational environment to serve as the common R&D backbone:  core analytic tools, shared information, and applications.  Provide analytic solutions and shared computations environments to support R&D and operational needs.  \n- Transition analytic investments, including machine learning, natural language processing, and statistical analytics technologies to the common R&D backbone for agency wide access.\n- Improve decision making processes and time-to-decision cycles by researching, developing, integrating, deploying, and managing advanced data analytics, data visualizations, and knowledge management capabilities to support DTRA’s and associated mission partners’\/customers’ validated operational capability requirements.\n- Establish and advise on approaches to leverage cloud-based capabilities to improve data access, interoperability, and policy compliance.  Implement and enforce system designs to support compliance with DoD cybersecurity policies.\n- Further develop and implement a sustainable and scalable analytic capability to discover emerging and disruptive technologies in support of efforts to anticipate and meet new and emerging requirements.\n- Continue PASCC and grant 20 to 25 research awards that support CWMD efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2018 to FY 2019 is due to a revised acquisition strategy for cloud services and the realignment of High Performance Computing activities."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.102"
                                        },
                                        "CurrentYear": {
                                            "val": "10.229"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.286"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.286"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.480"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.752"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.005"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.258"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "153\/0605502BR"
                                    },
                                    "Title": {
                                        "val": "Small Business Innovation Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.456"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of CWMD technologies selected for transition to advanced technology development (6.3) and advanced component development and prototypes (6.4)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RD"
                    },
                    "ProjectTitle": {
                        "val": "Detection Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "15.083"
                        },
                        "PriorYear": {
                            "val": "14.570"
                        },
                        "CurrentYear": {
                            "val": "14.769"
                        },
                        "BudgetYearOne": {
                            "val": "16.860"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.860"
                        },
                        "BudgetYearTwo": {
                            "val": "18.287"
                        },
                        "BudgetYearThree": {
                            "val": "17.520"
                        },
                        "BudgetYearFour": {
                            "val": "17.875"
                        },
                        "BudgetYearFive": {
                            "val": "18.249"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Detection Technologies mission is to conduct Research, Development, Test, & Evaluation to (1) identify, develop, and exploit signatures associated with nuclear threats to advance U.S.  capabilities to detect and interdict such threats; and (2) locate, identify, and track special nuclear material and improve detection factors such as range, time, sensitivity, and accuracy to enhance Service and Special Mission Unit capabilities.  These efforts support Department of Defense (DoD) requirements for countering terrorism, counter\/nonproliferation, countering rogue states, and homeland defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RD:  Detection Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RD develops direct and indirect technologies for the detection of radiation and non-radiative signatures associated with nuclear threats, and advances warfighter capabilities to rapidly locate, characterize, and counter such threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.570"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop technologies to identify and catalogue nuclear threat signatures and characteristics and to formulate corresponding detection modalities and collection systems.\n- Continue to develop algorithms and tools for rapid analysis of all-source intelligence to identify nuclear threats.\n- Continue to develop initial technologies and subsystems to remotely monitor small and wide areas that may produce or contain nuclear threats.\n- Continue to develop algorithms and tools to synthesize the collection and analysis of multiple nuclear threat signatures in order to improve assessment confidence and cuing of potential nuclear threat events.\n- Continue to test and evaluate developmental radiation detection systems to identify the best performing technologies and techniques for transition to advanced technology development efforts. \n- Develop technologies for next generation nuclear imaging devices with neutron and dual gamma and neutron imaging capability, enabling warfighters to rapidly pinpoint and identify detected radioisotopes.\n- Develop technologies enabling interoperable architectures for enhanced, real-time mission analysis and common operational pictures within a shared or distributed area of operations.\n- Develop techniques and technologies for alternative signature detection, processing, and exploitation methods to detect and locate nuclear threats. \n- Develop novel detection materials and advanced Helium-3 replacement technologies into prototype radiation detection systems to increase range, sensitivity, and accuracy of detection and enable warfighters to more rapidly locate targeted material.\n- Develop, integrate, and demonstrate prototype radiation detection algorithms to enhance the range of detectability of targeted material."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.769"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop radiation and nuclear threat detection systems to identify the best performing technologies and techniques for transition to advanced technology development efforts.\n- Continue to develop technologies for next generation nuclear imaging devices with dual gamma and neutron imaging capability, enabling warfighters to rapidly pinpoint and identify detected radioisotopes.\n- Continue to develop technologies to enable interoperable architectures for enhanced, real-time mission analysis and user-defined operational pictures within a shared or distributed area of operations.\n- Continue to develop and integrate novel detection materials and advanced helium-3 replacement technologies into prototype radiation detection systems to increase range, sensitivity, and accuracy of detection and enable warfighters to rapidly locate targeted material.\n- Continue to develop, integrate, and demonstrate prototype radiation and nuclear threat detection algorithms, electronics and communications capabilities to enhance the range of detectability of targeted material.\n- Initiate investigation of computer learning and computer vision technologies to enhance nuclear threat situational awareness and nuclear threat identification.\n- Initiate investigation of various sensor capabilities for far-field identification and tracking of nuclear threats.\n- Identify exploitable observables to inform technology development and investigate emerging technologies that indicate the presence of nuclear threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.860"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.860"
                                            },
                                            "Text": {
                                                "val": "- Develop a contamination avoidance capability.\n- Develop wearable neutron detectors made of Boron-Coated Straw in support of the development of modern, novel detector solutions to revolutionize CONOPs.\n- Develop detailed studies to systematically identify new nuclear threat signatures, breaking down the problem geographically to distinguish between allies and foes, and to determine assets and coverage.\n- Transition those technologies that demonstrate exceptional capabilities in radiation and nuclear threat detection to advanced technology development.\n- Develop tools for pre-detonation diagnostics, leveraging high spatial resolution nuclear imagers, multiplicity algorithms, trace analysis tools, and high-fidelity test objects to increase capability to characterize threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2018 to FY 2019 is due to additional investment in radiation detection and nuclear threats detection, intelligence, surveillance, and reconnaissance to support technology development efforts for greater effectiveness of general purpose forces in a nuclear environment."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.608"
                                        },
                                        "CurrentYear": {
                                            "val": "17.556"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.021"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "26.021"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "27.110"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.170"
                                        },
                                        "BudgetYearFour": {
                                            "val": "28.867"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.472"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across the Department of Defense and other government agency laboratories, academia, industry and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of CWMD technologies selected for transition to advanced technology development (6.3) and advanced component development and prototypes (6.4)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RE"
                    },
                    "ProjectTitle": {
                        "val": "Counter-Terrorism Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.472"
                        },
                        "PriorYear": {
                            "val": "0.099"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Counter-Terrorism Technologies project is an over-arching project that develops and transitions a full spectrum of new technologies to counter emergent Weapons of Mass Destruction (WMD) thus enabling warfighters to improve their ability to detect, disable, interdict, neutralize, and destroy chemical, biological, nuclear production, storage, and weaponization facilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RE:  Counter-Terrorism Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RE provides research and development (R&D) support to Joint U.S. Military Forces, specifically U.S. Special Operations Command (USSOCOM), in the areas of Explosive Ordnance Disposal Device Defeat; Counter WMD technologies for warfighters; the USSOCOM Countering WMD – Terrorism Support program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.099"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "98.532"
                                        },
                                        "CurrentYear": {
                                            "val": "103.869"
                                        },
                                        "BudgetYearOne": {
                                            "val": "108.978"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "108.978"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "111.060"
                                        },
                                        "BudgetYearThree": {
                                            "val": "113.426"
                                        },
                                        "BudgetYearFour": {
                                            "val": "115.596"
                                        },
                                        "BudgetYearFive": {
                                            "val": "118.024"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Number of technologies developed and delivered, and\/or proof of concept, or successful Military Utility Assessments conducted that increase the potential mission success and reduce the number of current gaps in Special Operations Forces capabilities to counter weapons of mass destruction."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RF"
                    },
                    "ProjectTitle": {
                        "val": "Forensics Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "207.133"
                        },
                        "PriorYear": {
                            "val": "9.176"
                        },
                        "CurrentYear": {
                            "val": "10.274"
                        },
                        "BudgetYearOne": {
                            "val": "10.257"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.257"
                        },
                        "BudgetYearTwo": {
                            "val": "10.466"
                        },
                        "BudgetYearThree": {
                            "val": "10.675"
                        },
                        "BudgetYearFour": {
                            "val": "10.894"
                        },
                        "BudgetYearFive": {
                            "val": "11.123"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Forensics Technologies project develops post-detonation nuclear forensics technologies providing accurate, rapid, and reliable means to collect, analyze, and evaluate prompt data and debris from a nuclear or radiological event in support of exploitation and attribution efforts.  These forensics technologies also enable the Defense Threat Reduction Agency (DTRA) and its trusted partners to detect, locate, identify, track, and interdict nuclear and radiological threats, including weapons and material and enablers to their acquisition and development.  In accordance with Department of Defense Directive S-2060.04, DTRA serves as the U.S. Government lead for post-detonation National Technical Nuclear Forensics (NTNF) research and development (R&D).  As the central NTNF R&D coordinator, DTRA works in consultation with interagency partners to develop and improve ground-based capabilities supporting exploitation and attribution missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF:  Forensics Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RF develops post-detonation nuclear forensics technologies providing accurate, rapid and reliable means to collect, analyze, and evaluate prompt data and debris from a nuclear or radiological event in support of exploitation and attribution efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.176"
                                            },
                                            "Text": {
                                                "val": "- Develop, test, and evaluate new and improved technologies for prompt diagnostics, debris collection, data analysis, debris diagnostics, and technical capability modeling to support nuclear device reconstruction, as well as to decrease timeline, lower uncertainty, and increase confidence in technical nuclear forensics conclusions supporting attribution.\n- Develop, test, and evaluate new and improved technologies and processes for National Technical Nuclear Forensics validation and verification in order to decrease timeline, lower uncertainty, and increase confidence in technical nuclear forensics conclusions supporting attribution.\n- Investigate and develop novel concepts enabling radical reductions in the time required to reach target areas, to collect fallout debris and conduct analyses in the field, and to obtain significant forensic results and attribution conclusions.\n- Investigate and develop techniques and algorithms to analyze, combine, and integrate speed-of-light (SoL) and speed-of-sound (SoS) phenomena in an urban environment to increase the effectiveness of nuclear detonation yield determinations.\n- Evaluate and expand current understanding of propagation and transport of prompt diagnostics phenomenologies (SoL, SoS) in an urban environment to support the planned deployment of ground-based sensor capabilities (U.S. Prompt Diagnostics System).\n- Conduct interagency and international research evaluation events to assess process improvements and identify potential capability gaps in forensic conclusion confidence, timeliness, and accuracy.\n- Engage with partner nations under appropriate international agreements to improve the understanding of prompt phenomenology, improve modeling tools, and improve sensor technologies. \n- Expand international collaboration in the area of experiments and modeling in order to improve device reconstruction tools and analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.274"
                                            },
                                            "Text": {
                                                "val": "- Develop and evaluate new and improved prompt diagnostics, debris collection, analysis and diagnostics, and device modeling concepts and methodologies to support nuclear device reconstruction and decrease timelines for, lower uncertainty of, and increase confidence in technical nuclear forensics conclusions supporting attribution.\n- Engage with partner nations under appropriate international agreements to improve understanding of prompt phenomenology, modeling tools, and sensor technologies.\n- Develop and improve techniques and algorithms to analyze, combine, and integrate speed-of-light and speed-of-sound phenomena in an urban environment to increase the effectiveness and accuracy of nuclear detonation yield determinations and weapon characterizations.\n- Investigate and evaluate innovative ground-based prompt diagnostic sensor concepts and technologies, such as ubiquitous networks and sensors with reduced size, weight, and power consumption, to improve sensor portability and expand operational capability and flexibility.\n- Expand international collaboration in the areas of experiments and weapons modeling to improve device reconstruction tools and analysis.\n- Develop and evaluate new and improved validation and verification technologies and methodologies, such as surrogate debris and representative isotopes, to support post-detonation National Technical Nuclear Forensics laboratory analysis and decrease timelines, lower uncertainties, and increase confidence in technical nuclear forensics conclusions supporting attribution.\n- Investigate and develop novel concepts enabling radical reductions in the time required to conduct ground fallout debris collections, conduct analyses in the field, and obtain nuclear forensic results."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.257"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.257"
                                            },
                                            "Text": {
                                                "val": "- Reduce the fixed lab process timeline by 50%, increasing confidence and decreasing technical uncertainties in the materials forensics results.  This will be accomplished through expanded interpretability of test results, improvement in quality of ground samples, including complex debris from transient environments, and optimization of current debris analysis constructs.\n- Evaluate and extract relevant data from historic nuclear tests to help calibrate codes to support device characterization improvements.\n- Expand signature databases with appropriate information on generic designs, known weapon designs, and known effects.\n- Increase capability development efforts in ubiquitous networks and airborne platforms to support prompt diagnostics and forensics technology improvements.\n- Conduct\/lead a DoD and interagency end-to-end nuclear forensics process technology demonstration and evaluation of DTRA-developed technologies\/methodologies to assess NTNF process improvements.\n- Identify potential development of a new advanced capability in forensic conclusion confidence, timeliness, and accuracy, and assist in assessing contribution to interagency attribution process and decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "36.738"
                                        },
                                        "CurrentYear": {
                                            "val": "40.286"
                                        },
                                        "BudgetYearOne": {
                                            "val": "33.578"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "33.578"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "32.973"
                                        },
                                        "BudgetYearThree": {
                                            "val": "33.668"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.371"
                                        },
                                        "BudgetYearFive": {
                                            "val": "35.094"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "122\/0605000BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Systems Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.479"
                                        },
                                        "CurrentYear": {
                                            "val": "6.241"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.163"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.163"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.821"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.340"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.602"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.720"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of Counter WMD technologies selected for transition to advanced technology development (6.3) and advanced component development and prototypes (6.4)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RG"
                    },
                    "ProjectTitle": {
                        "val": "Defeat Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "86.028"
                        },
                        "PriorYear": {
                            "val": "10.428"
                        },
                        "CurrentYear": {
                            "val": "11.060"
                        },
                        "BudgetYearOne": {
                            "val": "12.959"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.959"
                        },
                        "BudgetYearTwo": {
                            "val": "13.262"
                        },
                        "BudgetYearThree": {
                            "val": "13.222"
                        },
                        "BudgetYearFour": {
                            "val": "13.436"
                        },
                        "BudgetYearFive": {
                            "val": "13.634"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defeat Technologies project develops innovative kinetic and non-kinetic weapon technologies to expand traditional and asymmetric options available to Combatant Commanders to deny, disrupt, and defeat adversarial use of Weapons of Mass Destruction (WMD) while minimizing collateral effects.  Technology development focuses on the physical or functional defeat of WMD threat materials, an adversary's ability to deliver the same, and the physical and nonphysical support networks enabling both.  It does so through the systematic identification and maturation of technologies capable of defeating WMD agents or agent-based processes and selecting technologies for integration into weapons, delivery systems, or rapid WMD elimination capabilities.  This effort includes developing specific WMD agent\/agent-based process simulants, sub-scale test infrastructure, and sampling capability required for effective development, testing, and evaluation of next-generation Countering WMD (CWMD) capabilities.  The project places a high priority on understanding, characterizing, and validating potential weapon effects within mathematical confidence as it relates to the unintended release of hazardous threat materials.  Technologies with the potential for weapon and capability integration are transitioned to the advanced technology development effort under this project.  On a limited basis, technology test data is shared with coalition partners.\n\nDTRA’s Counter - Improvised Explosive Device \/ Counter- small Unmanned Aerial Systems (C-IED\/C-sUAS) mission includes three primary lines of effort - attack the supporting threat network, protecting US forces, and building partner capacity.  Since DTRA already provides this support in helping the Department counter IEDs for the US joint force, it follows that DTRA is the most-appropriate Department asset to undertake this C-sUAS coordination mission - to provide counter threat network support to deployed forces, C-IED\/C-sUAS technology solutions, C-IED\/C-sUAS training support (deploying and deployed US joint forces), and building partner nation capacity all while coordinating the overall Department's (C-IED\/C-sUAS) efforts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RG: Defeat Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RG develops innovative kinetic and non-kinetic weapon technologies to expand traditional and asymmetric options available to Combatant Commanders to deny, disrupt, and defeat adversarial use of WMD while minimizing collateral effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.428"
                                            },
                                            "Text": {
                                                "val": "- Continue classified component\/system design and development.\n- Continue static demonstrations of access denial and denial-of-use technologies against representative WMD threats.\n- Conduct sub-scale tests of new standoff weapon payloads to defeat chemical and biological warfare targets.\n- Continue sub-scale tests to assess capability to accurately measure WMD simulant released in a plume.\n- Continue to develop electromagnetic source to functionally defeat WMD threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.060"
                                            },
                                            "Text": {
                                                "val": "- Continue static demonstrations of access denial and denial-of-use technologies against representative WMD threats.\n- Conduct scaled demonstrations of access denial and denial-of-use technologies against representative WMD threats.\n- Continue sub-scale tests of new standoff weapon payloads to defeat chemical and biological warfare targets.\n- Continue sub-scale tests of emergent technologies to accurately measure WMD simulant released in a plume."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.959"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.959"
                                            },
                                            "Text": {
                                                "val": "- Conduct an incremental capability demonstration for an autonomous systems technology update to the Modular Autonomous Counter-WMD System B (MACS-B).\n- Develop future MACS advanced holistic payloads, refining the concept and conducting technology investigation.\n- Develop Combined Effects Payload for Access Denial (CEPAD) payload.\n- Collect signatures on threat-improvised rotary winged and fixed winged IED\/sUAS in a lab and field environment.\n- Provide infrastructure to collect signatures including sensors, lab, and field equipment, collection software and collection tools.\n- Provide a consolidated C-IED\/C-sUAS library including database(s), database access, and database\/library management including entry, creation and vetting of information.\nAnalyze C-IED\/C-sUAS equipment data, and create\/sustain algorithms, databases and tables to monitor the creation and vetting of information.\n- Monitor exploitation of rotary winged, fixed winged IED\/C-sUAS to manage the capability gap (from a technology and database standpoint)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2018 to FY 2019 is due to the net effect of the realignment of funds to support experimental activities in Project RM in program element 0603160BR and increased investment to counter IED\/C-sUAS."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.819"
                                        },
                                        "CurrentYear": {
                                            "val": "22.161"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.277"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "49.277"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.491"
                                        },
                                        "BudgetYearThree": {
                                            "val": "24.108"
                                        },
                                        "BudgetYearFour": {
                                            "val": "24.578"
                                        },
                                        "BudgetYearFive": {
                                            "val": "25.010"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of CWMD technologies selected for transition to advanced technology development (6.3) and advanced component development and prototypes (6.4)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RI"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Survivability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "129.182"
                        },
                        "PriorYear": {
                            "val": "30.085"
                        },
                        "CurrentYear": {
                            "val": "34.103"
                        },
                        "BudgetYearOne": {
                            "val": "32.732"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.732"
                        },
                        "BudgetYearTwo": {
                            "val": "33.723"
                        },
                        "BudgetYearThree": {
                            "val": "34.479"
                        },
                        "BudgetYearFour": {
                            "val": "32.915"
                        },
                        "BudgetYearFive": {
                            "val": "33.841"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear Survivability project develops innovative technologies for the protection of mission-essential personnel, critical military and national defense capabilities, and associated control and support systems during a nuclear event.  Research under this project supports the mission critical systems identified under Department of Defense Instruction 3150.09, Chemical, Biological, Radiological, and Nuclear Survivability Policy.  The Defense Threat Reduction Agency is designated by the Department of Defense (DoD) as the center of excellence for electromagnetic pulse (EMP) survivability assessments.  The System Vulnerability and Assessment effort develops nuclear assessment capabilities to support operational planning, weapons effects predictions, and strategic system design.  This activity also provides the DoD’s nuclear design and protection standards for new and existing systems, e.g., command and control facilities and aircraft.  Key systems include the Nuclear Command and Control System, the net-centric thin-line, and both military and civilian satellites and associated support systems.  The radiation hardened nano-electronics effort develops and demonstrates radiation-hardened, high-performance prototype nano-electronics to meet DoD strategic deterrence system requirements.  Experimental Capabilities activities provide the warfighter with unique x-ray, gamma ray, and EMP test capabilities in support of system survivability development, certification, and sustainment.  This effort leverages research from and coordinates with the National Nuclear Security Administration (United States) and the Atomic Weapons Establishment (United Kingdom) to develop enabling technologies for improved nuclear weapon effects experimentation capabilities.  Nuclear technology analysis efforts support detailed planning related to policy, strategy, objectives, and programmatic integration.  These efforts also support international collaboration, user groups, case study reviews, and the Joint Atomic Information Exchange Group.  The human survivability effort conducts research to develop and validate mortality and morbidity models associated with radiological and nuclear weapon effects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RI: Nuclear Survivability"
                                    },
                                    "Description": {
                                        "val": "Project RI provides the capability for DoD nuclear forces and their associated control and support systems and facilities to avoid, repel, endure, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.085"
                                            },
                                            "Text": {
                                                "val": "- Complete manufacture of maskless e-beam lithography tool prototype in a trusted foundry.\n- Develop and integrate the latest human radiation exposure models into current predictive modeling software.\n- Develop model to evaluate synergistic effects of nuclear weapon combined injuries.  \n- Develop advanced warm x-ray source concepts.\n- Develop well-characterized x-ray test environments at the NIF.\n- Continue to develop a RadHard-by-Design microprocessor with less than 22nm commercial technology.\n- Evaluate High Altitude Electromagnetic Pulse (HEMP) threat survivability for Aegis Ashore-Poland and satellite communication ground facilities.\n- Investigate electromagnetic pulse effects on power grid transformers, as part of a collaborative research effort with the United Kingdom on critical civilian and defense infrastructure.\n- Provide nuclear scintillation expertise to DoD and Service Program Executive Offices (PEOs) to assist in certification of disturbed channel simulators and new survivable satellite communication systems.\n- Publish a Surface\/Near-Surface Nuclear Weapon Environment Military Standard to assist DoD and Service PEOs.\n- Publish update to MIL-STD-188-125-1, HEMP Protection for Ground-Based C4I Facilities Performing Critical, Time-Urgent Missions: Part 1 Fixed Facilities.\n- Publish Nuclear Disturbed Communications Environment Annex to the Consolidated Afloat Networks and Enterprise Services Military Standard to assist DoD and Service PEOs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.103"
                                            },
                                            "Text": {
                                                "val": "- Develop nuclear countermeasure and neutron biological effectiveness modeling in DTRA's existing Health Effects from Radiological & Nuclear Environments (HENRE) R&D computer code and, upon validation and verification, update United States Strategic Command (USSTRATCOM) and DTRA operational codes; this modeling will assist DoD and other federal agencies in selecting and supporting specific nuclear countermeasures.\n- Complete development of and implement a methodology for comprehensive analysis of the DoD Chemical, Biological, Radiological, and Nuclear Mission-Critical Reports for nuclear survivability and hardening of Mission-Critical Systems\/Equipment per DoDI 3150.09.          \n- Continue to evaluate High Altitude Electromagnetic Pulse (HEMP) threat survivability for Aegis Ashore-Poland and satellite communication ground facilities.\n- Continue to investigate electromagnetic pulse effects on power grid transformers, as part of a collaborative research effort with the United Kingdom on critical civilian and defense infrastructure.\n- Continue to provide nuclear scintillation expertise to DoD and Service Program Executive Offices (PEOs) to assist in certification of disturbed channel simulators and new survivable satellite communication systems.\n- Publish update to MIL-STD-188-125-1, HEMP Protection for Ground-Based Command, Control, Communications, Computers, and Intelligence (C4I) Facilities Performing Critical, Time-Urgent Missions:  Part 1 Fixed Facilities and update to MIL-HDBK-423 HEMP Protection for Ground-based, Mission-Critical Facilities Part 1 Fixed Facilities, Part I.\n- Publish Nuclear Disturbed Communications Environment Annex to the Consolidated Afloat Networks and Enterprise Services Military Standard to assist DoD and Service PEOs.\n- Complete HEMP Certification recommendation to USSTRATCOM for the Missile Defense Complex, Ft. Greely, AK.\n- Apply advanced electron beam diagnostics to characterize the PITHON test capability at the DTRA West Coast Facility for strategic reentry systems survivability.\n- Continue to develop or initiate development of and demonstrate an advanced warm x-ray spectrometer to reduce uncertainties and design margins for code validation and electronics certification.\n- Demonstrate an advanced Single Wire Radiator array warm x-ray source on Double-EAGLE at the DTRA West Coast Facility for strategic reentry systems survivability.\n- Demonstrate multi-point x-ray sources at the National Ignition Facility to improve cold x-ray test capabilities for strategic and missile defense systems.\n- Demonstrate a large-area direct laser impulse test capability at the National Ignition Facility for strategic system survivability certification.\n- Complete study of satellite solar power array response phenomenologies in pulsed x-ray environments.\n- Support Missile Defense Agency cold x-ray survivability experiments at the National Ignition Facility.\n- Continue to develop the 16\/14nm Radiation Hardened by Design (RHBD) Library.\n- Continue development of Complementary e-Beam Lithography (CeBL) technologies to reduce the cost of low volume DoD radiation hardened micro and nano-electronics.\n- Develop RHBD neutron Single Event Effects mitigation techniques for strategic radiation hardened digital complementary metal–oxide–semiconductor and Analog Mixed Signal Devices.\n- Complete development of the Satellite System Natural and Nuclear Environment Protection Standard.\n- Complete exploration of technology-agnostic radiation hardening for Boolean logic and multipliers using the principles of information theory and transition results to the 14nm RHBD program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.732"
                                            },
                                            "Text": {
                                                "val": "- Align nuclear detonation personnel casualty output from DTRA’s Health Effects from Radiological & Nuclear Environments (HENRE) for Hazard Prediction and Assessment Capability (HPAC) to the Defense Health Agency’s Joint Medical Planning Tool.\n- Advance cold\/warm x-ray and laser experimentation in order to improve nuclear survivability.  For cold x-ray impulse, initiate ion beam and diagnostics development on PITHON, leading to high fluence x-rays for materials and full system impulse capability for Re-entry Vehicles\/Re-entry Bodies to improve radiation survivability.  Complete debris mitigation system for Double-EAGLE in support of cold x-rays for optics and thermostructural response efforts that support Missile Defense Agency (MDA) and satellite systems requirements\n- Translate radiation hardening basic mechanisms and physics of failure into engineering solutions to improve device and component hardening and survivability.\n- Update environment and protection standards on periodic five year intervals and respond to Service and Combatant Command requests for verification assessments, to include conduct of U.S. European Command\/ U.S. Pacific Command Operational Plan and mission critical systems analytical assessments.\n- Continue development of RHBD neutron Single Event Effects mitigation techniques for strategic radiation hardened digital complementary metal-oxide-semiconductor and Analog Mixed Signal Devices.\n- Develop HEMP, atmospheric, and disturbed environment standards; conduct verification assessments for the Services and MDA; develop technology insertions; and provide subject-matter expert support to provide combat readiness and survivability status to leadership and feedback for Military Standards validity."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2018 to FY 2019 is due to reduced investment in radiation hardened Nano-electronics."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.964"
                                        },
                                        "CurrentYear": {
                                            "val": "6.658"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.783"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.783"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.946"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.025"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.156"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.285"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across the DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of CWMD technologies selected for transition to advanced technology development (6.3) and advanced component development and prototypes (6.4)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "158.822"
                        },
                        "PriorYear": {
                            "val": "26.419"
                        },
                        "CurrentYear": {
                            "val": "29.228"
                        },
                        "BudgetYearOne": {
                            "val": "29.388"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.388"
                        },
                        "BudgetYearTwo": {
                            "val": "30.054"
                        },
                        "BudgetYearThree": {
                            "val": "30.723"
                        },
                        "BudgetYearFour": {
                            "val": "31.413"
                        },
                        "BudgetYearFive": {
                            "val": "32.072"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear and Radiological Effects project develops modeling tools to: support military operational planning, weapons effects predictions, and strategic system design decisions; consolidate validated modeling tools into the Joint Information Environment for integrated functionality; predict system responses to nuclear and radiological weapons producing electromagnetic, thermal, blast, shock, and radiation environments; provide detailed adversary nuclear infrastructure characterization to enhance counterforce operations and hazard effects; and, develop foreign nuclear weapon outputs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear & Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL develops nuclear and radiological assessment modeling tools to support military operational planning, weapons effects predictions, and strategic system design decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.419"
                                            },
                                            "Text": {
                                                "val": "- Deliver initial nuclear induced fire initiation and spread modeling capability.\n- Develop nuclear weapons effects tools and analyses for effective targeting, including methods to evaluate the consequences of execution of a given course of action.\n- Develop enhanced High Altitude Radiation Phenomenology functionality for use on modern computer systems.\n- Develop initial weapon output spectrum extension required by missile defense systems to ensure critical systems can accomplish their designated missions when exposed to a nuclear weapons environment.\n- Develop a consistent, state-of-the-art combined effects methodology to ensure critical systems can accomplish their designated missions when exposed to a nuclear weapons environment.\n- Continue to develop an authoritative source of foreign and historical nuclear weapon outputs to aid in the development of uniform nuclear survivability standards, hardening technologies, and the experimental test capabilities.\n- Maintain a virtual interagency and international coalition combining capabilities of existing government and industry organizations into cohesive \"networks\" of people, knowledge, and infrastructure to synchronize research and development across the nuclear weapon effects community of interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.228"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop nuclear weapons effects tools and analyses for effective targeting, including methods to evaluate the consequences of execution of a given course of action.\n- Continue to develop enhanced High Altitude Radiation Phenomenology functionality for use on modern computer systems.\n- Continue to develop initial weapon output spectrum extension required by missile defense systems to ensure critical systems can accomplish their designated missions when exposed to a nuclear weapons environment.\n- Continue to develop combined effects methodologies to ensure critical systems can accomplish their designated missions when exposed to a nuclear weapons environment.\n- Continue to develop an authoritative source of foreign and historical nuclear weapon outputs to aid in the development of uniform nuclear survivability standards, hardening technologies, and experimental test capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.388"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.388"
                                            },
                                            "Text": {
                                                "val": "- Develop system-generated electromagnetic pulse follow-on efforts and electromagnetic pulse coupling and response efforts to deliver high-fidelity early-time electromagnetic analysis and operational tools for US and Allied nuclear weapon effects stakeholders.\n- Publish updates to Weapons Output eBooks, delivering high-fidelity nuclear source terms and historical test data for use in, and validation of, modern weapon effects codes.  \n- Develop petroleum effects models for Consequences of Execution, linking higher order impacts to Political Military Economic Social Infrastructure Information (PMESII) analyses."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603000BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.390"
                                        },
                                        "CurrentYear": {
                                            "val": "3.500"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.427"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.427"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.426"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.424"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.424"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.497"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "*Prior year funds related to this this project in program element number 0605000BR."
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of Counter WMD technologies selected for transition to advanced technology development (6.3) and advanced component development and prototypes (6.4).\n "
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RM"
                    },
                    "ProjectTitle": {
                        "val": "WMD Counterforce Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "92.653"
                        },
                        "PriorYear": {
                            "val": "11.702"
                        },
                        "CurrentYear": {
                            "val": "14.552"
                        },
                        "BudgetYearOne": {
                            "val": "12.780"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.780"
                        },
                        "BudgetYearTwo": {
                            "val": "12.991"
                        },
                        "BudgetYearThree": {
                            "val": "13.736"
                        },
                        "BudgetYearFour": {
                            "val": "13.483"
                        },
                        "BudgetYearFive": {
                            "val": "14.081"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The WMD Counterforce Technologies Project develops Countering Weapons of Mass Destruction (CWMD) weapon effects modeling algorithms, full and sub-scale test series required to investigate CWMD weapon effects and sensor performance, and visualization and situational awareness tools to support the next generation Defense Threat Reduction Agency (DTRA) Technical Reachback cell.  These activities are critical enablers for the development of advanced CWMD planning tools and include Advanced Energetics and Advanced Life Sciences.  Advanced Energetics develops energetic materials and weapon design technology providing advanced defeat capabilities for engaging hard and deeply buried targets that are well beyond current high explosive blast\/fragmentation warhead technology.  Advanced Life Sciences research develops technologies to find, locate, mitigate, and defeat WMD using bio-organisms or components."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RM: WMD Counterforce Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RM provides novel and enhanced weapons energetic materials and structures, full-scale testing of counter WMD weapon effects, weapon effects modeling, weapon delivery optimization, and technical reachback services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.702"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate upgraded Hybrid Enhanced Blast Explosives for improved agent defeat capability. \n- Complete medium-scale testing of a new combined effects weapon case that provides enhanced blast and reactive fragments. \n- Complete scaled testing of two new explosive formulations tailored (temperature, pressure, and outgases) for WMD defeat operations.\n- Complete calculations and tests to develop agent defeat weapon effects models, to include phenomena and events such as dynamic pressure\/fragment, agent release, thermal effects and defeat, particle shattering, agent dispersion, combustion modeling, and agent fate.\n- Complete calculations and tests to develop hardened structure weapon effects models, to include phenomena and events such as dynamic pressure, blast propagation through failing walls, blast and fragmentation on structural elements, multi-hit penetration in high-strength concrete, bunker collapse, blast and debris environment from embedded detonation, and penetration mechanics in ultra-high performance concrete.\n- Complete high performance computing (HPC) requirements collection, HPC modernization program frontier proposal submission, and HPC resource allocation for improved WMD defeat modeling."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.552"
                                            },
                                            "Text": {
                                                "val": "- Continue to demonstrate upgraded small scale Hybrid Enhanced Blast Explosives for improved agent defeat capability.\n- Deliver agent defeat weapon effects models to include post blast agent release and dispersion from multiple agent release mechanisms, agent mass transport, break-up and phase change, and agent fate for modeling and simulation (M&S) planning tool enhancements.\n- Complete tests to deliver data for updating chemical agent source term models within the Integrated Munitions Effects Assessment (IMEA) and for calibration and validation of Second-order Closure Integrated Puff (SCIPUFF).\n- Complete calculations and mid \/ large-scale tests, and deliver weapons effects models to include blast and debris environment from embedded detonation, blast dynamic pressure, fragmentation, and blast through blast doors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.780"
                                            },
                                            "Text": {
                                                "val": "- Transition Hellfire-sized structural reactive material warhead technology and design to the Military services to improve capabilities to hold targets at risk.\n- Advance technical capabilities or methods to detect, locate\/track, identify, characterize, monitor, assess, plan and protect against, deter, delay, disrupt, neutralize, or destroy WMD through special innovative research targeted at meeting capability gaps in CWMD.\n- Test biocide at larger scale to analyze prompt and persistent effects, improving capability to neutralize or destroy biological weapons or agents.\n- Develop CWMD weapon effects modeling algorithms and scaled test series leveraging machine learning and optimization for attack planning to investigate CWMD weapon effects, and enhance WMD defeat Modeling and Simulation planning tools."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2018 to FY 2019 is due to the realignment of the High Performance Computing (HPC) activity from Project RM to Project RA."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.041"
                                        },
                                        "CurrentYear": {
                                            "val": "24.663"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.243"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.243"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.905"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.911"
                                        },
                                        "BudgetYearFour": {
                                            "val": "27.520"
                                        },
                                        "BudgetYearFive": {
                                            "val": "28.097"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of CWMD technologies selected for transition to advanced technology development (6.3) and advanced component development and prototypes (6.4)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RR"
                    },
                    "ProjectTitle": {
                        "val": "Countering WMD Test and Evaluation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "73.113"
                        },
                        "PriorYear": {
                            "val": "13.501"
                        },
                        "CurrentYear": {
                            "val": "13.652"
                        },
                        "BudgetYearOne": {
                            "val": "14.345"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.345"
                        },
                        "BudgetYearTwo": {
                            "val": "14.816"
                        },
                        "BudgetYearThree": {
                            "val": "15.156"
                        },
                        "BudgetYearFour": {
                            "val": "15.451"
                        },
                        "BudgetYearFive": {
                            "val": "15.775"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "**Project RR title changed from Combating WMD Test and Evaluation to Countering WMD Test and Evaluation beginning in FY 2017."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Countering WMD Test and Evaluation project provides a unique national test capability for simulated Weapons of Mass Destruction (WMD) facilities and processes.  This capability provides structured and systematic end-to-end test event planning, preparation, management, execution, and data analysis.  It also offers test instrumentation (data acquisition systems and optics), scientific analysis and predictions, test article construction, test article\/test bed remediation, tunnel mining, architectural and engineering design, systems engineering and integration, and test data management.  The facility leverages 50 years of expertise in investigating weapons effects and target response across the spectrum of hostile environments that could be created by proliferent nations or terrorist organizations with access to advanced conventional weapons or WMD.  Subject matter experts design full and sub-scale testing strategies focusing on weapon-target interaction with fixed soft and hardened facilities to include above ground facilities, cut-and-cover facilities, and deep underground tunnels.  This capability does not exist anywhere else within the Department of Defense (DoD) and supports the counterproliferation pillar of the National Strategy to Counter WMD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RR:  Countering WMD Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Project RR provides a unique national test bed capability for the study of weapon-target interaction, simulated\nWMD facility characterization, and WMD facility defeat testing to evaluate the implications of WMD and other special weapon use against U.S. military and civilian assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.501"
                                            },
                                            "Text": {
                                                "val": "- Develop and test CBRNE sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking of WMD targets.\n- Continue to develop technical and testing capabilities in support of the Transatlantic Collaborative Biological Resiliency Demonstration, a DoD effort to shape interagency approaches to counter a wide area biological event.\n- Continue testing at the Nevada National Security Site in support of the nonproliferation portion of the National Center for Nuclear Security portfolio.\n- Continue WMD sensor testing at the Technical Evaluation Assessment and Monitoring site to develop capabilities for detection of nuclear grade material.\n- Conduct Special Project CWMD testing and demonstrations at the Nevada National Security Site to defeat credible and threat-based scenarios with transition into several related projects\/planned events.\n- Continue environmental remediation and compliance activities at New Mexico and Nevada test sites to meet federal and state environmental guidelines. Remediate major test articles within acceptable standards.\n- Conduct collection campaigns with interagency participation specific to warfighter CWMD data requirements.\n- Design diagnostics and instrumentation in support of the Department of Energy and National Laboratories Treaty Verification Technology program and Source Physics Experiment to support Comprehensive Test Ban Treaty initiatives.\n- Provide required test planning, design, execution, and reporting to ensure the successful execution of the DTRA Agent Defeat Warfighter Capability Strategic Initiative.\n- Reconstitute and sustain the current inventory of research, development, test and evaluation infrastructure and instrumentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.652"
                                            },
                                            "Text": {
                                                "val": "- Continue to support Combatant Commands with development and testing of Chemical, Biological, Radiological, Nuclear, and High-Explosive (CBRNE) sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking of WMD targets.\n- Support Combatant Command exercises and planning events in order to develop existing Counter WMD (CWMD) technologies, tools, and capabilities.\n- Continue pursuit of state-of-the-art chemical and biological testing capabilities with participation in the Integrated Early Warning program, the inter-agency Layered Sensing Initiative, the Integrated Sensor Architecture, and the Army Technical Support and Operational Analysis (TSOA) in order to satisfy emerging warfighting gaps.\n- Extend testing in support of the nonproliferation portion of the National Center for Nuclear Security portfolio.\n- Continue to develop nuclear material detection capabilities through testing of candidate technologies at the Technical Evaluation Assessment and Monitoring Site.  \n- Continue to test and demonstrate credible and threat-based WMD attack scenarios at the Nevada National Security Site for Defense Threat Reduction Agency (DTRA) and partner agency projects supporting development of warfighter-identified missile defeat capability requirements.\n- Continue to conduct diagnostics, instrumentation, and explosives handling research in support of Department of Energy and National Laboratories Source Physics Experiments, supporting Treaty Verification Technology and Comprehensive Test Ban Treaty initiatives.\n- Initiate reconstitution of instrumentation and diagnostics sensors infrastructure capabilities in support of Counter-WMD technology development projects.\n- Continue planning the design and execution of tests characterizing a chemical\/biological plume generated by an explosive event in support of the DTRA Agent Defeat Modeling and Simulation Baseline (ADMB) initiative.\n- Continue to design and build testbeds in small-, mid-, and large-scale environments capable of capturing data needed to improve and validate high-fidelity modeling and simulation tools used to predict weapons effects on WMD storage facilities.\n- Initiate decoupling test program using conventional explosives to develop modern seismic-acoustic data sets at varying levels of coupling, for the purpose of deriving signatures that are similar to recent nuclear test detonations for treaty verification purposes.\n- Reconstitute the Photogrammetry Laboratory equipment inventory (static and dynamic) for pre- and post-test characterization of geology deriving seismic-acoustic signatures, and providing imagery for warfighter planning and targeting analyses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.345"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.345"
                                            },
                                            "Text": {
                                                "val": "- Develop the use of seismo-acoustic arrays as test diagnostics (both hardware and algorithms) and tools for assessing decoupling\/coupling.\n- Continue reconstitution of instrumentation and diagnostics sensors infrastructure capabilities in support of Counter-WMD technology development projects.\n- Continue additional diagnostics, instrumentation, and explosives handling research in support of other testing and compliance initiatives.\n- Support Combatant Commands with development and testing of CBRNE sensors and WMD countermeasures being developed to support Combatant Command requirements.\n- Support exercises and planning events at the Nevada Test Bed in order to develop existing defeat technologies, tools, and capabilities.  Further extend testing at the Nevada National Security Site in support of the National Center for Nuclear Security portfolio’s nonproliferation efforts.\n- Continue to design and build testbeds in small-, mid-, and large-scale environments capable of capturing data needed to improve and validate high-fidelity modeling and simulation tools used to predict weapons effects on WMD storage facilities.\n- Provide development, maintenance, upgrades, and testing for Autonomous Systems Test Development to support an adaptable test bed for standardized evaluation of autonomous systems in development for CWMD missions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY2018 to FY2019 is due to greater investment in test infrastructure in support of the maintenance and development of WMD countermeasure testing capabilities."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "27\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "12.500"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.394"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.394"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.389"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.389"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.389"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.649"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive selection of most appropriate performers to fulfill science and technology development needs.  Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of CWMD technologies selected for transition to advanced technology development (6.3) and advanced component development and prototypes (6.4)."
                        }
                    }
                }
            ]
        }
    }
}