{
    "id": "2019-Navy-PB-1319-JBOOK-d4028cfc347373f894e741f0ef44baac41c8b52c4128dfd2dc1f305018c1279e-9",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605853N"
        },
        "ProgramElementTitle": {
            "val": "Management, Technical & Intl Supt"
        },
        "R1LineNumber": {
            "val": "192"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "97.939"
            },
            "CurrentYear": {
                "val": "94.562"
            },
            "BudgetYearOne": {
                "val": "87.565"
            },
            "BudgetYearOneBase": {
                "val": "87.565"
            },
            "BudgetYearTwo": {
                "val": "97.717"
            },
            "BudgetYearThree": {
                "val": "97.449"
            },
            "BudgetYearFour": {
                "val": "97.625"
            },
            "BudgetYearFive": {
                "val": "99.570"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "International Cooperative RDT&E: provide program management, execution, and support to implement a broad range of cooperative Naval Research and Development, Test and Evaluation initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations, and identify cooperative international opportunities, and improve coalition interoperability.  In addition, it develops coherent approaches, coordinating with partner nations, to sea-based missile defense, command, control, communications, computers and intelligence (C4I), and cooperative acquisition programs while also identifying technology to support the Global Maritime Partnership initiative.\n\nNaval War College Strategic Studies Support:  Provides research, analysis and gaming activities which serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, joint and interagency communities.  These efforts generate strategic and operational alternatives, quantitative analysis, war gaming and political military assessments, and provide recommendations regarding the formulation and execution of maritime options .  The War Gaming Department plans, designs, executes, analyzes and reports on the Navy's Title 10 war games.  These war games provide analytical input to the Navy's Strategic Plan, assessments of future concepts, and recommendations to the Navy's Quadrennial Defense Review, force design, and strategy process.  The War Gaming Department also designs, executes and analyzes war games for theater security cooperation plans and operational war fighting issues.  \n\nAssessment Program: The Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect war fighting capability trades and enterprise resources, identifies needs, gaps, and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations (CONOPS), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Systems (Information Dominance); warfare systems (Sea Strike, Sea Shield, and Sea Basing) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both war fighting and war fighting support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense (DoD) M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.  It develops tools and analytical methodologies that assist in evaluating Navy programs and provides technical leadership for the analysis functional area of Naval Modeling and Simulation.\n\nMid-Range Financial Improvement Plans: This project supports the Research Development Test & Evaluation, Navy (RDTEN) portion of the larger DoD and Navy-wide effort to implement the financial improvement plan.  Funding is for the sustainment of clean and auditable statements for RDTEN.\n\nOperations Integration Group:  Classified\n\nCHENG: Develops and implements architecture-based systems engineering processes, methods and tools that assure integrated and interoperable systems are delivered to the fleet.  This project provides the mission-oriented technical basis for implementing capability-based acquisition management within the Navy to engineer and field Navy and Marine Corps combat systems, weapon systems, and command, control, communications, computers and intelligence (C4I) programs that must operate as  family-of-systems (FoS) or system-of-systems (SoS).  The focus of this project is on identifying the functions, relationships, and connections between systems at both the force and unit level and across warfare mission areas, and encompasses three key elements:  Systems Engineering to provide the framework for making engineering decisions by war fighting capability at the FoS\/SoS level and supports consistent engineering and investment decision-making across Navy and Marine Corps programs within capability-based acquisition portfolios.  Naval Collaborative Engineering Environment development and implementation as a DON enterprise resource for Naval integration and interoperability information to enable collaboration and decision support among Fleet organizations, Program Executive Offices, Program Managers, Systems Commands, prime contractors, Resource\/Warfare Sponsors and Comptroller organizations.  Standards, Policies and Guidelines engineering and technical staff to implement DoN, Office of the Secretary of Defense (OSD) and Joint integration and interoperability and Anti-Tamper initiatives.\n\nNaval Research Laboratory (NRL)Facilities Modernization: This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old.\n\nThe Joint Information Environment (JIE) initiative provides the supporting IT capability framework comprised of shared information technology infrastructure, enterprise services, interoperability with coalition partners and a single security architecture that enables mission commanders to execute mission partnered operations.  JIE provides the U.S. configuration controls necessary for enterprise capabilities.  By utilizing a U.S enterprise-wide secure Identity and Access Management system, JIE ensures that authorized users at the right classification level gain access to only the data and services they are entitled.  The continued development and refinement of a Joint Information Environment will provide for a significant improvement in data sharing within, and between, coalition maritime elements.\n\nMTMD - Maritime Theater Missile Defense Forum:\n\nThis project funds participation in Maritime Integrated Air and Missile Defense projects with other nations. Included is participation in the Maritime Missile Defense Projects Framework Memorandum of Understanding of 2004 (as amended 2009). Known as the Maritime Theater Missile Defense (MTMD) forum, it promotes interoperability with the Navies of ten participating nations (Australia, Canada, France, Germany, Italy, Netherlands, Norway, Spain, United Kingdom and the United States). This project funds participation in several Project Arrangements and includes maritime contribution to the NATO Active Layered Theater Ballistic Missile Defense (ALTBMD) project, now known as NATO Ballistic Missile Defense (BMD). Engineering analysis and recommendations from MTMD activities are provided to European, Pacific and Central Combatant Commands to influence present day operations. Specifically, the MTMD Forum is addressing challenges with \"Maritime Allied Air Defense in Support of Ballistic Missile Defense Operations\" that face the Combatant Commanders during present day operations.\n\nThe MTMD forum provides protection against the proliferation of short, medium and long-range Ballistic Missile (BM) and Advanced Anti-Ship Cruise Missile (ASCM) threats through the creation of an interoperable sea-based Integrated Air and Missile Defense (IAMD) capability among coalition nations. This includes protection across the full spectrum of these threats through the enhanced utilization of existing sea-based systems to protect against current threats while progressively improving and developing systems and system-of- systems to effectively counter evolving threats.\n\nThis project supports USN participation in several Maritime IAMD related Project Arrangements and Working Groups including:\n\n(1) Battle Management Command, Control, Communications, Computers, and Intelligence (BMC4I) to define and develop architectures as well as to perform engineering to address coalition capability gaps.\n(2) Modeling & Simulation (M&S) to establish and maintain a maritime coalition M&S testbed and to perform legacy and future systems simulation testing.\n(3) Coalition Distributed Engineering Plant (CDEP) to establish and maintain a maritime coalition Hardware-in-the Loop Testbed and to conduct CDEP testing.\n(4) Open Architecture (OA) to develop Interface Standards and Data Models.\n(5) Test Planning and Execution (TPEX) to develop Test Plans, oversee exercise participation and conduct post event data analysis and reporting.\n(6) Operational Requirements (OR) to develop a Coalition Maritime Missile Defense Operational Concept Document and to identify operational constraints and tactical constructs surrounding coalition maritime missile defense activities.\n(7) Reciprocal Use of Test Facilities agreements with other nations to support Maritime IAMD and MTMD related demonstrations.\n\nAnti-Tamper (AT): The AT program performs as the Navy Technical Process Owner for the Anti-Tamper systems engineering activity that is intended to prevent and\/or delay the exploitation of critical technologies in U.S. systems; manages the research, design, development, implementation, and testing of AT measures and coordinates with Department of Defense AT Executive Agent.  Starting in FY19, funding for AT is realigned to PE 0605024N Anti-Tamper Technology Support.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "87.077"
                },
                "CurrentYear": {
                    "val": "94.562"
                },
                "BudgetYearOne": {
                    "val": "97.597"
                },
                "BudgetYearOneBase": {
                    "val": "97.597"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "97.939"
                },
                "CurrentYear": {
                    "val": "94.562"
                },
                "BudgetYearOne": {
                    "val": "87.565"
                },
                "BudgetYearOneBase": {
                    "val": "87.565"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "10.862"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-10.032"
                },
                "BudgetYearOneBase": {
                    "val": "-10.032"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.001"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.983"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.828"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.828"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.204"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.204"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.154"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "13.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding decrease in FY19 reflects the realignment of the funding for Project 2801 Anti-Tamper (AT) to 0605024N Anti-Tamper Technology Support and the realignment of funding for Project 1767 Naval War College Strategic Studies Support to Operation and Maintenance, Navy  (O&M,N) BA 3, Professional Development Education (3C3L) for the enhancement of Navy gaming and research.\n\nThe FY 2019 request was reduced by -$6.2 million to account for the availability of prior year execution balances.  The FY 2019 funding request was further reduced by $0.460 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0149"
                    },
                    "ProjectTitle": {
                        "val": "International Coop RDT&E"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.544"
                        },
                        "CurrentYear": {
                            "val": "3.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.575"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.575"
                        },
                        "BudgetYearTwo": {
                            "val": "3.658"
                        },
                        "BudgetYearThree": {
                            "val": "3.513"
                        },
                        "BudgetYearFour": {
                            "val": "3.549"
                        },
                        "BudgetYearFive": {
                            "val": "3.623"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Provides funding for program management, execution, and support activities to implement a broad range of cooperative naval Research and Development, Test and Evaluation (RDT&E) initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations,and identify cooperative international opportunities.   The funding is used to develop approaches to international cooperation consistent with combatant commanders (COCOMs), CNO, and SECNAV priorities in the maritime domain.\n\nVarious cooperative RDT&E programs, projects and exchanges are pursued to identify cooperative acquisition programs, enhance OCO efforts and MDA development, fill capability gaps, improve US\/coalition interoperability, and standardize defense capabilities with international partners. Such efforts have resulted in:\n1. Negotiating and developing approximately 57 international RDT&E Agreements annually with allied and friendly nations;\n2. Executing approximately 300 Information Exchange Annexes (IEAs) with foreign partners;\n3. Improving IEA information dissemination with allied and friendly countries and within Department of the Navy (DoN);\n4. Coordinating Navy inputs to the Office of the Under Secretary of Defense (OUSD) Acquisition, Technology, and Logistics (AT&L) Foreign Comparative Test (FCT) Program, and Coalition Warfare Program (CWP) as well as the DoN Technology Transfer Security Assistance Review Boards (TTSARB). \n5. Represent the US Navy in Office of the Secretary of Defense (OSD) directed Armaments Cooperation Forums, including the Conference of NATO Armaments Directors' groups {NATO Naval Armaments Group (NNAG)}, and Senior National Representative(SNR);\n6.  Funding of various international RDT&E support databases including Technical Project Officer (TPO), International Agreement Generators, Information\/Data Exchange Agreements, and Project Agreements\/Memorandums of Understanding;\n7. Funding for Engineering and Scientist Exchange Program (ESEP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Coop RDT&E"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.544"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to support Maritime Theater Missile Defense (MTMD) Forum.  The multi-lateral forum (9 Maritime Partner countries and the US Navy) entered into four international agreements (Battle Management Command, Control, Communications, Computers and Intelligence (BMC4I); Distributed Engineering Plant; Open Architecture; and Modeling and Simulation (M&S).  \n-Continue execution of approximately 300 Information Exchange Agreements\/Date Exchange Agreements (IEA\/DEA) with more than 30 countries.\n-Continue execution and support in placement of US Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP).\n-Continue to coordinate US Navy participation in OUSD (AT&L) Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements.\n-Fund various evolving potential cooperative exchanges and projects contribution to Maritime Domain Awareness (MDA) and irregular warfare including Multi-Mission Aircraft (MMA), Broad Area Maritime Surveillance (BAMS), Submarine Littoral Weapons System, and Swimmer Engagement.  Coordinate US Navy Support to OUSD (AT&L) International Cooperation Office.\n-Support new CNO-Initiated Strategy Dialogue with Australia, including Air and Expenditionary Warfare Working Groups for mutual development of requirements and projects.  Support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs including harbor protection, electronic warfare, and Defense Against Terrorism (DAT) trials.\n-Continue execution of Expenditionary Warfare Working Group (EWWG).\n-Execution of Assured Precision Strike (APS) Study.\n-Execution of Above Water Working Group (AWWG).\n-Execution of Undersea Warfare Working Group (UWWG).\n-Exeuction of Commnication and Information Warfare Working Group (CIWWG).\n-Execution of Amphibious Operations Working Group (AOWG)\n-Execution of Unmanned Warrior 2016 Demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue ongoing efforts from prior FY17\n-Continue to support Maritime Missile Defense (MTMD) Forum system engineering and BMD interoperability activities, including Forum staff support, and ongoing PA activities for Battle Management C4I, Coalition Distributed Engineering Plant, Modeling and Simulation, Force Level Open Architecture Standards, and At-Sea Demonstration\n-Continue execution of approximately 150 Information Exchange Agreements\/Data Exchange Agreements (IEA\/DEA) with more than 30 countries\n-Continue execution and support in placement of U.S. Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP)\n-Continue to coordinate U.S. Navy participation in OUSD (AT&L) Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements\n-Support U.S.-India Defense Technology and Trade Initiative Working Groups, including the Joint Working Group on Aircraft Carrier Technology Cooperation (JWGACTC), the Jet Engine Technology Joint Working Group (JETJWG), and the Joint Working Group on Naval Systems (JWGNS). \n-Support U.S.-India Defense Technology and Trade Initiative Information Exchange and Terms of Reference (TOR) exchanges to promote cooperative opportunity development.\n-Navy International Agreement Database maintenance and support\n-Execution of Above Water Working Group (AWWG)\n-Continue to support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.575"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.575"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts from prior FY's\n-Identify potential from an International Theater ASW Forum with foreign partners, similar in structure to the existing MTMD Forum.\n-Continue to support Maritime Missile Defense (MTMD) Forum system engineering and BMD interoperability activities, including Forum staff support, and ongoing PA activities for Battle Management C4I, Coalition Distributed Engineering Plant, Modeling and Simulation, Force Level Open Architecture Standards, and At-Sea Demonstration\n-Continue execution of approximately 150 Information Exchange Agreements\/Data Exchange Agreements (IEA\/DEA) with more than 30 countries\n-Continue execution and support in placement of U.S. Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP)\n-Continue to coordinate U.S. Navy participation in OUSD (AT&L) Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements\n-Support U.S.-India Defense Technology and Trade Initiative Working Groups, including the Joint Working Group on Aircraft Carrier Technology Cooperation (JWGACTC), the Jet Engine Technology Joint Working Group (JETJWG), and the Joint Working Group on Naval Systems (JWGNS). \n-Support U.S.-India Defense Technology and Trade Initiative Information Exchange and Terms of Reference (TOR) exchanges to promote cooperative opportunity development.\n-Navy International Agreement Database maintenance and support\n-Execution of Above Water Working Group (AWWG)\n-Continue to support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2018 request was reduced by $0.6 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Navy International Cooperative RDT&E project supports the implementation of many international cooperative program activities throughout the Department of the Navy (DoN) RDT&E communities. The project funds DoN participation in NATO and OSD lead Armaments Cooperation as well as DoN lead international cooperation that promotes coalition interoperability and set standards with international partners. The focused activities under this project maximize the DoN's efforts by leveraging international technologies and funding to fill capabilities gaps, gain access to foreign research and testing data, and avoid duplication of research and development efforts. The performance goals and metrics are, in cooperation with Maritime Partner nations, to set and harmonize requirements, utilize respective technologies, encourage financial contributions and facilities use, and support forums and work that reduce DoN funding requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1767"
                    },
                    "ProjectTitle": {
                        "val": "Naval War Col Strategic Studies Supt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.044"
                        },
                        "CurrentYear": {
                            "val": "4.434"
                        },
                        "BudgetYearOne": {
                            "val": "5.263"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.263"
                        },
                        "BudgetYearTwo": {
                            "val": "5.658"
                        },
                        "BudgetYearThree": {
                            "val": "5.769"
                        },
                        "BudgetYearFour": {
                            "val": "5.879"
                        },
                        "BudgetYearFive": {
                            "val": "5.991"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Naval War College (NWC) research, analysis and gaming activities serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, Joint and Interagency communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analysis, war gaming, political-military assessments, and provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Studies"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts research in strategic studies in response to tasking from the Secretary of the Navy (SECNAV), Chief of Naval Operation (CNO), Fleet Commanders, numbered Fleet Commanders, and Combatant Commanders.  NWC also hosts the activities of the CNO's Strategic Studies Group (SSG).  The CNO SSG is a select group of senior naval officers handpicked by the CNO, who report to him in the development of revolutionary warfighting and operational concepts, such as Sea Strike and FORCEnet."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, Navy Component Commanders, and the Combatant Commanders.   \n- Continue to support the OPNAV Staff on tasked research projects.  \n- CNO SSG tasking from the CNO to SSG XXXVI to generate revolutionary operating and warfighting concepts for future Navy and maritime operations.   Following up on CNO and OPNAV actions resulting from SSG XXXV Final Report. \n- Conduct research into the Chinese Maritime capabilities and affairs in order to enhance understanding of global developments and provide studies and advice for the CNO and the fleet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.512"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct research and analysis projects and provide d supporting events for OPNAV, the numbered Fleets, Navy Component Commanders, and the Combatant Commanders.   \n- Continued to support the OPNAV Staff on tasked research projects.  \n- Conduct research into the Chinese Maritime capabilities and affairs in order to enhance understanding of global developments and provide studies and advice for the CNO and the fleet."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.522"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.522"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct research and analysis projects and provide d supporting events for OPNAV, the numbered Fleets, Navy\nComponent Commanders, and the Combatant Commanders.\n- Continued to support the OPNAV Staff on tasked research projects.\n- Continue to conduct research into the Chinese Maritime capabilities and affairs in order to enhance understanding of global\ndevelopments and provide studies and advice for the CNO and the fleet.\n-Conduct limited research into North Korea capabilities\/affairs and the future of the Arctic Region order to enhance understanding of global developments and provide studies and advice for the CNO and the fleet."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval War Gaming Support"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts strategic and operational war gaming and research for Office of the\nChief of Naval Operations (OPNAV), the numbered Fleets, Fleet Commanders, and the Combatant Commanders. Each\nyear, 45-60 major war games and associated events provide support to efforts that explore and analyze military, political,informational and economic aspects of differing strategic and operational scenarios and tactical imperatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.411"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct 55-60 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.   \n- Continue to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war gaming expertise to other services' Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such as MDA, Irregular Warfare, cyber, and C4ISR.\n- Continue to conduct research, analysis, and war gaming of emerging concepts such as anti access and area denial and air sea battle.\n- Continue to conduct high level policy analytic research and gaming addressing Proliferation Security Initiatives for Office of the Secretary of Defense (OSD).\n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming, research, and analysis. \n- Continue to conduct analytic research on maritime security cooperation planning for forward based fleets. \n- Continue to lead the effort to conduct analytical  research in operational concepts of Cyber Warfare. \n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure protection and counter piracy. \n- Continue to support Fleet Commanders with high quality Course of Action Analysis and war games of operational plans.  \n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for implementation of Cooperative Strategy for 21st Century Seapower.    \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime security, and sea control. \n- Continue to conduct additional research and analysis on key operational challenges such as theater anti-submarine Warfare, maritime missile defense, global maritime security, maritime homeland defense, maritime domain awareness, and sea basing.\n- Continue to improve on War Gaming capabilities through equipment and infrastructure investments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.350"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct 60-65 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.   \n- Continue to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war gaming expertise to other services Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such as MDA, Irregular Warfare, cyber, and C4ISR.\n- Continue to conduct research, analysis, and war gaming of emerging concepts such as anti access and area denial and air sea battle.\n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming, research, and analysis. \n- Continue to conduct analytic research on maritime security cooperation planning for forward based fleets. \n- Continue to lead the effort to conduct analytical  research in operational concepts of Cyber Warfare. \n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure protection and counter piracy. \n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure protection.\n- Continue to support Fleet Commanders with high quality Course of Action Analysis and war games of operational plans.  \n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for implementation of Cooperative Strategy for 21st Century Sea power.    \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime security, and sea control. \n- Continue to conduct research and analysis on key operational challenges such as theater ASW, IAMD, global maritime security, maritime homeland defense, MDA, and sea basing.    \n- Continue to increase the level of directed high security research war gaming at the operational level of war. Intent of the high security research games will be to inform current and future Navy programs regarding focus issues and capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.157"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.157"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct 60-65 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.   \n- Continue to support CNO and OPNAV with Navy Title X war games, research, and analysis.  Continue to provide war gaming expertise to other services Title 10 war games. \n- Continue to provide research, analysis, and war gaming support to senior Navy leadership in areas as directed, such as MDA, Irregular Warfare, cyber, and C4ISR.\n- Continue to conduct research, analysis, and war gaming of emerging concepts such as anti access and area denial and air sea battle.\n- Continue to foster and sustain cooperative relationships with international partners through the use of war gaming, research, and analysis. \n- Continue to conduct analytic research on maritime security cooperation planning for forward based fleets. \n- Continue to lead the effort to conduct analytical  research in operational concepts of Cyber Warfare. \n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure protection and counter piracy. \n- Continue to support Fleet Commanders and advance concepts in war fighting areas of interest, such as critical infrastructure protection.\n- Continue to support Fleet Commanders with high quality Course of Action Analysis and war games of operational plans.  \n- Continue to conduct advanced research and analysis for OPNAV on determining measures of effectiveness for implementation of Cooperative Strategy for 21st Century Sea power.    \n- Continue war gaming, research and analytical support for Navy core capabilities, such as deterrence, maritime security, and sea control. \n- Continue to conduct research and analysis on key operational challenges such as theater ASW, IAMD, global maritime security, maritime homeland defense, MDA, and sea basing.    \n- Continue to increase the level of directed high security research war gaming at the operational level of war. Intent of the high security research games will be to inform current and future Navy programs regarding focus issues and capabilities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2018  to FY 2019 supports the 60-65 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfare Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) supports senior decision-makers from the Department of Defense, Department of the Navy, the numbered Fleets, Fleet Commanders and Combatant Commanders in reaching well-informed, objective decisions on strategic, operational and programmatic issues through collaborative research which integrates traditional research and analysis with advanced decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.305"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the Combatant Commanders.  Projects were in direct support of warfighting analysis requirements for numbered fleet commanders and were expanded to include Commander Seventh Fleet (C7F) with particular focus on India and the Indian Ocean.   \n- Conduct analytical research on key strategic and operational challenges such as maritime ballistic missile defense, proliferation security initiative, global maritime security, maritime situational awareness, maritime operations headquarters, interconnectivity, and multi-service force deployment.   \n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- 20-25 major decision events will be conducted in support of there efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the Combatant Commanders.  Projects were in direct support of warfighting analysis requirements for numbered fleet commanders and were expanded to include Commander Seventh Fleet (C7F) with particular focus on India and the Indian Ocean.   \n- Conduct analytical research on key strategic and operational challenges such as maritime ballistic missile defense, proliferation security initiative, global maritime security, maritime situational awareness, maritime operations headquarters, interconnectivity, and multi-service force deployment.   \n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- Approximately 20 major decision events will be conducted in support of there efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.544"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.544"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to conduct major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the Combatant Commanders.  Projects were in direct support of warfighting analysis requirements for numbered fleet commanders and were expanded to include Commander Seventh Fleet (C7F) with particular focus on India and the Indian Ocean.   \n- Conduct analytical research on key strategic and operational challenges such as maritime ballistic missile defense, proliferation security initiative, global maritime security, maritime situational awareness, maritime operations headquarters, interconnectivity, and multi-service force deployment.   \n- Continue additional evaluation of concepts and decision events in conjunction with war gaming center.\n- Conduct research targeted at the strategic and policy level decision making within China. \n- Continue to provide direct support to NWC student research groups and war gaming. \n- Approximately 20 major decision events will be conducted in support of there efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant increase from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NWC Student Research Projects"
                                    },
                                    "Description": {
                                        "val": "Selected top performing Naval War College (NWC) students to conduct focused research and analysis of current and future strategic and operational challenges and tactical imperatives.  These students are organized under the supervision of the Mahan Scholars Program and the Halsey Group Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.079"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct focused research, analysis and war gaming of current and future strategic\/operational challenges and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continue in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering information denial and missile defense at the theater joint operational level.    \n- Conduct research for Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.039"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct focused research, analysis and war gaming of current and future strategic\/operational challenges and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continue in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering information denial and missile defense at the theater joint operational level.    \n- Conduct research for Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct focused research, analysis and war gaming of current and future strategic\/operational challenges and tactical imperatives by the Halsey Groups and Mahan Scholars programs. \n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continue in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering information denial and missile defense at the theater joint operational level.    \n- Conduct research for Deputy Secretary of Defense (DEPSECDEF) on matters tasked to the College."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This project provides research, analysis and war gaming to meet the needs of the Secretary of the Navy, the Chief of Naval Operations, and Fleet Commanders.  Performance is measured in terms of both the quantity and quality of war games, analysis and the extent to which demand for war games and research products can be accommodated within funding levels.  Results of research products and war games are evaluated through customer feedback and the extent to which findings are incorporated into follow-on research and practical applications such as Navy doctrine, operational tactics, and programming decisions made during the Planning, Programming, Budgeting & Execution (PPBE) process."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2098"
                    },
                    "ProjectTitle": {
                        "val": "Navy Postgraduate School (NPS) Studies Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.755"
                        },
                        "CurrentYear": {
                            "val": "13.122"
                        },
                        "BudgetYearOne": {
                            "val": "11.588"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.588"
                        },
                        "BudgetYearTwo": {
                            "val": "11.559"
                        },
                        "BudgetYearThree": {
                            "val": "11.961"
                        },
                        "BudgetYearFour": {
                            "val": "12.099"
                        },
                        "BudgetYearFive": {
                            "val": "12.348"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Navy Postgraduate School (NPS) research and analysis activities serve as a focal point, stimulus, and major source of strategic, tactical and operational thought within the Navy communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analyses, technical developments and assessments, and political-military assessments.  Also, provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States.  Research will be conducted that will enhance graduate education for Naval Officers and potentially provide students with areas of studies for theses and faculty projects. These research activities also serve as a means for OPNAV Resource Sponsors and Major Commands to have analysis and decision support research conducted in the uses of the applied, soft, and hard sciences in solving diverse and complex resource allocation and strategic issues facing the Navy today and envisioned in the future."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Faculty and Student Studies, Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Navy Postgraduate School (NPS) supports senior decision-makers from the Department of the Navy, the Office of the Chief of Naval Operations, Budget Submission Offices and Fleet Commanders in reaching well-informed, objective decisions on strategic, operational and programmatic issues through collaborative research which integrates traditional research and analysis with advanced decision support tools.  Student Theses will be an integral part of this program in support of the critical analysis and research conducted by the Faculty."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.755"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Conduct studies in support of OPNAV N1Conduct studies in support of OPNAV N2\/N6\n-Conduct studies in support of OPNAV N3\/N5\n-Conduct studies in support of OPNAV N4\n-Conduct studies in support of OPNAV N8\n-Conduct studies in support of OPNAV N9\n-Conduct studies in support of US Fleet Forces Command\n-Conduct studies in support of the Secretary of the Navy"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.122"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct studies in support of OPNAV N1\n- Conduct studies in support of OPNAV N2\/N6\n- Conduct studies in support of OPNAV N3\/N5\n- Conduct studies in support of OPNAV N4\n- Conduct studies in support of OPNAV N8\n- Conduct studies in support of OPNAV N9\n- Conduct studies in support of US Fleet Forces Command\n- Conduct studies in support of the Secretary of the Navy"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct studies in support of OPNAV N1\n- Conduct studies in support of OPNAV N2\/N6\n- Conduct studies in support of OPNAV N3\/N5\n- Conduct studies in support of OPNAV N4\n- Conduct studies in support of OPNAV N8\n- Conduct studies in support of OPNAV N9\n- Conduct studies in support of US Fleet Forces Command\n- Conduct studies in support of the Secretary of the Navy"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2018 to FY 2019 reflects fewer studies being conducted in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This Project provides funding to support continuing need for studies and analysis to meet the needs of the Secretary of the Navy, the Chief of Naval Operations, Resource Sponsors, Major Commands and Fleet Commanders.  Performance is measured in terms of both the quantity and quality of the studies, research and analysis products that can be accommodated within funding levels. Results of research products are evaluated through customer feedback and the extent to which findings are incorporated into follow-on research and practical applications such as Navy doctrine, operational tactics, and programming decisions made during the Planning, Programming, Budgeting & Execution (PPBE) process.  This project supports research of both Naval Postgraduate School faculty and students."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2221"
                    },
                    "ProjectTitle": {
                        "val": "JT Mission Assessment Studies"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "20.256"
                        },
                        "CurrentYear": {
                            "val": "24.889"
                        },
                        "BudgetYearOne": {
                            "val": "25.767"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.767"
                        },
                        "BudgetYearTwo": {
                            "val": "26.937"
                        },
                        "BudgetYearThree": {
                            "val": "27.522"
                        },
                        "BudgetYearFour": {
                            "val": "27.835"
                        },
                        "BudgetYearFive": {
                            "val": "28.364"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect warfighting capability trades and enterprise resources, identifies needs, gaps and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations, Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance Systems (Information Warfare); warfare systems (Expeditionary Warfare & Combat Logistics, Sea Control, and Power Projection) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring, or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both warfighting and warfighting-support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.\n\nCONFORM\/CDE for ships, boats and unmanned maritime vehicles must be continuously exercised to remain viable. It takes years to train competent practitioners, and knowledge currency is quickly lost without practice. Evolving threats and technologies drive concepts (and the tools, processes, and skills needed to produce them) towards obsolescence without constant attention. Capability Based Assessments and Analysis of Alternatives (AoA) timelines are insufficient for establishing potential material solution cost versus capability relationships without significant concept formulation work beforehand. Active collaboration between the Office of the Chief of Naval Operations requirement sponsors, Program Offices, and the various System Commands (Naval Sea Systems Command, Naval Air Systems Command and Space and Naval Warfare Systems Command) engineers is critical for fully exploring the trade space by conducting analysis for affordability, effectiveness and risk.  \n-\tThe majority of Total Ownership Cost (TOC) is locked into a design before it is even a program. In the later stages of a program it becomes much more costly to make changes that will significantly impact TOC. Investment up front in concept design can have a high payoff in TOC reduction over the life of a platform class.\n-\tThis project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship and associated platform force structure along with development of the tools to accomplish these efforts. Advanced platform concept studies and systems technology assessments will be conducted as will the development and upgrade of concept design and engineering tools, methods, and criteria.\n-\tOutputs include concept costing and performance parameterization for comparative assessment against capability objectives and synthesis to quantify overall (Fleet) capabilities. These products (expressions of cost vs. capability) will serve as the basis of requirements and Joint Capabilities Integration and Development System analysis, define the trade space for AoA efforts, and underpin discussion of force architecture\/structure during Quadrennial Defense Review, Long Range Shipbuilding Strategy builds, and Joint Requirements Oversight Council reviews.\nCapabilities-Based Assessment (CBA) is the Joint Capabilities Integration and Development System (JCIDS) analysis process that includes three phases: Functional Area Analysis (FAA), Functional Needs Analysis (FNA), and Functional Solution Analysis (FSA). The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval warfighting capabilities and force structure needed to support the Joint Requirements Oversight Council (JROC)\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions. This analysis includes evaluation of integration and interoperability gaps of both current and future Navy platforms and systems capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Standard Scenarios with Warfare and Warfare Support Analyses"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.990"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed, updated and maintained detailed level Navy Standard scenarios based on Defense Programming Guidance (DPG).\n-Developed alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Developed, updated, and maintained analytic baselines for the MCO based on DPG. \n-Developed details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Developed and maintained a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data were defined and traceable to government approved\/provided source material.  \n-Developed scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Developed Measures of Performance (MOP)and Measures of Evaluation (MOE)and recommended appropriate modeling\/methodology to support analyses.  \n-At the mission level, continued to script OPSITS or TACSITS for use in effectiveness analyses in specific warfare mission areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.126"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, update and maintain detailed level Navy Standard scenarios based on DPG.\n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Continue to develop, update and maintain analytic baselines for the MCO based on DPG. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Continue to develop and maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.  \n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses.  \n-At the mission level, continue to script OPSITS or TACSITS for use in effectiveness analyses in specific warfare mission areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.148"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.148"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, update and maintain detailed level Navy Standard scenarios based on DPG.\n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Continue to develop, update and maintain analytic baselines for the MCO based on DPG. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Continue to develop and maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.  \n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses.  \n-At the mission level, continue to script Operational Situations (OPSITS) or Tactical Situations (TACSITS) for use in effectiveness analyses in specific warfare mission areas."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Capability Based Assessments with Campaign Mission Analyses Analytical and Technical Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.730"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Performed collaborative assessment with capability sponsors. \n-Continued the proactive participation in Capability Sponsors' Integrated Process Teams. \n-Presented opposing analytically-based points of view to the CNO and Navy senior leadership. \n-Provided analytically-based decision recommendations to CNO for both warfighting and support areas. \n-Developed CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Assessed the capability sponsors' products for senior leadership decision forums. \n-Conducted Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Conducted OCO CBAs that provide a rapid and scalable process to utilize a Concept of Operation, develop investment strategies, and capabilities roadmaps. \n-Conducted Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Conducted independent assessment of Anti-Submarine Warfare. \n-Conducted weapons safety and sea basing capability assessments. \n-Conducted ISR and METOC assessments to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Supported CBAs to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Performed rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminated complex warfare issues which support decision-making in the PPBE process. \n-Performed analyses including joint campaign analysis that examines the ability to counter a range of coordinated threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determines system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Conducted cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Developed innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Provided rigorous business case assessments of complex issues relating to the warfighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Performed analyses for accreditation of models, use estimated cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.116"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to perform collaborative assessment with capability sponsors. \n-Continue to proactively participate in Capability Sponsors' Integrated Process Teams. \n-Continue to present opposing analytically-based points of view to the CNO and Navy senior leadership. \n-Continue to provide analytically-based decision recommendations to CNO for both warfighting and support areas. \n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Continue to assess capability sponsors' products for senior leadership decision forums. \n-Continue to conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Continue to conduct OCO CBAs that provide a rapid and scalable process to utilize a Concept of Operation, developed investment strategies, and capabilities roadmaps. \n-Continue to conduct Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Continue to conduct independent assessment of Anti-Submarine Warfare. \n-Continue to conduct weapons safety and sea basing capability assessments. \n-Continue to conduct ISR and METOC assessments to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Continue to support CBAs to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the PPBE process. \n-Continue to perform analyses including joint campaign analysis that examine the ability to counter a range of coordinated threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Continue to conduct cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Continue to develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Continue to provide rigorous business case assessments of complex issues relating to the warfighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Continue to perform analyses for accreditation of models, use estimated cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.097"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.097"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to perform collaborative assessment with capability sponsors. \n-Continue to proactively participate in Capability Sponsors' Integrated Process Teams. \n-Continue to present opposing analytically-based points of view to the CNO and Navy senior leadership. \n-Continue to provide analytically-based decision recommendations to CNO for both warfighting and support areas. \n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Continue to assess capability sponsors' products for senior leadership decision forums. \n-Continue to conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Continue to conduct OCO CBAs that provide a rapid and scalable process to utilize a Concept of Operation, developed investment strategies, and capabilities roadmaps. \n-Continue to conduct Tactical Aircraft Recapitalization alternatives and Theater Ballistic Missile Defense cost capability trade off assessments. \n-Continue to conduct independent assessment of Anti-Submarine Warfare. \n-Continue to conduct weapons safety and sea basing capability assessments. \n-Continue to conduct ISR and METOC assessments to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Continue to support CBAs to meet the requirements of current and future scenarios, and make strategic decisions within a constrained economic framework. \n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminate complex warfare issues which support decision-making in the PPBE process. \n-Continue to perform analyses including joint campaign analysis that examine the ability to counter a range of coordinated threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determine system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Continue to conduct cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Continue to develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Continue to provide rigorous business case assessments of complex issues relating to the warfighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Continue to perform analyses for accreditation of models, use estimated cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Campaign Analysis-Modeling and Simulation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.642"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Developed and maintained common baselines from which campaign excursions and mission-level analyses are executed. \n-Identified, developed and improved data and modeling.\n-Led Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Provided coordination across the Navy.\n-Brokered agreements upon assumptions, CONOPS, scenarios, and data.\n-Led campaign analysis for OPNAV.\n-Conducted modeling and simulation support for ongoing OPNAV missile defense analysis requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.125"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop and maintain common baselines from which campaign excursions and mission-level analyses are executed. \n-Continue to identify, develop and improve data and modeling.\n-Continue to lead Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to provide coordination across the Navy.\n-Continue to broker agreements upon assumptions, CONOPS, scenarios, and data.\n-Continue to lead campaign analysis for OPNAV.\n-Continue to conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.251"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.251"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop and maintain common baselines from which campaign excursions and mission-level analyses are executed. \n-Continue to identify, develop and improve data and modeling.\n-Continue to lead Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to provide coordination across the Navy.\n-Continue to broker agreements upon assumptions, CONOPS, scenarios, and data.\n-Continue to lead campaign analysis for OPNAV.\n-Continue to conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2018 to FY 2019 supports increased need for modeling and simulation support for Campaign analysis and ongoing OPNAV missile defense analysis requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OSD\/Joint Staff Study Analysis and Assessment with Investment Strategy Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Coordinated and led OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhanced Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Provided overarching PPBE analyses and guidance. \n-Provided analytically-based decision recommendations to OPNAV for joint warfighting and support areas. \n-Conducted net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Served as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Provided the lead requirements and acquisition for OPNAV. \n-Coordinated and led Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Participated in OSD and JS analysis assessments and provide structure for coordination across the Navy. \n-Coordinated and supported Joint Analytical Model Improvement Program. \n-Developed new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to coordinate and lead OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhanced Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Continue to provide overarching PPBE analyses and guidance. \n-Continue to provide analytically-based decision recommendations to OPNAV for joint warfighting and support areas. \n-Continue to conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Continue to serve as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Continue to provide the lead requirements and acquisition for OPNAV. \n-Continue to coordinate and lead Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Continue to participate in OSD and JS analysis assessments and provide structure for coordination across the Navy. \n-Continue to coordinate and supported Joint Analytical Model Improvement Program. \n-Continue to develop new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and developed investment strategies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to coordinate and lead OSD\/Navy's Analytic Agenda in Defense Planning Scenario, Multi-Service Force Deployment, Enhanced Planning Process, Strategic Planning Guidance, and participate in Capability Sponsors' Integrated Process Teams. \n-Continue to provide overarching PPBE analyses and guidance. \n-Continue to provide analytically-based decision recommendations to OPNAV for joint warfighting and support areas. \n-Continue to conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Continue to serve as the Navy's lead to Joint Requirements Oversight Council, Joint Capabilities Board, and Functional Capabilities Board. \n-Continue to provide the lead requirements and acquisition for OPNAV. \n-Continue to coordinate and lead Navy's role in Defense Planning Guidance, Program Decision Memoranda, Quadrennial Defense Review, and Defense Science Board studies. \n-Continue to participate in OSD and JS analysis assessments and provide structure for coordination across the Navy. \n-Continue to coordinate and supported Joint Analytical Model Improvement Program. \n-Continue to develop new analytic techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and developed investment strategies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase in FY 2019 supports development of new analytic techniques for informing resource allocation decisions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "World Class Modeling, Simulation, and Capability Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.836"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Developed and improved the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement included mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Focused on integrated analysis capabilities that cut across business and program accounts.  Specific efforts address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Developed medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Updated the high-level readiness model that fully integrate all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.282"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop and improve the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement included mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Continue to focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Continue to develop medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Continue to update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.980"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.980"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop and improve the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement included mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Continue to focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Continue to develop medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Continue to update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2018 to FY 2019 reflects the continued development of a new model to improve the Navy's capabilities in Anti-Submarine Warfare (ASW) mission-level analysis."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CONFORM"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.582"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Conducted ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs).  Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Collaborated with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level.  Warfare Systems effectiveness assessment tools are being continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems.  Additionally, collaborate with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands which refines fleet level requirements.\n-Refined platform concept stage cost analysis tools to predict costs better in areas where weight-based algorithms may not be appropriate.  Continually enhance tools to estimate total ownership costs more accurately at the ship and weapons system concept development stage.  Continue to conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts.  Further develop Cost Estimating Relationships (CERs) to accommodate emerging technologies incorporated in future platforms.  Continue to develop cost estimating tools which incorporate emerging technologies applicable to future platforms.\n-Conducted future force structure concept formulation.  Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired.  Areas examined include interoperability concepts, force architecture impact studies, Long Range Shipbuilding Schedule (LRSS) support, and operational employment concept studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.994"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to conduct ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs).  Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Continue to collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level.  Warfare Systems effectiveness assessment tools are being continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems.  Additionally, collaborate with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands which refines fleet level requirements.\n-Continue to refine platform concept stage cost analysis tools to predict costs better in areas where weight-based algorithms may not be appropriate.  Continually enhance tools to estimate total ownership costs more accurately at the ship and weapons system concept development stage.  Conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts.  Further develop Cost Estimating Relationships (CERs) to accommodate emerging technologies incorporated in future platforms.  Continue to develop cost estimating tools which incorporate emerging technologies applicable to future platforms.\n-Continue to conduct future force structure concept formulation.  Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired.  Areas to be examined include interoperability concepts, force architecture impact studies, Long Range Shipbuilding Schedule (LRSS) support, and operational employment concept studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to conduct ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs).  Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Continue to collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level.  Warfare Systems effectiveness assessment tools are being continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems.  Additionally, collaborate with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands which refines fleet level requirements.\n-Continue to refine platform concept stage cost analysis tools to predict costs better in areas where weight-based algorithms may not be appropriate.  Continually enhance tools to estimate total ownership costs more accurately at the ship and weapons system concept development stage.  Conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts.  Further develop Cost Estimating Relationships (CERs) to accommodate emerging technologies incorporated in future platforms.  Continue to develop cost estimating tools which incorporate emerging technologies applicable to future platforms.\n-Continue to conduct future force structure concept formulation.  Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired.  Areas to be examined include interoperability concepts, force architecture impact studies, Long Range Shipbuilding Schedule (LRSS) support, and operational employment concept studies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2018 to FY 2019 reflects the need for concept studies to inform Fleet architecture and future force structure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Mission Assessment Studies"
                                    },
                                    "Description": {
                                        "val": "CBA - The CBA is the JCIDS analysis process that includes three phases: the FAA, the FNA, and the FSA. The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval war fighting capabilities and force structure needed to support the JROC\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.203"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue CBA's such as advanced Naval surface fires and Naval aviation training to identify future capability requirements. Develop metrics to describe the effectiveness of solutions, and evaluate current and programmed systems ability to meet capability requirements to determine capability gaps. Expand warfighting gap assessments addressing interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue CBA's such as advanced Naval surface fires and Naval aviation training to identify future capability requirements. Develop metrics to describe the effectiveness of solutions, and evaluate current and programmed systems ability to meet capability requirements to determine capability gaps. Expand warfighting gap assessments addressing interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Capabilities-Based Assessments (CBA) such as advanced Naval surface fires and Naval aviation training to identify future capability requirements. Develop metrics to describe the effectiveness of solutions, and evaluate current and programmed systems ability to meet capability requirements to determine capability gaps. Expand warfighting gap assessments addressing interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A."
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goal is to conduct analysis to support the Navy decisions needed to turn strategy and guidance into the Fleet capabilities we need within acceptable risk. METRIC:  Risks are balanced across capability that delivers the right capabilities within the resources available to Navy.  Navy Assessment Program supports the development of platform specific studies and Capabilities Based Assessments, an analytical effort resulting in Functional Area Analysis, Functional Needs Analysis, and Functional Solution Analysis.  Efforts provide added analytical rigor relative to program's maturation under the Joint Capabilities Integration and Development System (JCIDS) and support warfare integration initiatives. \n\n-Navy Standard Scenarios with Warfare and Warfare Support Analyses: Goal: To ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved source material. METRIC: Consistency with other ongoing analyses as directed, develop Measures of Performance and Measures of Effectiveness and recommend appropriate modeling\/methodology to support analysis. Models\/methodology used reflect study objects, level of fidelity required and time constraints. \n\n-Capability Based Assessments with Campaign Mission Analyses Analytical and Technical Support: Goal: To provide analyses and technical and engineering support including, but not limited to, joint campaign analysis that examines the ability to counter a range of coordinated threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, force structure of modernization decision; mission-level effectiveness analyses to determine system capabilities; analyses of alternative force structures to determine ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations; cost-effectiveness and analyses; Acquisition Category Program Office and Systems Command assessments; and analyses of new technologies. METRIC: Develop analysis plans; determine proposed alternatives for analysis; and research performance data on current and future threats, coalition and own force systems; perform technology investigations and forecasts; develop or obtain cost data for current or planned systems; develop and use Cost Estimating Relationships to determine cost for conceptual or future systems for which no cost data is available; identify analysis assumptions, limitations and uncertainties; use established models or develop new models or methodologies to perform analyses; and interpret and analyze results. \n\n-Campaign Analysis-Modeling and Simulation: Goal: Develop and maintain a standard set of models for use in warfare analyses and analyses performed to support Planning Strategy that work at the campaign, mission, and engagement levels. METRIC: A combination of model design statements, model study reports, system specifications, updated model reports, model\/database documents, model verification and validation plans, code, and Plan of Action and Milestones reports developed or updated that encompass all aspects of Sea Power 21 to include at a minimum air, land, sea, and Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance.\n\n-Joint Assessments and Integration and Investment Strategy Development: Goal: Conduct assessments to determine shortfalls and redundancies in existing or planned operational or support capabilities; identify key issues including deficiencies in warfighting capability; determine priorities for needed capabilities; assesses affordability of high payoff systems and technologies; assess effectiveness and affordability of alternative force structures; and formulate investment strategies. Continue development and refinement of Navy program planning to determine the warfighting wholeness and cost effectiveness of alternative Navy strategies. METRIC: Identify shortfalls and redundancies in existing or planned capabilities. Determine the impact of variations in warfare systems and architectures in threat, U.S. and combined forces and strategies. Provide engineering and analytic support for the assessment and transition of technology for use in the Investment Strategy. \n\n-World Class Modeling, Simulation, and Capability Analysis: Goal: Development of new models or model upgrades to meet requirements identified by the WCM requirements process that support the Program Objective Memorandum decision-making process, with the goal of creating a state-of-the art set of models for use in warfare and warfare support analyses. METRIC: Develop model design documents, model study reports, system specifications, updated model reports, model documentation, model verification and validation plans, code, Plan of Action and Milestones reports, and technical reports.\nThe May 2007 revision of the Joint Chiefs of Staff's Joint Capabilities Integration and Development System (JCIDS) instruction (CJCSI 3170.01F) requires a CBA to assess new requirements. A CBA instruction has been developed by the Chief Navy Office's warfare integration office that prescribes a procedure and structure to this warfighting requirements generation process (JCIDS). A CBA is required to address and validate capability shortfalls or gaps as defined by combatant commanders. It is an analytical process that includes three phases: the Functional Area Analysis, the Functional Needs Analysis, and the Functional Solution Analysis. This process is designed to address future warfighting requirements and analysis needs and improve the quality of Analysis of Alternatives. CBA supports Navy programming decisions and provides the means to develop the analytic underpinning to support the determination of Naval capabilities and force structure recapitalization investments required to fulfill the Maritime Strategy."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2801"
                    },
                    "ProjectTitle": {
                        "val": "Anti-Tamper"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.389"
                        },
                        "CurrentYear": {
                            "val": "1.385"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.774"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Starting in FY19, funding for Project 2801 Anti-Tamper (AT) is realigned to 0605024N Anti-Tamper Technology Support."
                        },
                        "ProjectMissionDescription": {
                            "val": "Anti-Tamper Program -  performs as the Navy Technical Process Owner for the Anti Tamper systems engineering activity that is intended to prevent and\/or delay the exploitation of critical technologies in U.S. systems; manages the research, design, development, implementation, and testing of Anti Tamper measures and coordinates with Department of Defense Anti Tamper Executive Agent."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Tamper (AT)"
                                    },
                                    "Description": {
                                        "val": "Starting in FY19, funding for Project 2801 Anti-Tamper (AT) is realigned to 0605024N Anti-Tamper Technology Support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue championing new technology with a focused and disciplined approach of development, assessment, evaluation, and transition to meet Navy program AT requirements. Maintain role in AT policy development for implementation and execution by the SYSCOMs incorporating Navy program AT requirements. Provide secure facilities, networks, computers, video\/telephone conference and support personnel for collateral and Special Program operational environments to enable AT implementation and execution by SYSCOM's programs, incorporating AT requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue championing new technology with a focused and disciplined approach of development, assessment, evaluation, and transition to meet Navy program AT requirements. Maintain role in AT policy development for implementation and execution by the SYSCOMs incorporating Navy program AT requirements. Provide secure facilities, networks, computers, video\/telephone conference and support personnel for collateral and Special Program operational environments to enable Anti-Tamper implementation and execution by SYSCOM's programs, incorporating AT requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Starting in FY19, funding for Project 2801 Anti-Tamper (AT) is realigned to 0605024N Anti-Tamper Technology Support."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Manage the research, design, development, implementation and testing of Anti-Tamper measures for the Department of the Navy. Manage Information Security for all navy programs throughout their lifecycles."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3024"
                    },
                    "ProjectTitle": {
                        "val": "Financial Auditability and Audit Readiness (FIAR)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.137"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.137"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding will support DON FIAR efforts to achieve audit readiness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "FIAR Reimbursable Support"
                                    },
                                    "Description": {
                                        "val": "The decrease in FY 2018 reflects the realignment of the Financial Auditability and Audit Readiness (FIAR) funding to PE 0605861N RDT&E Science & Technology Management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.137"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding will be used to support one reimbursable FTE\/Civilian labor cost at the Office of Naval Research (ONR) in support of their Financial Auditability and Audit Readiness (FIAR)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Efforts will be in compliance with National Defense Authorization Act of 2010 that mandated auditable financial statements.  Performance includes monitoring internal controls surrounding business processes at Office of Naval Research."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3027"
                    },
                    "ProjectTitle": {
                        "val": "Defense Critical Infrastructure Program"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.625"
                        },
                        "CurrentYear": {
                            "val": "6.431"
                        },
                        "BudgetYearOne": {
                            "val": "5.862"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.862"
                        },
                        "BudgetYearTwo": {
                            "val": "7.743"
                        },
                        "BudgetYearThree": {
                            "val": "6.927"
                        },
                        "BudgetYearFour": {
                            "val": "7.073"
                        },
                        "BudgetYearFive": {
                            "val": "7.217"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funds received pursuant to the transfer of budget authority from OUSD Policy (OUSD (P)) Homeland Defense Mission Assurance Directorate will be used for infrastructure analysis, assessment, and research required to support execution of the Defense Critical Infrastructure  and Mission Assurance Program (DCIP \/ MA). Additionally, the transferred budget authority will be used to provide in-depth\/cross-cutting analysis to the Mission Assurance (MA)\/DCIP programs at the Office of the Secretary of Defense (OSD), Joint Staff, Military Departments\/Services, Defense Sector Lead Agencies (DSLAs), and Combatant Commands. NSWC-A40 will also perform cyber mission assurance research and provide expertise in infrastructure mitigation techniques.\n\nThe funding decrease in FY 2017 reflects the availability of prior year execution balances."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Assurance Risk Management System (MARMS) Technical Support"
                                    },
                                    "Description": {
                                        "val": "The OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P). The work performed is in alignment with the 2014 Memorandum of Agreement (MOA) between Naval Surface Warfare Center Dahlgren Division (NSWCDD) (now known as CT&SSD A40) and the Under Secretary of Defense for Policy (USD (P) Mission Assurance Directorate. In accordance with (IAW) the MOA transferred funding the following tasks will be performed in fiscal year (FY) 2019.  A40 shall provide capabilities to meet the below technical requirements in support of the developmental efforts for a current or future common operating picture for Mission Assurance supporting Joint Staff MARMS development team"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.145"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided support to MARMS technical working group monthly in meetings that adjudicated various processes and requirements drafting in support of initial development of MARMS RFI \/ RDP for FY18 contract award and program office setup."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.1.1\tParticipate in MARMS technical working group (TWG). Provide assistance with the requirements development input and feedback from collected stakeholder user stories into Functional requirements for industry response to RFI\n3.1.2\tUsing MARMS Configuration Management Board (CMB)-approved requirements produce a set of MARMS Department of Defense (DoD) Architecture Framework (DoDAF) diagrams for program milestones by 31 May 2018.  Deliverables will be based on the outcome of TWG requirements and rules for DoDAF articles necessary for programs of record detailed from existing acquisition standards\n3.1.3\tAnalyze and map data elements between existing databases for information sharing and eventual transfer to an existing or future MARMS database per guidance from Joint Staff, TWG, and CMB:\n     3.1.3.1\tConsolidate Strategic Mission Assurance Data System (SMADS) Tier 1 and 2 Task Critical Assets (TCAs), Baseline Elements of Information (BEI) and the CVAMP database into a singular database for insertion into an existing or future database as designated by Joint Staff and MARMS CMB \/ TWG requirements\n     3.1.3.2\tProvide technical support to improve interim capability with existing Mission Assurance information technology (IT) systems.  This task could include adjustments to SMADS asset data, review of classified hosting services and facilities from various defense agencies, or systems engineering analysis and code updates to enhance integration capabilities of existing MA IT systems.\n     3.1.3.3\tProvide technical assistance to support and improve the web service to and from the United States Strategic Command (USSTRATCOM) Strategic Mission Assurance Data System (SMADS) to the family of CAMS, Joint Staff Anti-terrorism Vulnerability data extracted from the Core Vulnerability Assessment Management Program (CVAMP) to a yet-to-be-determined system, and other systems used by other MA-related programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.679"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.679"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tMARMS TWG guidance & requirements traceability tracking and enforcement upon anticipated FY18 contract award\n2\tMARMS programmatic acquisition support to DoD CIO based on milestone decision authority phase entry and system engineering support\n3\tMARMS Architecture (DoDAF) tracking and incorporating data registry scheme between existing Joint Staff portals and MARMS developed user interface\n4\tDatabase mapping and analysis for MARMS and update of data from emerging analysis and assessment data for initial operational capability for MARMS use and implementation"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Assurance Assessments Support"
                                    },
                                    "Description": {
                                        "val": "The OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P). The work performed is in alignment with the 2014 Memorandum of Agreement (MOA) between Naval Surface Warfare Center Dahlgren Division (NSWCDD) (now known as CT&SSD A40) and the Under Secretary of Defense for Policy (USD (P) Mission Assurance Directorate. In accordance with (IAW) the MOA transferred funding the following tasks will be performed in fiscal year (FY) 2019. A40 shall provide capabilities to meet the below technical requirements for OSD (P)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Identified general and specific trend categories for incorporation by MA community and assessors for tracking vulnerability trends across mission and defense critical infrastructures\n-Compared various assessment capabilities and methods to combine best practices for future use and development of common standards and data inputs from MA community assessments teams\n-Identified existing and potential paths forward in risk management calculations and estimates of priority critical assets for budget solutions and acceptance of vulnerability risks to missions"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.2.1\tConduct annual analysis on MAA reports for trends and\/or common issues.  \n3.2.2\tConduct like asset analysis on mission or systems specific assessments in support of MA DCI, defense critical missions and\/or Defense Planning Guidance (DPG) work.  \n3.2.3\tAnalyze designated Joint Staff processes for consistency, validity, and accuracy (mathematical formulas, weighting factors, and assessment processes using A40 analytical resources)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tMission Assurance Trends Analysis Methodology finalization and continued refinement of data inputs from latest assessment results \n2\tAnnual trends analysis on MAA reports conducted to ensure common vulnerabilities are identified, tracked, and enterprise solutions offered to enhance efficient use of limited budgets and funding for risk mitigations\n3\tReview of Joint Staff quantitative processes in Mission Assurance Assessments to ensure viable and verified risk estimates are defendable within the budget process and gain attention for immediate resolution from cyber and physical threats"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 reflects a transition from on-site travel to assessments to more desktop assessments considering strategic implications of aggregate assessment data, and therefore lower travel costs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Mission Assurance"
                                    },
                                    "Description": {
                                        "val": "The OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P). The work performed is in alignment with the 2014 Memorandum of Agreement (MOA) between Naval Surface Warfare Center Dahlgren Division (NSWCDD) (now known as CT&SSD A40) and the Under Secretary of Defense for Policy (USD (P) Mission Assurance Directorate. In accordance with (IAW) the MOA transferred funding the following tasks will be performed in fiscal year (FY) 2019.  A40 shall provide capabilities to meet the below technical requirements for OSD (P)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Provided support to MA SSG and MA SSG ICS Subworking group on inputs for control system initiatives and legislative responses to Congress on cybersecurity efforts to defend critical infrastructure systems against emerging threats\n-Developed Platform IT best practices white paper to be distributed across DoD entities in support of enhancing control system cybersecurity practices and response to emerging cyber threats\n-Established experimental demonstration test bed for control system threats and responses \/ mitigations to emerging threats in control system and physical infrastructure inputs\n-Provided technical support to Mission Assurance Risk Management enterprise through expert inputs to Joint Staff and OSD efforts to enhance and apply MA concepts to cyber key terrain identification and classification of data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "A40 will continue to work with OSD Cyber Policy and OASD HD on the Cyber dependencies of critical infrastructure assets. A40 will be asked to provide follow on analysis of additional cyber studies in COCOM regions and specific defense mission assets. They will also assist in looking at how to better synchronize nascent cyber processes and capabilities, such as cyber assessments, cyber key terrain analysis, and Control System inventories into the DCIP methodology.\nA40 will engage with CCMDs and Sector Agencies on identifying and developing cyber key terrain data and resilience metrics as they pertain to key critical assets in both public and private domains. A40 will analyze technical and situational Cyber Security information (all threats, particularly industrial control systems) from intelligence message traffic, internet, private sources, other government agencies, national labs, and industry that address cyber control system infrastructure threats and vulnerabilities.  \nA40 will provide guidance, analysis, and technical evaluation and experimentation for Aurora Rotating Equipment Isolation Device (REID) utility engagements and test beds; maintain test data on REIDs with public sector utility companies and utilize private sector engagements to enhance knowledge about the Aurora threat and develop mitigations"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tBest Practices report for risk reduction to PIT-CS will be expanded to encompass weapons platform IT constructs and other critical infrastructure platforms the DoD has dependencies on\n2\tAnnual ICS update to Best Practices Report will be conducted to identify enhanced methods and metrics to monitor progress and accomplishment towards categorizing entire inventory of critical DoD control systems and their known vulnerabilities\n3\tResearch and develop cyber-specific infrastructure assessment methods to complement assessment teams and data incoming from ongoing assessments across DoD and Services\n4\tTechnical Liaison Support to Cyber MA Enterprise will continue to identify paths for engaging MA partners on a collaborative tool that identifies cyber mission risks from assets identified as part of ongoing assessment efforts across multiple missions and cyber domains"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 reflects the sunset of contractor support in this area due to deliverables being implemented, as part of future FY 2018\/2019 task group planning."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Critical Electric Infrastructure (DCEI)"
                                    },
                                    "Description": {
                                        "val": "The OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P). The work performed is in alignment with the 2014 Memorandum of Agreement (MOA) between Naval Surface Warfare Center Dahlgren Division (NSWCDD) (now known as CT&SSD A40) and the Under Secretary of Defense for Policy (USD (P) Mission Assurance Directorate. In accordance with (IAW) the MOA transferred funding the following tasks will be performed in fiscal year (FY) 2019.  A40 shall provide capabilities to meet the below technical requirements for OSD (P)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.520"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Provided updated critical electric infrastructure pathways for DoD installations in support of FAST Act and DoE led efforts to restore primary power pathways of the grid\n-Provided analysis to industry utility inquiries determined to enhance black out response options and identify greatest load bearing nodes in the power grid for enhanced recovery from outages or blackouts via natural or manmade events.\n-Enhanced awareness and situational knowledge of electric grid to Senior DoD leadership via mission assurance focused briefings on electric grid construction, components, and dependencies DoD has on commercial grid infrastructures\n-Arranged on site visits and assessments of nearby critical commercial infrastructure DoD and partners have on electric grid nodes and control systems\n-Identified opportunities for ways to collaborate across agencies and private companies via operational center personnel briefs and tours of facilities to enhance DoD awareness of grid dependencies and provide customer requirements to utility providers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.4.1\tProduce briefing outlining findings and methodology used to identify Defense Critical Electric Infrastructure to DoD and interagency audiences.\n3.4.2\tBrief DoD and interagency audiences, as requested.\n3.4.3\tUpdate analysis to improve accuracy, pending DoD and interagency feedback, as requested by OSD (P).\n3.4.4\tProvide courses of action (COAs) for how other entities can conduct the modeling Dahlgren conducted in this effort. At OSD (P) request, brief other entities in detail on the methodology used so they can replicate.\n3.4.5\tProvide recommendations on what DoD processes may be appropriate to use to engage with utilities to discuss analysis findings.\n3.4.6\tProvide recommendations on organizations and points of contact (POCs) for OSD (P) personnel to engage with to deepen understanding of utility operations and grid operations.\n3.4.7\tOther support as required related to assess energy infrastructure and other dependencies of select DoD installations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.644"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.644"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tProvide briefing outlining DCEI analysis findings to interagency partners across US in support of DHS and DOE initiatives related to power grid resiliency\n2\tUpdate DCEI analysis as requested per ongoing interagency collaborations in DoD cluster areas\n3\tWriting documentation recommending COAs for how other entities can replicate A40 analysis of the grid to enhance relationships with local utility and power providers\n4\tProvide recommendations on what DoD processes may be appropriate to use to engage with utilities to discuss analysis findings\n5\tEngage with other federal and private industry agencies to deepen understanding of utility operations and grid operations (FERC, NERC, NRECA, etc.)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 reflects the anticipated draw down of Energy Security analysis as previous FY analysis rolls out to DoD and Interagency entities for implementation and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Assurance Program Management"
                                    },
                                    "Description": {
                                        "val": "The OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P). The work performed is in alignment with the 2014 Memorandum of Agreement (MOA) between Naval Surface Warfare Center Dahlgren Division (NSWCDD) (now known as CT&SSD A40) and the Under Secretary of Defense for Policy (USD (P) Mission Assurance Directorate. In accordance with (IAW) the MOA transferred funding the following tasks will be performed in fiscal year (FY) 2019.  A40 shall provide capabilities to meet the below technical requirements for OSD (P)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.635"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Provided monthly program management reports and check ins on progress of all related tasking associated with A40 statement of work to OSD Policy customers\n-Provided weekly meetings and updates to resource team of analysts to track progress of all tasking and derivative analysis \/ findings \/ initiatives in support of all A40 SOW tasks\n-Provided subject matter expertise and support to OSD during technical meetings with industry, academia, think tanks, and other research labs to determine value added collaboration options for better MA analysis\n-Determined consolidated IT footprint for most of analytical team saving costs from annual and monthly network and terminal upkeep of various computer systems\n-Provided web services and file exchange for OSD customers in support of information sharing initiatives across agencies and enhancing our own analysis and GIS service data"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.5.1\tProvide a program manager and POC for all interaction with OSD (P) and A40 personnel to facilitate task execution and provide direction to A40 personnel on emerging tasking.\n3.5.2\tProvide IT support and A40 business office management to develop and maintain Mission Assurance analytical tools, standards, contract support, and knowledge management systems for DoD-wide mission assurance efforts.  \n3.5.3\tSupport for IT Non-Classified Internet Protocol Router Network (NIPRNet) and Secret Internet Protocol Router Network (SIPRNet) domains for DCI data analysis including Information Assurance (IA) processes, IT maintenance, infrastructure data licenses (e.g., Telecordia, PowerWorld, and ESRI ArcGIS).\n3.5.4\tProvide web services and host management for data sharing, visualization tools, and interagency collaboration via A40 Intelink portal and Inteldocs file management, and U.S. Army Aviation and Missile Research Development and Engineering Center (AMRDEC) file exchange process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1 Enhance program management support to OSD to include financial tracking and updates to support reclama notices or budget execution data calls\n2 Offer options for enhanced information sharing to MA community and related entities, potentially in support of COCOM exercises or real world events that showcases A40 expertise\n3 Continue to discover ways to save funding via IT footprint consolidation and efficient use of network resources and database files"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 reflects the anticipated reduction of oversight from management efforts as other tasks stand up management \/ leadership from within, as part of tasking initiative."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Critical Infrastructure"
                                    },
                                    "Description": {
                                        "val": "The OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P). The work performed is in alignment with the 2014 Memorandum of Agreement (MOA) between Naval Surface Warfare Center Dahlgren Division (NSWCDD) (now known as CT&SSD A40) and the Under Secretary of Defense for Policy (USD (P) Mission Assurance Directorate. In accordance with (IAW) the MOA transferred funding the following tasks will be performed in fiscal year (FY) 2019.  A40 shall provide capabilities to meet the below technical requirements for OSD Mission Assurance Directorate initiatives in support of Joint Staff 33 personnel"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Identified methods to enhance Joint Staff GMAP portal data and offered expertise in database development of follow on tool development\n-Supported Joint Staff adjudication of defense critical infrastructure asset nominations and risk planning efforts\n-Researched and determined various methods for dissecting and analysis defense critical infrastructure inputs from varied assessments inputs to consolidate and track nomination of status as defense critical infrastructure\n-Reviewed and commented on multiple risk management plans derived from assessments of assets in support of critical DoD missions\n-Provided multiple briefings and research on variety of related defense critical infrastructure topics in support of real world events and assessment findings"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.6.1\tMaintain and QA Joint Staff documents and data on the Global Mission Assurance Portal-JWICS and Global Mission Assurance Portal-SIPR.  Maintain\/update MA and protection contract list on GMAP.\n3.6.2\tDraft 20 DCI Criticality Assessments; submit and track status of DCI nominations.\n3.6.3\tCoordinate input of 12 Mission Mitigation Plans (MMPs). Coordinate input of 12 Risk Reduction Plans (RRPs).\n3.6.4\tDraft 12 Risk Assessment Plan (RMP) summaries based on MMPs and RRPs received.\n3.6.5\tDraft three updated RMP summaries based on updated MMPs and RRPs received.\n3.6.6\tPrepare and submit staffing nomination packages for the Defense Critical Assets Review Board (DCARB).\n3.6.7\tPrepare revalidation package for all Defense Critical Assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.347"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.347"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tMaintain GMAP portal documentation requirements and help build out database solution and provide best practices \/ option in support and coordination with MARMS effort\n2\tDCI criticality assessments and nominations will continue to flow in and be reviewed \/ analyzed for completeness and prioritized for review\n3\tMission Mitigation and Risk Reduction Plan coordination and review of new or existing nominated assets and need for budget prioritization of vulnerability solutions\n4\tRisk Management Plan draft summaries will be coordinated, edited, and reviewed for correctness, completeness and identified appropriate vulnerabilities and threats to justify risk management plan efforts cover the issues\n5\tNomination package preparation for biannual update and finalization of critical defense assets and infrastructure\n6\tRevalidation packages for DCAs will be reviewed and nominated based on previous mission plan inputs and current Joint Staff and OSD defense planning guidance updates"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 reflects a drawdown in focus on infrastructure specific asset analysis to a more overarching view of mission analysis and engineering."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Critical Mission"
                                    },
                                    "Description": {
                                        "val": "The OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P). The work performed is in alignment with the 2014 Memorandum of Agreement (MOA) between Naval Surface Warfare Center Dahlgren Division (NSWCDD) (now known as CT&SSD A40) and the Under Secretary of Defense for Policy (USD (P) Mission Assurance Directorate. In accordance with (IAW) the MOA transferred funding the following tasks will be performed in fiscal year (FY) 2019.  A40 shall provide capabilities to meet the below technical requirements for OSD Mission Assurance Directorate initiatives in support of Joint Staff 33 personnel"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Dissected singular mission maps for completeness and overall method for identifying defense critical missions in support of upcoming assessments that are reviewing supporting DoD installations to the specific missions\n-Researched and developed discussions around what identification of DCMs can do in support of overall DoD assessments and operational plans and procedures to enhance the resiliency of the plan against emerging threats and potential vulnerabilities to DCI dependencies\n-Provided inputs to MA SSG reviews on control system and cyber mission assurance related efforts to identify DCM shortcomings and potential solutions to rectify"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.031"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.7.1\tFurther develop 15 Mission Maps to include collaboration with stakeholders for designated missions and enhance with current assessment data to identify potential weak links or lack of knowledge on critical links to mission accomplishment\n3.7.2\tDevelop briefings to inform senior leaders about DCM processes and provide support to establishing DCM identification and methodologies to focus annual assessment efforts on critical information gaps\n3.7.3\tDevelop DPG responses to OSD taskings and update briefs to the Mission Assurance Senior Steering Group (MA SSG) to decide on dedicated best path forward for utilizing the DCM concept and implementing it as part of the assessment process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.989"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.989"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tContinuous update of Mission Maps to maintain awareness of existing and new DCMs and the assets supporting multiple AORs and across mission owners (and de-conflict)\n2\tProvide DCM process briefings to MA community to enhance awareness of critical mission assets and their importance on executing in multiple mission domains\n3\tSupport DPG response briefings and papers to Joint Staff led initiatives incorporating the concept into doctrine or best practices\n4\tUpdate Defense Critical Mission Methodology Brief to include Plan of Action and Milestones and execute tasks to provide a more holistic concept of mission assurance and protection of assets in support of multiple missions"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Program cost, schedule, and performance are measured using a systematic approach with approved program management methods.  The results are presented in a monthly financial execution status report. Reports are to be submitted to the Director, MA and the Policy Resource Management Office in OSD Policy by the 15th of each succeeding month.  The reports will reflect the progress made on each of the project tasks by deliverable and a separate accumulated cost report.  Actual versus planned costs will be reflected in the reports at the request of the sponsor."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3312"
                    },
                    "ProjectTitle": {
                        "val": "MTMD-Maritime Theater Missile Defense Forum"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "8.455"
                        },
                        "CurrentYear": {
                            "val": "7.776"
                        },
                        "BudgetYearOne": {
                            "val": "7.045"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.045"
                        },
                        "BudgetYearTwo": {
                            "val": "8.596"
                        },
                        "BudgetYearThree": {
                            "val": "8.674"
                        },
                        "BudgetYearFour": {
                            "val": "8.498"
                        },
                        "BudgetYearFive": {
                            "val": "8.670"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds participation in Maritime Integrated Air and Missile Defense projects with other nations.  Included is participation in the Maritime Missile Defense Projects Framework Memorandum of Understanding of 2004 (as amended 2009, 2015, and 2016).  Known as the Maritime Theater Missile Defense (MTMD) Forum, it promotes interoperability with the Navies of eleven participating nations (Australia, Canada, Denmark, France, Germany, Italy, Netherlands, Norway, Spain, United Kingdom and the United States).  This project funds participation in multiple Projects and includes maritime contribution to the NATO Active Layered Theater Ballistic Missile Defense (ALTBMD) project, now known as NATO Ballistic Missile Defense (BMD). Engineering analysis and recommendations from MTMD activities are provided to European, Pacific and Central Combatant Commands to influence present day operations.  Specifically, the MTMD Forum is addressing challenges with \"Maritime Allied Air Defense in Support of Ballistic Missile Defense Operations\" that face the Combatant Commanders during present day operations.  The MTMD Forum is leveraging At-Sea Demonstration (ASD) test events and operational Fleet Exercises  to integrate technology with concepts of operations developed within MTMD Forum working groups.\n\nThe MTMD Forum develops systems and techniques that enhance protection and defense against the proliferation of short, medium and long-range Ballistic Missile (BM) and Advanced Anti-Ship Cruise Missile (ASCM) threats through the creation of an interoperable sea-based Integrated Air and Missile Defense (IAMD) capability among coalition nations.  This includes protection across the full spectrum of these threats through the enhanced utilization of existing sea-based systems to protect against current threats while progressively improving and developing systems and system-of- systems to effectively counter evolving threats. \n\nThis project supports USN participation in several Maritime IAMD related Project Arrangements and Working Groups including:\n\n(1)  Battle Management Command, Control, Communications, Computers, and Intelligence (BMC4I) to define and develop architectures as well as to perform engineering to address coalition capability gaps.\n(2)  Modeling & Simulation (M&S) to establish and maintain a maritime coalition M&S testbed and to perform legacy and future systems simulation testing.\n(3)  Coalition Distributed Engineering Plant (CDEP) to establish and maintain a maritime coalition Hardware-in-the-Loop Testbed and to conduct CDEP testing.\n(4)  Open Architecture (OA) to develop Interface Standards and Data Models.\n(5)  Test Planning and Execution (TPEX) to develop Test Plans, oversee exercise participation and conduct post event data analysis and reporting.\n(6)  Operational Requirements (OR) to develop a Coalition Maritime Missile Defense Operational Concept Document and to identify operational constraints and tactical constructs surrounding coalition maritime missile defense activities.\n(7)  Reciprocal Use of Test Facilities agreements with other nations to support Maritime IAMD and MTMD related demonstrations.\n\nStarting in FY17, funding for MTMD is realigned from Program Element 0603582N Combat System Integration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MTMD-Martime Theater Missile Defense Forum"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.455"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Starting in FY17, funding for MTMD was realigned from Program Element 0603582N Combat System Integration.\n\n(1) BMC4I continued engineering analysis and multi-national interoperability gap assessment for the Target Architecture based on test results and began development of the Target Architecture based on requests for information input from member nations. BMC4I evaluated Recommended Point Solutions and provided recommendations for the implementation in correcting coalition interoperability gaps. BMC4I determined information exchange requirements in preparation for at-sea demonstrations. BMC4I continued updating MTMD Coalition Capabilities and Interoperability (CCI) and Systems Tactical Data Links Interoperability Report (STIR).\n\n(2) M&S completed the Technical Plan of Work for Project Arrangement 4 (PA 4). The Technical Plan of Work provides the basis for M&S efforts supporting analysis of future Target Architectures and future capabilities developed by the MTMD Forum. The virtualization of the M&S Test Bed in FY17 provided additional capability for M&S to perform analysis for the Forum. In support of the Joint Project Optic Windmill (JPOW 17), the M&S Working Group provided the following products: JPOW 17 Statement of Test Requirements, JPOW 17 Analysis Plan, JPOW 17 Concept Development and Experimentation Phase (CDE) positional analysis report, JPOW 17 Mission Model analysis and report, and JPOW 17 Table Top analysis report. \n\n(3) CDEP continued to maintain its alignment with the Systems Engineering Teams (SET) Capability Roadmap with the incorporation of national systems upgrades and improvements.  CDEP utilized BMC4I Coalition Capabilities and Interoperability (CCI) document in planning for the Annual Test Event.  Inputs were also received from the Test Planning and Execution (TPEX) and Operational Requirements (OR) working groups to assess test objectives for land-based testing.  CDEP accomplished its first Annual Test Event (ATE1) for Project Arrangement Three (PA3) in February 2017.  This event included objectives for the Joint Project Optic Windmill 2017 (JPOW17) and Formidable Shield 2017 (FS17). Data analysis is expected to be complete and reported end of Fiscal Year (FY) 2017.  \n\n(4) Open Architecture completed the Open Architecture Radar Interface Standard (OARIS) Project Arrangement final report. Open Architecture continued to analyze, define and document the data model requirements as the first task in building the Force Level Open Architecture Technical Standard (FLOATS). The requirements are being used to develop, derive, and evaluate existing data models that will define the force level data model. The OAWG collaborated with BMC4I, OR, and the Special Experts Meeting (SEM) to ensure alignment with the Target and Reference Architecture as well as the Possible Point Solution (PPS) Force Level Functions (FLFs).\n\n(5) TPEX continued preparations for MTMD participation as part of ongoing at-sea test event continuums and Formidable Shield 17.  TPEX initiated planning for Pacific Dragon 2018 exercise during the Rim of the Pacific Exercise (RIMPAC).  The at-sea demonstrations included live-tracking events and a combination of live and simulated engagements. Integrated Air Defense and Ballistic Missile Defense test scenarios were conducted among the nations. TPEX also supported preparations for At-Sea Demonstrations, Formidable Shield, Pac Dragon and follow-on at-sea testing for future years.\n\n(6) Operational Requirements group continued to provide fleet inputs and operator oversight to test and evaluation events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.776"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1) BMC4I will continue engineering analysis and multi-national interoperability gap assessment for the Target Architecture based on test results and complete development of the Target Architecture based on requests for information input from member nations. BMC4I will evaluate Recommended Point Solutions and provide recommendations for the implementation in correcting coalition interoperability gaps. BMC4I will finalize information exchange requirements in preparation for at-sea demonstrations. BMC4I will develop updates to MTMD Coalition Capabilities and Interoperability (CCI) and Systems Tactical Data Links Interoperability Report (STIR), as appropriate.\n\n(2) M&S will continue analysis of Target Architectures and conduct further assessments in support of providing recommendations to improve information exchange requirements identified by BMC4I and the Systems Engineering Team (SET). M&S will model future Target Architectures and provide training in support of future at-sea demonstrations. In support of the MTMD Forum's future capability development, the M&S Working Group will continue to work on expansion and development of the M&S lab and integration of new simulation software and further development of virtualization capabilities for the test bed. In support of concept development and experimentation, M&S will develop plans for testing of Target Architecture 2, as developed by BMC4I. M&S will develop Mission Models to support future concepts such as Force Threat Evaluation (FTE) and Force Weapon Assignment (FWA) (FTEWA) and other Proposed Point Solutions. Development of Mission Models allows the M&S Working Group to illustrate the operational impact of proposed solutions in a variety of operational settings relevant to IAMD capability development. \n\n(3) CDEP will work with BMC4I and OR working groups to update the Coalition Capabilities and Interoperability (CCI) document and develop test plans to assess capabilities suitable for land-based testing. CDEP will also characterize risks of future at-sea demonstrations such as ASD 20. CDEP will prepare for and conduct hardware-in-the-loop tests and provide assessments and recommendations to improve information exchanges required to conduct at-sea demonstrations or to evaluate performance as an effective and efficient alternative to costly at-sea demonstrations. CDEP will execute its Second Annual Test Event (ATE2) with a focus on Link-22, Force Threat Evaluation and Weapons Assignment (FTEWA) and Interrogate Friend or Foe (IFF) Mode 5.  \n\n(4) Open Architecture will begin developing the Force Data Model by analyzing the Data Requirements document and evaluating inputs from other WGs such as; the Mission Threads, Target and Reference Architecture, Ichart, as well as existing data models such as implemented in OARIS.  The Force Data model will be used to develop the Force Level Function component interfaces. The OAWG will collaborate with BMC4I, OR and the SEM to ensure the Force Data model aligns with the Target and Reference Architecture as well as selected Possible Point Solutions (PPS) in developing the Force Level Open Architecture Technical Standard (FLOATS). Open Architecture will generate a follow on FLOATS PA. \n\n(5) TPEX will continue preparations for MTMD participation as part of ongoing at-sea test event continuums. Formidable Shield 17 execution will occur at the beginning of FY18.  Pac Dragon 2018 will occur in the fourth quarter of FY18.  These at-sea demonstrations will include live tracking events and a combination of live and simulated engagements. Integrated Air Defense and Ballistic Missile Defense test scenarios will be conducted among the nations with a fleet exercise and interoperability focus. Planning for At-Sea Demonstrations and follow-on at-sea testing will continue into future years and include target configuration\/procurement.  Future planning in FY18 will include Formidable Shield 2019 and Pac Dragon 2020 exercises which will include target procurement.  Also, long range planning will occur for major At Sea Demonstration (ASD) missions notionally in 2020 and 2025 as well as Formidable Shield 2021 including procurement of long lead target items.  \n\n(6) Operational Requirements group will continue to provide fleet inputs and operator oversight to test and evaluation events. The Operational Concept Document will be updated as will final tactics, techniques and procedures in support of ongoing at-sea demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.045"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.045"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1) BMC4I will continue engineering analysis and multi-national interoperability gap assessment for the Target Architecture based on test results and complete development of the Target Architecture based on requests for information input from member nations. BMC4I will evaluate new Recommended Point Solutions and provide recommendations for the implementation in correcting coalition interoperability gaps. BMC4I will update information exchange requirements in preparation for at-sea demonstrations. BMC4I will develop updates to MTMD Coalition Capabilities and Interoperability (CCI), as appropriate.\n\n(2) M&S will continue analysis of Target Architectures and conduct further assessments in support of providing recommendations to improve information exchange requirements identified by BMC4I and the SET. M&S will model future Target Architectures and provide analysis in support of future at-sea demonstrations. The M&S team will continue development of the test bed and add additional computing power to the test environment to provide faster and more powerful analytical capability to the Forum System Engineering Team. The M&S Working Group will continue development of the Mission Models in support of capability development to illustrate operational impact of proposed solutions to complex IAMD problems. \n\n(3) CDEP will integrate joint air and land assets for the first time in the Third Annual Test Event (ATE3).  CDEP will work with BMC4I and OR working groups to update the Coalition Capabilities and Interoperability (CCI) document and develop test plans to assess capabilities suitable for land-based testing. CDEP will also characterize risks of future at-sea demonstrations such as At-Sea Demonstration (ASD) 2020. CDEP will prepare for and conduct hardware-in-the-loop tests with allied partners, and will provide assessments and recommendations to improve information exchanges required to conduct at-sea demonstrations or to evaluate performance as an effective and efficient alternative to costly at-sea demonstrations.  CDEP will continue to align with the stated objectives within the MTMD Forum Capability Roadmap.\n\n(4) Open Architecture will develop the Force Level Function (FLF) component interfaces based on the Force Level data model and other inputs as required. The OAWG will collaborate with BMC4I, OR and the SEM to ensure these interfaces align with the Target and Reference Architectures as well as selected Possible Point Solutions (PPS) in developing the Force Level Open Architecture Technical Standard (FLOATS). The OAWG will collaborate with M&S as well to ensure the FLF component interfaces are testable.\n\n(5) TPEX will continue preparations for MTMD participation as part of ongoing at-sea test event continuums. Exercise Formidable Shield 19 execution will commence at the end of FY19.  These at-sea demonstrations will include live tracking events and a combination of live and simulated engagements. Integrated Air Defense and Ballistic Missile Defense test scenarios will be conducted among the nations with a fleet exercise and interoperability focus. Planning for At-Sea Demonstrations and follow-on at-sea testing will continue into future years and include target configuration\/procurement.  Future planning in FY19 will include Exercise Formidable Shield 2021 and Exercise Pacific Dragon 2020 which will each include target procurement.  Additionally, planning will continue for major MTMD Forum ASD test events, notionally in 2020 and 2025, which require procurement of long-lead targets and support equipment.  \n\n(6) Operational Requirements group will continue to provide current fleet inputs while also providing operational subject matter expertise and oversight for test and evaluation events. The Operational Concept Document and tactics, techniques, and procedures will be updated for distribution to MTMD Forum nations as well as NATO through Executive Committee action."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $0.848 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Program Reviews and Baseline Assessments"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3330"
                    },
                    "ProjectTitle": {
                        "val": "Naval Research Laboratory (NRL) Facilities Modernization"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "15.424"
                        },
                        "CurrentYear": {
                            "val": "18.279"
                        },
                        "BudgetYearOne": {
                            "val": "15.438"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.438"
                        },
                        "BudgetYearTwo": {
                            "val": "17.963"
                        },
                        "BudgetYearThree": {
                            "val": "17.476"
                        },
                        "BudgetYearFour": {
                            "val": "17.368"
                        },
                        "BudgetYearFive": {
                            "val": "17.720"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NRL Facilities Modernization"
                                    },
                                    "Description": {
                                        "val": "Critical Science and Technology research cannot be sustained or succeed in deteriorated facilities. World class research can only be accomplished in facilities that are at a minimum \"adequate\", but preferably \"state-of-the-art.\" Due to their advanced age and deterioration, funds are planned to restore\/modernize various laboratory facilities at the Naval Research Laboratory."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.424"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Naval Research Laboratory, the Navy's only Corporate Research Laboratory, will be completing the first phase of its Corporate Facility Investment Plan (CFIP), a comprehensive plan through FY25, to modernize its laboratory to ensure they can meet future technological threats. The funds will be used for specific studies, evaluations, and the special handling of highly critical and sensitive laboratories that will be relocated into refurbished buildings. This includes planning, consolidating and relocating of over 100 laboratories into less than 80 laboratories; careful disassembly of one-of-a-kind facilities and equipment by in-house scientists and experts and contractor support with specialized skills to devise unique plans to disassemble, transport, and reassemble the facilities; and the recalibration and specialized reassembly of the highly specialized equipment (e.g., solid-state electronic devises, lasers, vacuum tubes, electrical connections, reactors, gas sensors and chambers, and chemical connectors and distribution systems)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.279"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Areas of focus for FY 2018 will be air handling and distribution systems in the center for Bio molecular Sciences, Information Technology Division, Optical Sciences Division, Acoustics Chamber and Electra Laser facilities.  Continue modernization of laboratories to ensure they can meet future technological threats. Conduct specific studies, evaluations, and the special handling of highly critical and sensitive laboratories that are being relocated into refurbished buildings. Continue planning, consolidating and relocating of over 100 laboratories into less than 80 laboratories; careful disassembly of one-of-a-kind facilities and equipment by in-house scientists and experts and contractor support with specialized skills to devise unique plans to disassemble, transport, and reassemble the facilities; and the recalibration and specialized reassembly of the highly specialized equipment (e.g., solid-state electronic devises, lasers, vacuum tubes, electrical connections, reactors, gas sensors and chambers, and chemical connectors and distribution systems)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.438"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.438"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue modernization of laboratories to ensure they can meet future technological threats. Conduct specific studies, evaluations, and the special handling of highly critical and sensitive laboratories that are being relocated into refurbished buildings. Continue planning, consolidating and relocating of over 100 laboratories into less than 80 laboratories; careful disassembly of one-of-a-kind facilities and equipment by in-house scientists and experts and contractor support with specialized skills to devise unique plans to disassemble, transport, and reassemble the facilities; and the recalibration and specialized reassembly of the highly specialized equipment (e.g., solid-state electronic devises, lasers, vacuum tubes, electrical connections, reactors, gas sensors and chambers, and chemical connectors and distribution systems)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $0.320 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government.  The funding was further reduced by $0.657 million to reflect the availability of prior year execution balances.  The additional funding decrease reflects projected cost reductions."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "None"
                        },
                        "PerformanceMetrics": {
                            "val": "Restoration and modernization of the laboratory facilities will begin in a phased approach until completion."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3363"
                    },
                    "ProjectTitle": {
                        "val": "PACOM Initiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "14.737"
                        },
                        "CurrentYear": {
                            "val": "15.246"
                        },
                        "BudgetYearOne": {
                            "val": "13.027"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.027"
                        },
                        "BudgetYearTwo": {
                            "val": "15.603"
                        },
                        "BudgetYearThree": {
                            "val": "15.607"
                        },
                        "BudgetYearFour": {
                            "val": "15.324"
                        },
                        "BudgetYearFive": {
                            "val": "15.637"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "China Strategic Initiative (CSI) (LI 0605853N). The CSI became a DoD RDTE program in FY14. The CSI program is USPACOM's first Asia Rebalance initiative and provides critical support to operational planning efforts. The CSI program is a command-directed program that provides the Commander, USPACOM and his staff critical support at all levels of planning and decision-making for military operations within the PACOM Area Of Responsibility (AOR). The CSI program provides:  Effects Emulations, PACOM Media Project, Operational Modeling and Simulation and a Critical Factors Analysis Tool.\nThis funding is for a classified effort."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PACOM Initiative"
                                    },
                                    "Description": {
                                        "val": "The China Strategic Initiative (CSI) program is USPACOM's first Asia Rebalance initiative and provides critical support to operational planning efforts. The CSI program is a command-directed program that provides CDR, USPACOM and his staff critical support at all levels of planning and decision-making for military operations within the PACOM AOR."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.737"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Operational Emulations (OE).  Successfully achieved Initial Operating Capability on OE sub Line of Effort (LOE) with at least 80% of initial objectives being met after proof of concept test run in late FY17.\n- Operational Decision Analysis (ODA).  Continued successful execution of ODA sub Line of Effort support effort on a monthly basis.  Identified and monitored theater events providing authoritative insights for USPACOM senior leadership and warfighter efforts in the Indo-Asia-Pacific area.\n- Decision Support Elements to Operational Emulation Modeling and Simulation (DSEOMS).   Continued successful execution of monthly modeling and simulation focused at the strategic level achieving both DoD and PACOM Theater warfighter objectives and providing recommendations to improve U.S. warfighter planning efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.246"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of:  Effects Emulations, PACOM Media Project, Operational Modeling and Simulation, and the Critical Factors Analysis Tool."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of:  Effects Emulations, PACOM Media Project, Operational Modeling and Simulation, and the Critical Factors Analysis Tool."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $2.219 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Operational Emulation (OE). Successfully achieve Initial Operating Capability on OE sub Line of Effort (LOE) with at least 80% of initial objectives being met after proof of concept test run in late FY17; successfully implement quarterly OE events beginning 1QTR FY18\n\nOE provides funding to support continuing requirement for extensive studies and analysis of issues critical to operational and intelligence contingency planning required by the China Strategic Roundtable (whose members include all Combatant Commanders, Service Chiefs, Deputy Secretary of Defense, Policy leadership, the Director of Defense Intelligence Agency, and Director of the National Security Agency). This PE directly supports the China Strategic Initiative (CSI) Strategic Emulations LOE, expanding those outputs to the operational level, making insights timely and relevant to USPACOM (and other Combatant Commands), Functional Component Force Commanders across all strategic domains (e.g. cyber, air and space, sea etc.) in support of national-level mandated operational and strategic-level contingency planning.  \n\nOperational Decision Analysis (ODA). Successfully achieve Initial Operating Capability on ODA sub Line of Effort support effort with at least 80% of initial objectives being achieved by 3QTR FY18.\n\nODA provides funding to support continuing requirement for studies and analysis of issues critical to operational and intelligence contingency planning required by the China Strategic Roundtable (whose members include all Combatant Commanders, Service Chiefs, Deputy Secretary of Defense, Policy leadership, the Director of Defense Intelligence Agency, and Director of the National Security Agency). The PE directly support CSIs Strategic Emulation LOE and will provide critical technical inputs and strategic insights that complement the programs OE output database, which is still under development. ODA outputs will significantly enhance Combatant Component Command staffs with their operational and intelligence planning and global synchronization across multiple domains amongst all geographic and functional combatant commands.  \n\nDecision Support Elements to Operational Emulation Modeling and Simulation (DSEOMS). Successfully achieve Initial Operating Capability on this major LOE with at least 80% of initial objectives being met by 3QTR FY19.\n\nDSEOMS provides funding to support all four major LOEs for the CSI program and all its sub-LOEs. This effort will provide a comprehensive and campaign-quality decision support toolset to decision makers across the entire CSI enterprise: OSD, Joint Staff, Combatant Commands, Intelligence Community, and the Whole of US Government (Interagency). This PE will create a set of enhanced automated and doctrinal decision- making tools to assist key policy- and strategic leaders on a full spectrum of contingencies related to competitor nations. DSEOMS will provide analytic modeling and simulation tools that take inputs from all major CSI program LOEs; the goal being to present decision- and policy-makers and their planning staffs with a rich dataset of information that is relevant, timely, and substantive for their respective problem sets. The current scope and focus across all LOEs is to support emerging near-term and longer-term planning to both significantly enhance war planning orientation and force posture considerations but also to significantly enhance more informed strategic choices regarding future joint\/service capability investments and joint\/service operational concepts across all strategic domains.   Ultimately, fully integrated program deliverables will guide a deliberative process for identifying efficiencies in major service platform decisions to ensure they are optimized for the full-spectrum of projected adversary capabilities in the future."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.573"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.573"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funds execution of DoD's Executive Agent (EA) for Printed Circuit Board (PrCB) Technologies as established by the 2009 National Defense Authorization Act (Section 256, PL 110-417).  The primary deliverable from this effort will be a PrCB and Interconnect Technology Roadmap, or strategic plan, identifying domestic technology gaps, future research and development needs, and any policy changes required to ensure that the DoD has access to PrCB manufacturing capabilities and technical expertise necessary to meet future military requirements.  As mandated, the EA will also address DoD PrCB supply chain issues, including diversity and vulnerabilities, and develop trustworthiness requirements for PrCBs used in defense systems."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Printed Circuit Board Executive Agent"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.573"
                                        },
                                        "Text": {
                                            "val": "Refined draft \"Trusted Supplier\" requirements addressing printed circuit board design, fabrication, and assembly with broader DOD security community of interest.\nCompleted 3 of 5 beta-site audits with industry suppliers for fabrication and assembly in order to assist in further refinement of the requirements and accreditation process structures.\nCompleted an assessment of counterfeit parts on field failures across the Department in response to Section 238 of the 2016 National Defense Authorization Act. \nMigrating DoN Counterfeit Material Process Guidebook to a DOD Handbook for Counterfeit Electronic Parts; Avoidance, Detection, Mitigation and Disposition Standard.\nDeveloping 2017 technology roadmap update with industrial base health input data from the Department of Commerce.\nCollaborating with trade associations and the industrial base focused on the development and revision of commercial and defense applicable standards, the creation of a trusted network of suppliers for defense printed circuit and interconnect technology needs, assessment of and reaction to supply chain and industrial base topics and issues, and evaluation and assessment of emerging technologies and current and future defense needs.\nCollaborating with defense organizations providing input and information pertinent to supply chain and industrial base topics and issues.\nPerformed an assessment of advanced high density interconnect structures (stacked and staggered microvia's) due to both industry and DOD identified failures and reliability issues.\nParticipating in commercial and military standards development and training for Intellectual Property Standard (IPC-1071) rewrite and J-STD-001 Space and Military Addendum development.  \nMonitoring and reviewing impending policy and guidance directives."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In 2005, the National Academies national research council (NRC) conducted a study and subsequently issued a report relating to manufacturing trends in printed circuit technology.  Within that report, the NRC detailed four critical issue areas that needed to be addressed in the interest of national security.  Those issue areas included; Trust, Supply Chain, Organic (DoD) Capability Sustainment, and Technology Development.  \n\nIntense global competition in the Printed Circuit Board (PrCB) industry has resulted in a significant reduction in the number of United States PrCB companies, leaving the domestic PrCB industrial base \"fragile\" and progressively declining in capability and health.  Implementation of the strategies developed by the EA for PrCB Technologies will proactively ensure that the U.S. PrCB industry is capable of supporting future DoD electronics requirements.  The strategic plan is expected to indentify technology gaps and research and development needs, as well as identify and recommend policy changes.\n\nIn addition to benefiting DoD by ensuring access to leading edge PrCB technology, it is expected that the EA program will help the struggling domestic PrCB industry by indentifying future technology research and development needs and securing the domestic military market."
                        }
                    }
                }
            ]
        }
    }
}