{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-11",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603133D8Z"
        },
        "ProgramElementTitle": {
            "val": "Foreign Comparative Testing"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "45.534"
            },
            "PriorYear": {
                "val": "18.966"
            },
            "CurrentYear": {
                "val": "24.199"
            },
            "BudgetYearOne": {
                "val": "24.532"
            },
            "BudgetYearOneBase": {
                "val": "24.532"
            },
            "BudgetYearTwo": {
                "val": "25.041"
            },
            "BudgetYearThree": {
                "val": "25.493"
            },
            "BudgetYearFour": {
                "val": "25.992"
            },
            "BudgetYearFive": {
                "val": "26.496"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Foreign Comparative Testing (FCT) Program Element (PE) focuses on Pre-Engineering and Manufacturing Development (Pre-EMD) and Proof of Principle prototypes derived from evaluation of foreign equipment that will provide the U.S. Armed Services, U.S. Special Operations Command (USSOCOM), and Defense agencies capabilities to counter emerging threats. FCT’s broad reach across our allies and friendly foreign countries enables development of innovative, cost effective, and interoperable solutions for the Department of Defense (DoD), Multi-Service and Combatant Command (CCMD) priority requirements. FCT also increases competition, ensuring our personnel have access to the best technology available.\n\nService Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "The FCT program supports the warfighter by leveraging technologies and equipment developed by allied nations and coalition partners to counter emerging threats, thereby enhancing U.S. warfighting capabilities while lowering U.S. development costs and accelerating the DoD acquisition process. FCT supports DoD best practices by incentivizing the use of prototyping and experimentation in advancing technological solutions to warfighter problems and acts as a hedge against threat developments. FCT enhances interoperability, facilitates international collaboration, increases competition, and enables more efficient and affordable transition of technologies into acquisition programs of record. Authorized by Title 10, U.S. Code, Section 2350a (g), the FCT program is managed by the Office of Secretary of Defense (OSD) Deputy Assistant Secretary of Defense Emerging Capability & Prototyping (DASD(EC&P)), Comparative Technology Office (CTO). FCT projects are sponsored by the Military Services and USSOCOM. Evaluation processes for project selection include a detailed review to confirm the proposed item addresses valid requirements and DoD priorities, a thorough market survey, and an emphasis on transitioning technologies into current or future programs of record.\n\nThe FCT program is a catalyst for teaming and other business relationships between foreign and U.S. industries. Many successful FCT projects result in the licensed production of a qualified foreign item in the United States. Other nations recognize the long-term value of such practices for competing in the U.S. Defense market and the resultant strengthening of the \"two-way street\" in Defense procurement. The result often means the creation of jobs and contributions to local economies throughout the United States. To date, companies from 34 states benefited from FCT projects."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.343"
                },
                "CurrentYear": {
                    "val": "24.199"
                },
                "BudgetYearOne": {
                    "val": "24.910"
                },
                "BudgetYearOneBase": {
                    "val": "24.910"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.966"
                },
                "CurrentYear": {
                    "val": "24.199"
                },
                "BudgetYearOne": {
                    "val": "24.532"
                },
                "BudgetYearOneBase": {
                    "val": "24.532"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.377"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.378"
                },
                "BudgetYearOneBase": {
                    "val": "-0.378"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.353"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.021"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.213"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.213"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.165"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.165"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 to FY 2018 profile increase reflects funding for Department priorities supporting DoD best practices and objectives to promote effective competition by improving DoD outreach for technology and products from global markets through risk reducing prototypes.\n\nFY 2019 baseline decrease is being applied to fund other DoD requirements and priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "313"
                    },
                    "ProjectTitle": {
                        "val": "Foreign Comparative Testing"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "45.534"
                        },
                        "PriorYear": {
                            "val": "18.966"
                        },
                        "CurrentYear": {
                            "val": "24.199"
                        },
                        "BudgetYearOne": {
                            "val": "24.532"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.532"
                        },
                        "BudgetYearTwo": {
                            "val": "25.041"
                        },
                        "BudgetYearThree": {
                            "val": "25.493"
                        },
                        "BudgetYearFour": {
                            "val": "25.992"
                        },
                        "BudgetYearFive": {
                            "val": "26.496"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FCT funding supports projects that evaluate foreign equipment and prototypes as potential capabilities to counter emerging threats. Individual projects typically cost less than $1.200 million, last 24-36 months, and focus on pre-Engineering and Manufacturing Development (pre-EMD) and proof of principle prototypes of innovative technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mobile Land Based Anti-Ship Fires (Army)"
                                    },
                                    "Description": {
                                        "val": "Integrate existing Norwegian Naval Strike Missile (NSM) and four-pod launcher onto a standard U.S. Army Palletized Load System flat rack and demonstrate NSM launch and engagement of an over-the-horizon maritime target. This Heavy Expanded Mobility Tactical Truck (HEMTT) mounted system enables Army and Marine Corps forces to support joint force freedom of movement and action through the projection of power from land into the maritime domain. Currently, there is no mobile, land-based, over-the-horizon, anti-ship warfare capability. The goal of this project is to evaluate an asset that could fill this critical capability gap. In 4Q FY 2017, a contract was awarded to procure the launcher and missile system from the vendor."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.230"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.430"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the system in operational scenarios. Seven phases of testing are scheduled culminating in a live-fire demonstration at Rim of the Pacific Exercise 2018. System performance will be documented in each scenario. Complete final test and FCT closeout reports. If successful, the HEMTT mounted NSM will transition as an interim Mobile Land Based Anti-Ship Fires capability while the Army develops an organic capability, currently planned for Long Range Precision Fires Increment II."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding drops to zero in FY 2019 due to project completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HALO Integration with Common Remotely Operated Weapon Station (CROWS) (Army)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 New Start - The CROWS provides the capability to locate and attack targets while gunners remain under armor. The HALO system is an add-on image processor that enhances existing camera streams to allow for continuous standard and Infrared (IR) image “fusion” and a significant reduction in motion blur for the CROWS. The CROWS equipped with a HALO system will increase lethality and force protection by greatly improving image clarity and target recognition capability; and increase surveillance capability in a degraded visual environment. During FY 2017, test items and data characterization equipment were procured."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Phases 2-4 of the project will be completed.  Phase 2 testing will consist of:  power and data performance evaluation; support integration with current equipment for testing; perform government laboratory testing on an integrated system to inform future requirements and technology development; and mitigate system integration risks not previously identified.  Perform Electro-Magnetic Interference testing of prototypes to ensure there is no degradation to nearby communications systems as well as evaluate detectability of the soldier with handheld radios connected to the e-textile vest.  Phase 3 will support a Go\/No-Go decision by evaluating test data to determine if the hardware is mature enough to warrant evaluation in a field environment.  Phase 4 will be a demonstration of prototypes at the OSD Joint Infantry Company – Power event.  Write test reports and FCT closeout report."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Send sensors (IR and Daytime Cameras) to vendor for integration. Conduct developmental testing, system level testing, and optimize system integration. Pending successful testing, the HALO system will be added to CROWS Increment II Specification and procured as part of overall CROWS production."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding drops to zero in FY 2019 due to project completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Compact Long Range Observation System (United States Special Operations Command ((USSOCOM))"
                                    },
                                    "Description": {
                                        "val": "FY 2017 New Start - Project evaluates a lightweight, low-power, hand-held precision targeting device to enhance target observation, recognition, and identification of targets during day and night operations at long range. Initiated test planning and procurement of test articles in FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.663"
                                            },
                                            "Text": {
                                                "val": "Conduct kickoff meeting to formally plan specific path forward.  Negotiate hardware and cost sharing plan with the contractor and establish optimal contract vehicle.  Complete Phase 1 Launcher\/Pallet integration analysis, Phase 2 Advanced Field Artillery Tactical Data System (AFATDS) Modification\/Integration, and Phase 3 AFATDS\/Link 16 Integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.275"
                                            },
                                            "Text": {
                                                "val": "Complete procurement of test articles in 1Q FY 2018. Conduct laboratory\/safety testing during 1Q-2Q FY 2018. Conduct operational user demonstrations during 3-4Q FY 2018. Prepare FCT project close-out report and prepare Milestone C Decision package by end of FY 2018. Upon successful testing, system will transition directly to Special Operations user community."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding drops to zero in FY 2019 due to project completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "E-band Communications (Air Force)"
                                    },
                                    "Description": {
                                        "val": "This project evaluates an E-band (71-86 gigahertz) radio system’s capability to increase communications throughput by an order of magnitude or greater over deployed military systems. Completed Phase I laboratory testing 3Q FY 2017. Completed Phase II Field Testing 4Q FY 2017. Complete final test and closeout reports 1Q FY 2018 with FY 2017 funds. Following the FCT, the test item will transition to the Air Force Research Laboratory in New Mexico for additional rooftop testing under the W\/V-band Satellite Communications Experiment Program. Additionally, the technology could be used today for other line-of-sight applications. Although this project did not meet the one million dollar threshold it was included in this section because of a large investment in FY 2016."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.480"
                                            },
                                            "Text": {
                                                "val": "Receive test articles and complete upgrade to software in the units to enable them to track moving targets.  Complete Phase I (characterization testing):  physical & optical characteristics, ballistic compensation and alignment, Laser range finder, power consumption and battery life.  Go\/no-go decision."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rifle Accessory Control Unit (Navy\/USMC)"
                                    },
                                    "Description": {
                                        "val": "Evaluates a rifle-mounted, programmable button device that enables operation of various electronic weapon accessories and radios from a central control point with increased speed while maintaining hands on the rifle and eyes on the target. Completed Phase I laboratory testing in 1Q FY 2017. Received upgraded Phase I test articles in 2Q FY 2017. Completed Phase I field testing during 4Q FY 2017. Although this project did not meet the one million dollar threshold, it was included in this section because of a large investment in FY 2016."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.399"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the system in operational scenarios such as ground-ground, ship-ship, and ship-shore.  Document performance in each scenario.  Complete final test report and FCT closeout.  If successful, potential for transition to future Air Force 71-86 gigahertz Satellite Communications Programs currently in development or other Service applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.283"
                                            },
                                            "Text": {
                                                "val": "Complete Phase II laboratory testing 1Q FY 2018. Receive upgraded Phase II test articles in 2Q FY 2018. Complete Phase II field testing in 3Q FY 2018. Complete final test and close-out reports by end of 4Q FY 2018. If successful, the technology will transition to USMC Program Manager, Marine Expeditionary Rifle Squad."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding drops to zero in FY 2019 due to project completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Compact High Power Radio Frequency Directed Energy (HPRF-DE) Source (Navy\/USMC)"
                                    },
                                    "Description": {
                                        "val": "This project tests state-of-the-art HPRF magnetron microwave tubes and solid state power modulators, and evaluates the non-lethal effects offered by this technology. This approach provides the warfighter a capability between “shouting and shooting” by delivering electromagnetic energy that will disrupt, disable, or potentially destroy critical vehicle\/vessel electronic circuitry. Completed Phase I Open Air Effects Testing and initiated Phase II Radio Frequency Output Characterization Test Planning in FY 2017. Although this project did not meet the one million dollar threshold, it was included in this section because of a large investment in FY 2016."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.430"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.443"
                                            },
                                            "Text": {
                                                "val": "Complete Phase II Radio Frequency Output Characterization test during 1Q FY 2018. Complete Phase II Static Open Air Effects test in 2Q FY 2018. Complete System Safety Analysis, Prototype Vessel Temporary Installation and Integration, and Dynamic Developmental Testing and provide transition decision in 4Q FY 2018. Complete final technical test and project closeout reports during 4Q FY 2018. If successful, potential transition to various vehicle or vessel stopping programs within the Coast Guard, Navy, and Marine Corps."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding drops to zero in FY 2019 due to project completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Shipboard Navigation (Navy)"
                                    },
                                    "Description": {
                                        "val": "This effort tests the capability of a multi-constellation Global Navigation Satellite System (GNSS) receiver to function as an additional navigation source to existing military Global Positioning System (GPS) solutions for U.S. Naval surface ships and airborne applications. This testing will provide valuable insight into the potential benefits of using these signals in a U.S. military environment. Differences in positioning and timing between the foreign GNSS receiver and the platform's principal military GPS receiver may indicate to the platform that it should select an alternate, non-satellite navigation source. Completed anechoic chamber test equipment modifications and initiated final testing in FY 2017. Although this project did not meet the one million dollar threshold, it was included in this section because of a large investment in FY 2016."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.670"
                                            },
                                            "Text": {
                                                "val": "Perform data analysis and reporting from the Open Air Effects Testing at Naval Surface Warfare Center, Dahlgren Division 1Q FY 2017.  Review proposal input in 2Q FY 2017.  Perform Test Planning and Test Readiness Review 3Q-4Q FY 2017.  Receive Phase II Test Articles 4Q FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.260"
                                            },
                                            "Text": {
                                                "val": "Complete final test and prepare closeout and test reports for decision package 1Q-2Q FY 2018. Participate in Trident Warrior exercise during 4Q FY 2018. If successful, transition to the Global Positioning Navigation and Timing Systems program of record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding drops to zero in FY 2019 due to project completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Autonomous Classification of Ships and Submarines (Navy)"
                                    },
                                    "Description": {
                                        "val": "This project will evaluate an Australian-developed signal processing algorithm and sensor based on underwater measurement of acoustic intensity at low frequency near the seafloor. The algorithm has the ability to classify surface and sub-surface targets. Initiated test planning, Project Arrangement with Australia, and test article procurement in FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.436"
                                            },
                                            "Text": {
                                                "val": "Complete Phase I bench test and prototype assembly in 1Q FY 2017.  Complete prototype test by end of 2Q FY 2017.  Complete Phase II Comparative Analysis Report by end of 2Q FY 2017.  Initiate limited field testing early 3Q FY 2017.  Using FY 2017 funding this project will in FY 2018:  conduct field test planning, complete field test 1Q-3Q FY 2018 and complete technical test reports during 4Q FY 2018.  If successful, potential for transition to Program Manager Marine Intelligence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Complete Project Arrangement with Australia to support collaborative testing and test article procurement in 1Q FY 2018. Conduct at-sea testing at Fort Pierce, Florida in 2-3Q FY 2018. Complete test reports and make procurement decision 4Q FY 2018. If successful, the technology will transition to the Navy's Fixed Surveillance System Program of Record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding drops to zero in FY 2019 due to project completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Power Radio Frequency (HPRF) for Counter Unmanned Aerial Systems (CUAS) (Navy\/USMC)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 New Start - This project integrates and tests HPRF directed energy source components with various off- the-shelf sensor technologies to provide a complete CUAS prototype system that provides the capability to detect, track, identify, engage, and defeat low, slow, and small UAS. No fielded non-kinetic HPRF CUAS systems currently exist. Project initiated and initial funds received in 3Q FY 2017. Initiated test planning and test article procurement in 4Q FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.962"
                                            },
                                            "Text": {
                                                "val": "Complete GNSS test equipment modifications 1Q FY 2017 and test foreign GNSS receivers as an integrated enhancement to existing navigation systems 3Q FY 2017.  Initiate test report 3Q FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.559"
                                            },
                                            "Text": {
                                                "val": "Complete test planning and test article procurement in 1Q FY 2018. Conduct Phase I UAS effects testing in 2Q FY 2018. Provide Phase I test report in 3Q FY 2018. Pending Phase I test results, initiate Phase II beam steering prototype design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.784"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.784"
                                            },
                                            "Text": {
                                                "val": "Conduct Phase II system level testing against UAS 2Q FY 2019. Complete final test and closeout reports by end of 3Q FY 2019. If successful, an operational prototype will be available as a Quick Reaction Capability in support of urgent needs and results will inform various program office acquisition decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding supports development and delivery of a beam steering prototype for testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Ground Mapping for Characterizing Landing Zones (Air Force)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 New Start - Test airborne electromagnetic ground survey techniques currently used in commercial applications for characterizing landing zones for military aircraft. This could replace the current approach of inserting manned teams on the ground to perform the manually intensive, time consuming task of characterizing potential landing zones, often in hostile environments. Completed Phase I Laboratory and Static Testing in FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.635"
                                            },
                                            "Text": {
                                                "val": "Develop operational flight test plan during 1Q FY 2017.  Perform operational flight test in late 2Q FY 2017.  Make transition and procurement decision 4Q FY 2017.  If successful, plans in place to transition to PMA-276 Light Attack Helicopters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.365"
                                            },
                                            "Text": {
                                                "val": "Conduct Phase II system baseline testing on the ground in 2-3Q FY 2018. Complete Phase II test report in 4Q FY 2018. Conduct Phase III system testing from an aerial platform in 2-3Q FY 2019 with FY 2018 funding. Complete test and closeout reports in 4Q FY 2019 with FY 2018 funding. If successful, will transition to the Air Force Research Laboratory for additional developmental\/operational testing and user demonstrations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding drops to zero in FY 2019 due to project completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future X-Band Radar (Navy)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 New Start - Tests an off-the-shelf open-architecture Active Electronically Scanned Array (AESA) X-band aircraft radar for potential application to the Navy's Air and Missile Defense Radar (AMDR) program for ships. Currently, AMDR lacks a modern AESA X-band component to provide horizon surveillance against current and future threats. Completed initial test planning in 4Q FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Initiate test article fabrication throughout FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Receive test article 1Q FY 2019. Conduct lab testing throughout FY 2019. Conduct shipboard testing in FY 2020 with FY 2019 funding."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The majority of funds for this effort are required for test article procurement which is expected to occur in FY 2018. Funding decreases in FY 2019 for test events."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Anti-Submarine Warfare (ASW) Training Target (Navy)"
                                    },
                                    "Description": {
                                        "val": "-FY 2017 New Start - Demonstrate the capabilities of an off-the-shelf autonomous underwater vehicle for ASW training. This system accurately replicates the acoustic signature of threat submarines and provides a significant enhancement in training effectiveness over decades old technology currently in use. Initiated test planning in 4Q FY 2017. Conduct Phase I system baseline testing and evaluation throughout FY 2018 with FY 2017 funding. Continues in FY 2019 with FY 2019 funding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Conduct Phase II delta testing and evaluation throughout FY 2019. Complete final test and closeout report in 4Q FY 2019. If successful, the Navy anticipates purchasing several ASW Training Targets under an Abbreviated Acquisition Program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2018 FCT funds not required as U.S. Navy sponsor funding will pay for FY 2018 testing support. FY 2019 FCT funds are required for Phase II delta testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects (Projects Less Than One Million Dollars Each):"
                                    },
                                    "Description": {
                                        "val": "OSD CTO selected multiple low cost projects in the areas of Force Protection, Force Support, Anti-Access\/Area Denial, Robotics and Autonomous Systems, Interoperability and Countering Unmanned Systems. These projects were selected to deliver proof of principle prototypes for evaluation, assessment, and Service adoption within 24 to 36 months.\n-Soldier\/Sniper Weapon Observation and Reconnaissance Device (Navy): Tests a rifle mounted, Android command and control device to provide enhanced situational awareness and targeting capabilities at the individual soldier level. Completed Phase I prototype lab testing in 2Q FY 2017. Completed Phase II engineering field test and final reports during 4Q FY 2017. If successful, the technology will transition to Program Manager, Marine Intelligence.\n-High Efficiency Flexible Photovoltaics (Navy): Tests high efficiency, lightweight, flexible solar cells for cross-domain military applications that will increase power for Unmanned Aerial Vehicles, small satellites, man-portable and ground-based renewable energy systems. Complete solar backpack, Unmanned Aerial Vehicle, and simulated space testing in 1Q FY 2018 with FY 2017 funding. If successful, transition decision and final closeout report expected in 2Q FY 2018.\n-Cruise Missile Gas Turbine Engine (Navy): FY 2017 New Start - Tests an off-the-shelf, multi-fuel turbine engine currently in use in various foreign missile systems to provide up to a 200 percent performance increase for legacy US Navy missile systems. Initiated test planning in 4Q FY 2017. This effort continues in FY 2018 with FY 2018 funds.\n-Autonomous Aircraft Material Maintenance (Navy): FY2017 New Start - Tested a trailer-mounted, autonomous cold spray metallization technology for repair of corrosion damaged areas on aircraft. Initiated test article contract award preparation in 4Q FY 2017. This effort continues in FY 2018 with FY 2018 funds.\n-Advanced Energy Storage and Power Batteries (Navy): FY 2017 New Start - Tests advanced lithium-ion batteries and new cell chemistries for military vehicle applications that will, at a minimum, double energy density. Initiated test planning in 4Q FY 2017. This effort continues in FY 2018 with FY 2018 funds.\n-Gimballed Laser Target Designator (Navy): FY 2017 New Start - Tests a miniature 3-axis stabilized electro-optic\/infrared turret payload with integrated laser designator on a Group 1 Puma Unmanned Aerial Vehicle. Initiated test planning in 4Q FY 2017. This effort continues in FY 2018 with FY 2018 funds.\n-Energy Storage for Directed Energy Weapons and Sensors (Navy): FY 2017 New Start - Tests foreign graphene-based ultra-capacitor technology against industry leading domestic products to enable high energy storage capabilities necessary for directed energy weapons and sensors. Receive test articles and conduct phase I individual cell testing during 1-2Q FY 2018 with FY 2017 funding. Conduct phase II module configuration testing in 3Q FY 2018 with FY 2017 funding. Complete final test and closeout reports in 4Q FY 2018. If successful, the technology will transition to the Multifunction Energy Storage Future Naval Capability effort.\n-Tunable Laser Eye Protection (Air Force): FY 2017 New Start - Tests a prototype active tunable eye protection system for aircraft pilots to counter laser threats across different wavelengths. Received test article 4Q FY 2017. This effort continues in FY 2018 with FY 2018 funds.\n-Gallium Nitride Amplifier Study of Space Environment Radiation Tolerance (Air Force): FY 2017 New Start - Comparatively tests foreign and domestic Gallium Nitride (GaN) technology in simulated space radiation environments. GaN technology offers 5 to 10 times performance improvement over legacy technology. Initiated performance benchmark testing in 4Q FY 2017. This effort continues in FY 2018 with FY 2018 funds.\n-Advanced Mobile Universal Electrical Tester (Air Force): Evaluates a handheld, wireless automated test device for rapid identification of aircraft electrical system failures. Conduct extended operational testing on various military aircraft throughout FY 2018 using FY 2017 funds. Complete final test and closeout report in 4Q FY 2018 with FY 2017 funding. If successful, this technology will transition to the Air Force’s automated test equipment program office.\n-Secondary Propulsion Thrusters (Navy): Tests pump-jet propulsion technology to replace existing hydraulic propeller-based submarine secondary propulsion system which is plagued by high procurement, operational, and maintenance costs. Prototype lab testing will continue throughout FY 2018 with FY 2017 funding. If successful, potential exists for technology insertion for Virginia-class Block VI and baseline design for Columbia-class submarines.\n-Low Cost Small Satellite Components (Navy): Tests mature and cost effective foreign small satellite components including Attitude Determination and Control Systems (ADCS), Electrical Power Systems (EPS), and X-band radios to enhance on-going US Navy nanosatellite development programs. Completed ADCS and EPS testing in 4Q FY 2017. Complete X-band radio testing in 3Q FY 2018 with FY 2017 funding. Complete final closeout report in 4Q FY 2018 with FY 2017 funding. If successful, technology will transition to the Naval Nanosatellite Program of Record.\n-Underwater Wireless Power Transfer (Navy): Evaluates foreign wireless power transfer systems for potential use in Navy underwater systems and other defense applications. Wireless power transfer enables enhanced endurance of autonomous underwater vehicles and sensors, increased situational awareness, and new mission capabilities. Completed phase III pier-side testing in 4Q FY 2017. Conduct user demonstrations throughout FY 2018 with FY 2017 funding. If successful, transition potential exists for various Department of Defense programs.\n-Millimeter Wave Sensing for Autonomy (Navy): Tested technology that enables rapid and affordable evaluation of commercial automotive millimeter wave radar technology for defense applications including unmanned aerial systems. Completed flight test events in 4Q FY 2017. Complete final closeout report in 1Q FY 2018 with FY 2017 funding. If successful, the technology will transition into the Low-Cost Unmanned Aerial Vehicle Swarming Technology Innovative Naval Prototype Program.\n-Small Anti-Jam GPS Antenna for H-1 (Navy): Tested a small anti-jam Global Positioning Satellite (GPS) antenna system for helicopters, Group 3\/4 Unmanned Aerial Vehicles, and ground vehicles to provide a counter GPS signal jamming capability to size, weight, and power constrained vehicles. Completed Phase I anechoic chamber testing 3Q FY 2017. Completed Phase II flight testing 3Q FY 2017. Complete final test and closeout report in 2Q FY 2018 with FY 2017 funding. If successful, the technology will transition to the Navy's H-1 Helicopters Program Office for fielding.\n-Software Defined Network for Maneuverable Agile & Resilient Traffic (Navy): Tests network routing technologies that represent a paradigm shift for mission flexibility because network control is moved from a distributed architecture on proprietary devices to a centralized architecture using open software operating on low cost, generic hardware. Widely used by large scale information technology companies, this approach significantly reduces the time and effort required to conduct network configuration management. Completed comparative technology assessment in FY 2017. Conduct user demonstrations in a prototype environment throughout FY 2018 with FY 2017 funding. If successful, the technology could transition into large scale network architectures across the DoD.\n-Improved Steels (Army): Tests new classes of high nitrogen steels to improve durability and protection of vehicles. Completed coupon mechanical, weldability, corrosion and initial ballistic performance testing in FY 2017. Testing continues on full size plates in FY 2018 with FY 2017 funding. If successful, will transition to Program Executive Office Ground Combat Systems and Army Research Development and Engineering Center. \n-Sappherios Sensor System (Army):  Tests unattended ground sensor system comprised of dozens of rapidly deployable miniaturized seismic-acoustic, visual, and radar sensors to detect activity over large areas for long periods. Provides real-time autonomous situational awareness by deploying sensors from UAS. Completed developmental testing of enhanced sensor system 4Q FY 2017. Conducted operational evaluation of enhanced sensors as part of Adaptive Red Team\/Technical Support and Operational Analysis event at Muscatatuk Urban Training Center 4Q FY 2017. Complete system testing in FY 2018 with FY 2017 funding. If successful, the technology will transition to Program Manager (PM) Close Combat Support, PM Ground Sensor, and PM Marine Tactical Remote Sensor System.\n-Soldier Power with Inductive Recharge and Intelligent Textiles (Army): Tests e-textiles that incorporate wireless power and data distribution, in a plug-and-play capability for various worn Soldier systems. System will give soldier a tactical edge by improving sustainability, increased operational time in the field, and reduced logistic support requirements. Received test articles from two companies and completed initial lab testing in FY 2017. Complete comparative testing, field demonstrations, and final reporting in FY 2018 with FY 2017 funding. Upon successful testing, system will transition to Army, Program Executive Office Soldier and Marine Corps, PM Expeditionary Power Systems.\n-Evaluation of Towed Jumper Emergency Parachute Assembly (Army): Tests an emergency parachute system used to safely descend a towed jumper, an Airborne soldier whose equipment malfunctioned and is dragged behind the aircraft. Allows the Airborne soldier to safely descend regardless of aircraft exit and consciousness. Operational testing with crash test dummies completed in 4Q FY 2017. Complete reliability testing in FY 2018 with FY 2017 funding. Upon successful testing, system will be installed in C-130 and C-17 assets supporting Airborne operations and transitioned to Product Manager Soldier Clothing and Individual Equipment.\n-M3E1 Integrated Fire Control (Army): Tests an integrated Fire Control System for the M3E1 Multi-Role Anti-Armor Anti-Personnel Weapon System. Provides enhanced target engagement capability that significantly improves first round probability of hit in day or night with less collateral damage. Completed developmental and safety testing at vendor facility in 4Q FY 2017. This effort continues in FY 2018 with FY 2018 funds.\n-Falcon Chemical Agent Sensor (Army): FY 2017 New Start – Tests a chemical agent detector equipped with a tunable infrared laser which simultaneously identifies and precisely localizes smaller chemical threat plumes with higher sensitivity and improved accuracy. Developed and finalized functionality and operational testing plans in FY 2017. Functionality and performance tests will be conducted in FY 2018 with FY 2017 funding. Operational testing and demonstrations will be conducted in 4Q FY 2018 with FY 2017 funding. If successful, the technology will transition to the Joint Program Executive Office for Chemical Biological Defense for Nuclear Biological Chemical Reconnaissance Vehicles.\n-Autogated White Phosphor Image Intensifier Tubes (USSOCOM): FY 2017 New Start – Tests auto-gated white phosphor image intensifier tubes integrated into existing night vision systems to enable greater detection, recognition, and identification ranges for head mounted goggles, hand held surveillance devices, and weapon mounted sights. Completed project test planning. Receipt of test items, fabrication, and integration of test articles for baseline evaluation in FY 2018. This effort continues in FY 2018 with FY 2018 funds."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.472"
                                            },
                                            "Text": {
                                                "val": "- Software Defined Networking (SDN) (Navy):  Complete Phase II testing and conduct demonstration of feasibility and benefits of SDN monitoring and control technologies 3Q FY 2017.  Complete closeout and test report for decision package 4Q FY 2017.\n- High Efficiency Flexible Photovoltaics (HEFP) (Navy):  Complete laboratory acceptance testing 2Q FY 2017; complete test article panels 1Q FY 2017; and initiate Phase II field testing and reporting.  If successful, transition decision to occur in 2Q FY 2018 following application field testing.\n- Holographic Immersion Simulation System (Navy):  Purchase test articles in 2Q FY 2017.  Perform test article integration and training.  Perform data collection analysis and reporting in 3Q FY 2017 and initiate phase II test article procurement and testing 4Q FY 2017.  If successful, transition decision expected in 2Q FY 2018 following user assessments.\n- Underwater Wireless Power Transfer (Navy):  Perform Phase II benchtop testing in water; perform Phase III pier-side testing to demonstrate power, efficiency, and communication speed characterization; and make transition decision.\n- Improved Steels (Army):  Write test reports, new material specification and FCT close out report.  If successful, this new material specification is expected to transition in 4Q FY 2017 to PEO Ground Combat Systems.\n- Sappheiros System Unattended Ground Sensing and Monitoring System (Army):  Developmental Testing:  determine system communications ranges, system detection ranges, system emplacement characteristics, and mission duration.  Operational testing:  Assess the potential integration with Fires and the effectiveness of sensors and imagers for accomplishing target identification and battle space situational awareness.  This effort may become part of a systems approach towards a materiel solution for Ottawa Treaty compliance.  Information collected during this effort will inform Army and USMC ground sensor requirements.\n- Evaluation of Towed Jumper Release System (Army):  Conduct static line evaluation of the Hung-Up Parachutist Release Assembly on C-130 ramp exits during a towed jumper malfunction for T-11, MC-6 and RA-1 parachute systems.  Write technical evaluation report.  Write closeout report.   Anticipate Army procurement decision in 3Q FY 2018."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.659"
                                            },
                                            "Text": {
                                                "val": "-Holographic Immersion Simulation System (Navy): Test a deployable training system that renders three dimensional holographic environments at interactive frame rates to provide greater training realism and develop faster reactionary skills and improved decision making. Conduct single and multiple user configuration user assessments throughout FY 2018. If successful, the technology will transition to the Indoor Simulated Marksmanship Training Program of Record.\n-Cruise Missile Gas Turbine Engine (Navy): Receive test articles 1Q FY 2018. Conduct Phase I and II engine performance assessment from 2-4Q FY 2018. If successful, the technology will transition to the Navy's Precision Strike Weapons Program.\n-Autonomous Aircraft Material Maintenance (Navy): Receive test article in 2Q FY 2018. Conduct process validation on V-22 and H-1 aircraft during 3-4Q FY 2018. This effort continues in FY 2019 with FY 2019 funds.\n-Advanced Energy Storage and Power Batteries (Navy): Receive test articles during 1Q FY 2018. Initiate performance and safety testing in 2Q FY 2018. Complete testing in 2Q FY 2019 with FY 2018 funding. Complete final test and closeout reports in 3Q FY 2019 with FY 2018 funding. If successful, the technology will transition to various Marine Corps ground vehicle programs.\n-Gimballed Laser Target Designator (Navy): Complete laser safety review and test planning during 1Q FY 2018. Receive test article during 2Q FY 2018. Conduct flight test during 3Q FY 2018. Complete final test and closeout report during 4Q FY 2018. If successful, payload will transition to Group 1 Unmanned Aerial System Program of Record. \n-Tunable Laser Eye Protection (Air Force): Conduct physical, human effects, and compatibility testing throughout FY 2018. This effort supports next generation laser eye protection technology development. If successful, the technology will transition to the Naval Ophthalmic Support and Training Activity for manufacture.\n-Gallium Nitride Amplifier Study of Space Environment Radiation Tolerance (Air Force): Initiate radiation effects testing in 2Q FY 2018. If successful, best performing technology will be a candidate for operational testing on the experimental Navigation and Timing Satellite 3. \n-Crash Resistant, Ballistic Tolerant, Fuel Cell Qualification for H-1 Helicopters (Navy): Qualify a second source of crashworthy self-sealing fuel cell technology currently being used on foreign platforms for use on US Navy AH-1Z Viper and UH-1Y Venom attack helicopters. Initial Phase I test efforts were delayed due to failures that required a product redesign. Modified Phase I test article received 3Q FY 2017. Initiate Phase I retests during 4Q FY 2017. If successful, technology will be made available for procurement to replace currently fielded fuel cells by attrition.\n-M3E1 Integrated Fire Control (Army): Complete system evaluation 1Q FY 2018. Assessment of user requirements and test\/evaluation in support of system full material release. Will transition from a test and evaluation effort to a direct solution for an Urgent Material Release for 1,111 systems in 2Q FY 2018.\n-Autogated White Phosphor Image Intensifier Tubes (USSOCOM): Conduct Safety and Technical Testing 2Q FY 2018. Plan and participate in Operational User Demonstration in 3Q FY 2018. Prepare Milestone C Decision package and final test report in 4Q FY 2018. Upon successful testing, the Image Intensifier Tubes will be integrated into Night Vision Devices for the Special Operations Forces user community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "-Autonomous Aircraft Material Maintenance (Navy): Complete testing in 1Q FY 2019. Complete final test and closeout reports in 3Q FY 2019. If successful, the technology will be available for follow-on procurement and fielding by the Navy's Fleet Readiness Centers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 funding is reduced as currently selected projects complete their 24-36 month evaluation. In FY 2019, these funds become available for new projects as captured below in the OSD focus areas, Asymmetric Force Application, Autonomous Systems, Information Operations and Analytics, Electromagnetic Spectrum Agility, and Force Logistics."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Asymmetric Force Application and Autonomous Systems Focus Areas"
                                    },
                                    "Description": {
                                        "val": "FCT will invest in cross-domain, innovative, non-traditional technologies for new and emerging capabilities from international partners to enable cost-leveraging, increase competition, and provide more efficient solutions for our forces during maneuver and engagement operations. Solutions will reduce U.S. reliance on overleveraged blue capabilities and creatively exploit increasingly capable adversary systems while adjusting the cost curve in our favor. Applications of particular interest are those able to provide an innovative technology offset and\/or cost calculus advantage. Our allies have made particular progress in the development of systems that offer a significant cost advantage in procurement or operation and reduce the amount of manpower necessary to effectively conduct operations. In addition, FCT will continue to seek out increased interoperability across platforms and systems. These technologies will be likely candidates for evaluation under the FCT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.831"
                                            },
                                            "Text": {
                                                "val": "During FY 2017, FCT will focus on selecting projects supporting the below Asymmetric Force Application and Autonomous System Areas:\n- Technologies to counter threats associated with integrated air defense systems\n- Technologies that enhance the ability to conduct long range penetrating strike\n- Offensive and defensive air superiority operations\n- Mobile unmanned systems that must maneuver in an environment with little or no human assistance\n- Systems that aid human cognitive tasks"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.956"
                                            },
                                            "Text": {
                                                "val": "During FY 2018, FCT will focus on selecting projects supporting the below Asymmetric Force Application and Autonomous System Areas:\n- Technologies to counter threats associated with integrated air defense systems\n- Technologies that enhance the ability to conduct long range penetrating strike\n- Offensive and defensive air superiority operations\n- Mobile unmanned systems that must maneuver in an environment with little or no human assistance\n- Systems that aid human cognitive tasks"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.468"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.468"
                                            },
                                            "Text": {
                                                "val": "During FY 2019, FCT will focus on selecting projects supporting the below Asymmetric Force Application and Autonomous System Areas:\n- Technologies to counter threats associated with integrated air defense systems\n- Technologies that enhance the ability to conduct long range penetrating strike\n- Offensive and defensive air superiority operations\n- Mobile unmanned systems that must maneuver in an environment with little or no human assistance\n- Systems that aid human cognitive tasks"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This focus area shows a rise in funding from FY 2017\/FY 2018 into FY 2019. The reason for the increase is because, during the years of execution (FY 2017\/FY 2018), projects are selected, funded, and displayed individually in this R-2, thus reducing FY 2017\/FY 2018 funding in this focus area."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Operations and Analytics and Electromagnetic Spectrum Agility Focus Areas"
                                    },
                                    "Description": {
                                        "val": "FCT will invest in cross-domain, innovative Information Operations and Analytics and Electromagnetic Spectrum Agility evaluations of new and emerging capabilities with international partners. Solutions will increase U.S. options for enhancing communications and situational awareness and allow the Department of Defense to operate with freedom of maneuver in the electromagnetic spectrum."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.967"
                                            },
                                            "Text": {
                                                "val": "During FY 2017, FCT will focus on selecting projects supporting the below Information Operations and Analytics and Electromagnetic Spectrum Agility Areas:\n- Provide the Joint Force enhanced communications and situational awareness within the area of responsibility to disrupt and delay adversary force from offensive operations \n- Counter adversary ability to use deceptive messaging to influence U.S. and Coalition operations\n- Develop capabilities to counter adversary cyber and command and control communications \n- Gaining and attaining access to spectrum for friendly forces, denying and\/or degrading spectrum to our adversaries\n- Conducting Electromagnetic (EM) deception operations to degrade an adversary's understanding of our intent and capability\n- Preventing the adversary from leveraging the EM domain to conduct operations in other domains (i.e., air, space, maritime, land and cyber)\n- Achieving new effects in the electromagnetic spectrum domain to include directed energy and radio frequency disruption\n- Evaluating low-cost, efficient or innovative international capabilities"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.535"
                                            },
                                            "Text": {
                                                "val": "During FY 2018, FCT will focus on selecting projects supporting the below Information Operations and Analytics and Electromagnetic Spectrum Agility Areas:\n- Provide the Joint Force enhanced communications and situational awareness within the Area of Responsibility to disrupt and delay adversary force from offensive operations \n- Counter adversary ability to use deceptive messaging to influence U.S. and Coalition operations\n- Develop capabilities to counter adversary command and control communications \n- Gain and attain access to spectrum for friendly forces, denying and\/or degrading spectrum to our adversaries\n- Conduct Electromagnetic (EM) deception operations to degrade an adversary's understanding of our intent and capability\n- Prevent the adversary from leveraging the EM domain to conduct operations in other domains (i.e., air, space, maritime, and land)\n- Achieve new effects in the electromagnetic spectrum domain to include directed energy and radio frequency disruption\n- Evaluate low-cost, efficient or innovative international capabilities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.780"
                                            },
                                            "Text": {
                                                "val": "During FY 2019, FCT will focus on selecting projects supporting the below Information Operations and Analytics and Electromagnetic Spectrum Agility Areas:\n- Provide the Joint Force enhanced communications and situational awareness within the Area of Responsibility to disrupt and delay adversary forces from offensive operations \n- Counter adversary ability to use deceptive messaging to influence U.S. and Coalition operations\n- Develop capabilities to counter adversary command and control communications \n- Gain and attain access to spectrum for friendly forces, denying and\/or degrading spectrum to our adversaries\n- Conduct Electromagnetic (EM) deception operations to degrade an adversary's understanding of our intent and capability\n- Prevent the adversary from leveraging the EM domain to conduct operations in other domains (i.e., air, space, maritime, and land)\n- Achieve new effects in the electromagnetic spectrum domain to include directed energy and radio frequency disruption\n- Evaluate low-cost, efficient or innovative international capabilities"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This focus area shows a rise in funding from FY 2017\/FY 2018 into FY 2019. The reason for the increase is because, during the years of execution (FY 2017\/FY 2018), projects are selected, funded, and displayed individually in this R-2, thus reducing FY 2017\/FY 2018 funding in this focus area."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Logistics Focus Areas"
                                    },
                                    "Description": {
                                        "val": "FCT will invest in cross-domain, innovative force logistic technologies for new and emerging capabilities with international partners, including but not limited to these Defense-wide requirements that are consistent with strategic priorities: reducing soldier load, interoperability across platforms and systems, and energy solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.791"
                                            },
                                            "Text": {
                                                "val": "During FY 2017, FCT will focus on selecting projects supporting the below Force Logistics Areas:\n- Reducing soldier load reduces the weight currently sustained by the individual dismounted soldier, including materials that enable weight reduction to individual weapons, ammunition, or portable missile systems\n- Increasing interoperability across platforms and systems will invest into technologies for mission-based, on-demand routing, network, and information management, with a focus on command and control interoperability with coalition capabilities through integrated multi-level security enabled networks.  Transition of Modular Open Systems Approach (MOSA) capabilities which are portable, modular, partitioned, scalable, extendable, and secure\n- Improving energy solutions will include power systems and electronics designed for extreme cold to support arctic strategy and renewable energy options that can reduce force support and logistics requirements"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.034"
                                            },
                                            "Text": {
                                                "val": "During FY 2018, FCT will focus on selecting projects supporting the below Force Logistics Areas:\n- Reducing soldier load reduces the weight currently sustained by the individual dismounted soldier, including materials that enable weight reduction to individual weapons, ammunition, or portable missile systems\n- Increasing interoperability across platforms and systems will invest into technologies for mission-based on-demand routing, network, and information management, with a focus on command and control interoperability with coalition capabilities through integrated multi-level security enabled networks. Transition of MOSA capabilities which are portable, modular, partitioned, scalable, extendable, and secure\n- Improving energy solutions will include power systems and electronics designed for extreme cold to support arctic strategy and renewable energy options that can reduce force support and logistics requirements"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.300"
                                            },
                                            "Text": {
                                                "val": "During FY 2019, FCT will focus on selecting projects supporting the below Force Logistics Areas:\n- Reducing soldier load reduces the weight currently sustained by the individual dismounted soldier, including materials that enable weight reduction to individual weapons, ammunition, or portable missile systems\n- Increasing interoperability across platforms and systems will invest into technologies for mission-based on-demand routing, network, and information management, with a focus on command and control interoperability with coalition capabilities through integrated multi-level security enabled networks. Transition of MOSA capabilities which are portable, modular, partitioned, scalable, extendable, and secure\n- Improving energy solutions will include power systems and electronics designed for extreme cold to support arctic strategy and renewable energy options that can reduce force support and logistics requirements"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This focus area shows a rise in funding from FY 2017\/FY 2018 into FY 2019. The reason for the increase is because, during the years of execution (FY 2017\/FY 2018), projects are selected, funded, and displayed individually in this R-2, thus reducing FY 2017\/FY 2018 funding in this focus area."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Successful FCT’s can transition to acquisition via several ways: As a pre-engineering and manufacturing development prototype the item tested could be a technology upgrade insertion into a current platform or program providing greater capability or prolonging the life of the weapon system. If the item was a proof-of-principle prototype the testing results could lead to informed\/refined requirements generation providing better outcome for current planned U.S. system or could lead to a direct transition\/procurement should the item\/article provide a new capability."
                        },
                        "PerformanceMetrics": {
                            "val": "Strategic Goals Supported:\n- Develop and Demonstrate Proof-of-Principle prototypes that fill capability gaps.\n- Develop and Demonstrate Pre-EMD prototypes that address DoD strategic priorities.\n- Develop and Demonstrate a prototype that informs\/refines the acquisition process.\n\nMeasurable Outcomes:\n- FCTs will demonstrate capability objectives within 24-36 months.\n- In FY 2017, FCT had a transition rate of 70 percent for completed projects, exceeding the DoD Strategic Performance goal of 40 percent for demonstration programs."
                        }
                    }
                }
            ]
        }
    }
}