{
    "id": "2019-MissileDefenseAgency-PB-0400-MJBOOK-0-0-313df8b423016705249a66beda439e970c68289f03a0c6ebe21625e15b60ce28-15",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-MDA-U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603898C"
        },
        "ProgramElementTitle": {
            "val": "Ballistic Missile Defense Joint Warfighter Support"
        },
        "R1LineNumber": {
            "val": "82"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "120.395"
            },
            "PriorYear": {
                "val": "47.402"
            },
            "CurrentYear": {
                "val": "48.954"
            },
            "BudgetYearOne": {
                "val": "48.767"
            },
            "BudgetYearOneBase": {
                "val": "48.767"
            },
            "BudgetYearTwo": {
                "val": "53.418"
            },
            "BudgetYearThree": {
                "val": "51.448"
            },
            "BudgetYearFour": {
                "val": "54.076"
            },
            "BudgetYearFive": {
                "val": "54.061"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "N\/A"
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Warfighter Support Program (JWSP) is Missile Defense Agency's primary means for providing direct technical support to Combatant Commands (CCMDs), the Military Services and the Joint Staff on Ballistic Missile Defense System (BMDS) development, testing, and operational support, to include real world testing and validation of the warfighter's  operational Integrated Broadcast Service (IBS).  It enables delivery of BMDS capabilities to Warfighters and ensures their participation in identification and development of new Ballistic Missile Defense (BMD) capabilities via the Warfighter Involvement Process (WIP).  The JWSP allows the Warfighter and Missile Defense Agency to work together to identify gaps, seams, and needs in warfighting capability and enhance BMDS attributes by submitting modification and fielding requests.  It also provides 24 hours a day, 365 days a year BMD operational support to Warfighters worldwide.  The program enables rapid response to Warfighter Requests for Information (RFIs) and Requests for Analyses (RFAs), which are especially critical to mission success in protecting U.S. forces and other defended assets during \"Real World\" threat events. The program supports improving products delivered to Warfighters through technical reviews and technical analyses supporting strategic and regional BMD planning, development of shot doctrine and BMD defense design.   The JWSP also enables the inclusion of both CCMD and MDA BMD objectives in CCMD\/Joint Staff-sponsored wargames and exercises, which are used to sharpen and enhance joint BMD warfighting skills.    \n\nMD40 Program-Wide Support (PWS) consists of essential non-headquarters management efforts providing integrated and efficient support to MDA functions and activities across the entire BMDS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "47.776"
                },
                "CurrentYear": {
                    "val": "48.954"
                },
                "BudgetYearOne": {
                    "val": "49.524"
                },
                "BudgetYearOneBase": {
                    "val": "49.524"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "47.402"
                },
                "CurrentYear": {
                    "val": "48.954"
                },
                "BudgetYearOne": {
                    "val": "48.767"
                },
                "BudgetYearOneBase": {
                    "val": "48.767"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.374"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.757"
                },
                "BudgetYearOneBase": {
                    "val": "-0.757"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.374"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY 2017 Request for Additional Appropriations"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Missile Defeat and Defense Enhancement"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.757"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.757"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD03"
                    },
                    "ProjectTitle": {
                        "val": "Joint Warfighter Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "76.903"
                        },
                        "PriorYear": {
                            "val": "15.042"
                        },
                        "CurrentYear": {
                            "val": "15.394"
                        },
                        "BudgetYearOne": {
                            "val": "15.279"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.279"
                        },
                        "BudgetYearTwo": {
                            "val": "17.584"
                        },
                        "BudgetYearThree": {
                            "val": "16.021"
                        },
                        "BudgetYearFour": {
                            "val": "17.771"
                        },
                        "BudgetYearFive": {
                            "val": "16.872"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "There are six primary functions in Joint Warfighter Support (MD03):\n\n(1)\tCurrent Operations Support\n\n(2)\tCombatant Command Support\n\n(3)\tMilitary Department Engagement\n\n(4)\tOperational BMDS Verification and Validation\n\n(5)\tWarfighter Training Support\n\n(6)\tJoint Staff Engagement\n\nDetailed descriptions and accomplishments are provided in the following section"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Warfighter Integration"
                                    },
                                    "Description": {
                                        "val": "(1) Current Operations Support: \n- Manages and operates MDA Operations Support Center (OSC)24 hours a day, 365 days a year and two MDA Operations Centers (MOCs)\n in Virginia and Alabama daily execution of scheduled BMDS activities; prepares and transmits Logistic Reports.  \n- Manages and executes BMDS Asset Management (BAM) scheduling and execution process.\n- Leads MDA Operations Support Planning Team (OSPT), an MDA-wide task force supporting Warfighters, Services and the Joint\n  Staff to address real-world contingencies and crisis events.\n- Develops BMDS Annual Plan and BMDS Operating Schedule facilitating key stakeholder coordination and maximizing operational\n  availability of the BMDS; Develops and maintains the Integrated Scheduling Tool.  \n- Facilitates major software\/hardware additions to the Operational Capacity Baseline for homeland\/regional defenses.\n- Develops and maintains the BORRS application to collect and report BMDS operational availability and readiness data through\n  the network-based tool to distribute data to OSD, CCMDs, Joint Staff, Military Services, and BMDS Operators.\n- Provides certification training to BMDS watch officers (BWO), BMDS Safety Officers (BSO), and other Operations Support Center\n  staff.\n\n(2) Combatant Command Support (USSTRATCOM, USNORTHCOM): \n- Supports the Warfighter Involvement Process (WIP) and other MDA Warfighter engagement efforts by assisting Warfighters in their update to the annual BMDS Prioritized Capabilities List (PCL) and Modification and Fielding Request List (MFRL).\n- Supports Joint Functional Component Command Integrated Missile Defense (JFCC IMD) integration by participating in the Warfighter.\n  Forum (WFF); a multi-lateral information and decision event to address CCMD, Service and DoD BMDS equities\n- Assists USNORTHCOM in broadening homeland defense planning to address the full range of USNORTHCOM threats by conducting the\n  Homeland Defense Architecture Working Group (HDAWG) and Shot Management Analysis Cell (SMAC).  \n\n(3) Military Department Engagement: \n- Facilitates and coordinates Service Boards of Directors (BODs) on Lead Service BMDS related equities, POM development and execution;\n  and element fielding, operations and maintenance.\n- Maintains daily, strategic-level interfaces with Military Services and Joint Staff; plans for the delivery, fielding, and operation\n  of respective Lead Service BMDS capabilities via senior-level working groups, General Officer Air and Missile Defense and Space\n  forums. \n- Supports and provides the BMDS capability delivery process and transition and transfer to the Military Services through participation\n  in senior-level working groups, Joint staff directorates, and facilitates General Officer forums.\n\n(4) Operational BMDS Verification and Validation\n- Provides 24 hours a day, 365 days a year, global system verification and validation operational Integrated Broadcast Service, Common\n  Integrated Broadcast, and Shared Early Warning System for BMD early warning data.\n- Supports Tactical Data Processor software development, MDA flight tests and other software development efforts using live real-world\n  broadcasts of simulated missile threats.\n- Support Naval Board of Inspection and Survey (INSURV), Shipboard installation, Aegis On-Demand, Aegis program releases, US and\n  Coalition operational readiness and BMD Exercise requirements to validate equipment, materiel, and tactical readiness while\n  simultaneously providing deployment  certification and crew operator qualification; verifies operational readiness of both US\n  and Coalition partners to detect a real-world launch of a ballistic threat.\n\n(5) Warfighter Training Support: \n- Provides Missile Defense Space Warning tool (MDST) support to increase operator proficiency, competence, and confidence; providing\n  initial qualification training for BWOs and BMDS Safety Officers.\n- Provides technical and programmatic updates for BMD Warfighter training; participates in BMD training and Education Working Group to  coordinate BMD training issues with USSTRATCOM and Joint Staff \n- Supports Fleet Synthetic and Aegis Operator Training to ensure operational readiness of Aegis as the first step in the kill chain for BMD.\n- Provides Early Warning missile injects for all MT03 war games and exercises and tailored support for other Joint Warfighter Support Test.\n  events (as listed in IMTP v19.1 which is at a higher classification level).\n\n(6) Joint Staff Engagement\n- Facilitates and coordinates all Joint Staff interactions with the MDA.\n- Maintains daily, strategic-level interfaces with the Joint Staff.\n\nSpecific and\/or unique accomplishments to each FY are as follows:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.042"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.394"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- SEE ABOVE."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.279"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.279"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- SEE ABOVE."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603882C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Midcourse Defense Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1034.861"
                                        },
                                        "CurrentYear": {
                                            "val": "957.097"
                                        },
                                        "BudgetYearOne": {
                                            "val": "926.359"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "926.359"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1046.235"
                                        },
                                        "BudgetYearThree": {
                                            "val": "847.537"
                                        },
                                        "BudgetYearFour": {
                                            "val": "585.956"
                                        },
                                        "BudgetYearFive": {
                                            "val": "572.619"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603884C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Sensors"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "252.665"
                                        },
                                        "CurrentYear": {
                                            "val": "278.145"
                                        },
                                        "BudgetYearOne": {
                                            "val": "220.876"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "220.876"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "250.238"
                                        },
                                        "BudgetYearThree": {
                                            "val": "267.502"
                                        },
                                        "BudgetYearFour": {
                                            "val": "263.758"
                                        },
                                        "BudgetYearFive": {
                                            "val": "260.273"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603890C"
                                    },
                                    "Title": {
                                        "val": "BMD Enabling Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "435.203"
                                        },
                                        "CurrentYear": {
                                            "val": "465.642"
                                        },
                                        "BudgetYearOne": {
                                            "val": "540.926"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "540.926"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "542.326"
                                        },
                                        "BudgetYearThree": {
                                            "val": "608.210"
                                        },
                                        "BudgetYearFour": {
                                            "val": "489.637"
                                        },
                                        "BudgetYearFive": {
                                            "val": "496.313"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603895C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense System Space Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.910"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603896C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Command and Control, Battle Management & Communication"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "465.433"
                                        },
                                        "CurrentYear": {
                                            "val": "454.862"
                                        },
                                        "BudgetYearOne": {
                                            "val": "475.168"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "475.168"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "515.239"
                                        },
                                        "BudgetYearThree": {
                                            "val": "494.873"
                                        },
                                        "BudgetYearFour": {
                                            "val": "492.119"
                                        },
                                        "BudgetYearFive": {
                                            "val": "515.529"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603904C"
                                    },
                                    "Title": {
                                        "val": "Missile Defense Integration and Operations Center (MDIOC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "53.483"
                                        },
                                        "CurrentYear": {
                                            "val": "53.265"
                                        },
                                        "BudgetYearOne": {
                                            "val": "54.925"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "54.925"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "58.498"
                                        },
                                        "BudgetYearThree": {
                                            "val": "57.764"
                                        },
                                        "BudgetYearFour": {
                                            "val": "59.020"
                                        },
                                        "BudgetYearFive": {
                                            "val": "61.915"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Joint National Integration Center Research and Development Contract \/ Integrated Research and Development for Enterprise Solutions Contract is the major performing integrated contract and was recompeted in FY 2017. The acquisition strategy for Strategic Warfighter Integration mission execution is to employ a contract to perform designated integration and sustainment tasks to conduct BMDS Research, Development, Test and Evaluation (RDT&E). Strategic Warfighter Integration is operated by missile defense subject matter experts composed of Government, military, civilian personnel, Contract Support Services, and major defense contractors."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Funding in the All Prior Years column represents a summary of Prior Years Total Costs for active contracts, Military Interdepartmental Purchase Requests, and civilian salaries on the R-3."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration - Strategic Warfighter Integration -  HR A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MiDAESS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.279"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.143"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.147"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.125"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.125"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration - Strategic Warfighter Integration -  IC A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MiDAESS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.444"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.232"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration - Strategic Warfighter Integration - Administrative A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MiDAESS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.146"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.116"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.252"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.190"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.190"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration - Strategic Warfighter Integration - Civilian Salaries\/Operations Sustainment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs\/Huntsville, NCR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "26.616"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.123"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.205"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.158"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.158"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration - Strategic Warfighter Integration - Current Operations"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JRDC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.607"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.162"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.056"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.470"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.470"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration - Strategic Warfighter Integration - IT Wireless Services (JRDC\/IRES)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JRDC\/IRES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, Huntsville"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.683"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.582"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration - Strategic Warfighter Integration - MDST"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JRDC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.525"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.588"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.180"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.450"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration - Strategic Warfighter Integration - Travel and Training"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, Huntsville, NCR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.932"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.225"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.231"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.231"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration - Strategic Warfighter Integration - Warfighter Support A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MiDAESS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, Huntsville, NCR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.671"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.896"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.799"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.125"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.125"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "Test_131618958636405305.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Strategic Integration Wargame Events in support of MT03"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MT03"
                    },
                    "ProjectTitle": {
                        "val": "Joint Warfighter Support Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "32.199"
                        },
                        "PriorYear": {
                            "val": "30.424"
                        },
                        "CurrentYear": {
                            "val": "31.206"
                        },
                        "BudgetYearOne": {
                            "val": "31.142"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.142"
                        },
                        "BudgetYearTwo": {
                            "val": "33.352"
                        },
                        "BudgetYearThree": {
                            "val": "32.940"
                        },
                        "BudgetYearFour": {
                            "val": "33.616"
                        },
                        "BudgetYearFive": {
                            "val": "34.564"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Joint Warfighter Support Test is comprised of two primary responsibilities:  wargames and exercises and warfighter operational support.\n\nWargames and exercises: \n-Support the Warfighter to plan and conduct worldwide wargames and exercises supporting BMDS development and fielding.\n-Enable the Warfighter to define, test, deploy, and employ new missile defense capabilities.\n-Support JFCC-IMD BMDS table top exercises to facilitate the global missile defense capability and to refine the European capability concept of operations through low-fidelity demonstration Models & Simulation (M&S).\n-Examine current and future BMDS operational capabilities for Geographic (i.e., USCENTCOM, USEUCOM, and USPACOM) and Strategic (i.e., USNORTHCOM and USSTRATCOM) Combatant Commands (CCMDs).\n-Complete test planning for BMDS events. \n\nWarfighter operational support (program planning and operations):\n-Prepare MDA senior leadership for engagements with the Geographic Combatant Commands (GCCs) by providing logistical support and developing briefings for the GCC Assistant Test Directors (ATDs) and MDA Director.\n-Interface with the GCCs on BMD operational issues by providing planning and analysis support and capturing\/transmitting warfighter responses in the MDA RFI\/RFA database.\n-Support GCC contingency activation planning for real-world contingencies and theater security cooperation programs by supervising the activation of MDA assets to use in the operational BMDS.\n-Aid GCC participation in BMDS capability definition, design, development, integration, and delivery processes through the Warfighter Involvement Process (WIP) to synchronize capability delivery with operational readiness and acceptance.\n-Provide resource management and administration of MT03 personnel and funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Wargames and Exercises"
                                    },
                                    "Description": {
                                        "val": "The Missile Defense Agency will continue to focus on providing operational-level interfaces to the Global Combatant Commands (GCCs) and increasing Warfighter participation to develop future missile defense capabilities. \nThe MDA will continue to enhance Warfighter operational support through internal support activities and proactive execution of Combatant Command (CCMD) interface activities.\n- Work with CCMDs on the inclusion of Allies and regional partners into MDA Ground and Flight tests, and wargame & exercise simulations.\n- Provide warfighter training simulations in direct support of flight and ground tests.\n- Serve as liaison between internal MDA organizations and the Joint Functional Component Commander for Integrated Missile Defense (JFCC-IMD) across all functional areas to facilitate Geographic Combatant Command (GCC) participation in the BMDS capability definition, design, development, integration and delivery processes.\n- Support JFCC IMD and EUCOM in the European Phased Adaptive Approach (EPAA) implementation process through the planning, testing, integration and execution of BMDS wargames and exercises.\n- Support Joint Staff integration of MDA models into Tier I events through the JOINT, LIVE VIRTUAL CONSTRUCTIVE (JLVC) campaign.\n- Work with Program Offices and the Warfighter; publish a Concept of Operations that will support future MDA Models and Simulation (M&S) support to BMD wargames and exercises.\n- Coordinate and integrate CCMD requirements into the BMDS Integrated Master Test Plan.\n- Support the GCC Assistants to the Director (ATDs) and Liaison Officers (LNOs).\n- Provide support to the development and update of Ballistic Missile Defense (BMD) portions of CCMD Operation Plans (OPLANS) and Contingency Plans (CONPLANS).\n- Engage in MDA\/GCC interface and synchronization of information regarding capabilities and security cooperation strategies.\n- Develop and provide Wargames, Exercises and Table Top Exercises (TTX) in support of CCMD-specific scenarios as listed in the R4-4A schedule for the EUCOM, PACOM, CENTCOM and NORTHCOM\/STRATCOM Geographic Combatant Commands. \n \nAdditional GCC interface activities by region will include: \nUSEUCOM Engagement: \n- Coordinate with USEUCOM for continued MDA support of key European Phased Adaptive Approach milestones in order to provide a full range of BMDS capabilities addressing ballistic missile threats to the European theater. \n- Work with USEUCOM to include NATO Allies and regional partners during MDA Ground tests, Flight tests, Wargames, and Exercises in order to improve Allied - US BMDS interoperability.   \n- Coordinate with MDA program elements to facilitate rapid agency responses to USEUCOM requests for analysis and information.  Provide reach-back support for the MDA ATD and LNO in USEUCOM for activities requiring visibility by the MDA Director and Director for Test. \n- Coordinate with MDA Global Deployment Program Office to plan and execute actions required for deployment of BMDS assets in the USE\n\nUSCENTCOM Engagement:\n- Promote CCMD leadership in developing a regional partner data sharing system supporting USCENTCOM regional IAMD architecture development.\n- Coordinate with MDA program elements, assisting in planning and execution activities supporting USCENTCOM's regional partners. \n\nUSPACOM Engagement:\n- Assist USPACOM leadership in broadening Phased Adaptive Approach planning to address a full range of threats and integration of allies into the BMDS. \n- Support USPACOM J3 in efforts to promote purchase of an Aegis Ashore system.\n- Share operational information and knowledge and help allies develop common operational procedures.\n\nSpecific and\/or unique accomplishments to each FY are as follows:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.161"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- SEE ABOVE"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.893"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.893"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- SEE ABOVE"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program, Planning and Operations"
                                    },
                                    "Description": {
                                        "val": "MDA will continue to focus on providing operational-level interface to the GCCs and increasing Warfighter participation in the development of future missile defense capabilities. The key Warfighter interface activities include:\nMDA Operational Support:\n- Support the Operations Support Planning Team (OSPT) activation during heightened period of interest.\n- Support Warfighters, DoD Agencies, and Military Services in identifying desired missile defense capabilities and characteristics.  \n- Obtain Warfighter participation and advice on desired operational features and approaches to system fielding throughout development.\n- Track analysis and responses for CCMD Requests for Analysis (RFA) and Requests for Information (RFI).\n- Serve as the immediate link between MDA and the GCCs on all Warfighter activities and requirement.\n- Prepare MDA senior leadership for U.S. Army, Navy, and Air Force BOD meetings and AMD General Officer Steering Committee meetings.\n- Provide resource management and administration of BMDS Warfighter personnel and budget.\n- Manage travel, including travel to support the wargames and exercises and the Assistant to the Director (ATDs) and Liaison Officer (LNOs) as MDA representatives at the GCC HQs.\nSpecific and\/or unique accomplishments to each FY are as follows:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.937"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.045"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- SEE ABOVE"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- SEE ABOVE"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2018 to FY 2019 decrease reflects need for additional funding in war games and exercises to support the robust IMTP schedule."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In order to optimize the performance of the Ballistic Missile Defense System, MDA leverages Defense Department executive agents as well as the MDA Joint National Integration Center Research and Development (JRDC) contract. \n\nThe executing agents utilize various contracting strategies in a flexible manner to maximize their contribution to the BMDS. Products and Services will be acquired by competitive means to the extent that is possible and practical.\n\nIn 2017, the MDA JRDC contract was recompeted and called the Integrated Research and Development for Enterprise Solutions (IRES)."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Prior year funding was captured in MD03 budget project."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Wargames and Exercises - Combatant Commanders (COCOM) Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JRDC\/MIPR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, Huntsville, NCR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.240"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "18.443"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "16.976"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "18.564"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "18.564"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Wargames and Exercises - Wargame Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JRDC\/MIPR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.818"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.044"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.185"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.329"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.329"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program, Planning and Operations  - Civilian Salaries\/Operations Sustainment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, Huntsville, NCR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.343"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.972"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.811"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.202"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.202"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program, Planning and Operations  - Combatant Commanders (COCOM) Support A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MiDAESS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, Huntsville, NCR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.049"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.998"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.227"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.982"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.982"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program, Planning and Operations  - Government Travel & Training"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, Huntsville, NCR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.650"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.580"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.792"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.780"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.780"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program, Planning and Operations  - Support to MDA Leadership A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MiDAESS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, Huntsville, NCR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.099"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.387"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.215"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.285"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.285"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "Test_131618958637341305.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "IMTP v19.1 war game and exercise event details are at a higher classification."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MC03"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Operations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.152"
                        },
                        "BudgetYearOne": {
                            "val": "0.154"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.154"
                        },
                        "BudgetYearTwo": {
                            "val": "0.156"
                        },
                        "BudgetYearThree": {
                            "val": "0.159"
                        },
                        "BudgetYearFour": {
                            "val": "0.161"
                        },
                        "BudgetYearFive": {
                            "val": "0.164"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.946"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project MC03 is the Defensive Cyber Operations Project established in this Program Element (PE) during PBR 2018. Funds were previously reported in Project MD03 of this PE."
                        },
                        "ProjectMissionDescription": {
                            "val": "The funds in this project are required to verify and validate that cybersecurity and\/or cybersecurity-enabled products (firewalls, data\/network encryption devices, routers, Intrusion Detection Systems, etc.) used within the MDA infrastructure have a current and Evaluated Assurance Level (EAL) certification and rating. They assure that validated IT products are listed on the DOD Approved Products List (APLITS). There is an additional requirement to routinely identify findings and prepare a report with recommendations. The Warfighter Strategic Integration directorate (DDW) requires this support in the IT product evaluation provided. Activities in the Project are necessary to comply with the Federal Information Systems Modernization Act of 2014 (FISMA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Warfighter Integration Software Assurance Support"
                                    },
                                    "Description": {
                                        "val": "Perform manual and automated software code analysis, using GFE tools (e.g. Fortify 360), to detect false positives, weaknesses, and vulnerabilities.\n1) Verify and validate cybersecurity and\/or cybersecurity-enabled products (firewalls, data\/network encyptors, routers, Intrusion Detection Systems, etc.) used within the MDA infrastructure have a current and Evaluated Assurance Level (EAL) certification and rating. Validate IT products are listed on the DoD Approved Products List (APLITS). \n2) Participate in meetings with customers to review software analysis findings and proposed courses of action for remediation.\n3) Prepare a comprehensive report detailing the weaknesses and vulnerabilities found. Document the references to files and line numbers.\n4) Maintain a record of all software code analysis documentation and organized in accordance with Government policy.\nSpecific and\/or unique accomplishments to each FY are as follows:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.152"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- SEE ABOVE."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.154"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.154"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- SEE ABOVE."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Strategic Warfighter Integration Software Assurance Support - DDW Cyber Support (ICVA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TEAMS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COS"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.152"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.154"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.154"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "Test_131618958638277305.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "MC03 Cyber Operations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.293"
                        },
                        "PriorYear": {
                            "val": "1.936"
                        },
                        "CurrentYear": {
                            "val": "2.202"
                        },
                        "BudgetYearOne": {
                            "val": "2.192"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.192"
                        },
                        "BudgetYearTwo": {
                            "val": "2.326"
                        },
                        "BudgetYearThree": {
                            "val": "2.328"
                        },
                        "BudgetYearFour": {
                            "val": "2.528"
                        },
                        "BudgetYearFive": {
                            "val": "2.461"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Program Wide Support reflects proportional changes as a result of budget changes in the Ballistic Missile Defense Joint Warfighter Support program element.\nFunding in the All Prior Years column represents a summary of Prior Years Total Costs for active contracts, Military Interdepartmental Purchase Requests on the R-3."
                        },
                        "ProjectMissionDescription": {
                            "val": "PWS contains non-headquarters management costs in support of MDA functions and activities across the entire BMDS. It Includes Government Civilians and Contract Support Services.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes Global Deployment personnel and support performing deployment site preparation and activation, and provides facility capabilities for MDA Executing Agent locations. Other MDA wide costs includes: physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office, equipment, vehicle, and warehouse leases; utilities and base operations; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. PWS is allocated on a pro-rata basis and therefore, fluctuates by year based on the adjusted RDT&E profile (which excludes: 0305103C Cyber Security Initiative, 0603274C Special Programs, 0603913C Israeli Cooperative Program and 0901598C Management Headquarters)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Wide Support"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.936"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.192"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.192"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Facilities and Maintenance (MIPR)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multi: AK, AL,CA, CO, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.200"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Operations Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Multi: AL, CO, CA, VA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.808"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.039"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.044"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.033"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.033"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Operations and Support Civilian Salaries, Travel, Training"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multi:AK,AL, CA, CO, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.606"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.464"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.060"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Operations and Support Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ALATEC , INC,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AL, CO, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.422"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.433"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.461"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Operations and Support Services (Reqn)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Reqn"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multi:AK, AL, CA, CO, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.397"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.099"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.099"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Operations and Support, International, and Materiel and Readiness"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Naval Surface Warfare Center; VA, AL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.257"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - FFRDC\/UARC"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multi: AL, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "Test_131618958639057305.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "MD40 Program-Wide Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}