{
    "id": "2019-ChemicalandBiologicalDefenseProgram-PB-0400-MJBOOK-0-0-010e4e94f93bf78b525179782a54679624cab07b5b677513955cf87f618c1b5b-5",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-CBDP-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (RDT&E MGT SUPPORT)"
        },
        "R1LineNumber": {
            "val": "151"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "89.172"
            },
            "CurrentYear": {
                "val": "104.348"
            },
            "BudgetYearOne": {
                "val": "102.883"
            },
            "BudgetYearOneBase": {
                "val": "102.883"
            },
            "BudgetYearTwo": {
                "val": "107.245"
            },
            "BudgetYearThree": {
                "val": "108.834"
            },
            "BudgetYearFour": {
                "val": "107.215"
            },
            "BudgetYearFive": {
                "val": "107.572"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Budget Activity includes research, development, testing and evaluation management support for the Department of Defense (DoD) Chemical and Biological Defense Program (CBDP).\n\nProgram Element 0605384BP supports Joint Doctrine and Training (Project DT6), sustains the technical test capability at West Desert Test Center (WDTC) (Project DW6); sustains the core Department of Defense (DoD) Science and Technology (S&T) laboratory infrastructure (Project LS6), provides for program management and financial management support (Project MS6), and supports the Joint Concepts, Studies, and Analysis (JCSA) program (Project O49).  \n\nThe Joint Training and Doctrine Support (DT6) project supports the development of Joint Doctrine and Tactics, Techniques, and Procedures (TTPs) for developing CB defense systems.  This project also supports CB modeling and simulation to support the Warfighter.\n\nThe Major Range and Test Facility Base (MRTFB) is a set of test installations, facilities, and ranges which are regarded as \"national assets\".  These assets are sized, operated, and maintained primarily for DoD test and evaluation missions.  However, the MRTFB facilities and ranges are also available to commercial and other users on a reimbursable basis.  WDTC is designated as the primary element of the MRTFB to primarily conduct CB Defense test and evaluation.  The DW6 Project provides operating support to WDTC and BTB-ECBC, also part of the MRTFB, to ensure that DoD test customers are only charged direct costs of testing and that overhead expenses are centrally funded.  It finances the required institutional test operating costs.  Institutional test operating costs include institutional civilian and contractor labor; repair and maintenance of test instrumentation, equipment, and facilities; and replacement of test equipment.\n\nThe Laboratory Support (LS6) project includes laboratory infrastructure to maintain and enhance DoD infrastructure capabilities to counter an expanding threat space, exploit advances in technology; and develop and transition CB defense equipment and countermeasures to the Warfighter.\n\nThe management support (MS6) project, provides management support for the DoD CBDP to allow program overview and integration of overall medical and non-medical programs by the Assistant Secretary of Defense for Nuclear, Chemical, and Biological Defense Programs (ASD(NCB)), through the Deputy Assistant Secretary of Defense for Chemical Biological Defense Programs (DATSD(CBD)); funds management by the Defense Threat Reduction Agency (DTRA); Development, coordination, and approval of joint CBRND requirements, management of multi-service and joint CBRND doctrine, tactics, techniques and procedures; training, leader development, education, exercises, and development of the CBDP Program Objective Memorandum (POM) by the Joint Requirements Office; Joint RDA planning, input to the Annual Report to Congress and Program Objective Memorandum (POM) development by the Program Analysis and Integration Office (PAIO); review of Joint plans and the consolidated CB Defense POM Strategy by Army in its Executive Agent role.  \n\nThe management support project also includes the Test and Evaluation (T&E) Executive mission to establish test infrastructure investment strategy and adequate testing for Developmental Testing (DT) and Operational Testing (OT) of Department of Defense (DoD) Chemical Biological Defense (CBD) systems and components throughout the systems' acquisition life cycle, as required in the RDA Plan under the Joint Test Infrastructure Working Group (JTIWG) program.  The JTIWG program includes T&E Early Involvement, test threat planning, Fielded Equipment Assessments, T&E studies, and T&E Standards planning and development to support testing the CBD systems for all services to include radiological, nuclear, medical T&E efforts.  \n\nThe Joint Concepts, Studies, and Analysis (JCSA) program (Project O49) project supports the planning, conduct, evaluation, and reporting on Joint tests (for other than developmental hardware) and accomplishment of operational research assessments in support of requirements received from the Services and the Combatant Commanders for already fielded equipment and systems.\n\nThis Budget Activity also provides for Program Element 0605502BP, which supports the Small Business Innovative Research (SBIR) program.  The overall objective of the CBD SBIR program is to improve the transition or transfer of innovative CBD technologies between DoD components and the private sector for mutual benefit.  The CBD program includes those technology efforts that maximize a strong defensive posture in a CB environment using passive and active means as deterrents.  These technologies include CB detection; information assessment (identification, modeling, and intelligence); contamination avoidance; and protection of both individual soldiers and equipment.\n\nThe FY 2019 funding request was reduced by $5.573 million to account for the availability of prior year execution balances."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "85.754"
                },
                "CurrentYear": {
                    "val": "104.348"
                },
                "BudgetYearOne": {
                    "val": "103.954"
                },
                "BudgetYearOneBase": {
                    "val": "103.954"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "89.172"
                },
                "CurrentYear": {
                    "val": "104.348"
                },
                "BudgetYearOne": {
                    "val": "102.883"
                },
                "BudgetYearOneBase": {
                    "val": "102.883"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.418"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.071"
                },
                "BudgetYearOneBase": {
                    "val": "-1.071"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5.217"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.799"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.071"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.071"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY17 (+$3.914M): Program reprogrammings to support high priority CBDP efforts.\nFY17 (+$1.303M): Program reprogrammings to support CBDP Defense Finance and Accounting System transactions.\nFY17 (-$1.799M): Transfer of funding to support Small Business Innovative Research\/Small Business Technology Transfer efforts.\nFY19 (-$0.264M): Application of revised inflation guidance.\nFY19 (-$5.573M): Reduction to account for the availability of prior year execution balances.\nFY19 (+$4.766M): Program adjustments to balance overall portfolio efforts.\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DT6"
                    },
                    "ProjectTitle": {
                        "val": "JOINT DOCTRINE AND TRAINING SUPPORT (RDT&E MGT SUPPORT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.262"
                        },
                        "CurrentYear": {
                            "val": "3.600"
                        },
                        "BudgetYearOne": {
                            "val": "3.600"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.600"
                        },
                        "BudgetYearTwo": {
                            "val": "3.600"
                        },
                        "BudgetYearThree": {
                            "val": "3.600"
                        },
                        "BudgetYearFour": {
                            "val": "3.600"
                        },
                        "BudgetYearFive": {
                            "val": "3.600"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The activities of this project directly support the Joint Service CB defense program; in particular, the development of Joint Chemical, Biological, Radiological, and Nuclear (CBRN) defense capability requirements and the improvement of CBRN defense related doctrine, education, training, and awareness at the Joint and Service levels.  This effort provides for: (1) Development, coordination, and integration of Joint CBRN defense capability requirements; (2) Development\/revision of medical and non-medical CBRN defense Multi-Service Tactics, Techniques, and Procedures (MTTP) and development\/revision of Joint Doctrine and Tactics, Techniques, and Procedures (JTTP); (3) The CBDP Joint Senior Leader Course (JSLC); (4) Assistance in correcting training and doctrine deficiencies covered in the lessons learned process, combat operations, capability development studies and Department of Defense Inspector General (DODIG) and Government Accountability Office (GAO) reports and; (5) Support of current and planned CBRN defense studies, analysis, training, exercises, and war games; determine overlaps, duplication, and shortfalls; and build and execute programs to correct shortfalls in all aspects of CBRN defense across all DoD mission areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JRO DT"
                                    },
                                    "Description": {
                                        "val": "The purpose of this requirement is to provide technical and subject matter expert (SME) support in the areas of: related Chemical, Biological, Radiological, and Nuclear Defense (CBRND)\/Countering Weapons of Mass Destruction (CWMD); Joint and Multi-Service doctrine development; Joint and Service training, leadership development, education, and exercises. \n\nSpecifically, support is needed to:\n1.  Conduct technical reviews of Joint and Multi-service CBRN Defense\/CWMD doctrinal materials and develop CBRND\/CWMD related MTTP manuals.\n2.  Plan and conduct CBRN defense\/CWMD Joint Professional Military Education (JPME).\n3.  Provide CBRN defense\/CWMD planning, execution and SME support to Combatant Command (CCMD) and Joint Task Force (JTF) level exercises.\n4.  Conduct staff and leader CBRN defense\/CWMD training for CCMD and JTF level commands.\n\nProvides support to the National Defense University (NDU) Center for the Study of Weapons of Mass Destruction (WMD) to support their efforts as the Chairman's focal point for CWMD JPME."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.262"
                                            },
                                            "Text": {
                                                "val": "Supported Joint and Multi-service doctrine development.  This included preparation of various Joint publications which then inform MTTPs.  Continued to support COCOM scenario development and controller\/evaluator training by providing SMEs to exercises.  Continued to support training efforts at various Joint Senior Leadership schools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.600"
                                            },
                                            "Text": {
                                                "val": "Support Joint and Multi-service doctrine development.  This includes preparation of various Joint publications which then inform MTTPs.  JRO will continue to support COCOM scenario development and controller\/evaluator training by providing SMEs to exercises.  JRO will continue to support training efforts at various Joint Senior Leadership schools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.600"
                                            },
                                            "Text": {
                                                "val": "Support Joint and Multi-service doctrine development.  This includes preparation of various Joint publications which then inform MTTPs.  Continue to support COCOM scenario development and controller\/evaluator training by providing SMEs to exercises.  Continue to support training efforts at various Joint Senior Leadership schools."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW6"
                    },
                    "ProjectTitle": {
                        "val": "MAJOR RANGE AND TEST FACILITY BASE (MRTFB)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "49.017"
                        },
                        "CurrentYear": {
                            "val": "53.164"
                        },
                        "BudgetYearOne": {
                            "val": "54.056"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.056"
                        },
                        "BudgetYearTwo": {
                            "val": "55.486"
                        },
                        "BudgetYearThree": {
                            "val": "56.574"
                        },
                        "BudgetYearFour": {
                            "val": "56.310"
                        },
                        "BudgetYearFive": {
                            "val": "56.666"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project provides the technical and operational capability for testing Department of Defense (DoD) Chemical and Biological (CB) and Non Traditional Agent (NTA) defense materiel, equipment, and systems from concept through production to include associated special operations Tactics, Techniques, and Procedures Development (TTPD) activities at West Desert Test Center (WDTC), and the Biological Test Branch of the Edgewood Chemical and Biological Center (BTB-ECBC), both part of the Major Range and Test Facility Base (MRTFB) located at Dugway Proving Ground (DPG).  Project provides overhead (institutional) funding required to operate WDTC and BTB-ECBC in compliance with Section 232 of the National Defense Authorization Act (NDAA) for FY03 (Public Law 107-314 - December 2002).\n\nWDTC and BTB-ECBC are the reliance centers for all DoD CB defense testing and provide the United States' only combined range, chamber, toxic chemical lab, and bio-safety level-3 (BSL-3) test facility.  Total institutional test operating costs are to be provided by the OSD Chemical and Biological Defense Program IAW Program Budget Decision 250 (1996).\n\nWDTC and BTB-ECBC use state-of-the-art chemical and life sciences test facilities and test chambers to perform CB defense testing of protective gear, decontamination systems, detectors, equipment, and non-materiel CB defense solutions while maintaining safety, security, and surety of chemical agents and biological pathogens.  WDTC also provides test ranges, to include fully instrumented outdoor ranges, for TTPD activities and testing with simulants that can be correlated to the laboratory testing with live agents to ensure reliable and repeatable data is generated to support acquisition decisions of CB defense equipment.\n\nThe Secretary of the Army has been directed to conduct additional research addressing existing gaps in scientific knowledge encompassing the Biological Select Agents and Toxins (BSAT) Program.  The transition of the Bio-Testi Branch (BTB) to Edgewood Chemical Biological Center (ECBC) will enable the DoD BSAT Biosafety Program to meet end to end enterprise tracking, reporting, and auditability requirements within an approved Governance, Risks, and Compliance framework.  The laboratory commanders and directors are best able to identify potential risk through the use of local risk assessments and are responsible to promote cultures of safety and responsibility.  Direct liaison with and oversight by the Executive Agent Responsible Officer will ensure laboratory directors or MRTFB commander are empowered and supported in their operational environment.  The ultimate responsibility for the safe and secure receipt, storage, handling, shipment and transfer of BSAT resides with the laboratory director or MRTFB commander in accordance with Army, Navy, Air Force, and Federal policies and regulations.  The implementation of a structured BSAT Biosafety Program includes clear standards and procedures, policy and regulations, peer review, quality control, accountability and oversight, adequate resources and infrastructure, and continuous process improvement.  Through these means employees and members of the public are protected against the hazards associated with BSAT."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) BTB TEST - Civilian Labor"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.188"
                                            },
                                            "Text": {
                                                "val": "Maintain BTB-ECBC, MRTFB technical test capability and operations to include institutional civilian labor costs.  These civilian personnel will ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.133"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.133"
                                            },
                                            "Text": {
                                                "val": "Maintain BTB-ECBC, MRTFB technical test capability and operations to include institutional civilian labor costs.  These civilian personnel will ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) BTB TEST - LSTF 24-Hour Support"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "Provide dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as, test specific heating, ventilation, and air conditioning (HVAC) systems and decontamination systems within Life Sciences Test Facility (LSTF) Complex"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Provide dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as, test specific heating, ventilation, and air conditioning (HVAC) systems and decontamination systems within Lother Solomon Test Facility (LSTF) Complex and the Baker Lab."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) BTB TEST - Sustainment"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Provides for ongoing sustainment of existing test instrumentation and equipment at BTB-ECBC, in support of their operations.  Support annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.412"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.412"
                                            },
                                            "Text": {
                                                "val": "Provides for ongoing sustainment of existing test instrumentation and equipment at BTB-ECBC, in support of their operations.  Support annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems.  Also provides for additional office and laboratory equipment required for the inspection and certification for Building 2029 Lother Solomon Test Facility (LSTF) Annex."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) BTB TEST - Support"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Support the BTB-ECBC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation.  Will provide the additional support through contractual efforts to support variable workload rates and address capacity shortfalls created by civilian authorization limits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Support the BTB-ECBC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation.  Will provide the additional support through contractual efforts to support variable workload rates and address capacity shortfalls created by civilian authorization limits."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) WDTC, MRTFB - Civilian Labor"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.770"
                                            },
                                            "Text": {
                                                "val": "Maintained WDTC\/ECBC-BTB technical test capability and operations to include institutional civilian labor costs.  These civilian personnel ensured the safe and efficient operations of the MRTFB which included safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.504"
                                            },
                                            "Text": {
                                                "val": "Will maintain WDTC technical test capability and operations to include institutional civilian labor costs.  These civilian personnel will ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.306"
                                            },
                                            "Text": {
                                                "val": "Will maintain WDTC technical test capability and operations to include institutional civilian labor costs.  These civilian personnel will ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) WDTC, MRTFB - Sustainment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.994"
                                            },
                                            "Text": {
                                                "val": "Provided for ongoing sustainment of existing test instrumentation and equipment at WDTC\/ECBC-BTB in support of their operations.  Supported annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.828"
                                            },
                                            "Text": {
                                                "val": "Provide for ongoing sustainment of existing test instrumentation and equipment at WDTC,in support of their operations.  Support annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "Will provide for ongoing sustainment of existing test instrumentation and equipment at WDTC in support of their operations.  Will support annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) WDTC, MRTFB - Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.919"
                                            },
                                            "Text": {
                                                "val": "Provided WDTC\/ECBC-BTB with a dedicated and specially trained 24-hour support staff to operate and maintain all critical control systems such as test specific HVAC systems and decontamination systems within WDTC's Material Test Facility (MTF), Combined Chemical Test Facility (CCTF), and Life Sciences Test Facility (LSTF) Complex."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.016"
                                            },
                                            "Text": {
                                                "val": "Will provide WDTC with a dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as, test specific HVAC systems and decontamination systems within WDTC's MTF, and CCTF."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.946"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.946"
                                            },
                                            "Text": {
                                                "val": "Will provide WDTC with a dedicated and specially trained 24-hour support staff to operate and maintain all critical control systems such as test specific HVAC systems and decontamination systems within WDTC's MTF and CCTF."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) WDTC, MRTFB - Contractor Labor, Overhead"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.417"
                                            },
                                            "Text": {
                                                "val": "Supported the WDTC\/ECBC-BTB defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation.  Provided the additional support through contractual efforts to support variable workload rates and address capacity shortfalls created by civilian authorization limits."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.508"
                                            },
                                            "Text": {
                                                "val": "Will support the WDTC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation.  Will provide the additional support through contractual efforts to support variable workload rates and address capacity shortfalls created by civilian authorization limits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.540"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.540"
                                            },
                                            "Text": {
                                                "val": "Will support the WDTC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation.  Will provide the additional support through contractual efforts to support variable workload rates and address capacity shortfalls created by civilian authorization limits."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) NON-TRADITIONAL AGENT (NTA) TEST"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.917"
                                            },
                                            "Text": {
                                                "val": "Maintained synthesis capability of Class 1 NTA compounds and other NTA classes in support of program of record test and evaluation.  Developed NTA test methods for uniform materials and protective masks.  Developed chemical dissemination and challenge monitoring methods for other NTA classes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.020"
                                            },
                                            "Text": {
                                                "val": "Will maintain synthesis capability of Class 1 NTA compounds and other NTA classes in support of program of record test and evaluation.  Will develop NTA test methods for uniform materials and protective masks.  Will develop chemical dissemination and challenge monitoring methods for other NTA classes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.019"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.019"
                                            },
                                            "Text": {
                                                "val": "Will develop NTA test methods for uniform materials and protective masks.  Will upgrade large and small filter test infrastructure to accommodate NTA compounds.  Will assess existing decontamination test infrastructure to accommodate NTA testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "LS6"
                    },
                    "ProjectTitle": {
                        "val": "LABORATORY SUPPORT"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.150"
                        },
                        "CurrentYear": {
                            "val": "13.864"
                        },
                        "BudgetYearOne": {
                            "val": "13.537"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.537"
                        },
                        "BudgetYearTwo": {
                            "val": "12.844"
                        },
                        "BudgetYearThree": {
                            "val": "13.101"
                        },
                        "BudgetYearFour": {
                            "val": "13.108"
                        },
                        "BudgetYearFive": {
                            "val": "13.107"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (LS6\/Laboratory Support) provides for the sustainment and modernization of the DoD laboratory infrastructure capabilities to counter an expanding threat space, exploit advances in technology, and develop and transition chemical and biological (CB) defense equipment and countermeasures to the Warfighter.  This laboratory infrastructure project upgrades key systems to the current state-of-the-art capabilities.  Key systems include: gas filters, mechanical\/electrical, fume hoods, duct work and structural systems.  Provides for the initial equipment outfitting of new facilities.  Ensures that the necessary surety operations can be conducted effectively and safely in support of Chemical and Biological Defense Program (CBDP) RDT&E programs.  As a force multiplier, this project will provide more robust capabilities to the CBDP and ensure continuity of operations and environmental compliance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) LABINF - Edgewood Chemical Biological Center Surety Facility Sustainment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.650"
                                            },
                                            "Text": {
                                                "val": "Performed general facility sustainment and modernization in key surety facilities that supported the CBDP.  Provided gas filter maintenance and change out, sustainment of critical laboratory systems (fume hoods, exhaust systems, control systems, electrical\/mechanical systems, plumbing, emergency backup power), and modernization of key chemical and biological surety laboratories."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.264"
                                            },
                                            "Text": {
                                                "val": "Perform general facility sustainment and modernization in key surety facilities that support the CBDP.  Provides for gas filter maintenance and change out, sustainment of critical laboratory systems (fume hoods, exhaust systems, control systems, electrical\/mechanical systems, plumbing, emergency backup power), and modernization of key chemical and biological surety laboratories.  Modernization efforts include bringing laboratories up to state of the art standards by completing the following: toxic lab demolition, done IAW environmental law and standards, installing new stainless steel bench top fume hoods with security sash, new case work for existing fume hoods, new case work with acid and flammable cabinets, new epoxy coated floors and walls, new energy efficient security windows, and upgrades to the electrical systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.927"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.927"
                                            },
                                            "Text": {
                                                "val": "Perform general facility sustainment and modernization in key surety facilities that support the CBDP.  Provides for gas filter maintenance and change out, sustainment of critical laboratory systems (fume hoods, exhaust systems, control systems, electrical\/mechanical systems, plumbing, emergency backup power), and modernization of key chemical and biological surety laboratories.  Modernization efforts include bringing laboratories up to state of the art standards by completing the following: toxic lab demolition, done IAW environmental law and standards, installing new stainless steel bench top fume hoods with security sash, new case work for existing fume hoods, new case work with acid and flammable cabinets, new epoxy coated floors and walls, new energy efficient security windows, and upgrades to the electrical systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) LABINF - USAMRIID\/USAMRICD Infrastructure Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Provided laboratory infrastructure support to laboratory operations, facilities sustainment, and regulatory compliance for critical chemical biological defense activities at the U.S. Army Medical Research Institute for Chemical Defense."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Continue to provide laboratory infrastructure support to laboratory operations, facilities sustainment, and regulatory compliance for critical chemical biological defense activities at the U.S. Army Medical Research Institute for Infectious Diseases and the U.S. Army Medical Research Institute for Chemical Defense."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.610"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.610"
                                            },
                                            "Text": {
                                                "val": "Continues support to laboratory infrastructure for laboratory operations, facilities sustainment, and regulatory compliance for critical chemical biological defense activities at the U.S. Army Medical Research Institute for Infectious Diseases and the U.S. Army Medical Research Institute for Chemical Defense.  Activities supported include laboratory support operations, maintenance and repair of existing capabilities (including scientific equipment and information systems), chemical agent security, quality systems compliance, chemical and biological safety, and research protections."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS6"
                    },
                    "ProjectTitle": {
                        "val": "RDT&E MGT SUPPORT"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.417"
                        },
                        "CurrentYear": {
                            "val": "32.220"
                        },
                        "BudgetYearOne": {
                            "val": "31.234"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.234"
                        },
                        "BudgetYearTwo": {
                            "val": "33.815"
                        },
                        "BudgetYearThree": {
                            "val": "34.059"
                        },
                        "BudgetYearFour": {
                            "val": "32.697"
                        },
                        "BudgetYearFive": {
                            "val": "32.699"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides management support for the DoD Chemical and Biological Defense Program (CBDP).  It includes program oversight and integration of overall non-CBRN Defense Equipment (non-CDE) and CBRN Defense Equipment (CDE) programs by the Assistant Secretary of Defense for Nuclear, Chemical, and Biological Defense Programs (ASD(NCB)) and defense programs through the Deputy Assistant Secretary of Defense for Chemical and Biological Defense (DASD(CBD)).  Funds execution management is provided by DTRA. \n\nThe project also provides for the development, coordination and integration of Joint Chemical, Biological, Radiological and Nuclear (CBRN) defense capability requirements, including assistance and support to the Combatant Commanders (COCOMs) and Services to improve CBRN defense related doctrine, education, training, and awareness by the Joint Requirements Office (JRO); preparation of Joint Capability Integration and Development System (JCIDS) documents in accordance with Chairman of The Joint Chiefs of Staff Instruction CJCSI 3170.01I dated 23 January 2015; Joint CBRN Defense Research, Development, and Acquisition (RDA) planning; input to the CBD Annual Report to Congress; and program guidance development by the Program Analysis and Integration Office (PAIO).\n\nThe Biological Select Agent and Toxin (BSAT) Biosafety Program Office (BBPO) will advise the Executive Agent Responsible Official (EA RO) for the DoD BSAT Biosafety Program on biosafety and all matters that pertain to risk associated with BSAT operations, provide oversight of DoD BSAT laboratory biosafety operations, serve as a unified DoD interface with external regulatory agencies, ensure safety and standardization of procedures used in DoD BSAT laboratories, and identify industry-wide best practices to enhance biosafety across the full spectrum of DoD BSAT operations.  As the EA RO for BSAT the program is tasked with technical review, inspection, and harmonization of biosafety protocols and procedures across DoD laboratories that handle BSAT.  As such, the program manages the Biosafety and Scientific Review Panel, inspection of DoD laboratories, harmonization of DoD BSAT-related regulations and procedures, coordinating interaction and information with the CDC, establishing a Defense Business System to track and manage BSAT across DoD, providing laboratory biosafety oversight, and advancing BSAT-related scientific research to address knowledge gaps.  This office was established in March 2016 and prior to FY 2018 is funded within the OSD Management line.\n\nThe project includes programming support for the Joint Service CB Information System (JSCBIS) which serves as a budgetary and informational database for the DoD CBDP.  Also included within the project is financial management services to include fund distribution, execution reporting, and fiscal financial statements.\n\nThis project also supports the Chemical, Biological, Radiological and Nuclear Defense (CBRND) Test and Evaluation (T&E) Executive, who is responsible for the planning, balancing, and oversight of test infrastructure and test technology requirements to support Developmental Testing (DT) and Operational Testing (OT) of DoD CBRND systems, as outlined in the RDA Plan.  The CBRND T&E Executive oversees the Enterprise processes to develop and sustain standardized T&E methodologies and validated instrumentation and infrastructure to ensure the adequacy of test for CBRND systems in alignment with acquisition milestones and associated decision points.  The Joint Test Infrastructure Working Group (JTIWG) program supports T&E Early Involvement; test threat planning; T&E studies; and T&E standards planning and development to support CBRND testing for all Services to include medical T&E efforts.  \n\nThe CBRND T&E Executive directly supports OSD T&E oversight of acquisition programs and provides the mechanism for early T&E involvement in the acquisition process.  The CBRND T&E Executive provides the T&E infrastructure investment strategy and coordinates investment planning and T&E capabilities validation among the Joint Service Community to ensure that program needs are met.  The CBRND T&E Executive oversees the T&E processes to ensure end to end feedback loops to support to the Warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) OSD BIOSAFETY"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.719"
                                            },
                                            "Text": {
                                                "val": "Achieve full program staffing.  Provide oversight of DoD BSAT inspection activities.  Implement Quality Management System.  Continue development of BSAT training products.  Execute regular council stakeholder meetings.  Continue to advance BSAT training and conduct protocol reviews, and publish guidance and procedures from biannual BSRP meetings.  Continue coordination with CDC.  Maintain and improve the Defense BSAT Business System.  Implement third-party testing.  Perform laboratory site visits, and fund research to address safety-related scientific knowledge gaps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.138"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.138"
                                            },
                                            "Text": {
                                                "val": "Maintain program staffing. Develop and maintain BSAT training products.  Maintain Quality Management System, and Defense BSAT Business System.  Conduct life cycle management. Continue to perform laboratory site visits.  Execute regular stakeholders meetings. Conduct observation of laboratory inspection and maintain oversight of DoD BSAT inspection program. Conduct protocol reviews, publish guidance and procedures from quarterly BSRP meetings. Maintain interagency engagement. Fund research to address safety-related scientific knowledge gaps."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) JRO MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.361"
                                            },
                                            "Text": {
                                                "val": "Implemented CBRN Defense medical and non-medical capabilities development by representing the Services and COCOMs in JCIDS and acted as their proponent for coordinating and integrating CBRND operational capabilities.  Chaired the CWMD Working Group for the Protection FCB.  Served as the Joint Staff focal point for CBRN reports, assessments, meetings, agreements, concepts and studies, ATDs, and JCTDs.  Led the CBDP Enterprise POM development.  Prepared various JCIDS documents, including AoAs, IS ICDs, CDDs, and CPDs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "Will implement CBRN Defense medical and non-medical capabilities development by representing the Services and COCOMs in JCIDS and acting as their proponent for coordinating and integrating CBRND operational capabilities.  Will chair the CWMD Working Group for the Protection FCB.  Will serve as the Joint Staff focal point for CBRN reports, assessments, meetings, agreements, concepts and studies, ATDs, and JCTDs.  Will lead the CBDP Enterprise POM development.  Will prepare various JCIDS documents, including AoAs, IS ICDs, CDDs, and CPDs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.700"
                                            },
                                            "Text": {
                                                "val": "Continue to implement CBRN Defense medical and non-medical capabilities development by representing the Services and COCOMs in JCIDS and acting as their proponent for coordinating and integrating CBRND operational capabilities.  Continue to chair the CWMD Working Group for the Protection FCB.  Continue to serve as the Joint Staff focal point for CBRN reports, assessments, meetings, agreements, concepts and studies, ATDs, and JCTDs.  Continue to lead the CBDP Enterprise POM development.  Continue to prepare various JCIDS documents, including AoAs, IS ICDs, CDDs, and CPDs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) JTIWG"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.793"
                                            },
                                            "Text": {
                                                "val": "Continued T&E Executive mission support to ensure credible testing; T&E Early Involvement; T&E Studies; evaluation and decision support for CBDP systems; support the DOT&E for OSD T&E Oversight; and support the NCB in infrastructure planning; input to the POM process; and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.  Continued efforts to develop, refine, and\/or streamline processes for identifying, assessing, and addressing gaps in T&E capabilities to ensure timely support to acquisition programs.  Continued mission to improve the quality and reduce the costs of test planning and execution; eliminate unnecessary redundancies in test infrastructure.  Sponsored technical efforts to mitigate critical Test and Evaluation Gaps in order to reduce cost\/test schedule impacts to near-term PORs.  Developed new policies and processes to support more efficient and effective management and sustainment of test infrastructure and methodologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.389"
                                            },
                                            "Text": {
                                                "val": "Continue T&E Executive mission support to ensure credible testing; T&E Early Involvement; T&E Studies; evaluation and decision support for CBDP systems; support the DOT&E for OSD T&E Oversight; and support the NCB in infrastructure planning; input to the POM process; and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.  Continue efforts to develop, refine, and\/or streamline processes for identifying, assessing, and addressing gaps in T&E capabilities to ensure timely support to acquisition programs.  Continue mission to improve the quality and reduce the costs of test planning and execution; eliminate unnecessary redundancies in test infrastructure.  Continue efforts to identify and mitigate critical Test and Evaluation Gaps in order to reduce cost\/test schedule impacts to near-term PORs.  Continue to align and streamline policies and processes to support more efficient and effective management and sustainment of test infrastructure and methodologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.989"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.989"
                                            },
                                            "Text": {
                                                "val": "Continue T&E Executive mission support to ensure credible testing; T&E Early Involvement; T&E Studies; evaluation and decision support for CBDP systems; support the DOT&E for OSD T&E Oversight; and support the NCB in infrastructure planning; input to the POM process; continue efforts to develop, refine, and\/or streamline processes for identifying, assessing, and addressing gaps in T&E capabilities to ensure timely support to acquisition programs.  Continue mission to improve the quality and reduce the costs of test planning and execution; eliminate unnecessary redundancies in test infrastructure.  Continue efforts to identify and mitigate critical Test and Evaluation Gaps in order to reduce cost\/test schedule impacts to near-term PORs.  Continue to align and streamline policies and processes to support more efficient and effective management and sustainment of test infrastructure and methodologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project schedule."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) OSD MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.392"
                                            },
                                            "Text": {
                                                "val": "Performed program reviews\/assessments, provided programmatic PPBE oversight\/analysis, and provided congressional issue analysis and support.  Supported financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.117"
                                            },
                                            "Text": {
                                                "val": "Perform program reviews\/assessments, provide programmatic PPBE oversight\/analysis, and provide congressional issue analysis and support.  Support financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.777"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.777"
                                            },
                                            "Text": {
                                                "val": "Perform program reviews\/assessments, provide programmatic PPBE oversight\/analysis, and provide congressional issue analysis and support.  Support financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) PAIO MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.871"
                                            },
                                            "Text": {
                                                "val": "Developed assessments to support RDA Planning.  Provided analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Responded to specialized evaluation studies throughout the PPBE process.  Provided Joint Service Chemical Biological Information System database management and initiated JSCBIS modernization effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.495"
                                            },
                                            "Text": {
                                                "val": "Develop assessments to support RDA Planning.  Provide analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Respond to specialized evaluation studies throughout the PPBE process.  Provide Joint Service Chemical Biological Information System database management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.630"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.630"
                                            },
                                            "Text": {
                                                "val": "Continue to develop assessments to support RDA Planning.  Continue providing analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Respond to specialized evaluation studies throughout the PPBE process.  Continue to provide Joint Service Chemical Biological Information System database management and complete the JSCBIS modernization effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase\/Decrease due to fact of life change in the program\/project."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "O49"
                    },
                    "ProjectTitle": {
                        "val": "JOINT CONCEPTS, STUDIES, AND ANALYSES (JCSA)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.326"
                        },
                        "CurrentYear": {
                            "val": "1.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.456"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.456"
                        },
                        "BudgetYearTwo": {
                            "val": "1.500"
                        },
                        "BudgetYearThree": {
                            "val": "1.500"
                        },
                        "BudgetYearFour": {
                            "val": "1.500"
                        },
                        "BudgetYearFive": {
                            "val": "1.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The objectives of the Joint Concepts, Studies, and Analyses (JCSA) program are to support the Joint Requirements Office to develop, coordinate, and execute CBRND studies, experiments, analyses and architecture, in order to develop future operational concepts and support the efficient and effective generation of CBRN requirements.\n\nSpecific lines of effort across the Future Years Defense Program (FYDP) include: qualitatively characterizing emerging CBRN threats and operational risks to the Joint Force; conducting innovative approaches to deal with technical studies; analyzing Concepts of Operations for employing and developing capabilities; and analyzing specific issues that contribute to POM development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JCDE"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.326"
                                            },
                                            "Text": {
                                                "val": "Continued JCDE analysis.  Continued to perform Advanced Threat Analysis with several more categories of threat.  Updated best representative agents for consideration in requirements and testing.  Conducted detailed quantitative analyses to determine detection and challenge levels from key representative threats determined in the FY15 Advanced Threat Studies.  Updated detailed operational risk analyses to support CBDP leadership decisions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) JCSA"
                                    },
                                    "Description": {
                                        "val": "This program was formerly called Joint Combat Development and Experimentation (JCDE) and will continue the analysis performed under that program.  In addition, JCSA will perform Advanced Threat Analysis with several more categories of threat than JCDE.  JCSA updates the best representative agents for consideration in requirements and testing.  JCSA also conducts detailed quantitative analyses to determine detection and challenge levels from key representative threats determined in the FY15 Advanced Threat Studies.  JCSA also updates detailed operational risk analyses to support CBDP leadership decisions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Funds in JCDE were transferred to this program, Joint Concepts Studies and Analyses (JCSA), to perform strategic level studies in lieu of direct tactical level experimentation, to better define overarching properties.  Will continue to perform Advanced Threat Analysis with several more categories of threat.  Will update best representative agents for consideration in requirements and testing.  Will conduct detailed quantitative analyses to determine detection and challenge levels from key representative threats determined in the FY15 Advanced Threat Studies.  Will update detailed operational risk analyses to support CBDP leadership decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.456"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.456"
                                            },
                                            "Text": {
                                                "val": "Continue to perform Advanced Threat Analysis with several more categories of threat.  Continue to update best representative agents for consideration in requirements and testing.  Continue to conduct detailed quantitative analyses to determine detection and challenge levels from key representative threats determined in the FY15 Advanced Threat Studies.  Continue to update detailed operational risk analyses to support CBDP leadership decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}