{
    "id": "2019-UnitedStatesSpecialOperationsCommand-PB-0400-JBOOK-841ec88e9e9767e5036cd8441c4e5e32ca4a3adfb377b36c6891ef7b05dec0e3-12",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-SOCOM-U_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160483BB"
        },
        "ProgramElementTitle": {
            "val": "Maritime Systems"
        },
        "R1LineNumber": {
            "val": "255"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "350.185"
            },
            "PriorYear": {
                "val": "52.199"
            },
            "CurrentYear": {
                "val": "42.315"
            },
            "BudgetYearOne": {
                "val": "42.471"
            },
            "BudgetYearOneBase": {
                "val": "42.471"
            },
            "BudgetYearTwo": {
                "val": "31.865"
            },
            "BudgetYearThree": {
                "val": "29.982"
            },
            "BudgetYearFour": {
                "val": "21.197"
            },
            "BudgetYearFive": {
                "val": "46.307"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides for engineering and manufacturing development (EMD) of Special Operations Forces (SOF) Surface and Undersea Mobility platforms.  This program element also provides for pre-acquisition activities to quickly respond to new requirements for SOF surface and undersea mobility, looking at multiple alternatives to include cross-platform technical solutions, service-common solutions, Commercial-Off-The-Shelf technologies, and new development efforts.  \n\nThe Underwater Systems project provides for EMD of combat submersibles, SOF operator diving systems, underwater support systems, and underwater equipment.  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component and prototype development) to respond to emergent requirements.  These submersibles, equipment, and diving systems are used by SOF in the conduct of infiltration\/extraction, personnel\/material recovery, hydrographic\/inland reconnaissance, beach obstacle clearance, underwater ship attack, and other missions.  The capabilities of the submersible systems, diving systems, and unique equipment provide small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions.  \n\nThe Surface Craft project provides for EMD of medium and heavy surface combatant craft, combatant craft mission equipment, and pre-planned product improvement and technology insertion engineering changes to meet the unique requirements of SOF.  This project element also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to quickly respond to new requirements for maritime craft and subsystems.  The craft capabilities and unique equipment provide small, highly trained forces the ability to successfully engage the enemy and conduct operations associated with SOF maritime missions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "54.577"
                },
                "CurrentYear": {
                    "val": "42.315"
                },
                "BudgetYearOne": {
                    "val": "20.457"
                },
                "BudgetYearOneBase": {
                    "val": "20.457"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.199"
                },
                "CurrentYear": {
                    "val": "42.315"
                },
                "BudgetYearOne": {
                    "val": "42.471"
                },
                "BudgetYearOneBase": {
                    "val": "42.471"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.378"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "22.014"
                },
                "BudgetYearOneBase": {
                    "val": "22.014"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.389"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.989"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "22.014"
                                },
                                "BudgetYearOneBase": {
                                    "val": "22.014"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:   \n\nFY 2017:  Decrease of $2.378 million is due to the transfer of funds (-$1.989 million) to Small Business Innovative Research\/Small Business Technology Transfer programs and a reprogramming of -$0.389 million from Surface Craft for higher Command priorities.\n\nFY 2018:  None.\n\nFY 2019:  Net increase of $22.014 million is due to FY 2019 funding request reduction of -$8.733 million to account for the availability of prior year execution balances, a -$0.321 million decrease to reflect Departmental economic adjustments, an increase of $5.810 million to conduct Developmental Testing (DT) and Initial Operational Test and Evaluation (OT&E) for Threat Awareness System, an increase of $15.258 million to develop and integrate a Mid-Water Column lock-in\/lock-out, decompression pump, signature management capabilities on Dry Combat Submersible (DCS) vessels, and conduct DT and OT&E on DCS 1 and an increase of $10 million for Maritime Precision Engagement Production Representative Article. \n\nSchedule:  None.\n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S0417"
                    },
                    "ProjectTitle": {
                        "val": "Underwater Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "321.000"
                        },
                        "PriorYear": {
                            "val": "48.317"
                        },
                        "CurrentYear": {
                            "val": "35.114"
                        },
                        "BudgetYearOne": {
                            "val": "26.897"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.897"
                        },
                        "BudgetYearTwo": {
                            "val": "22.693"
                        },
                        "BudgetYearThree": {
                            "val": "21.595"
                        },
                        "BudgetYearFour": {
                            "val": "17.572"
                        },
                        "BudgetYearFive": {
                            "val": "42.610"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for engineering and manufacturing development of combat underwater submersibles, Special Operations Forces (SOF) operator diving systems, underwater support systems, and underwater equipment.  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to respond to emergent requirements.  These submersibles, equipment, and diving systems are used by SOF in the conduct of infiltration\/extraction, personnel\/material recovery, hydrographic\/inland reconnaissance, beach obstacle clearance, underwater ship attack, and other missions.  The capabilities of the submersible systems, diving systems, and unique equipment provides small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Shallow Water Combat Submersible (SWCS)"
                                    },
                                    "Description": {
                                        "val": "This sub-project provides for the design, development, test, manufacturing and sustainment of one Engineering Development Model (EDM) and ten production units to replace the legacy MK 8 MOD 1 Seal Delivery Vehicle (SDV) system. SWCS is a free-flooding combat submersible mobility platform suitable for transporting and deploying SOF and their payloads for a variety of SOF missions.  SWCS will be deployable from a Dry Deck Shelter (DDS), surface ships, and land. The SWCS system includes the SWCS vehicle and SWCS support Equipment, comprised of Mission Support Equipment (MSE), Pack-Up Kit (PUK), and Transportation and Handling (T&H).  It also includes integration efforts with the current Dry Deck Sheltere (DDS) and development of product improvements accomplished throughout the lifecycle of the system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.950"
                                            },
                                            "Text": {
                                                "val": "Complete EDM, including final logistics packages, develop and incorporate any engineering changes into SWCS production craft configuration as needed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.378"
                                            },
                                            "Text": {
                                                "val": "Continue Initial Operational Test and Evaluation (IOT&E)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.247"
                                            },
                                            "Text": {
                                                "val": "Continues pre-planned product improvements and complete IOT&E."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $0.131 million is due to minor adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Combat Submersible (DCS)"
                                    },
                                    "Description": {
                                        "val": "This sub-project provides for the advanced development, engineering, manufacturing, and testing efforts for a surface-launched, dry, diver lock-in\/lock-out vessel capable of inserting and extracting SOF and\/or payloads into denied areas.  USSOCOM awarded an Engineering and Manufacturing Development (EMD) contract in FY 2016 to produce one production representative vessel, with options to produce two additional vessels. USSOCOM is testing one submersible prototype to validate test methodologies, commercial classification, and SOCOM safety certification processes and will continue to use the prototype to evaluate capability enhancing technologies and reduce risk in the DCS program.  This project includes funding for enhanced warfighter capabilities such as Mid-Water Column Lock-In\/Lock-Out, depressurization pump, and submarine interoperability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "39.139"
                                            },
                                            "Text": {
                                                "val": "Continue EMD for DCS production representative system.  Complete testing of the prototypes and initiate refit of one prototype submersible to be used as a training vessel."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.497"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate capability enhancing technologies and reduce risk in the DCS program.  Continue manufacturing of DCS production representative EMD Vessel.  Achieve Milestone C."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.024"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.024"
                                            },
                                            "Text": {
                                                "val": "Continues to evaluate capability enhancing technologies and reduce risk in the DCS program.  Conduct Government Acceptance Testing and initiate developmental testing and operational testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $6.473 million to account for the availability of prior year execution balances and due to completion of Production Representative Article."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Deck Shelter (DDS) Modernization"
                                    },
                                    "Description": {
                                        "val": "This sub-project provides for the pre-planned product improvements, testing, and integration of specialized underwater systems to meet the unique requirements of SOF, and compatibility with the submarine fleet.  The current DDS is a certified diving system which attaches to modified host submarines that provides for insertion of SOF forces and platforms.  Funding supports product improvements to the current DDS, as well as associated diver equipment for in-service submarine support systems, unmanned underwater vehicles, and follow on development efforts for future SOF payloads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.228"
                                            },
                                            "Text": {
                                                "val": "Continue development of the modernization necessary to extend useful life of the DDS, transition from SSGN to Virginia Class host platform, and increase capacity to carry larger payloads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.200"
                                            },
                                            "Text": {
                                                "val": "Continue development of the modernization necessary to extend useful life of the DDS, transition from SSGN to Virginia Class host platform, and increase capacity to carry larger payloads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.564"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.564"
                                            },
                                            "Text": {
                                                "val": "Continues development of the modernization necessary to extend useful life of the DDS, transitions from SSGN to Virginia Class host platform, and increases capacity to carry larger payloads."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $1.636 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOF Combat Diving"
                                    },
                                    "Description": {
                                        "val": "This sub-project provides for the development, testing, and fielding of SOF peculiar diving equipment providing the SOF combat diver the ability to engage the enemy and conduct operations.  SOF Combat Diving will support the SDV, SWCS, and DCS with the conduct of infiltration\/extraction, material recovery, underwater ship attack, beach clearance, and other missions.  Technologies include, but are not limited to, commercial and developmental life support, maneuverability, diver navigational accuracy and situational awareness, thermal protection, and underwater communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continue thermal protection testing.  Begin development for situational awareness and underwater breathing apparatuses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.039"
                                            },
                                            "Text": {
                                                "val": "Continue development for environmental protection, navigation, communication, and propulsion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.062"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.062"
                                            },
                                            "Text": {
                                                "val": "Continues development, to include test and evaluation for environmental protection, navigation, communication, and propulsion."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.023 million due to minor adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC\/0210US"
                                    },
                                    "Title": {
                                        "val": "Underwater Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "42.840"
                                        },
                                        "CurrentYear": {
                                            "val": "92.606"
                                        },
                                        "BudgetYearOne": {
                                            "val": "136.723"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "136.723"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "75.126"
                                        },
                                        "BudgetYearThree": {
                                            "val": "40.817"
                                        },
                                        "BudgetYearFour": {
                                            "val": "24.017"
                                        },
                                        "BudgetYearFive": {
                                            "val": "22.609"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "•   SWCS used full and open competition with a down select to a single contractor.  The full spectrum of contracting activities are being utilized for any integration and subsystem requirements, using existing contracts where appropriate, government agencies, and new contracts as necessary.\n\n•   DCS used full and open competition, resulting in the selection of a single prime contractor.  A Fixed Price Incentive Firm Target contract for a production representative system was awarded in FY 2016 with options to procure one vessel in FY 2018 and one in FY 2019.\n\n•   The DDS is currently in sustainment through a series of maintenance and service contracts which were competitively sourced, and awarded for a 5-year period.  The modernization and engineering\/change efforts for the six DDS in inventory are executed utilizing existing services contracts.\n\n•   SOF Combat Diving efforts are executed using existing contracts, government agencies, and new contracts competitively selected as appropriate."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DCS Technologies Government Furnished Equipment"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "30.292"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.461"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.118"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.118"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS Engineering & Manufacturing Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Riviera Beach, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "26.846"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "26.015"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.997"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "65.858"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS Engineering Changes"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.135"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.571"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.087"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.087"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dry Deck Shelter (DDS)  Modernization"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oceaneering International Inc. Marine Services Division"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chesapeake, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.543"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.006"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.850"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.242"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.242"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SOF-Unique Diving Technologies"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.370"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.369"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.379"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.379"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SWCS Engineering Changes"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.047"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.047"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "202.681"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "202.681"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.094"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.094"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SWCS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Puget Sound Naval Shipyard"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Seattle, Washington"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.214"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.378"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.392"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA \/ CRANE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.306"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.525"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.448"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.448"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "19.279"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SOF Combat Diving"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.130"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.510"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.510"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.320"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.320"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SWCS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Penn State University"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "University Park, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.781"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.131"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DCS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tampa, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12.116"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.528"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.404"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.371"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.371"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DDS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAVSEA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.107"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.222"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.322"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.322"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SOF Combat Diving"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tampa, FL"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.170"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.173"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.173"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Funding"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.200"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.200"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "SWCS-2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "DCS-2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "DDS-2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "CBDS-2.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Shallow Water Combat Submersible"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Changes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Development Model Acceptance"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IOT&E"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Combat Submersibles"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Prototype Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DCS-L"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering and Manufacturing Development Phase"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering Changes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Representative Article"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Test and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Deck Shelter Modernization"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Phase 2 Design"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Phase 3 & 4 Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Critical Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Field Changes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOF Combat Diving"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Maritime Environmental Protection Development, Integration, and Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Propulsion Development \/ Manufacturing \/ Test \/ Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Navigation Development \/ Manufacturing \/ Test \/ Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Communications Development \/ Manufacturing \/ Test \/ Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S1684"
                    },
                    "ProjectTitle": {
                        "val": "Surface Craft"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "29.185"
                        },
                        "PriorYear": {
                            "val": "3.882"
                        },
                        "CurrentYear": {
                            "val": "7.201"
                        },
                        "BudgetYearOne": {
                            "val": "15.574"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.574"
                        },
                        "BudgetYearTwo": {
                            "val": "9.172"
                        },
                        "BudgetYearThree": {
                            "val": "8.387"
                        },
                        "BudgetYearFour": {
                            "val": "3.625"
                        },
                        "BudgetYearFive": {
                            "val": "3.697"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for engineering and manufacturing development of medium and heavy surface combatant craft, combatant craft mission equipment, and pre-planned product improvement (P3I) and technology insertion engineering changes to meet the unique requirements of Special Operations Forces (SOF).  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to quickly respond to new requirements for maritime craft and subsystems.  The craft capabilities and unique equipment provide small, highly trained forces the ability to successfully engage the enemy and conduct operations associated with SOF maritime missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combatant Craft Medium (CCM) Mk 1"
                                    },
                                    "Description": {
                                        "val": "This sub-project is a semi-enclosed multi-mission combatant craft for platoon-size maritime mobility in maritime denied environments.  It is multi-mission capable, including Maritime Interdiction, Insert \/ Extract, and Visit, Board, Search, and Seizure (VBSS) Operations.  CCM is Naval Special Warfare’s (NSW) craft-of-choice for long-range, high-payload SOF mobility operations in denied environments up to high threat.  CCM has NSW’s best Iron Triangle: 40 knot (kt) speed; 4 crew + 19 passengers (pax) \/ 10,000 pound (lb) payload; and 600 nautical miles (nm) range.  CCM Mk 1 payload capacity enables inclusion of shock mitigating seats, which is critical for ride quality, operator tactical readiness, and operator health.  At 60 feet long, CCM is C-17 \/ C5 transportable and can launch\/recover by well deck or shore based trailer."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.202"
                                            },
                                            "Text": {
                                                "val": "Develop conceptual, preliminary, and detail design drawings necessary to integrate and conduct initial testing of MK50 remote weapon system on the CCM test article.  Begin integration of NG CCFLIR."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.662"
                                            },
                                            "Text": {
                                                "val": "Continue integration of CCFLIR2 and begins integration of Tactical Operations Center (TOCNET) Intercommunications System and Joint Threat Warning System (JTWS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.788"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.788"
                                            },
                                            "Text": {
                                                "val": "Continues integration of CCFLIR2, TOCNET Intercommunications System and JTWS and begins integration of Threat Awareness System (TAS)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $0.874 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Heavy (CCH)"
                                    },
                                    "Description": {
                                        "val": "This sub-project represents a family of solutions that provides platoon-size maritime surface mobility.  The current CCH is the Sea, Air, Land Insertion, Observation, and Neutralization (SEALION) craft.  SEALION is a fully-enclosed, climate-controlled, semi-submersible craft that operates in denied environments up to high-threat. SEALION is NSW’s most versatile and survivable combatant craft and the craft-of-choice for sensitive maritime intelligence, surveillance, and reconnaissance missions and those missions requiring a prolonged presence in denied environments.  Its clandestine mobility capability is only exceeded by an undersea craft.  Iron Triangle: 40 kt speed; 7 crew + 12 pax \/ 3,300 lb payload; and 400 nm range.  SEALION payload capacity enables inclusion of shock mitigating seats, which is critical for ride quality, operator tactical readiness, and operator health.  At 77+ feet long, SEALION is C-17\/C-5 transportable and can launch\/recover by well deck or shore based mobile travel lift or crane."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.542"
                                            },
                                            "Text": {
                                                "val": "Complete tactical computer system upgrades.  Continue P3I and technology insertion.  Begin integration of NG CCFLIR and applicable CCME technology onto CCH crafts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.877"
                                            },
                                            "Text": {
                                                "val": "Continue CCFLIR2 integration and continue development and integration of upgraded Satellite Communications (SATCOM) antennas.  Begin development of CCH Next."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.885"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.885"
                                            },
                                            "Text": {
                                                "val": "Completes CCFLIR2 integration and continues development and integration of upgraded SATCOM antennas and development of CCH Next.   Begins integration of TAS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.008 million is due to minor adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Mission Equipment (CCME)"
                                    },
                                    "Description": {
                                        "val": "This sub-project provides a rapid response capability to support SOF combatant craft systems, subsystems, and their emerging requirements.  CCME provides technology refresh efforts to correct system deficiencies, improve asset life, and enhance mission capability.  Demonstrations and modifications may be made to support emerging capability enhancements such as, but not limited to, conformal antennas, identification friend-or-foe capabilities, enhanced communications, weapon integration, software refresh, and navigation subsystems in support of future missions.  Solutions to these emerging requirements may be commercial-off-the-shelf leveraged from other Government agencies, or new solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.717"
                                            },
                                            "Text": {
                                                "val": "Evaluate candidate solutions for technology development to include, but not limited to, MK50 SOF improvements (i.e., accuracy and increased rounds), Vehicular Intercommunications-3 intercom control integration tests, craft survivability painting studies and verification, and situational awareness studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.107"
                                            },
                                            "Text": {
                                                "val": "Evaluate candidate solutions for technology development to include, but not limited to, Maritime Precision Engagement, family of antennas testing, Airborne Mission Networking Marinization, and situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.125"
                                            },
                                            "Text": {
                                                "val": "Continues evaluation of candidate solutions for technology development to include, but not limited to, Maritime Precision Engagement, family of antennas testing, Airborne Mission Networking Marinization, and situational awareness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.018 million is due to minor adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Assault (CCA)"
                                    },
                                    "Description": {
                                        "val": "This sub-project CCA is a combatant craft for squad-size maritime mobility operations in maritime denied environments.  CCA is NSW’s best craft for VBSS in maritime denied environments up to and including medium threat.  It is the craft-of-choice for maritime interdiction and boarding operations because of the open deck space, maneuverability, and interoperability with an Afloat Forward Staging Base.  Iron Triangle: 40 kt speed; 3 crew + 12 pax \/ 5,000 lb payload; and 300 nm range.  At 41 feet long, CCA is air transportable by C-130 \/ C-17 \/ C-5 and can launch\/recover by crane, davit, well deck, or shore based trailer."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.421"
                                            },
                                            "Text": {
                                                "val": "Begin integration of NG CCFLIR and applicable CCME technology onto CCA crafts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.510"
                                            },
                                            "Text": {
                                                "val": "Continue integration and testing of CCFLIR2 mast design and SSN-8 Tactical Computer System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.515"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.515"
                                            },
                                            "Text": {
                                                "val": "Continues integration and testing of CCFLIR2 mast design and SSN-8 Tactical Computer System.  Begins integration of TAS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.005 million is due to minor adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Awareness System (TAS)"
                                    },
                                    "Description": {
                                        "val": "This sub-project provides SOF with an Electronic Intelligence capability for enhanced force protection of SOF in Maritime denied environments by allowing them to identify and avoid enemy detection capabilities.  TAS will utilize technological advancements to gain significant improvements in capability such as miniaturization and marinization to enable seamless craft integration."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.045"
                                            },
                                            "Text": {
                                                "val": "Begin development and testing of TAS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.261"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.261"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Continues development and testing of TAS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $0.784 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Precision Engagement (MPE)"
                                    },
                                    "Description": {
                                        "val": "This sub-project, Maritime Precision Engagement is a family of standoff, loitering, man-in-the-loop weapons systems deployed on combatant craft and capable of targeting individuals, groups, vehicles, high value targets, and small oceangoing craft with low collateral damage. The program consists of combatant craft alterations, launcher systems, and munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Begin design and development of the production representative article."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $10 million to initiate the design and development of the production representative article."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC\/0204SCCS"
                                    },
                                    "Title": {
                                        "val": "Combatant Craft Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "46.548"
                                        },
                                        "CurrentYear": {
                                            "val": "23.272"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.313"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.313"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "38.433"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.372"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.854"
                                        },
                                        "BudgetYearFive": {
                                            "val": "66.617"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "•  CCM was a two-phase source selection process.  Phase I involved a Small Business Set-Aside competition for two vendors to design, build and deliver test articles.  Phase II selected a single vendor to provide a fully integrated baseline craft system for test and evaluation with options for production, engineering support, and contractor logistic support.  \n\n•  CCH SEALION I & II were transitioned from United States Navy advanced technology demonstrator craft to USSOCOM.  Sustainment for SEALION I & II is conducted via Special Operations Forces Support Activity.  SEALION III is Sole Source to the OEM in order to take advantage of previous Government investments in manufacturing infrastructure for SEALION I & II.  \n\n•  CCME emphasizes on spearheading Technology Readiness Level (TRL) 6 technology for successful transition into SOF Combatant Crafts. CCME accomplishes this by employing the full spectrum of contracting services, using existing contracts where appropriate, and leveraging from other Government agencies to include the Services and USSOCOM SOF AT&L Science & Technology Directorate. CCME focuses on developing the technology for maturity, marinization and compatibility, finally transitioning to the craft. The integration and procurement piece is managed by the individual Combatant Craft Program.\n\n•  CCA utilizes various contracting and better buying power practices to develop, test, and integrate capability enhancements required to increase the craft’s current performance envelope.\n\n•  TAS PM JTWS will perform market research to determine feasibility and appropriateness of conducting a full and open competition.  PM JTWS is planning a developmental effort in FY18\/FY19 to mature existing technologies.  PM-SS will retain funds to support integration across the family of Combatant Craft.\n\n•  MPE will be a full and open competition of the launcher systems with follow-on government-led integration effort leveraging lessons learned from similar rapid integration efforts on other combat tested SOF platforms."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Combat Craft Medium (CCM)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.089"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.202"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.662"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.788"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.788"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Heavy (CCH)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.392"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.542"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.877"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.885"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.885"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Combatant Craft Assault"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.421"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.510"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.515"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.515"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Combat Craft Mission Equipment (CCME)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.939"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.514"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.878"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.888"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.888"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Threat Awareness System (TAS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Crane, IN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.045"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.661"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.661"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Costs"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.679"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.679"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Maritime Precision Engagement (MPE)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CCME"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.155"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.203"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.237"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.237"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TAS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.239"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.239"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Costs"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.395"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.395"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TAS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.361"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.361"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "MPE"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prior Year Costs"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.536"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.536"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "CCM-2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "CCH-2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "CCME-2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "CCA-2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "TAS-2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "MPE5.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Combatant Craft Medium"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Weapons, Survivability, C4ISR and NG CCFLIR Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Heavy"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Preplanned Product Improvement (Weapons \/ C4I \/ Survivability \/ NG CCFLIR \/ TAS)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Recapitalization Engineering:  CCH Next"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Mission Equipment"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Shock Enhancements\/Active Ride Control"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Situational Awareness Sensors\/Antennas"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SATCOM on the Move Test & Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "MK50 Weapon SOF Modifications\/Tests"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Survivability Enhancement\/Craft Paint Study"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Threat Analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Obsolescence Analysis and Test (Tech Refresh)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Airborne Mission Network - Maritime"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Survivability Studies"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Link 16"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Maritime Precision Engagement"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Assault"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Preplanned Product Improvement (Survivability, Weapons, C4ISR, NG CCFLIR, TAS)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Awareness System"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone B"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Precision Engagement"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone B"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering and Manufacturing Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Representative Article"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}