{
    "id": "2019-DefenseLogisticsAgency-PB-0400-MJBOOK-0-0-80eff91f1c07b236992045998f394e8d6c1dd79b140f5d9986bef8c801486252-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DLA-U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680S"
        },
        "ProgramElementTitle": {
            "val": "Manufacturing Technology Program (ManTech)"
        },
        "R1LineNumber": {
            "val": "48"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "19.736"
            },
            "CurrentYear": {
                "val": "40.511"
            },
            "BudgetYearOne": {
                "val": "49.667"
            },
            "BudgetYearOneBase": {
                "val": "49.667"
            },
            "BudgetYearTwo": {
                "val": "40.848"
            },
            "BudgetYearThree": {
                "val": "41.199"
            },
            "BudgetYearFour": {
                "val": "41.382"
            },
            "BudgetYearFive": {
                "val": "42.169"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency (DLA) Manufacturing Technology (ManTech) Program funds the advanced technology development needed to achieve a responsive, efficient domestic industrial base that affordably meets the warfighters’ needs in a timely manner.  The ManTech program works with DLA’s diverse supply chains to improve manufacturing capability throughout a product's life cycle.  It provides the crucial link between invention and application by maturing, scaling up, and validating advanced manufacturing technology in “real world” environments.  ManTech developments provide a path to low-risk technology implementation for the many small businesses and defense unique suppliers as well as depots and shipyards that are critical to DLA.  By anticipating and addressing production and sustainment problems before they occur, readiness levels increase and sustainment costs are lower.  \n\nDLA ManTech is aligned into three Strategic Focus Areas (SFA): 1) Improving Industrial Base Manufacturing Processes; 2) Maintaining Viable Sources of Supply; and 3) Improving Technical and Logistics Information.  \n\n• The Improving Industrial Base Manufacturing Processes SFA includes efforts to reduce industrial base material costs and production lead-times, while improving the quality of DLA managed products. This SFA has supply chain focused execution portfolios for food (Subsistence Network Procurement), Castings (Procurement Readiness Optimization—Advanced Casting Technology), Forgings (Procurement Readiness Optimization—Forging Advance System Technology), Batteries (Battery Network) and Additive Manufacturing.\n\n• Maintaining Viable Supply Sources includes efforts to assure the commercial industrial base can satisfy DLA materiel requirements without relying on foreign sources for microcircuits and critical strategic materials.  This strategic focus area mitigates supply issues caused by the lack of a reliable domestic manufacturing capability to produce products or raw materials needed to build and maintain weapon systems.  The major focus of the program is maintaining a reliable, trusted, domestic source for “non-procurable” linear and digital microcircuits.  Microcircuit emulation allows the Services to save significant costs by using form, fit and functionally equivalent spare parts rather than redesigning the next-higher-assembly.\n\n• The Improving Technical and Logistics Information SFA include efforts to improve and facilitate the exchange of engineering and logistics information among DLA, the Military Services, DLA industry partners and DLA customers. It includes the Military Unique Sustainment Technology (MUST) and the Defense Logistics Information Research (DLIR) programs.  A primary focus of this SFA is to capitalize on the emerging “Model Based Enterprise” paradigm and the semantic web as an enabler to a logistics system that is smart and connected up and down the supply chain and across all DLA Customers and suppliers.  A major focus is to transform DoD engineering data from two-dimensional paper-based products to three-dimensional computer based models, and to develop processes to move from “electronic paper” (i.e. PDF files) to technical data files that can interface directly with industries’ engineering systems. The benefits include shorter product introduction cycles, lower set up-costs for parts production and more economical small batch production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "31.259"
                },
                "CurrentYear": {
                    "val": "40.511"
                },
                "BudgetYearOne": {
                    "val": "50.098"
                },
                "BudgetYearOneBase": {
                    "val": "50.098"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.736"
                },
                "CurrentYear": {
                    "val": "40.511"
                },
                "BudgetYearOne": {
                    "val": "49.667"
                },
                "BudgetYearOneBase": {
                    "val": "49.667"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-11.523"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.431"
                },
                "BudgetYearOneBase": {
                    "val": "-0.431"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-20.185"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.338"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Inflation Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.431"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.431"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY2017, Manufacturing Technology received a Congressional Add for $10M for the Casting program with emphasis on Steel Castings. Under the FY2017 CR, PE 30603680S was considered a new start so ManTech business was executed under 70708011S resulting in reprogramming amount of $16.184M. The remaining reprogramming amount is a $1.963M reprogramming to Generic Logistics R&D as well as the USTRANSCOM amount owed to ManTech in the amount of $2.218M. Under the FY2017 CR, a portion of ManTech's funding was provided to USTRANSCOM to continue business operations. Upon enactment, the USTRANSCOM funding is being returned to ManTech.  In FY2017, the Small Business Innovation Research and Small Technology Transfer Research tax amounted to $1.338M. \n\nIn FY2019, program increased for the development of electron beam manufacturing processes for microcircuits (+$9.000M – to Maintaining Viable Supply Sources). Inflation adjustments for Non-Pay\/Non-Fuel Pay purchases and Civilian Pay decreased the program baseline in FY2019."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "IBMP"
                    },
                    "ProjectTitle": {
                        "val": "Improving Industrial Base Manufacturing Processes (formerly Material Availability)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "14.157"
                        },
                        "CurrentYear": {
                            "val": "16.227"
                        },
                        "BudgetYearOne": {
                            "val": "16.109"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.109"
                        },
                        "BudgetYearTwo": {
                            "val": "16.670"
                        },
                        "BudgetYearThree": {
                            "val": "16.519"
                        },
                        "BudgetYearFour": {
                            "val": "16.686"
                        },
                        "BudgetYearFive": {
                            "val": "17.131"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Improving Industrial Base Manufacturing Processes Strategic Focus Area (SFA) is an R&D effort undertaken with DLA’s suppliers to reduce material costs, reduce the length and variability of production lead-times, assure DLA managed products meet performance requirements, and continuously improve quality and reliability. Benefits of this SFA include lower material costs, lower inventory levels and more predictable Customer Wait Times, fewer quality deficiencies, and lower customer support costs. This SFA includes within its scope the Subsistence Network, the Battery Network, the Castings\/Forging programs and Additive Manufacturing programs. \n\nThe Battery Network (BATTNET) objective is to develop the next generation of battery manufacturing technologies for cost and price efficiency, longer shelf life, and lighter batteries with higher energy. BATTNET conducts R&D initiatives to address sustainment gaps and bridge technical solutions into higher a Manufacturing Readiness Level (MRL) for specific groups of batteries. BATTNET also focuses on projects to develop the production capability for advanced lithium-based non-rechargeable and rechargeable batteries to ensure the prompt and sustained availability, quality, and affordability of Service approved batteries. Desired outcomes include: streamlined inventory and associated cost reductions through standardization and improved distribution practices; resolved obsolescence issues; addressed surge and sustainment issues; enhanced security of supply chain; increased competition and manufacturing base; reduced per unit battery cost; and leveraged Service-level (Army, Navy, Air Force) and other governmental (DOE, DOT, NASA) R&D efforts to insert new technology and practices into the existing DLA battery inventory.\n\nThe Subsistence Network (SUBNET) Program is the successor to the Combat Rations Network R&D program. SUBNET focuses on solutions to develop and promote manufacturing improvements in the subsistence supply chain. The program's expanded areas of interest include: combat rations, food equipment, field feeding solutions, food footprint, food innovations, food safety and defense developments, garrison feeding, nutrition and health, storage and packing solutions, surge and sustainment support, and water security. SUBNET forms a community of practice with Military Services, U.S. Department of Agriculture, Natick Soldier Research Development, and Engineering Center; Academia, and Industry to research and promote manufacturing improvements in the Subsistence Supply Chain with the goals of maximizing capability and capacity to produce, and to encourage innovation and modernization needed to leverage the latest technologies. Desired outcomes include: reduced cost, increased efficiencies, enhanced quality, and improved surge demand capabilities.\n\nThe Casting program works to ensure a stable, reliable, and competitive domestic casting industrial base for the weapon system needs of the Department of Defense (DoD). Castings works with industry, universities, and the Casting Industry Associations to identify projects to improve the materials, processes and business practices of the nation’s foundry industry. The program aligns its projects with strategic issues and focus areas within the DLA and DoD.   Weapon system spare parts managed by DLA that contain castings are responsible for a disproportionate share of DLA’s backorders or unfilled orders (UFOs). Cast parts are ~2% of National Stock Numbered Class IX parts but represent ~5% of all backorders, and when only the oldest backorders are considered, up to 10% are castings. This program includes tasks to develop new capabilities in the areas of inspection, materials, processes, modeling, and design. Once developed, these capabilities will support the foundry industry, where these technologies will be tested and implemented, usually in conjunction with the industry associations. These advancements improve the metal casting supply chains for the DOD and the DLA to better support the warfighter. We will  invest in projects aimed at reducing lead-time, reducing cost, and improving quality of castings critical to DOD weapon systems.\n\nThe Forging program works to ensure a stable, reliable, and competitive domestic forging industrial base for the weapon system needs of the Department of Defense and the Defense Logistics Agency. Working with industry, universities, and the Forging Industry Association to identify projects to improve the materials, processes and business practices of the nation’s forging industry. The program aligns its projects with strategic issues and focus areas within the DLA and DoD.  Weapon system spare parts managed by DLA that contain Forgings are responsible for a disproportionate share of DLA’s backorders or unfilled orders (UFOs). Forged parts are ~2% of National Stock Number (NSN) Class IX parts but represent ~5% of all backorders, and when only the oldest backorders are considered, up to 10% are forgings. This program includes tasks to develop new capabilities in the areas of inspection, materials, processes, modeling, and design. Once developed these capabilities will support the forging industry, where these technologies will be tested and implemented in conjunction with the industry associations. These advancements improve the forging supply chains for the DoD and the DLA to better support the warfighter.  We will  invest in projects aimed at reducing lead-time, reducing cost, and improving quality of forgings critical to DoD weapon systems.\n\nThe Additive Manufacturing (AM) objective is to establish AM as an effective alternative to conventional manufacturing and document the process for AM benefits. DLA is pursing all AM technology as a lead-time and inventory reduction enabler.  The AM effort pursues alternate means of supply for products that are otherwise non-procurable or susceptible to procurement issues due to an unresponsive manufacturing vendor base. The AM effort includes the identification of AM candidates among the population of products that are needed but hard to obtain, costly or have long manufacturing lead times. The AM effort requires management of 3D digital technical and manufacturing data. In addition, the AM effort includes the development of the processes that will tie the designers, engineers, maintainers, logisticians, procurement managers and the vendor base into a seamless AM procurement stream. Potential benefits include products that can address an unfulfilled Warfighter readiness need by reducing production lead times, production costs, storage costs, transportation costs and in some cases fuel consumption due to lighter design and material options. DLA R&D will leverage these efforts with Industry, Academia and ongoing Military Service-level agreements (Army, Navy, Marine Corps, Air Force), Oak Ridge National Laboratory (ORNL) and the Department of Energy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Industrial Base Manufacturing Processes (formerly Material Availability)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.157"
                                            },
                                            "Text": {
                                                "val": "The Subsistence Network plan in FY17 is to expand to the broader subsistence network; having awarded the Broad Agency Announcement in 2016. DLA will work STPs with the community of practice partners of the military services, industry and academia.  SUBNET plans to improve process capabilities by identifying targets for product, automation and business operation changes, and implementing solutions in the Subsistence Supply Chain to produce such improvements as shorter lead times, higher throughput, reduced inventory and overhead cost, and improved quality. The STPs are required to have a business case, developed in advance to include specific metrics for success as well as return on investment where applicable to ensure that all SUBNET STPs are fully documented, all projects have the potential for implementation in industry; and all projects address a specific DoD\/DLA need.  \n\nThe Castings program will receive a significant increase in funding starting in FY17 to cover most of the unfunded requirements identified during the PBR 17 process. Projects identified will investigate, develop and deploy innovative enterprise and technical solutions to improve casting supply chains for the Department of Defense and the Defense Logistics Agency to support the warfighter.  Contracts will be competitively awarded in FY17.  Proposals are required to include a business case with specific metrics and transition plan for success.\n\nThe Forging program will receive an increase in funding to cover most of the unfunded requirements identified during the PBR17 process.  Proposals are required to include a business case with specific metrics and transition plan for success. The Forging consortium will also pursue additional forging manufacturing advances from successful DLA SBIR projects selected in FY2014.\n\nThe Battery Network funding will be applied to pursue additional projects including production readiness of lithium conformable soldier batteries, military ground vehicle batteries, and aviation batteries; manufacturing transition of legacy and obsolete lead acid and nickel cadmium batteries to advanced lithium-ion batteries; and battery manufacturing automation and optimization technologies. These projects will address pressing supply chain issues by migrating from declining manufacturing to a high growth industrial base, and will achieve cost reduction by optimizing the manufacturing design, assembly, and test processes.\n\nThe Additive Manufacturing plan is for DLA to partner with the Military Services to use AM to produce parts. DLA and the Services will identify candidate parts, convert technical data to 3D format to facilitate AM, procure the parts, and document the process for AM benefits. The Services will review newly created technical data packages (TDP), test the parts, and qualify AM as an acceptable process to produce the parts.\n\nFY 16 – FY 20: Funding for Additive projects will be reallocated from other MA SFA thrusts and classified into the Additive Manufacturing Thrust."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.227"
                                            },
                                            "Text": {
                                                "val": "The Battery Network will initiate new projects and continue efforts from FY17 for improving the production readiness, transition, and standardization of soldier and system batteries within the DLA supply chain. The Battery Network will also transition new battery manufacturing technologies developed in Small Business Innovative Research (SBIR) - electrode laser cutting, solvent-free electrode production, low cost materials production or recycling, advanced performance cells. DLA will also continue initiatives for manufacturing and material improvements in the vacuum electron tube supply base (used in microwave and radar systems) and pursue additional opportunities.\n\nThe Subsistence Network program plans to initiate and execute short-term projects in FY18, and continue efforts from FY17. SUBNET will also continue to pursue SBIR Topics in Subsistence. The Subsistence Network will also continue to work with community partners (military services, industry, and academia) to leverage the latest technologies, encourage innovation and modernization, and promote manufacturing improvements in the subsistence supply chain.\n\nThe Castings program plans to investigate, develop and deploy innovative enterprise and technical solutions to improve casting supply chains for the Department of Defense and the Defense Logistics Agency to support the warfighter. A Broad Agency Announcement (BAA) closed in FY17 and from that, we competitively award contracts to fulfill those requirements. Projects will be required to include a business case with specific metrics and a transition plan for success. The Casting program will also continue executing projects approved and awarded in prior years. \n\nThe Forging program will continue executing projects approved and awarded in prior years. In addition, the Forging program will receive an increase in funding to cover the unfunded requirements identified during the PBR17 process. Projects will investigate, develop and deploy innovative enterprise and technical solutions to improve forging supply chains for the DoD and DLA to support the warfighter. We competitively award contracts to fulfill those requirements. Projects will include a business case with specific metrics and transition plan for success.\n\nThe AM program plans to leverage Industry and the Military Service Engineering Support Activities (via Service-level agreements with the Army, Navy, Marine Corps, Air Force) ORNL and the Department of Energy by providing funding for AM support activities work identified under the respective agreements. Desired outcomes include: acceleration of rapid qualification and certification methodologies for AM, identification of AM applications for castings and forging preforms, rapid cast production and repair of castings using AM, exploration of conversion of recyclable materials to AM material, improved reverse engineering processes for AM purposes, and optimization of polymer and metal AM production to obtain land, air and sea and expeditionary platform spare parts. These efforts seek to increase the number of AM parts qualified for procurement and achieve savings from the associated lead-time, storage costs, transportation costs, in some cases reduction of fuel consumption due to lighter design and material options. Overall DLA Enterprise AM efforts will provide alternatives in product realization in order to address unfulfilled Warfighter readiness needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.109"
                                            },
                                            "Text": {
                                                "val": "The Battery Network will initiate new projects for improving the production readiness, transition, and standardization of soldier and system batteries within the DLA supply chain. The program will also leverage new battery manufacturing technologies for the supply chain that have been developed by industry – advanced electrode production, low cost materials production or recycling, advanced performance cells, and deep-discharge lithium-ion capabilities. The program will continue addressing additional requirements for manufacturing and material improvements in the vacuum electron tube supply base.\n\nThe Subsistence Network program plans to research and execute short-term innovative projects to improve the subsistence supply chain in FY19, and continue efforts from FY18. The Subsistence Network will attend subsistence trade and industry events to leverage technology innovations and promote manufacturing improvements. The program will also pursue SBIR Topics in Subsistence.  The Subsistence Network will work with community partners (military services, industry, and academia) to leverage the latest technologies, encourage innovation and modernization, and promote manufacturing improvements in the subsistence supply chain.\n\nThe Castings program plans to research, develop and deploy innovative and technical solutions to ensure a viable and competitive domestic industrial base for the DoD and DLA in support of the needs of the warfighter. The program will use competitively awarded contracts to fulfill these requirements; projects are required to include a business case with specific metrics and a transition plan for success. The Casting program will continue to work with industry, academia, and the leading Industry Associations to identify improvements to materials, processes, and business practices of the nation’s metal casting industry. The Casting program will continue to execute projects approved and awarded in prior years but will also maintain focus on future development and needs while executing projects awarded in FY19. \n\nThe Forging program will investigate, develop and deploy innovative enterprise and technical solutions to strengthen the forging supply chain and the forging industry. The program will explore alternative forging manufacturing methods, materials and modeling to reduce production lead time and costs. Enhancements to modeling and simulation software coupled with forging process and post-processing improvements are some projects that align the forging program with fulfilling the needs of the warfighter. The Forging program will also continue to execute projects approved and awarded in prior years.\n\nThe AM Program plans to fund technically proficient efforts that accelerate the rapid qualification and certification methodologies for AM items, identify the best AM applications for castings and forging preforms, achieve precise repeatability of part fabrication using an AM technical data package at simultaneous geographic points of need and prove the delivery of AM parts to warfighters deployed at expeditionary sea, land or air bases. Using market research, requests for information\/proposals, Broad Agency Announcements (BAA), DLA R&D will identify the best courses of action to negotiate intellectual property for AM fabrication data to keep these items competitive. The DLA R&D efforts include the proof of concept of using digital thread methodologies to effectively manage manufacturing data and maintain a consistent AM product from design through qualification and acceptance. Collaboration will continue with the Military Service Engineering Support Activities (via Service-level agreements with the Army, Navy, Marine Corps, Air Force) and the Department of Energy by providing funding for AM work identified under the respective agreements. The partnership with ORNL will allow further options with the Big Area AM (BAAM) family of parts. DLA will leverage Military Services and Industry collaboration to develop digital verification and validation (including measures of effectiveness and key performance parameters) of AM technical data and first article testing for polymers and metals, and critical and non-critical items. These efforts seek to increase the number of AM parts qualified for procurement and achieve savings from the associated lead-time, storage costs, transportation costs, in some cases reduction of fuel consumption due to lighter design and material options."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 increase is to begin to automate combat rations visual inspections and prepare for future innovative nanotechnology packaging systems for combat rations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AAA"
                    },
                    "ProjectTitle": {
                        "val": "Maintaining Viable Supply Sources (formerly High Quality Sources)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.302"
                        },
                        "CurrentYear": {
                            "val": "17.103"
                        },
                        "BudgetYearOne": {
                            "val": "27.770"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.770"
                        },
                        "BudgetYearTwo": {
                            "val": "19.422"
                        },
                        "BudgetYearThree": {
                            "val": "19.749"
                        },
                        "BudgetYearFour": {
                            "val": "19.825"
                        },
                        "BudgetYearFive": {
                            "val": "20.094"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Maintaining Viable Supply Sources SFA are projects undertaken to assure that the industrial base can respond to DLA requirements and DLA can fill military customers’ material requirements reliably and consistently. Benefits include eliminating cancelled requisitions returned to customers as “non-procurable.” This strategic focus area includes within its scope the former Material Acquisition Electronics (MAE) program. \n\nThe MAE Roadmap has four major thrusts in Digital Microcircuits: Advanced Schottky TTL, TTL Compatible CMOS, 512 Kilobit RAM\/ROM and Mega Gate ASIC. The Roadmap also includes a new major thrust area: Linear Microcircuits. Over the past several years, obsolescence in this class of microcircuits has greatly increased and has become a significant concern. These are classes of microcircuits that are expected to become non-procurable in FY 17 and beyond. Without the technologies planned on the MAE Roadmap, DLA will not be able to support DoD’s requirements for high quality spare parts for critical electronic systems and subsystems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maintaining Viable Supply Sources (formerly High Quality Sources)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.302"
                                            },
                                            "Text": {
                                                "val": "MAE will continue planning for the specific emulation technology implementations to support specific device family groups in consonance with Customer and Agency requirements. MAE will begin a major new thrust in emulation to address Linear Microcircuits in addition to its traditional focus on Digital.  Several efforts will address basic design, manufacturing, electrical test and quality\/reliability requirements for establishing a basis for product-oriented developments across the FYDP. MAE will also complete development and transition Advanced Schottky TTL Digital Microcircuit Emulation capability into full-scale production increasing DLA’s ability to re-establish sourcing of non-procurable microcircuit NSNs.  The newly transitioned emulation capabilities will address several discontinued device families and will increase the potential emulation production envelope by several hundred NSNs.  MAE will also continue development of additional emulation capabilities including TTL-Compatible CMOS. MAE will also initiate several new implementations including development of a 1 million gate Application-Specific Integrated Circuit (ASIC) and 512K Read-Only and Random-Access Memory Emulation Capabilities. It will complete prototyping 350 nanometer emulation circuitry, bringing emulation capability that re-establishes sources for additional NSNs.\n\nStrategic Materials: A request for white paper proposals was recently added to DLA’s Emerging R&D Requirements BAA for critical initial manufacturing technology requirements in domestic high strength carbon fibers.  Additional targeted requirements will be determined with DLA Strategic Materials.  Targeted requests for proposals will be conducted to address specific needs and opportunities to ensure that critical strategic materials are available from domestic sources and that process innovations are in place to efficiently produce strategic materials. Manufacturing technologies and capabilities are expected to transition to Title III or specific Weapon System Program funds for industrial base qualification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.103"
                                            },
                                            "Text": {
                                                "val": "MAE will continue planning for the specific emulation technology implementations to support specific device family groups in consonance with Customer and Agency requirements. MAE will continue a major new thrust in emulation to address Linear Microcircuits in addition to its traditional focus on Digital. Several efforts will address basic design, manufacturing, electrical test and quality\/reliability requirements for establishing a basis for product-oriented developments across the FYDP. MAE will also complete development and transition TTL-Compatible CMOS Microcircuit Emulation capability into full-scale production increasing DLA's ability to re-establish sourcing of non-procurable microcircuit NSNs. The newly transitioned emulation capabilities will address several discontinued device families and will increase the potential emulation production envelope by several hundred NSNs. MAE will also continue development of additional emulation capabilities including development of a 1 million gate Application-Specific Integration Circuit (ASIC) and 256K Read-Only and Random-Access Memory Emulation Capabilities. It will begin applying 350 nanometer emulation technology to specific part families for additional NSNs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.770"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.770"
                                            },
                                            "Text": {
                                                "val": "MAE will continue planning for the specific emulation technology implementations to support specific device family groups in consonance with Customer and Agency requirements. It will begin digital microcircuit process development at the 250 nanometer technology node including development of electron-beam lithography techniques. MAE will continue a major new thrust in emulation to address Linear Microcircuits in addition to its traditional focus on Digital. Several efforts will address basic design, manufacturing, electrical test and quality\/reliability requirements for establishing a basis for product-oriented developments across the FYDP. MAE will complete and transition 20-Volt operational amplifier emulation capability into full-scale production increasing DLA's ability to re-establish sourcing of non-procurable microcircuit NSNs. MAE will continue 40-Volt operational amplifier and analog switch projects started in FY18.  It will continue applying 350 nanometer emulation technology to specific part families for additional NSNs including 256K Static Random Access Memory (SRAM)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The proposed FY19 one-year $9M investment in equipment will graduate the Advanced Microcircuit Emulation program from soon to be antiquated photolithographic manufacturing techniques to use the more advanced electron beam lithography microcircuit manufacturing methods, which will support at least two future generations of technology over 10 to 15 years."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "OOO"
                    },
                    "ProjectTitle": {
                        "val": "Improving Technical and Logistics Information (formerly Industry and Customer Collaboration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.277"
                        },
                        "CurrentYear": {
                            "val": "7.181"
                        },
                        "BudgetYearOne": {
                            "val": "5.788"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.788"
                        },
                        "BudgetYearTwo": {
                            "val": "4.756"
                        },
                        "BudgetYearThree": {
                            "val": "4.931"
                        },
                        "BudgetYearFour": {
                            "val": "4.871"
                        },
                        "BudgetYearFive": {
                            "val": "4.944"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Improving Technical and Logistics Information SFA projects improve and facilitate the communication of technical and logistics information among industry, DLA’s military customers and DLA. This SFA includes the Military Unique Sustainment Technology (MUST), the Defense Logistics Information Research (DLIR), and the Emergent Manufacturing Technology (EMT) portfolios within its scope. \n\nThe MUST Program focus addresses GAO Report 12-707 recommendations for DoD to establish a “knowledge-based approach” to collaborate on define and communicate of military unique requirements. DLA has the responsibility to communicate and manage the technical requirements among the Services and the Defense Industrial Base. Currently there is no common environment for collaborating on new requirements among the stakeholders. The strategic objective of the DLA MUST program is to identify, develop and adopt technologies that can significantly reduce the lead-time between Individual Item and Equipment (IIE) development and sustainment from years to months. The Program focuses on technologies that will transform the military IIE supply chain from an “electronic paper” (i.e. PDF\/MS Word) based, manual environment into a knowledge based automated environment. The resulting approach will be a neutral platform that will seamlessly communicate military unique technical requirements throughout the end-to-end supply chain.\n\nThe DLIR program researches core technology to improve the quality, speed, and interoperability of logistics data. DLA must transform business practices and methodologies as the data for weapons systems evolves from traditional formats and delivery methods (such as two-dimensional images and PDF formats) to newer, more innovative methods (such as three-dimensional solid models, object-oriented databases, service-oriented architecture (SOA) and Web 3C standards). This fundamental shift for DLA is driven by the Model-Based Enterprise approach, which is influencing the way industry is delivering design and development data for weapon systems to the Military Services and the way the Military Services in turn manage and provide the data to DLA. DLA Logistics Operations, DLA Acquisition, DLA Tech\/Quality, and the Defense Standardization Program Office (DSPO) are key stakeholders in the DLIR initiatives to modernize the representation and delivery of weapons systems data. The DLIR program researches and demonstrates the use of innovative technologies to streamline DLA operations; current thrusts include development of logistics data interoperability and availability, and research into the transformation of DLA data repositories to a digitally linked, model-based enterprise. \n\nThe Technical and Logistical Data Interoperability will pioneer methods to capture data from military Services, Original Equipment Manufacturers (OEMs), and suppliers to form a seamless thread of interoperable and linked data models.\n\nThe EMT program addresses emerging and out of cycle requirements that always occur as DLA strives to maintain readiness of the aging weapon systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Technical and Logistics Information (formerly Industry and Customer Collaboration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.277"
                                            },
                                            "Text": {
                                                "val": "Continue the distributed pilots and begin transition of the technology into the supply chain.  Expand the number of companies participating in the pilots and validating the benefits of the knowledge based approach to IIE development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.181"
                                            },
                                            "Text": {
                                                "val": "DLIR plans to resume moving DLA from PDF Tech Data to Smart Data and Engineering Models and leveraging semantic technology to improve logistics data across the DLA Enterprise.\n\nMUST plans to continue test and validation pilots as well as process reengineering. In addition MUST plans to begin a schedule for prototype development and demonstration to be initiated in FY19.\n\nEmerging Manufacturing Technology program enables DLA to investigate new disruptive technology advances that may be implemented in the nearer term, without degrading  well established program efforts. This program enables the Agency to advance those technologies sooner to the warfighter earlier. SBIR phase III efforts (which cannot be funded with SBIR funds) are a prime example of activities that will be funded with these funds, examples include emerging magnetic braking technologies, and addressing strategic materials shortage\/risk."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.788"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.788"
                                            },
                                            "Text": {
                                                "val": "DLIR plans to continue assisting DLA improve the quality and interoperability of logistics data across the Enterprise and for the defense industrial base. Specifically, DLIR will initiate the Logistics Interoperability Technology Extension (LITE) project. LITE proposes publishing logistics documents as data instead of PDF utilizing advanced semantic interpretation techniques to extract and model the data inside the document. This approach will be based upon open standards to improve publishability of documents and to ensure broad industry adoption.  LITE will enable improved interoperability between DOD internal and external data sources.  \n\nMUST plans to conduct test and validation pilots, process reengineering to provide complete Function Requirement Document (FRD) for transition.  The focus will be the Product Test Center (PTC) industry reporting module, the TexSpec conversion for Spec Change Management, the Supply Request Package (SRP) process reengineering and the Shade Instrument Large Scale Pilot.  Schedule for Implementations with complete FRDs will start in FY19.\n\nThe EMT program enables DLA to investigate new disruptive technology advances that may be implemented in the nearer term, without degrading  well established program efforts. This program enables the Agency to advance those technologies sooner in order to provide to the warfighter earlier. SBIR phase III efforts (which cannot be funded with SBIR funds) are a prime example of activities that will be funded with these funds, examples include emerging magnetic braking technologies, and addressing strategic materials shortage\/risk. Efforts will begin in FY19 to advance Digital Manufacturing by developing a comprehensive approach to take advantage of integrated, computer-based systems of simulation, three-dimensional (3D) visualization, analytics and various collaboration tools to create and manufacture products to support the warfighter.  Additionally, any emergent Strategic Materials requirements will be addressed through the EMT program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 decrease due to funds realignment to Maintaining Viable Supply Sources."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex; non-studies) will transition."
                        }
                    }
                }
            ]
        }
    }
}