{
    "id": "2019-AirForce-PB-3600-MJBOOK-0-0-c3a203aa28182b60f61dc370dc004d262f4542c92e834cf238859eb5ffc78d51-23",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603456F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "25.784"
            },
            "CurrentYear": {
                "val": "33.635"
            },
            "BudgetYearOne": {
                "val": "36.463"
            },
            "BudgetYearOneBase": {
                "val": "36.463"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "37.541"
            },
            "BudgetYearThree": {
                "val": "36.237"
            },
            "BudgetYearFour": {
                "val": "37.068"
            },
            "BudgetYearFive": {
                "val": "37.818"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to enhance Airman performance and effectiveness in the aerospace force. State-of-the-science advances are made in warfighter training, warfighter system interfaces, directed energy bioeffects, deployment and sustainment of warfighters in extreme environments, and understanding and shaping adversarial behavior. The Directed Energy Bioeffects Parameters project develops, demonstrates, and transitions technologies to predict,evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems. The Human Dynamics and Terrain Demonstration project develops, demonstrates, and transitions human-centric technologies to address processing, exploitation, and dissemination of intelligence, surveillance, and reconnaissance (ISR) capability needs. The Mission Effective Performance project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness. The Warfighter Interfaces project develops, demonstrates, and transitions technologies to revolutionize the way airmen synergistically use Air Force systems, including autonomous machines and adaptive teams of airmen and machines. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602601F, 0602602F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "26.492"
                },
                "CurrentYear": {
                    "val": "33.635"
                },
                "BudgetYearOne": {
                    "val": "36.737"
                },
                "BudgetYearOneBase": {
                    "val": "36.737"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.784"
                },
                "CurrentYear": {
                    "val": "33.635"
                },
                "BudgetYearOne": {
                    "val": "36.463"
                },
                "BudgetYearOneBase": {
                    "val": "36.463"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.708"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.274"
                },
                "BudgetYearOneBase": {
                    "val": "-0.274"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.708"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.274"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.274"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635323"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Bioeffects Parameters"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.848"
                        },
                        "CurrentYear": {
                            "val": "5.388"
                        },
                        "BudgetYearOne": {
                            "val": "5.251"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.251"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.154"
                        },
                        "BudgetYearThree": {
                            "val": "5.280"
                        },
                        "BudgetYearFour": {
                            "val": "6.602"
                        },
                        "BudgetYearFive": {
                            "val": "6.736"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems.  This project also develops the human components of the guidelines for testing, deployment, and protection from high power microwave and high energy laser systems and uses this information to enhance the effectiveness of these weapon systems in air, space, and cyber operations.  The optical radiation bioeffects thrust develops and demonstrates technologies that counter optical threats, while exploiting optical systems for directed energy weapons applications.  The radio frequency (RF) radiation bioeffects thrust develops and demonstrates technologies to assess RF bioeffects and collateral hazards from high power RF directed energy systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate optical protective technologies for aircrew and ground personnel to provide protection against directed energy threats.  Develop modeling capabilities to assess collateral hazards from high power directed energy laser systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.506"
                                            },
                                            "Text": {
                                                "val": "Further integration of physiological\/behavioral response models into engagement-level simulation capabilities for directed energy weapon threats and concepts.  Validate and demonstrate modeling and simulation tools which transition engagement-level simulations to mission and campaign models to evaluate the utility and impact of directed energy systems.  Develop human systems integration modeling tools for laser eye protection devices.  Evaluate new technologies for laser eye protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.324"
                                            },
                                            "Text": {
                                                "val": "Support low-power ground testing as part of Self-Protect High Energy Laser Demonstrator (SHiELD) Advanced Technology Demonstration (ATD). The SHiELD ATD will be supported in order to assess concepts of operation risks from laser exposures and in order to ensure test safety.  Activities will include the integration of simulation capabilities as well as validation of predictive laser bioeffects models.  Develop probabilistic risk assessment tools to evaluate hazards and effectiveness of developing laser weapons.  Continue campaign-level assessment of mission with simulations involving directed energy threat and concept assessment.  Complete assessment of threshold level damage effects on physiological\/behavioral responses using in-house models.  Complete assessment of block 3 laser eye protection capability with prediction metrics for next spiral in acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.247"
                                            },
                                            "Text": {
                                                "val": "Mature integration of predictive models of bioeffects and protection in Air Force Research Laboratory (AFRL) level analysis architectures. Complete first end-to-end methodology for incorporation of probabilistic risk-based assessments for lasers in a collateral damage estimation toolset.  Perform ground evaluation of prototype nuclear flash protection goggle to investigate  technology compatibility with cockpit displays and airman performance requirements. Mature high-energy laser bioeffects and safety analysis tools through validation and verification and end-user evaluation for initial transition to major test range environments. Apply matured technologies to support of SHiELD Advanced Technology Demonstration and AFRL Laser Weapons System Program during ground and flight test safety planning."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.077 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to assess RF bioeffects and collateral hazards from high power RF directed energy systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.342"
                                            },
                                            "Text": {
                                                "val": "Continue verification and validation studies for high peak power effects model in support of next-generation counter-electronics weapons. Develop and validate a model of effects of low gigahertz radiation. Inform development of fire control technology for millimeter wave and high power microwave technologies based on safety and effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.064"
                                            },
                                            "Text": {
                                                "val": "Complete validation of a high average power bio-heat dosimetry model.  Continue verification and validation of thermal effects models for high average power systems.  Initiate fast thermal gradient effects model, and validation of dosimetry model.  Continue development of fire control algorithms for millimeter wave technology, and initiate development of system training software in preparation for distributed simulation events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.004"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "Integrate high average power bio-heat dosimetry models into distributed simulation environments.  Development of fast thermal gradient effects dosimetry validation models and continue effect model validation strategy.  Further development\/refinement of high average power models and validation through use of empirical comparisons moving into finer resolution to include internal structures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.060 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635324"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics and Terrain Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.115"
                        },
                        "CurrentYear": {
                            "val": "5.432"
                        },
                        "BudgetYearOne": {
                            "val": "5.408"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.408"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.886"
                        },
                        "BudgetYearThree": {
                            "val": "6.001"
                        },
                        "BudgetYearFour": {
                            "val": "7.446"
                        },
                        "BudgetYearFive": {
                            "val": "7.597"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to identify human threats within the air, space, and cyber domains.  These technologies will enhance Air Force capabilities in ISR, layered sensing, autonomous and adaptive decision-making systems, decision aids for computer network attack\/defense\/support, ISR force development and training, cross-cultural communication, human-centric exploitation of measurement and signatures intelligence, and advanced molecular diagnostic methodologies to assess airman performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate human-centered design processes and operational tools that optimize ISR information exploitation and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.782"
                                            },
                                            "Text": {
                                                "val": "Develop analytical work environment concepts to support advanced multi-intelligence analysis.  Demonstrate airmen-centered tools for future distributed ground processing concepts.  Assess efficacy of new concepts, methodologies, and tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.717"
                                            },
                                            "Text": {
                                                "val": "Develop human-machine collaboration and automation technologies to improve work efficiency and product quality of ISR analysts.  Preparing for transition speech-to-text technologies to the Air Force Distributed Common Ground Station architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.771"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.771"
                                            },
                                            "Text": {
                                                "val": "Transition speech to text technologies to Distributed Ground System Special Operations Forces (DGS-SOF). Preparing for transition of multi-intelligence analysis tools and airman-machine collaboration technologies to Air Force Distributed Common Ground System (AF-DCGS)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.054 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate machine translation and speech-to-text tools to support the span of Air Force mission areas including ISR and cyber operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.874"
                                            },
                                            "Text": {
                                                "val": "Investigate advanced multimedia translation and automatic speech recognition tool applications in military environments for mission focus areas and domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.715"
                                            },
                                            "Text": {
                                                "val": "Improve automatic speech recognition and machine translation results by incorporating context, including techniques for actively learning unknown words, and providing multilingual search capabilities to increase the task throughput of human operators performing intelligence, surveillance, and reconnaissance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.637"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.637"
                                            },
                                            "Text": {
                                                "val": "Develop initial context awareness of deep neural networks for improving automatic speech recognition and machine translation algorithms for Intelligence Surveillance Reconnaissance (ISR) analyst applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.078 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Develop automated and assisted methods to exploit human threat biosignatures to defeat terrorist activities and hidden person-borne threats.  Provide improved models of virtual humans to deliver mission-ready training for ISR analysts and create more immersive, realistic experiences in joint and coalition exercises."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.459"
                                            },
                                            "Text": {
                                                "val": "Integrate human detection algorithm to provide operators with real-time counts of gender and age differentiation into operationally relevant sensor applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Work Completed in FY 2017. No current plans as funding has been reallocated in FY18 to support AFRL Autonomy Initiative."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Not applicable"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635325"
                    },
                    "ProjectTitle": {
                        "val": "Mission Effective Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.199"
                        },
                        "CurrentYear": {
                            "val": "6.626"
                        },
                        "BudgetYearOne": {
                            "val": "6.795"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.795"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.929"
                        },
                        "BudgetYearThree": {
                            "val": "7.069"
                        },
                        "BudgetYearFour": {
                            "val": "7.212"
                        },
                        "BudgetYearFive": {
                            "val": "7.358"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  This project also develops advanced methods and technologies to enable interactive live, virtual, and constructive (LVC) environments for performance-aiding methods and technologies.  Focus areas include integrated high-fidelity weapon systems training technologies for air, space, and cyber; tailored immersive simulation environments for airmen at the tactical and operational levels; and incorporation of performance assessment and feedback tools.  These methods and technologies facilitate the development of mission-essential competencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure, persistent, and standardized LVC training enterprise.  Utilize modeling capabilities for technology demonstration efforts focused on developing software-based tools for training that would replace human instructors.  This enables more efficient mission execution training in an LVC environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.199"
                                            },
                                            "Text": {
                                                "val": "Begin definition of standards for sharable scenario content, data, models, and metrics across a range of military operations.  Transition fast jet learning management system into routine operational training and to an alternate research domain.  Begin development of methods to create adaptive learning environments across multiple missions contexts.  Define studies to evaluate efficiencies to be derived from the creation and use of more sharable scenario content models and metrics in LVC testbeds."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.626"
                                            },
                                            "Text": {
                                                "val": "Continue standards definition for sharable scenario content, data, models, and metrics across a range of military operations.  Demonstrate learning management system in a series of LVC testbeds to enable transfer of training studies.  Continue development of methods to create adaptive learning environments across multiple missions contexts.  Execute evaluation studies on sharable scenario content models and metrics in LVC testbeds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.795"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.795"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of sharable content across domain for airman machine team and multi-domain command and control. Establish warehouse for multiple domain performance data to enable proficiency-based training. Test and evaluate proficiency-based training at an operational unit. Increase after action review data visualization for real-time lessons learned and training effectiveness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.169 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635327"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Interfaces"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.622"
                        },
                        "CurrentYear": {
                            "val": "16.189"
                        },
                        "BudgetYearOne": {
                            "val": "19.009"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.009"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.572"
                        },
                        "BudgetYearThree": {
                            "val": "17.887"
                        },
                        "BudgetYearFour": {
                            "val": "15.808"
                        },
                        "BudgetYearFive": {
                            "val": "16.127"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to revolutionize the way airmen optimize the capabilities of Air Force systems, including autonomous machines and adaptive teams of Airmen and machines.  Improvements in the presentation of operational information to the community of users, from the system operator to the commander, must be developed in step with advancements in the acquisition, storage, and retrieval of information.  This project provides the advances in understanding of human cognitive abilities, as well as the utilization of human interfaces, multisensory fusion, high-resolution image displays, and three-dimensional (3-D) audio to customize communications and enhance shared understanding across a diverse user community in air, space, and cyber for maximum situational awareness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Demonstrate ability to forecast acoustic profiles for any atmospheric\/terrain condition.  Demonstrate technologies to enhance the battlefield Airman's situational awareness through wearable interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.689"
                                            },
                                            "Text": {
                                                "val": "Transition real-time 3-D acoustic models into mission planning tools. Transition high-fidelity 3-D acoustic models against real world data obtained from airborne platform measurements in different weather and terrain environments. Model and validate (through human listener studies) the impact of weather, landscape, and geography on acoustic propagation. Evaluate applications of physiological sensors and human performance assessment technologies for the battlefield airmen and pararescue jumpers. Refresh usability engineering methodologies to prototype and test innovative solutions required for battlefield airmen and pararescue jumpers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.071"
                                            },
                                            "Text": {
                                                "val": "Transition real-time acoustic mission planning capability to enhance training and optimize mission effectiveness.  Develop advanced interfaces for real-time interaction with acoustic models of listening environments to enhance warfighter situational awareness and effectiveness.  Employ advanced usability engineering methodologies for rapid prototyping, testing and seamless integration of innovative technologies into tactical ensembles supporting Battlefield Airmen and Pararescue operations.  Transition enhanced, man-wearable communication systems, mobile interfaces, and physiological sensors to enhance situation awareness, improve training, and support real-time battlespace monitoring for dismounted operators."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.722"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.722"
                                            },
                                            "Text": {
                                                "val": "Continue 3D audibility modeling research for special operations aviation focusing on effects of atmospherics, terrain, and psychoacoustic performance, and continue development\/refinement of advanced interfaces for real-time interaction with acoustic models of listening environments.  Continue conducting usability testing and employing advanced engineering methodologies for rapid prototyping, testing and seamless integration of innovative technologies into tactical ensembles supporting Battlefield Airmen and Para-rescue operations.  Continue to transition enhanced, man-wearable communication systems, mobile interfaces, and physiological sensors to enhance situation awareness, improve training, and support real-time battlespace monitoring for dismounted operators."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.651 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an integrated human-centered interface to control multiple Remotely Piloted Aircraft (RPA) that have various levels of autonomy and that optimize net-centric information flow. Develop and demonstrate manned-unmanned interaction and team concepts for tactical environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.933"
                                            },
                                            "Text": {
                                                "val": "Enhance and evaluate refined interface designs for a networked collaborative environment to enable distributed teams of manned and unmanned systems to work synergistically to maximize mission effectiveness.  Establish design patterns for optimal human-autonomy dialog tailored to the specific computational methods utilized by the underlying autonomy.  Refine intelligent agents for decision support and plan monitoring, across a wide range of applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.118"
                                            },
                                            "Text": {
                                                "val": "Develop human-machine interface (controls, displays, and decision support) to enable effective manned-unmanned tactical flight operations. Develop and demonstrate control techniques to direct maneuvers and tactics at manageable pilot workload levels. Develop and demonstrate architectures and interfaces to enable manned-machine teaming for the tactical air environment. Develop external contingency management methods for flight operations. Demonstrate pilot-vehicle interface capabilities in high-fidelity virtual simulation to assess pilot performance and mission effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.287"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.287"
                                            },
                                            "Text": {
                                                "val": "Flight demonstrate airman-directed control and management of multiple unmanned tactical behaviors.  Develop and integrate decision support and embedded intelligent agent capabilities to assess and reason about manned-unmanned team performance and overall mission effectiveness.  Demonstrate adaptive human-machine interfaces and task allocation methods in virtual and live tests.  Initiate m x n cooperative teams in networked simulation environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $2.169 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}