{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-18",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603618D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Electronic Advanced Technology"
        },
        "R1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.376"
            },
            "CurrentYear": {
                "val": "14.389"
            },
            "BudgetYearOne": {
                "val": "12.918"
            },
            "BudgetYearOneBase": {
                "val": "12.918"
            },
            "BudgetYearTwo": {
                "val": "12.098"
            },
            "BudgetYearThree": {
                "val": "12.318"
            },
            "BudgetYearFour": {
                "val": "12.529"
            },
            "BudgetYearFive": {
                "val": "12.766"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "To counter the United States’ historic technological advantage, adversaries are increasingly developing asymmetric capabilities that are enabled by advanced commercial electronic components and devices that have become globally available.  These threats range from terrorist-employed improvised devices, small unmanned air systems, and easily transportable Man-Portable Air Defense Systems (MANPADS) to dedicated military systems such as advanced sensor systems, advanced Electronic Warfare (EW) components and systems, advanced Integrated Air Defense Systems (IADS), and increasingly capable cruise and ballistic missiles that can diminish our technological advantage in conflicts with nation-states.\n\nThe rate at which new threats are appearing continues to accelerate and the myriad of new advanced Electromagnetic Spectrum (EMS) threats have made operations in the EMS significantly more difficult and complex.  The challenges posed by new kinetic and non-kinetic EMS threats and the dire consequences of technology surprise highlight the need to rapidly develop and field innovative EW and EW-Cyber capabilities that can rapidly address these new threats in more cost-effective ways.\n\nThe Joint Electronic Advanced Technology (JEAT) program was established to address these challenges through efforts designed to significantly accelerate the development and transitioning of new EW and EW-Cyber capabilities.  To do this, the JEAT program explores, assesses, and validates a plethora of new technologies and approaches focusing specifically on technologies and approaches that fall outside the Services’ Research and Development (R&D) programs or are being developed by the Services at rates that cannot not produce required capabilities in the needed timeframes to identify the most fruitful EW and EW-Cyber R&D opportunities for the Department.  To identify potential nearer-term and lower-cost solutions, the JEAT program also explores and assesses approaches that integrate and demonstrate off-the-shelf military and commercial technologies in innovative ways.  The JEAT program’s approaches have provided substantial savings for the Services and the Department in both R&D efforts and in Programs of Record, and thus enable required military capabilities to be delivered to the warfighter much sooner than possible in traditional DoD approaches. \n\nJEAT program efforts are focused in four areas in two Project Codes.\n\n•\tIn Project 619, Joint Electronic Advanced Technology, (1) the Experimentation\/Demonstration effort utilizes innovative field and laboratory experimentation venues to understand current and future threats and explore potential countermeasures and overmatch opportunities, (2) the Advanced Technology Development\/Verification effort explores technologies and approaches to counter advanced threats in innovative ways, and (3) the EW Collaboration and Planning effort ensures appropriate coordination and technological oversight of Department and Service EW and EW-Cyber R&D programs and processes and provides governance insights for senior decision makers.\n\n•\tIn Project 245, EW Enterprise Exploration and Innovation, (4) this effort explores computer-augmented data dominance and machine learning technologies, tools, and approaches to enhance awareness and accelerate planning and decision making in essential EMS war fighting capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.030"
                },
                "CurrentYear": {
                    "val": "14.389"
                },
                "BudgetYearOne": {
                    "val": "13.008"
                },
                "BudgetYearOneBase": {
                    "val": "13.008"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.376"
                },
                "CurrentYear": {
                    "val": "14.389"
                },
                "BudgetYearOne": {
                    "val": "12.918"
                },
                "BudgetYearOneBase": {
                    "val": "12.918"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.654"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.090"
                },
                "BudgetYearOneBase": {
                    "val": "-0.090"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.627"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.024"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.003"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.087"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.087"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 adjustments are reflective of higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "619"
                    },
                    "ProjectTitle": {
                        "val": "Joint Electronic Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.672"
                        },
                        "CurrentYear": {
                            "val": "11.646"
                        },
                        "BudgetYearOne": {
                            "val": "12.141"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.141"
                        },
                        "BudgetYearTwo": {
                            "val": "12.098"
                        },
                        "BudgetYearThree": {
                            "val": "12.318"
                        },
                        "BudgetYearFour": {
                            "val": "12.529"
                        },
                        "BudgetYearFive": {
                            "val": "12.766"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Electronic Advanced Technology project (Project 619) explores and assesses innovative technologies and approaches to rapidly mitigate advanced threats and demonstrate new overmatch technologies in ways not being explored by the Services.  Project 619’s three efforts, Experimentation\/Demonstration (Expt\/Demo), Advanced Technology Development\/Verification (ATD\/V), and Electronic Warfare Enterprise Collaboration and Planning (EW C&P), focus on enabling nearer-term technology transitions to the Services’ Programs of Record (PoR) with reduced risk and cost.  Expt\/Demo efforts focus on exploring, demonstrating, and assessing innovative technologies and approaches to overcome existing and developing threats and provide new overmatch capabilities for the U.S. military.  ATD\/V efforts integrate advanced commercial and military off-the-shelf technologies in ways not being explored by the Services to demonstrate nearer-term technological opportunities.  EW C&P efforts within Electronic Warfare and Countermeasures Office (EWCO) of the Under Secretary of Defense for Research and Engineering assess, ensure coordination, and provide senior leadership insights on all Departmental EW and EW-Cyber Research and Development (R&D) as well as coordinating national and international EW and EW-Cyber efforts. \n\nExperimentation\/Demonstration (Expt\/Demo):\n\nExpt\/Demo explores and demonstrates new EW and EW-Cyber technologies and approaches through the use of large-scale, dynamic field experimentation venues.  The current venue, Vigilant Hammer (VH), is a multi-year, multi-agency, live, virtual, and constructive event focused on advancing the state of the art for detecting, classifying, geolocating, and engaging of electromagnetic signals of interest.  Modeled after Project 619’s highly successful BLACK DART, TRIDENT SPECTRE, and Rotorcraft Aircraft Survivability Equipment Experiment (RASE) venues, VH includes both scripted and dynamic scenarios to give participants an opportunity to explore the efficacy of existing and new capabilities and approaches to engage emerging Electromagnetic Spectrum (EMS) threats.  Follow-on venues will address concerns such as multi-platform\/multi-aperture, collaborative\/coherent EW and multistatic passive\/active sensing architectures.\n\nAdvanced Technology Development\/Verification (ATD\/V):\n\nATD\/V explores, matures and assesses emerging technologies and approaches to address compelling EW and EW-Cyber warfighting needs.  Project 619’s ongoing ATD\/V effort, the Distributed Electronic Effects Development (DEED) Laboratory, explores, matures and assesses emerging EW and EW-Cyber technologies to enable, for example, multi-aperture collaborative\/coherent EW and EW-Cyber employment through exquisite coordination of sensing and electronic attack capabilities. \n\nEW Enterprise Collaboration and Planning (EW C&P):\n\nEW C&P supports all activities of the Director, EWCO, related to the selection, organization, oversight, and coordination of all EW and EW-Cyber-related efforts across DoD.  EW C&P oversees and ensures coordination and collaboration between OSD and the Joint Staff, the Combatant Commands, and the Services on all EW and EW-Cyber activities within DoD.  To do this, EW C&P identifies, assesses, and develops recommendations to address EW and EW-Cyber-related threats impacting sensor, seeker, communications, platform survivability, countermeasures, and battle management technologies.  EW C&P also provides programmatic recommendations and decision support to the Office of the Under Secretary of Defense for Acquisition and Sustainment (OUSD(A&S)) on PoR, including technology maturity and availability, Critical Program Information standards, Foreign Disclosure, and Technical Signals Requirements.  EW C&P also conducts and leads analyses of advanced threats and technological opportunities to support Departmental EW and EW-Cyber R&D research, development and acquisition efforts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimentation\/Demonstration (Expt\/Demo)"
                                    },
                                    "Description": {
                                        "val": "Leveraging our history of conducting highly successful experimentation venues, our current multi-year, multi-agency, live, virtual and constructive series of field experimentation venues, Vigilant Hammer (VH), explores and assesses technologies and approaches to more effectively detect, classify, geolocate, engage, and assess actions against modern, agile and cognitive signals in a very dense and highly complex signals environment.  Our next Expt\/Demo venue will focus on assessing the performance of passive\/active sensing architectures in a complex and congested environment.  As with VH and all earlier Project 619 experimentation venues, subsequent venues will be scoped to address the most pressing EMS threats and the selection of venue topics and the scoping of these efforts will involve the EW and Cyber Communities of Interest and Executive Committees (EXCOMs) to ensure maximum relevance and benefits to Departmental efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.330"
                                            },
                                            "Text": {
                                                "val": "Given the significant findings of VH 1 and VH 2, VH 3 is being delayed until the second quarter of FY 2018 to enable more focused engagement of specific sets of targets and higher fidelity examination of warfighting-essential nonkinetic engagement (NKE) capabilities. Assessment of earlier VH events, compelling threats, and technological maturity is also guiding initial planning efforts of our next Expt\/Demo venue, Nike’s Hammer, which will focus on multi-platform\/multi-aperture NKE of multistatic passive\/active sensing architectures. This venue will be planned during FY 2017 and FY 2018, and is tentatively scheduled to be held in early FY 2019."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.915"
                                            },
                                            "Text": {
                                                "val": "VH 3 is planned for early third quarter of FY 2018.  A report and briefing will be provided approximately two months following execution in the fourth quarter of FY 2018.  Assessment of earlier VH events, compelling threats, and technological maturity is also guiding initial planning efforts of our next Expt\/Demo venue which will focus on Multi-platform, Multi-aperture, Multi-domain (M3) opportunities to more effectively sense, target, and attack threats of multi-static passive\/active sensing architectures in a complex and congested environment.  This venue will be planned during FY 2018, and is tentatively scheduled to be held in late FY 2019."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.181"
                                            },
                                            "Text": {
                                                "val": "The new Project 619 experiment will focus on M3 and multistatic passive\/active sensing and their command, control, communications and computing threat architectures.  It is planned for late 2019, with a report produced and distributed approximately two months after completion of the experiment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Technology Development\/Verification (ATD\/V)"
                                    },
                                    "Description": {
                                        "val": "ATD\/V research efforts mature and assess emerging technologies to address compelling EW and converged EW-Cyber warfighting needs.  Utilizing Project 619’s DEED Laboratory, these efforts focus on identifying and integrating multiple advanced technologies to synergistically create effects that are far greater than the sum of the constituent systems and identifying more effective and lower cost approaches to more effectively utilize, manage, and protect U.S. EMS capabilities.  The DEED Laboratory integrates promising technologies into unmanned aerial vehicles managed by the Naval Air Warfare Center, Weapons Division, for further exploration and assessment in venues like VH."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.888"
                                            },
                                            "Text": {
                                                "val": "The DEED Laboratory’s first experimentation efforts will focus on exploring, developing and validating multi-platform, multi-aperture techniques and approaches that can be employed from distributed systems (unmanned air systems (UAS)). Once developed and validated within the DEED Laboratory’s controlled environment, these capabilities will be integrated into prototypical systems and further explored and assessed in field experimentation venues such as VH."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.627"
                                            },
                                            "Text": {
                                                "val": "Complete the integration and enable full-operational capability of the Integrated Air Defense Systems (IADS) threat simulator in the DEED Laboratory.  Develop and validate multi-platform\/multi-aperture EW and Integrated Cyber Electronic Warfare (ICEW) techniques and approaches employed from distributed platforms.  Continue support of advanced technique development and demonstration by multiple organizations across the DoD, including OSD and other agency-sponsored R&D efforts (Joint Capability Technology Demonstrations, Future Naval Capabilities, etc.)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.723"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.723"
                                            },
                                            "Text": {
                                                "val": "Continue to support OSD research interests in multi-platform\/multi-aperture EW and ICEW techniques during the transition to a customer-funded business model."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW Enterprise Collaboration and Planning (EW C&P)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Director, EWCO in coordinating, overseeing, and managing the plethora of EMS warfare-related R&D activities across DoD for the Under Secretary of Defense for Research and Engineering.  It includes maintaining cognizance of all EW capabilities and capability development activities worldwide; overseeing the all EW-related R&D activities across DoD; exploring new and innovative EMS technologies and approaches; coordinating Departmental, EW-related R&D, programs, protocols, and policy; analyzing requisite development and operational interfaces across DoD and with international partners; and reporting relevant information to top senior leaders and across the Department as well as to Congress and other external groups."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.454"
                                            },
                                            "Text": {
                                                "val": "In addition to continued participation in ongoing efforts mentioned above, FY 2017 efforts include analysis of alternative courses of action for employing advanced, adaptive and cognitive EW technologies that are being developed and marketed commercially for data communications, radar, and other advanced spectrum domains previously dominated by DoD. Assessment of complex spectrum environments, system-to-system interactions, link budget analyses, size, weight and power analyses and other relevant analytic studies will be undertaken as part of this effort, to include issues related to modeling of many advanced jammers operating in the same area. Plans and exploratory investigations will evolve to evaluate and harvest emerging concepts and technologies from the R&E Reliance Process and the EW S&T COI road maps. Analysis and coordination of national and international efforts addressing emerging Information Operations and EW-Cyber Convergence topics will begin as well as efforts to advance imaging IRCM countermeasure technologies and expand U.S.-Australia collaboration in EW-Cyber. Efforts will also guide planning of EW Enterprise Exploration and Innovation (P245) research efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.104"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, EW C&P effort will include participating in the EW EXCOM; providing guidance to and direction and management of JEAT Expt\/Demo and ATD\/V efforts; advancing initiatives for the establishment of EW vulnerability portfolios; and tracking the progress of Joint Urgent Operational Need SO-0010, for which Project 619 helped identify technology solutions.  Project 619 continues interfacing with the Intelligence Community (IC) at senior levels to address critical intelligence gaps related to foreign EMS capabilities and advanced technology development efforts.  Project 619 also assessed alternative courses of action for employing advanced, adaptive, and cognitive EW technologies that are being developed and marketed commercially for data communications, radar, and other advanced spectrum domains previously dominated by DoD.  Emerging concepts and technologies from the R&E Reliance Process and the EW Science and Technology Community of Interest road maps were assessed for their potential impact and value.  Analysis and coordination of national and international efforts addressing emerging Information Operations and EW-Cyber Convergence topics were addressed as well as efforts to advance technologies that provide countermeasures to imaging infrared seekers and expand U.S.-Australia collaboration in EW-Cyber.  These efforts guided planning of Non-Kinetic Battle Management and Visualization Technology research efforts in Project 245 of this Program Element.\n\nIn addition to continued participation in ongoing efforts mentioned above, FY 2018 efforts include the development of a variety of new EW capabilities including distributed cooperative or coherent aperture techniques; battle management and visualization technologies for optimization of non-kinetic fires; asymmetric targeting technologies; passive system countermeasure techniques; and national technical means applications to EW.  Efforts will also guide planning of future EW Enterprise Exploration and Innovation (Project 245) research efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.237"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.237"
                                            },
                                            "Text": {
                                                "val": "In addition to previous, ongoing efforts, FY 2019 efforts will focus on the development of a variety of new EW-Cyber integrated and coordinated capabilities, the transition of new battle management and visualization technologies for optimization of non-kinetic fires; the exploration of new multi-platform\/multi-aperture engagement technologies, and the exploration of new technologies and approaches to engage passive\/active sensing architectures, and the fuller leveraging of national technical means to enhance EW and EW-Cyber capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "245"
                    },
                    "ProjectTitle": {
                        "val": "EW Enterprise Exploration and Innovation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.704"
                        },
                        "CurrentYear": {
                            "val": "2.743"
                        },
                        "BudgetYearOne": {
                            "val": "0.777"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.777"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The EW Enterprise Exploration and Innovation project (Project 245) started in FY 2016 to accelerate the development of innovative technologies and approaches to (1) provide countermeasures to new classes of advanced EW threats, (2) provide new EW-Cyber capabilities, and (3) enable extremely high fidelity, real-time comprehension and control of the EMS battlespace and the effects of non-kinetic attack tools within it.  Four efforts were initiated to address these objectives, and one is ongoing.  The Advanced Airborne Countermeasures Development and Advanced Defensive Countermeasures Development efforts addressed Area 1 and the Advanced EW and EW-Cyber Exploration\/Development effort addressed Area 2 above.  The current ongoing effort, Non-Kinetic Battle Management and Visualization Technology Development addresses Area 3."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Airborne Countermeasures Development"
                                    },
                                    "Description": {
                                        "val": "This classified effort will mature and demonstrate an advanced countermeasure to a new class of missile seeker threats which have expanded spectral and temporal coverage and resolution.  Leveraging earlier Service efforts, the products of this effort will be integrated into existing countermeasure architectures for effectiveness assessment and enable the earlier transition of countermeasure capabilities to the warfighter.  This effort formally ended in FY 2017, but late receipt of ordered equipment will delay completion of this effort into FY 2018 utilizing FY 2017 funding (no additional funding is required)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.496"
                                            },
                                            "Text": {
                                                "val": "FY 2017 efforts will continue FY 2016 work with the focus on integrating and demonstrating the new countermeasure candidates into prototypes and assessing their performance against realistic threats in relevant environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Defensive Countermeasures Development"
                                    },
                                    "Description": {
                                        "val": "This two-year classified effort commenced in FY 2016.  It will develop and assess the efficacy of a new approach to defend naval assets against advanced threat weapons employing increasingly sophisticated seeker technologies.  Significant leveraging of existing countermeasure approaches will be emphasized with the objective of demonstrating the efficacy of this approach in a realistic field environment.  While this effort formally ended in FY 2017, late receipt of equipment is delaying the maritime test event until second quarter of FY 2018, followed by analysis and comparison with modeling and simulation results (no additional funding is required)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.775"
                                            },
                                            "Text": {
                                                "val": "FY 2017 efforts will continue FY 2016 work and will proceed towards an initial field demonstration of this approach."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Kinetic Battle Management and Visualization Technology Development"
                                    },
                                    "Description": {
                                        "val": "Non-Kinetic Battle Management and Visualization Technology Development explores a variety of advanced technologies to include legacy EMS Battle Management (BM) tools and IC capabilities and state-of-the-art ‘big data’ analytics, visualization and novel human-machine interface technologies to significantly enhance the fidelity, timeliness and comprehensibility of information provided to warfighters and IC analysts responsible for understanding and exercising control of the EMS and cyberspace warfighting domains.  Leveraging state-of-the-art algorithmic-driven processing, artificial intelligence, machine learning, and autonomy support, predictive analytics will be developed to enable course of action development for the highly accurate, precise and timely employment of non-kinetic capabilities within the electromagnetic and cyberspace warfighting domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.585"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2016 efforts, FY 2017 efforts significantly expand and refine approaches to increase the representational fidelity and comprehensibility of non-kinetic battlespaces and advance course-of-action development capabilities.  Operational and IC users will be highly leveraged in this work to refine initial products and streamline the transitioning of newly developed capabilities to users for field experimentation and assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.743"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2017 efforts, the initial demonstration of Digital Attack Surface Execution Environment (DASEE) capabilities is scheduled for December 2017 and the final demonstration for Phase One activities is scheduled in February 2018.  FY 2018 efforts will significantly expand and refine approaches to increase the representational fidelity and comprehensibility of non-kinetic battlespaces and advance course-of-action development capabilities.  Operational and IC users will be highly leveraged in this work to refine initial products and streamline the transitioning of newly developed capabilities to users for field experimentation and assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.777"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.777"
                                            },
                                            "Text": {
                                                "val": "DASEE research effort will continue with two additional demonstrations involving progressively more challenging objectives culminating with field demonstrations for operational and IC users to enable the transition of DASEE capabilities to these communities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 adjustments are reflective of higher priority DoD requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced EW and EW-Cyber Exploration\/Development"
                                    },
                                    "Description": {
                                        "val": "This task will work on access and payload capability for EMS-cyberspace capabilities for closed network access and effects against hard-to-reach targets in Anti-Access\/Area Denial (A2\/AD) environments.  This initiative focuses on the continuum between EW effects, such as jamming, and Cyber effects to produce greater military impact against potential adversaries.  It will also develop and integrate advanced algorithms, signal processing, and techniques for increasing the viable standoff distance for non-kinetically interrogating, engaging, and disrupting of adversary threats.  This effort was completed in FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.848"
                                            },
                                            "Text": {
                                                "val": "FY 2017 efforts will continue work started in FY 2016 with a focus on demonstrating the potential efficacy of newly developed capabilities in field demonstration venues.  Operational and IC users will be involved to enable earlier transitions of capabilities to these communities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}