{
    "id": "2019-AirForce-PB-3600-MJBOOK-1-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-131",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "1206864F"
        },
        "ProgramElementTitle": {
            "val": "Space Test Program (STP)"
        },
        "R1LineNumber": {
            "val": "162"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "40.507"
            },
            "CurrentYear": {
                "val": "25.398"
            },
            "BudgetYearOne": {
                "val": "25.620"
            },
            "BudgetYearOneBase": {
                "val": "25.620"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "26.097"
            },
            "BudgetYearThree": {
                "val": "26.550"
            },
            "BudgetYearFour": {
                "val": "27.103"
            },
            "BudgetYearFive": {
                "val": "27.596"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.070"
                },
                "CurrentYear": {
                    "val": "25.398"
                },
                "BudgetYearOne": {
                    "val": "25.812"
                },
                "BudgetYearOneBase": {
                    "val": "25.812"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.507"
                },
                "CurrentYear": {
                    "val": "25.398"
                },
                "BudgetYearOne": {
                    "val": "25.620"
                },
                "BudgetYearOneBase": {
                    "val": "25.620"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "13.437"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.192"
                },
                "BudgetYearOneBase": {
                    "val": "-0.192"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "15.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.379"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.184"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.192"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.192"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2017: +$15.000M reflects the Congressional Add program increase to execute the Rapid Agile Launch Initiative (RALI)"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "662617"
                    },
                    "ProjectTitle": {
                        "val": "Free-Flyer Spacecraft Missions"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.507"
                        },
                        "CurrentYear": {
                            "val": "25.398"
                        },
                        "BudgetYearOne": {
                            "val": "25.620"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.620"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "26.097"
                        },
                        "BudgetYearThree": {
                            "val": "26.550"
                        },
                        "BudgetYearFour": {
                            "val": "27.103"
                        },
                        "BudgetYearFive": {
                            "val": "27.596"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Space Test Program (STP) conducts space test missions for the purpose of accelerating DoD space technology transformation while lowering developmental risk. The program flies an optimally selected number of DoD-sponsored experiments consistent with Space Experiments Review Board (SERB) priority, opportunity, and funding.   STP missions provide a cost-effective way to flight test new militarily relevant space system technologies, concepts, and designs, providing a way to:  \n \n- Support the acquisition block development approach \n- Demonstrate and develop responsive research and development (R&D) space capabilities \n- Provide early operational capabilities to quickly react to new developments \n- Perform operational risk reduction through direct flight test of prototype components \n- Improve operational design by characterizing the space environment, event, or sensor physics proposed for an operational system\/system upgrade \n- Develop, integrate, test, and acquire advanced payload support hardware for launch vehicles (LV), commercial launch services, and human-rated spaceflight vehicles \n \nThe Deputy Secretary of Defense Space Test Program Management & Funding Policy, issued in July 2002, reaffirmed STP as the primary provider of spaceflight for the DoD space research community.  The July 2002 policy statement also reaffirmed STP's role as the single manager for all DoD payloads on the International Space Station (ISS). \n\nThe current and future space domain demands that space systems be responsive to new and changing threats, and can rapidly integrate new capabilities to make our warfighting force more resilient in a contested battlespace. This agility, survivability, and rapid reconstitution must extend through the entire space warfighting enterprise, to include how we learn about the threat; develop solutions; acquire, test, deploy, train, operate and integrate new systems into the greater system of systems; and ensure our space mission force is ready to defeat a thinking adversary in a complex, multi-domain battlespace. The enterprise will use all of its elements to accelerate decision-making, prototype potential solutions, rapidly integrate decision-making tools and sustain a war-winning capability by delivering multi-domain effects in, from, and through space and cyberspace enabling battle management and resilience options to \"fight through.\" \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver STP weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 1206392F and 1206398F.\n\nThis program is in Budget Activity 6, RDT&E Management Support because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Rapid Agile Launch Initiative (RALI) Services and Support"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14.500"
                                        },
                                        "Text": {
                                            "val": "Procure Venture-Class launch vehicles (LVs) and mission assurance support to deliver prototype and other RDT&E  payloads to space.  RALI will demonstrate rapid, responsive procurement by using Other Transaction Authority (OTA) and commercial launch approaches. The FY 2017 Congressional Add funds, less $0.5M SBIR transfer, were used to award to Rocket Labs ($5.7M) a dedicated launch mission and to VOX Space ($4.8M) a rideshare mission on 11 Oct 2017.  The Air Force projects to award a third OTA in the second quarter of FY 2018."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Payload Integration"
                                    },
                                    "Description": {
                                        "val": "Integrate payloads onto spaceflight missions, including free-flyer payloads, hosted payloads, sounding rockets, experiments on the International Space Station, and commercial missions. Includes acquisition of associated spacecraft and integration hardware."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.476"
                                            },
                                            "Text": {
                                                "val": "Continue payload integration efforts onto spaceflight missions (STPSat-4 and STPSat-5). Complete the design of STPSat-6 and begin the acquisition and integration of STPSat-6, and STP-H6. Continue to provide the unique program costs required for the operation of the STP in its management and oversight role including program management, administrative, information technology, travel and supply support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.355"
                                            },
                                            "Text": {
                                                "val": "Continue payload integration on to STPSat-6, STP-H6, and other efforts onto spaceflight missions.\nContinue program office and other related support activities that may include, but are not limited to studies, technical analysis, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.193"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.193"
                                            },
                                            "Text": {
                                                "val": "Complete development, launch, and deploy STPSat-4 from the International Space Station (ISS) in FY 2019. \nComplete payload integration and launch STP-H6 in FY 2019. \nComplete payload integration efforts and launch-based processing and launch operations for STPSat-6 and other efforts onto spaceflight missions. \nContinue program office support and other related support activities. Rapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, prototyping, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.162M. Justification for this decrease is described in plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Launch Vehicle and Launch Services"
                                    },
                                    "Description": {
                                        "val": "Purchase launch services, launch vehicles and launch vehicle support for free-flyer payloads, hosted payloads, sounding rockets, experiments on the ISS, and commercial spaceflight missions, and support the spaceflight worthiness and \"Do No Harm\" certification for Space and Missile Systems Center (SMC) and Air Force Space Command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.835"
                                            },
                                            "Text": {
                                                "val": "Continue purchase of launch services for STPSat-5, launch vehicles, and launch vehicle support for free-flyer payloads, hosted payloads, sounding rockets, experiments on the ISS, and commercial spaceflight missions. Launch STP-2 medium launch mission, launch STP-H5 to ISS, and launch Kestrel Eye II from ISS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.161"
                                            },
                                            "Text": {
                                                "val": "Continue purchase of launch services, launch vehicles, and launch vehicle support for free-flyer payloads, hosted payloads, sounding rockets, experiments on the ISS, and commercial spaceflight missions.\nPlan to launch STPSat-5, EAGLE on the AFSPC-11, and additional payloads to the ISS in FY18."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.158"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.158"
                                            },
                                            "Text": {
                                                "val": "Continue purchase of launch services, launch vehicles, and launch vehicle support for free-flyer payloads, hosted payloads, sounding rockets, experiments on the ISS, and commercial spaceflight missions.\nPlan to launch STPSat-6 and additional payloads to the ISS. Continue program office support and other related support activities.\nRapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, prototyping, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $2.997M. Justification for this increase is described in plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "On Orbit Satellite Operations"
                                    },
                                    "Description": {
                                        "val": "Execute first-year operations and operations support for STP-sponsored missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.696"
                                            },
                                            "Text": {
                                                "val": "Complete forecasted launch and early-orbit checkout of the Demonstration and Science Experiment (DSX) and NASA's Green Propellant Infusion Mission (GPIM) carrying SERB experiments on STP-2."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.882"
                                            },
                                            "Text": {
                                                "val": "Continue first-year operations and\/or operations support for STP-sponsored missions, the Demonstration and Science Experiment (DSX) and NASA's Green Propellant Infusion Mission (GPIM).\nContinue support of forecasted launch and early orbit checkout of the GPIM and DSX missions on STP-2."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.269"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.269"
                                            },
                                            "Text": {
                                                "val": "Complete first year operations for STPSat-5, EAGLE, and STP-2's payloads, DSX and GPIM."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $2.613M. Justification for this decrease is described in plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}