{
    "id": "2019-DefenseLogisticsAgency-PB-0400-MJBOOK-0-4-32521504027ebdb13752e3b88d1670fe1a293063bafd6431aca8a5e28b29fb53-10",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708012S"
        },
        "ProgramElementTitle": {
            "val": "Pacific Disaster Centers"
        },
        "R1LineNumber": {
            "val": "243"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "18.291"
            },
            "PriorYear": {
                "val": "1.690"
            },
            "CurrentYear": {
                "val": "1.770"
            },
            "BudgetYearOne": {
                "val": "1.770"
            },
            "BudgetYearOneBase": {
                "val": "1.770"
            },
            "BudgetYearTwo": {
                "val": "1.770"
            },
            "BudgetYearThree": {
                "val": "1.785"
            },
            "BudgetYearFour": {
                "val": "1.821"
            },
            "BudgetYearFive": {
                "val": "1.856"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Pacific Disaster Center (PDC) has been in operation since February 1996. The PDC is a public\/private partnership managed by the University of Hawaii (UH) under a cooperative agreement with the Department of Defense.  It is functionally within the organization of the Office of the Under Secretary of Defense (Acquisition, Technology, and Logistics) (OUSD(AT&L)) and the Defense Logistics Agency (DLA). The PDC is a world-recognized authority and leader in science and information technology applications relating to humanitarian assistance and disaster relief (HA\/DR).  PDC develops new and innovative technologies to operate an (unclassified) integrated multi-hazard hazard monitoring, early warning and decision support system, called RAPIDS, for the department."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.754"
                },
                "CurrentYear": {
                    "val": "1.770"
                },
                "BudgetYearOne": {
                    "val": "1.770"
                },
                "BudgetYearOneBase": {
                    "val": "1.770"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.690"
                },
                "CurrentYear": {
                    "val": "1.770"
                },
                "BudgetYearOne": {
                    "val": "1.770"
                },
                "BudgetYearOneBase": {
                    "val": "1.770"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.064"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.064"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY2017, the Small Business Innovation Research and Small Technology Transfer Research tax amounted to $0.064M."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Logistics Support Activities (LSA)"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "12.488"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.488"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program is reported in accordance with Title 10, United States Code, Section 119 (a)(1) in the Special Access Program Annual Report to Congress.  The staff cognizance and oversight will transfer from the DLA to the Defense Information Systems Agency (DISA) effective October 1, 2014. The USD(P) will continue to be the Operational Sponsor and functional OSD Principal Staff Assistant (PSA) for the program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "03"
                    },
                    "ProjectTitle": {
                        "val": "Pacific Disaster Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.803"
                        },
                        "PriorYear": {
                            "val": "1.690"
                        },
                        "CurrentYear": {
                            "val": "1.770"
                        },
                        "BudgetYearOne": {
                            "val": "1.770"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.770"
                        },
                        "BudgetYearTwo": {
                            "val": "1.770"
                        },
                        "BudgetYearThree": {
                            "val": "1.785"
                        },
                        "BudgetYearFour": {
                            "val": "1.821"
                        },
                        "BudgetYearFive": {
                            "val": "1.856"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Pacific Disaster Center (PDC) has been in operation since February 1996. The PDC is a public\/private partnership managed by the University of Hawaii (UH) under a cooperative agreement with the Department of Defense.  It is functionally within the organization of the OUSD(AT&L) and the DLA. The PDC is a world-recognized authority and leader in science and information technology applications relating to Humanitarian Assistance and Disaster Relief (HA\/DR).  It has developed innovative technologies, and has provided operational support for an (unclassified) integrated multi-hazard hazard monitoring, early warning and decision support system, called RAPIDS, for the department since 2007.  The system, covering global hazard is frequently used by COCOMS, particularly PACOM and SOUTHCOM, for HA\/DR missions and exercises, and was recently selected as one of the most effective systems in a position paper by the department, reviewing all unclassified information sharing systems. “Expanded use of RAPIDS across the DoD at the Combatant Commands, Joint Task Force, and by deployed units from the services” was identified as ”a primary Joint Staff objective” in a memorandum dated July 6, 2017."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pacific Disaster Center (PDC)"
                                    },
                                    "Description": {
                                        "val": "This program is reported in accordance with Title 10, United States Code, Section 119 (a)(1) in the Special Access Program Annual Report to Congress.  The USD(P) will continue to be the Operational Sponsor and functional OSD Principal Staff Assistant (PSA) for the program.  USD(AT&L) will provide acquisition oversight authority for the program.\n\nThe PDC has been in operation since February 1996. The PDC is a public\/private partnership managed by the University of Hawaii (UH) under a cooperative agreement with the Department of Defense.  The Pacific Disaster Center (PDC) function, manpower, and budget resources transferred to the Office of the Under Secretary of Defense (Acquisition, Technology, and Logistics) (OUSD(AT&L)) and the Defense Logistics Agency (DLA)in October 2011.\n\n The USD(P) will continue to be the Operational Sponsor and functional OSD Principal Staff Assistant (PSA) for the program.  The PDC is a world-recognized authority and leader in science and information technology applications relating to humanitarian assistance and disaster relief (HA\/DR). PDC’s applications and information products enhance preparedness, situational awareness, and civil-military communications for humanitarian missions worldwide, while its national-level socio-economic Risk and Vulnerability Assessments help inform strategies by measuring indicators for national resiliency using scientific methods.\n\nThe PDC Program Office’s (USD(P),  ASD(HD&GS), and DASD(DC&MA)) primary responsibility is for management and stewardship of governmental funds provided in Defense Department appropriations for DoD missions associated with DoD CrM, HA\/DR, Theater Security Cooperation, and Defense Support to Civil Authorities (DSCA). In doing this, the Program Office develops and provides policy, oversight and guidance, and jointly develops strategic guidelines, programmatic content and priorities with the UH and PDC. The PDC Program Office also serves as a support element of the Hawaii-based organization especially in the area of gaining Federal agency support and resources, as well as business opportunities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.690"
                                            },
                                            "Text": {
                                                "val": "Risk and Vulnerability Assessment\n•    Explore trends and shifts in risks and vulnerability using the last 7 years of data. \n\nData\n•     In accordance with the latest (DRAFT) DoD study for unclassified information systems for disaster preparedness, enhance development of standard protocols for interoperability.\n\n•    Continue development of new data sources for hazards and related observational data TBD\n\t\nModeling\n•     Explore incorporating impacts from hazard models into the definition of disasters within the system.\n\n•     Continue enhancing application of hazard models to estimating initial needs for HA\/DR support missions\n\t\nApplications\n•     Enhance RAPIDS functionality based on user feedback and requirements\n\n•    Continue improving stabilization of the platform by increasing cloud-based utilization\n\n•    Continue evaluating new and innovative technologies for enhancing user experience (for RAPIDS)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.770"
                                            },
                                            "Text": {
                                                "val": "Risk and Vulnerability Assessment\n• Explore trend analysis based on existing Global RVA data accumulated of the prior years\n• Improve analytical reporting\/visualization and automated assessment capabilities using Global RVA data\n• Incorporate country-report analytical capabilities into the above assessment reporting capabilities\n\nData\n• Explore feasibility of hosting classified data in RAPIDS, should the application be hosted on SIPR\n• Continue development of data sources for hazards and related observational data TBD\n\nModeling\n• Integrate alerting capabilities and hazard impact modeling\n• Continue enhancing application of hazard models to estimate initial needs for HA\/DR support missions\n\nApplication\n• Improve performance of the system and enhance user experience\n• Improve mobile device-related features (e.g. battery usage, etc.)\n• Continue evaluating new and innovative technologies for enhancing user experience (for RAPIDS)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.770"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.770"
                                            },
                                            "Text": {
                                                "val": "Risk and Vulnerability Assessment\n• Collaborate with regional Combatant Commands (e.g., SOUTHCOM, PACOM, etc.) to integrate and visualize subnational RVA data into RAPIDS\n• Improve sub-national analytical reporting\/visualization and automated assessment capabilities\n\nData\n• Explore new technologies for handling “big data”\n• Improve analytical capabilities using “big data”, including use of social media for early detection of man-made hazards\n• Continue development of data sources for hazards and related observational data TBD\n\nModeling\n• Integrate Global Exposure Model for high-resolution “impact and exposure” analytical reporting\n• Continue enhancing application of hazard models to estimate initial needs for HA\/DR support missions\n\nApplication\n• Expand use and visualization of “big data”, supporting higher-resolution baseline inventories\n• Improve cross-device user experience (e.g., desktop, mobile tablets, smart phones, wearables, etc.)\n• Integrate mass (alert) notification functions\n• Continue evaluating new and innovative technologies for enhancing user experience (for RAPIDS)"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "PDC projects beyond the baseline Situational Awareness & Decision Support Applications\/Tools architecture (Atlas\/EMOPS\/RAPIDS) undertaken in support of the DoD Cooperative Agreement (CA) with the University of Hawaii (UH) are from PDC customers (e.g., DoD, NGOs, other nations, academia, and industry). The PDC prepares the public, disaster managers, governments, and others to mitigate the effects of disasters.  The goal is to have people and technology work together to preserve life, safeguard livelihoods, protect property to foster disaster-resilient communicates. Projects obtained and funded from this customer base serve as a means to determine PDC product and services relevancy."
                        },
                        "PerformanceMetrics": {
                            "val": "Projects objectives and tasks are designed to build upon the previous year’s successes and are consistent with the framework and direction provided by the Strategies 2016-2020 document (updated Nov 2016).  At the beginning of each calendar year, an Annual Plan is in-place to guide the program and enable a framework for performance feedback to the DoD PDC Program Manager, the PDC Executive Director, WHS CA Contracting Office, and the UH. At the end of each calendar year, these stakeholders meet to review the past year performance and finalize a new Annual Plan for the next calendar year.  This plan details a set of specific objectives to further capabilities and capacities supporting the PDC’s mission and increasing operational value to the stakeholders."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PDC Disaster AWARE: Early Warning and Decision Support Applications"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "University of Hawaii Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Honolula, HI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.803"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.690"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.770"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.770"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.770"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "70708012S_R4.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}