{
    "id": "2019-AirForce-PB-3600-JBOOK-ff3ce798fd66c1fdf15074778cc17eeee0864d783490f920850ed1e15fcb218d-5",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602202F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Applied Research"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "110.012"
            },
            "CurrentYear": {
                "val": "108.784"
            },
            "BudgetYearOne": {
                "val": "112.518"
            },
            "BudgetYearOneBase": {
                "val": "112.518"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "122.392"
            },
            "BudgetYearThree": {
                "val": "124.055"
            },
            "BudgetYearFour": {
                "val": "129.338"
            },
            "BudgetYearFive": {
                "val": "122.740"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program conducts applied research in the area of airmen training, airmen system interfaces, bioeffects, and understanding and shaping adversarial behavior. The Learning and Operational Readiness project conducts research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance. The Human Dynamics Evaluation project conducts research to advance machine intelligence and operator-aiding technologies by developing and applying airman-focused research for advanced intelligence, surveillance, and reconnaissance (ISR) capabilities and detecting and exploiting human signatures. The Sensory Evaluation and Decision Science project conducts research to revolutionize the manner in which airmen optimize the capabilities of Air Force systems, including remotely piloted aircraft (RPA) and adaptive teams of airmen and machines. The Bioeffects project conducts research on the effects of human exposure to potentially toxic, operational and advanced chemicals and materials (including nanomaterials), electromagnetic (EM) energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602203F, 0602204F, 0602601F, 0602602F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "111.647"
                },
                "CurrentYear": {
                    "val": "108.784"
                },
                "BudgetYearOne": {
                    "val": "111.326"
                },
                "BudgetYearOneBase": {
                    "val": "111.326"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "110.012"
                },
                "CurrentYear": {
                    "val": "108.784"
                },
                "BudgetYearOne": {
                    "val": "112.518"
                },
                "BudgetYearOneBase": {
                    "val": "112.518"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.635"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.192"
                },
                "BudgetYearOneBase": {
                    "val": "1.192"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.635"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.192"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.192"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2019 due to Department of Defense (DoD) civilian pay reprice adjustment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621123"
                    },
                    "ProjectTitle": {
                        "val": "Learning and Operational Readiness"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "22.899"
                        },
                        "CurrentYear": {
                            "val": "23.840"
                        },
                        "BudgetYearOne": {
                            "val": "22.440"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.440"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "24.292"
                        },
                        "BudgetYearThree": {
                            "val": "23.660"
                        },
                        "BudgetYearFour": {
                            "val": "24.725"
                        },
                        "BudgetYearFive": {
                            "val": "23.464"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  Research is conducted in two focus areas:  continuous learning and cognitive modeling.  The continuous learning effort creates live, virtual, and constructive (LVC) environments for use in developing revolutionary simulation technologies to increase training capabilities and enhance training effectiveness and efficiency by using learning theory to improve military training and mission performance.  Cognitive modeling creates realistic models and simulations of human behavior to advance the understanding of how airmen perform complex tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Research enhances distributed mission operations (DMO) and LVC environments and identifies technology requirements for training in live and immersive environments.  Continuous learning strategies improve mission training, command and control (C2), ISR, and cyber missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.713"
                                            },
                                            "Text": {
                                                "val": "Continue development of multiple agents as synthetic white forces to support Air Support Operations Center training.  Develop, test, and validate a moderate fidelity F-35 non-proprietary simulator. Establish a baseline to evaluate first responder training gaps and support exercises to garner baseline data to quantify gaps and engineer and develop training curriculum. Complete the development of the Distributed Common Ground Station Weapons Systems Trainer. Conduct initial training effectiveness study to evaluate the transfer of training using the DWST. Begin a Fighter Integration evaluation and study to address future JSF training challenges. Develop innovative solutions for multi-level security. Support the development of cross domain solution for F-35. Demonstrate LVC in a five-eyes coalition environment.  Continue to develop specifications for secure fifth generation LVC operations to include executing a fourth and fifth generation platform study. Execute scalable studies to focus on the individualized learning and adapting the learner to the training environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.708"
                                            },
                                            "Text": {
                                                "val": "Transition scenarios and performance tracking techniques to operationally relevant testbeds. Develop cross domain solution ruleset for fifth generation LVC operations. Execute training readiness evaluations to integrate real-time performance tracking to develop and validate personalized team adaptive training. Continue to develop designs for out-year studies to execute fourth to fifth generation realistic, secure training and rehearsal events.  Conduct evaluations of identified training gaps and potential solutions to gaps for the integration of the fifth generation aircraft into a close air support environment.Design experimentation, studies, and evaluation for challenges for multi-domain operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.733"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.733"
                                            },
                                            "Text": {
                                                "val": "Grow persistent readiness assessment and tracking capabilities for optimized airman machine teaming. Establish objective training performance metrics. Continue to develop 5th Gen Cross Domain solution prototypes. Investigate integrated simulations of, secure adaptive environments for, and execute training research studies within multi-domain command and control."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $5.975 million. Justification for the decrease is decreased emphasis in continuous learning."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Modeling"
                                    },
                                    "Description": {
                                        "val": "Research explores application of cognitive science for performance improvement by enhancing training in mission-relevant environments (e.g., flight simulators)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.186"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort was originally performed in the Continuous Learning effort.  \n\nApply predictive performance optimization to more complex warfighter training contexts.  Evaluate robustness and stability of autonomous operations in mission-relevant simulations.  Further develop mechanisms for effectiveness in human-machine teaming.  Rapidly validate complex models through massively parallel computing architectures.  Enhance constructive entities through infusion of intelligent agent technologies.  Develop personalized learning through scheduling of learning events in intelligent tutors.  Support career-wide continuous learning through development of persistent personalized learner models that may allow individual airmen training to be followed from accession to retirement.  Refine and validate integration of intelligent agents into existing training testbeds.  Apply vigilance research to long-duration missions to improve warfighter performance at the edges of human performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.132"
                                            },
                                            "Text": {
                                                "val": "Conduct studies in autonomous operations in mission-relevant simulations.  Validate autonomous training agent learning-through-reading capability in mission-relevant context. Continue to validate complex cognitive models through in computing architectures.  Initiate studies in multi-level models for performance assessment.  Continue development of personalized learning through scheduling of learning events in intelligent tutors.  Continue work in computational analysis for agent training and assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.707"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.707"
                                            },
                                            "Text": {
                                                "val": "Transition fatigue models for mobility operations. Demonstrate time-savings for mission planning using model-based processes. Integrate retention-based scheduling system for training into operational learning management system. Demonstrate prototype trainable agent for multi-domain operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $4.575 million. Justification for the increase is increased emphasis in cognitive learning."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625328"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics Evaluation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "25.864"
                        },
                        "CurrentYear": {
                            "val": "24.338"
                        },
                        "BudgetYearOne": {
                            "val": "24.568"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.568"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "27.259"
                        },
                        "BudgetYearThree": {
                            "val": "28.056"
                        },
                        "BudgetYearFour": {
                            "val": "29.104"
                        },
                        "BudgetYearFive": {
                            "val": "27.619"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to advance machine intelligence, information operations, and operator-aiding technologies for advanced ISR capabilities. Research is focused in the following areas: human analyst augmentation, human trust and interaction, and human signatures. The human analyst augmentation area develops, integrates, and evaluates human-centric analyst technology to develop cognitive systems engineering solutions for airman data overload, work integration, and mission performance, enhancing operationally effective ISR for the Air Force. The human trust and interaction area seeks to advance human language technologies to benefit military linguists and analysts as well as to understand, quantify, and calibrate trust factors influencing airman interaction with autonomous systems that can be applied to airman-machine teaming in future weapon systems. The human signatures area develops and applies S&T to detect and exploit a variety of human-centered signatures, including behavioral and anthropometric aspects of existing and emerging adversaries as well as nano, bio, and molecular signatures of airman performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Conduct research to enhance human components of ISR.  Develop ability to improve human analytic efficiency and effectiveness with fewer personnel and in increasingly complex mission space.  Develop the ability to improve human cognitive performance of the ISR weapon system through improved data exploitation and intelligence content synthesis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.147"
                                            },
                                            "Text": {
                                                "val": "Conduct research to understand factors that enable the Air Force's goal of full spectrum analysis, transitioning from individual analysts working a single intelligence source to exploiting multiple sources.  Develop new human-centered methodologies and analyst processes integrating semiautonomous analysis technologies to create robust analytic capacity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.339"
                                            },
                                            "Text": {
                                                "val": "Develop methodologies and techniques for enabling individual analysts to exploit multiple intelligence sources.  Investigate verbal communication with semiautonomous analysis agents for aiding intelligence analysts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.572"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.572"
                                            },
                                            "Text": {
                                                "val": "Further investigate cognitive mechanisms that underlie analyst's sense making capabilities and develop methodologies to use autonomous agents to assist in the process."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.233 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Conduct research in cross-cultural communication and automated speech translation tools for Air Force missions.  Conduct research to address important aspects of trust in airman-machine teams including investigating how an airman knows an autonomous or semiautonomous system is safe to use and whether the system, data, conclusions, and decision recommendations can be trusted."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.091"
                                            },
                                            "Text": {
                                                "val": "Investigate trust between airmen and automation and airmen and robots to determine the appropriate levels of transparency in automatous and robotic systems.  Implement emerging machine processing approaches for militarily-relevant languages including mission and domain specific applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.063"
                                            },
                                            "Text": {
                                                "val": "Evaluate trust for robotics and automated systems in degraded visual environments and develop trust guidelines for Line In-The-Sky Auto Ground Collision Avoidance System.  Study multilingual deep neural networks for automatic speech recognition and adapt Asian languages machine translation models for information search and retrieval."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.845"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.845"
                                            },
                                            "Text": {
                                                "val": "Develop initial transparency and trust guidelines for application to semiautonomous vehicles and autonomous agents for analysts. Investigate techniques for translating text to images and images to text."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.782 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Develop databases of human motion and features collected from air\/space platforms.  Identify human threat signatures across diverse populations for ISR and force protection applications.  Develop nano, bio, and molecular signatures of airman performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.626"
                                            },
                                            "Text": {
                                                "val": "Exploit novel, non-invasive biomarkers in sweat and exhaled breath, develop selective capture elements for detection of these markers, and incorporate and test these to provide real-time feedback to operators.  Develop durable algorithm to provide persistent human detection and tracking throughout a single full motion video mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.936"
                                            },
                                            "Text": {
                                                "val": "Develop methodologies for integrating near real-time performance assessment algorithms using physiological and non-invasive biomarkers and individualized learning algorithms.  Continue development of durable algorithm to provide persistent human detection and tracking throughout a single full motion video mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.151"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.151"
                                            },
                                            "Text": {
                                                "val": "Develop methodologies for air quality and physiological monitoring of personnel using machine learning techniques. Develop algorithms to characterize human detections from air based sensors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.785 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625329"
                    },
                    "ProjectTitle": {
                        "val": "Sensory Evaluation and Decision Science"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "31.257"
                        },
                        "CurrentYear": {
                            "val": "29.476"
                        },
                        "BudgetYearOne": {
                            "val": "31.687"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.687"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "33.288"
                        },
                        "BudgetYearThree": {
                            "val": "34.241"
                        },
                        "BudgetYearFour": {
                            "val": "35.517"
                        },
                        "BudgetYearFive": {
                            "val": "33.707"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to revolutionize the manner in which airmen optimize the capabilities of Air Force systems, including remotely piloted aircraft (RPA) and adaptive teams of airmen and machines.  Research optimizes airman situational awareness and cognitive performance, improves the airman-machine interface, and seamlessly integrates warfighters with their weapon systems across air, space, and cyber domains.  Research is conducted in four focus areas:  applied neuroscience; human role in semiautonomous systems; battlespace visualization; and battlespace acoustics.  The applied neuroscience area develops technologies to enhance airman-airman and airman-machine collaborations and system interactions in distributed decision-making environments.  The human role in semiautonomous systems area develops new control\/display concepts and technologies to optimize Air Force platform capabilities.  The battlespace visualization area advances the science and technology (S&T) associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making.  The battlespace acoustics area researches human-human and human-machine communications to exploit the use of voice and acoustic data in collaborative, net-centric environments while accounting for the effects of acoustic propagation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develop technologies to enhance Airman performance and Airman-machine collaboration in high-stress decision-making environments.  Conduct research to predict physiological impacts of extreme, dynamic environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.502"
                                            },
                                            "Text": {
                                                "val": "Conduct research on sensing and assessment technologies for enhanced Airman performance. Investigate augmentation strategies for enhanced physical and cognitive performance to include non-invasive brain stimulation techniques.  Establish method for use of real-time biomarker sensor technology. Begin development of human response models to enhance aircrew performance in extreme environments.  Explore next generation aircraft injury exposure criteria for improved aircrew protection. Investigate on-board oxygen generating system performance vulnerabilities affecting oxygen production.  Explore new technologies in support of next generation on-board oxygen generating system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.719"
                                            },
                                            "Text": {
                                                "val": "Refine real-time sensing and assessment technologies for enhanced Airman performance in operationally-relevant environments. Explore human-machine teaming constructs relevant to Airman mission success. Continue assessing the applicability of biomarker sensor technologies use in operational environments. Refine, validate, and implement augmentation techniques (including non-invasive brain stimulation) for physical and cognitive performance optimization and stress resilience. Explore novel data analytic techniques to develop capabilities that predict Airman performance over time and in any environment. Explore utility of non-invasive peripheral nerve stimulation techniques and closed-loop stimulation techniques to enhance cognitive performance.\nComplete development of human response models to mitigate injury risks. Continue development of the next generation aircraft injury exposure criteria for improved aircrew protection. Continue investigation of on-board oxygen generating system performance vulnerabilities affecting oxygen production. Continue development of an on-board oxygen generating system contamination database and susceptibility model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.634"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.634"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate and refine sensing and assessment technologies\/capabilities for sustained and enhanced Airman performance in multiple operationally relevant environments including Airman-Machine Teaming scenarios and multi-domain operations. Validate applicability of biomarker sensor technologies use in operational environments. Continue to investigate augmentation techniques for physical and cognitive performance optimization and stress resilience and apply those techniques in operationally-relevant environments. Continue to explore utility of non-invasive peripheral nerve stimulation and closed-loop stimulation techniques to enhance cognitive performance. Complete development of the next generation aircraft injury exposure criteria for improved aircrew protection. Investigate multi-axis spinal injury modeling during aircraft ejection. Complete investigation of on-board oxygen generating system performance vulnerabilities affecting oxygen production. Complete the development for on-board oxygen generating system contamination database and susceptibility model. Research the development of the next generation of oxygen monitoring system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $1.915 million. Justification for the increase is increased emphasis in applied neuroscience."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Research new control\/display concepts and technologies (e.g., information portrayal, control devices, decision aiding algorithms) for adaptive human-machine interaction and teamwork."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.152"
                                            },
                                            "Text": {
                                                "val": "Demonstrate effective deliberative-reactive control interaction methods of dynamic mission planning of heterogeneous multivehicle systems. Integrate agent architecture to perform sense-making of human, vehicle, and environmental factors to enhance task performance and mission effectiveness. Research advanced airman workload measurement technologies integrated with real-time adaptive airman-machine learning and task allocation methods. Demonstrate real time adaptive airman-machine teaming and task allocation methods. Develop and demonstrate distributed control methods for unmanned system concepts in limited communication environments. Research and develop predictive, look-ahead tools for effects-based mission planning and execution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.837"
                                            },
                                            "Text": {
                                                "val": "Demonstrate distributed control methods for unmanned system concepts in limited communication environments. Continue research and development of predictive, look-ahead tools for effects-based mission planning and execution. Continue research in advanced airman workload measurement technologies integrated with real-time adaptive airman-machine teaming and task allocation methods. Research and develop human-machine interface methods to for real time machine reasoning and negotiating processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.224"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.224"
                                            },
                                            "Text": {
                                                "val": "Refine airman-system cooperative decision aids and interfaces that support distributed unmanned system control concepts in limited communication environments. Continue research and development of predictive, look-ahead tools for effects-based mission planning and execution. Continue research on real-time adaptive human-machine teaming\/task allocation that includes examining workload and shared situation awareness metrics and the influence of machine aids on airmen problem solving, attention management and task prioritization. Continue research and development of airman-machine interface methods for real-time machine reasoning and negotiating processes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.387 million.  Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Visualization"
                                    },
                                    "Description": {
                                        "val": "Research the visualization, interaction and understanding of complex information to enhance warfighter decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.398"
                                            },
                                            "Text": {
                                                "val": "Explore alternative analytic strategies with emerging machine learning techniques to develop next generation automated data exploitation.  Initiate data analytics research for human visualization of complex data.  Assess cyber operations visualization techniques for transforming numerical data into actionable information. Continue development and begin performance-based comparisons of new cyber interfaces and visualization work aids for cyber warfare. Evaluate decision aids for multisource fusion imagery analysis. Assess preliminary geospatial viewers on mobile devices for improved operator performance. Initiate human-centric visual target detection and recognition model development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.867"
                                            },
                                            "Text": {
                                                "val": "Continue exploration of analytic strategies with machine learning techniques to achieve next-generation, automated, data exploitation capability.  Continue data analytics research focused on human visualization of complex data.  Evaluate cyber operator system interfaces for integrated defensive and offensive operations. Develop models to predict visibility of objects viewed by humans under both unaided and aided conditions. Integrate visualizations of threats and their priority, tasks, targets, and courses of action for C2 environments across the space and cyberspace domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.457"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.457"
                                            },
                                            "Text": {
                                                "val": "Continue exploration of analytic strategies with machine learning techniques to achieve next-generation, automated, data exploitation capability, and develop visual interfaces to enhance decision making. Continue data analytics research focused on human visualization of complex data. Evaluate multi-domain operator system interfaces for integrated defensive and offensive operations. Refine models to predict visibility of objects viewed by humans under both unaided and aided conditions and explore multi-modal model integration. Continue to integrate visualizations of events and their influence on objectives and courses of action for C2 environments across the air, space and cyberspace domains."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.590 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Conducts research on advanced auditory and communication technologies that mitigate effects of noise and enhance performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.205"
                                            },
                                            "Text": {
                                                "val": "Conduct research on the impact of auditory context and synthetic voicing to inform the design of synthetic speech displays for improving communication effectiveness and enhancing decision making in human-machine teams. Examine listener adaptation to non-individualized spatial auditory displays and acoustic information distorted by tactical hearing protection and communication devices. Develop persistent auditory iconography for enhancing situation awareness and develop\/evaluate source-based symbology to enhance auditory displays. Develop standard procedures and metrics for objectively characterizing the loss of situation awareness in tactical operations when wearing hearing protection and communication devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.053"
                                            },
                                            "Text": {
                                                "val": "Conduct research on auditory processing of complex, multi-source acoustic scenes and develop context-aware auditory displays for optimal delivery of real-time information from synthetic teammates, including verbal communication, spatial location and system state.  Develop electro-acoustic characterization techniques for the prediction of auditory protection and performance requirements.  Examine techniques for real-time augmentation of auditory reality.  Develop and evaluate new biomimic acoustic detection models that employ representations of domain-specific listening environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.372"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.372"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct research on auditory processing of complex, multi-source acoustic scenes and develop context-aware auditory displays for optimal delivery of real-time information from synthetic teammates, including verbal communication, spatial location and system state. Develop enhanced electro-acoustic characterization techniques for the prediction of auditory protection and performance requirements. Examine and implement techniques for real-time augmentation of auditory reality. Enhance and refine biologically-inspired models of acoustic detection for special operations aviation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.681 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627757"
                    },
                    "ProjectTitle": {
                        "val": "Bioeffects"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "29.992"
                        },
                        "CurrentYear": {
                            "val": "31.130"
                        },
                        "BudgetYearOne": {
                            "val": "33.823"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.823"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "37.553"
                        },
                        "BudgetYearThree": {
                            "val": "38.098"
                        },
                        "BudgetYearFour": {
                            "val": "39.992"
                        },
                        "BudgetYearFive": {
                            "val": "37.950"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on the effects of human exposure to potentially toxic chemicals in the operational environment, advanced materials (including nanomaterials), electromagnetic (EM) energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons. This research addresses fundamental physical principles, as well as the psychophysical interaction between directed energy and the individual or groups of individuals.  Research is divided into three core focus areas:  optical radiation bioeffects; radio frequency radiation (RFR) bioeffects; and molecular bioeffects.  Optical radiation bioeffects research enhances combat survivability and systems effectiveness through technologies that enable deployed forces to counter optical threats and exploit optical systems for offensive applications.  The RFR bioeffects research investigates basic biological mechanisms of RFR, conducts theoretical and empirical dosimetry, conducts research of bioeffects from short and long-term exposures, develops methods to counter RFR threats, and performs research for exploitation of directed energy systems for offensive capabilities.  Molecular bioeffects research is conducted to protect Airmen from the effects of toxic chemicals and materials to include nanomaterials and other advanced development products and to discover novel biomarkers and molecular mechanisms to support personalized training, performance and protection of Airman cognitive and physical performance using advanced sense, assess and augment technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research on laser bioeffects, enabling military exploitation of laser technology while providing countermeasures for optical hazards\/threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.811"
                                            },
                                            "Text": {
                                                "val": "Expand research into pulse laser damage mechanisms for collateral hazard assessment of new high energy laser systems under development.  Continue development of scalable effects simulation tool for solid state continuous wave lasers.  Integrate probabilistic assessment using dose-response methodologies for realistic laser exposure scenarios.  Initiate development of glare assessment models that consider retinal pigmentation, dynamic background, and ocular scatter. Conduct studies to define impact of laser eye protection on performance and potential mitigation strategies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.695"
                                            },
                                            "Text": {
                                                "val": "Initiate assessment of alternate wavelength bioeffects for use in high-energy lasers.  Complete assessment of effectiveness of novel glare device bioeffects.  Continue pulse laser damage bioeffects assessment to help in evaluation of collateral hazards of high energy laser systems.  Initiate investigations of suprathreshold laser damage to allow future probabilistic assessment of full range of bioeffects from collateral exposures.  Validate developing scalable effects simulation tool and dose-response methodologies to assure science-based assessment of high-energy lasers weapons or developing visual glare devices.  Continue development of models reflecting the performance impact of laser exposures and develop mitigation strategies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.247"
                                            },
                                            "Text": {
                                                "val": "Complete initial studies of alternate laser wavelength bioeffects for use in high-energy lasers.  Incorporate glare vision effect models in national and DoD standards for definition of protective requirements and glare device effectiveness. Transition risk-based model components for hazard evaluations of laser and broad-band optical systems.  Mature generalized dose-response component models for future analysis of emerging laser technologies such as fiber and Diode Pumped Alkali Laser (DPAL) systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $2.552 million. Justification for the increase is increased emphasis in optical radiation bioeffects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research to enable safe exploitation of directed energy technologies for communication, target identification, and weapons development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.928"
                                            },
                                            "Text": {
                                                "val": "Evaluate effects of whole body fast thermal gradients.  Refine bioeffects approach to analyze effects of short pulse radio frequency energy.  Finalize validation of dosimetry suite covering broad power and frequency range to support next-generation counter-electronic weapons and high power microwave smart weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.052"
                                            },
                                            "Text": {
                                                "val": "Parameterize fast thermal gradient bioeffects for whole body application.  Validate targeted energy deposition models.  Explore smart waveform mixing for deep-targeted energy deposition.  Advance whole body molecular beacon technology for advanced radio frequency (RF) dosimetry and computer effects model validation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.873"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.873"
                                            },
                                            "Text": {
                                                "val": "Focus on molecular signatures of RF overexposure to assess acute and chronic bioeffects of RF overexposures in operational situations.  Complete scalability matrix for fast thermal gradients exposures for transition from contact to free field application.  Continued advancements in fast thermal gradient research.  Investigating damage effects of high average power exposures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $1.821 million. Justification for the increase is increased emphasis in radio frequency bioeffects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Molecular Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Protect Airmen from toxic chemicals and materials and enhance performance capability under demanding training and mission activities through molecular bioscience research."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.253"
                                            },
                                            "Text": {
                                                "val": "Advance knowledge and capability to complete analysis of aerospace fluid(s) toxicity characterization and impacts on high performance aircraft operators to best reduce Airmen health risk and Air Force mission risk.  Characterize and examine novel mechanisms of fundamental interaction of nanomaterials in a biological system to best understand exposure effects on the Airman.  Examine molecular mechanism of cognitive performance in physically or mentally intensive operational environments for the development of effective and safe strategies to protect, optimize and augment Airman performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.383"
                                            },
                                            "Text": {
                                                "val": "Initiate toxicological analysis of several relevant aerospace fluids, such as coolants and jet fuels, that may negatively affect high performance aircraft operators. Initiate developmental studies to create an organ on chip technology that enables rapid and accurate assessment of potentially toxic aerospace materials, with special emphasis on advanced acquisition materials that includes nanoparticles.  Conduct characterization and toxicity evaluation of particle aerosol in post-detonated areas to define exposure limits for the warfighter. Complete definitive analysis of chromium VI toxicity to best protect maintenance Airmen exposed to the surface coating on many current aircraft containing this chemical. Identify an easily measureable biomarker in Airmen that become hypoxic, to rapidly identify a degraded performance state.  Examine molecular mechanism of cognitive performance in physically or mentally intensive operational environments for the development of effective and safe strategies to protect, optimize and augment Airmen performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.703"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.703"
                                            },
                                            "Text": {
                                                "val": "Complete toxicological analysis of several relevant aerospace fluids, such as hydraulics, coolants, lubricants and jet fuels that may negatively affect high performance aircraft operators. Begin development of an Air Force Specific In Vitro Screen (AFSIVS) to enable rapid and accurate assessment of potentially toxic chemicals and materials including nanoparticles. Conduct studies to develop safe and effective fatigue counter measures to improve Airmen performance in physically or mentally intensive operational environments. Complete initial characterization and toxicity evaluation of particle aerosol in post-detonated areas to define exposure limits for the warfighter.  Conduct developmental studies to create an organ on chip technology that enables rapid and accurate assessment of potentially toxic aerospace materials, with special emphasis on advanced acquisition materials that includes nanoparticles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $1.680 million. Justification for the decrease is decreased emphasis in molecular bioeffects."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}