{
    "id": "2019-Navy-PB-1319-JBOOK-821a86e52b8a9e8adb2520b7da522d7e9127bb0d09d665079e51fae2a6f074c0-54",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA7-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1203109N"
        },
        "ProgramElementTitle": {
            "val": "(U)Satellite Communications (SPACE)"
        },
        "R1LineNumber": {
            "val": "268"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "37.836"
            },
            "BudgetYearOne": {
                "val": "39.174"
            },
            "BudgetYearOneBase": {
                "val": "39.174"
            },
            "BudgetYearTwo": {
                "val": "47.333"
            },
            "BudgetYearThree": {
                "val": "48.223"
            },
            "BudgetYearFour": {
                "val": "52.908"
            },
            "BudgetYearFive": {
                "val": "53.996"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Navy Multiband Terminal (NMT) Program is the required Navy component to the Advanced Extremely High Frequency (AEHF) program for enhancing protected and survivable satellite communications to Naval forces.  The NMT system provides an increase in single service capability from 1.5 Megabits per second (Mbps) to 8 Mbps, increases the number of coverage areas and retains Anti-Jam\/Low Probability of Intercept (AJ\/LPI) protection characteristics.  It is compatible with legacy Navy Low Data Rate\/Medium Data Rate (LDR\/MDR) terminals and will sustain the Military Satellite Communications (MILSATCOM) architecture by providing connectivity across the spectrum of mission areas, to include land, air and naval warfare, special operations, strategic nuclear operations, strategic defense, theater missile defense, and space operations and intelligence in support of Assured Command and Control (AC2) initiatives.  The NMT system replenishes and improves on Navy terminal capabilities of the Military Strategic, Tactical & Relay System (MILSTAR), Defense Satellite Communications System  (DSCS), Wideband Global Satellite (WGS) and Global Broadcast Service (GBS).  The new system equips the warfighters with the assured, jam resistant, secure communications as described in the joint AEHF satellite communications system and WGS Operational Requirements Documents (ORD).  The NMT provides multiband Satellite Communications (SATCOM) capability for ship, submarine, and protected MILSATCOM for shore sites.\n\nThe Navy Global Broadcast Service (GBS) Program is the Navy component of the Joint Military Satellite Communications (MILSATCOM) ACAT IC program that delivers the continuous flow of high-speed, high-volume communication and information flow for deploying, deployed, on the move, and garrisoned forces. The Joint GBS system supports the Navy Strategic Plan and equips warfighters with Assured Command and Control (AC2) communications.  The Enterprise SATCOM Gateway Modem (ESGM) is the DoD Chief Information Officer directed solution to satisfy the Transmission Security (TRANSEC) requirement in place of the Joint Internet.  Testing and fielding of the ESGM is a joint venture, operationally directed by the Defense Information Systems Agency (DISA) and the Air Force as the lead service.  GBS augments and interfaces with other communications systems, provides relief to overburdened communications systems already in place, and provides information to previously unsupported users. GBS provides bandwidth five times any other system, up to 45 Mbps of forward link data (shore to ship) per WGS satellite transponder.\n\nThe Mobile User Objective System (MUOS) program provides for the development of the next generation Department of Defense (DoD) advanced narrowband communications satellite constellation. MUOS is the only UHF satellite system replacing the aging UHF Follow-on (UFO) system, which is currently beyond its design life. MUOS provides legacy UHF satellite communications as well as a Wideband Code Division Multiple Access (WCDMA) capability which significantly increases performance and capacity critical to support Combatant Command priorities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "37.836"
                },
                "BudgetYearOne": {
                    "val": "35.724"
                },
                "BudgetYearOneBase": {
                    "val": "35.724"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "37.836"
                },
                "BudgetYearOne": {
                    "val": "39.174"
                },
                "BudgetYearOneBase": {
                    "val": "39.174"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.450"
                },
                "BudgetYearOneBase": {
                    "val": "3.450"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.764"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.764"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.314"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.314"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY19 adjustment includes a reduction of $1.236M reduction to account for the availability of prior year execution balances; an increase of $5.000M in support of UHF Narrowband SATCOM AoA, and $0.314M for Rate and miscellaneous adjustments.\n\nSchedule:\nEHF SATCOM Terminals (Project 0728) - No change\n\nTechnical:\nEHF SATCOM Terminals (Project 0728):  No change\n\nProjects 0728, 2472 and 3398 realigned from PE 0303109N beginning in FY 2018."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0728"
                    },
                    "ProjectTitle": {
                        "val": "EHF SATCOM Terminals"
                    },
                    "MdapCode": {
                        "val": "290"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "22.361"
                        },
                        "BudgetYearOne": {
                            "val": "17.729"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.729"
                        },
                        "BudgetYearTwo": {
                            "val": "32.801"
                        },
                        "BudgetYearThree": {
                            "val": "33.363"
                        },
                        "BudgetYearFour": {
                            "val": "38.993"
                        },
                        "BudgetYearFive": {
                            "val": "39.809"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Navy Multiband Terminal (NMT) Program is the required Navy component to the Advanced Extremely High Frequency (AEHF) Program for enhancing protected and survivable satellite communications to Naval forces. Although development of the NMT terminal is complete, software and hardware upgrade development is ongoing to provide enhanced capabilities to the fleet.  Development efforts, including Adaptive Coding (AC), Time of Day (TOD), and the Wideband Anti-Jam Modem System (WAMS) augment the baseline NMT system to pace the evolving threats to the warfighter.  The NMT system provides an increase in single service capability from 1.5 Megabits per second (Mbps) to 8 Mbps, increases the number of coverage areas, and retains Anti-Jam\/Low Probability of Intercept (AJ\/LPI) protection characteristics.  It is compatible with legacy Navy Low Data Rate\/Medium Data Rate (LDR\/MDR) terminals and will sustain the Military Satellite Communications (MILSATCOM) architecture by providing connectivity across the spectrum of mission areas, to include land, air and naval warfare, special operations, strategic nuclear operations, strategic defense, theater missile defense, and space operations and intelligence.  The NMT system replenishes and improves on Navy Military Strategic, Tactical & Relay System (MILSTAR), Defense Satellite Communications System (DSCS), Wideband Global Satellite (WGS), and Global Broadcast Service (GBS) terminal capabilities.  The new system equips the warfighters with assured, jam resistant, secure communications as described in both the joint AEHF Satellite Communications System and the WGS Operational Requirement Documents (ORD).  Mission requirements specific to Navy operations, including threat levels and scenarios, are contained in the ORD.  The NMT provides multiband Satellite Communications (SATCOM) capability for ship, submarine, and protected MILSATCOM for shore sites.\n\nThe Wideband Anti-Jam Modem Systems (WAMS) enhances communication capability of shipboard and submarine NMTs by providing wideband Anti-Jam (AJ) Satellite Communication throughput over Wideband Global SATCOM (WGS). The United States Air Force (USAF) Protected Tactical Enterprise Service (PTES) program will provide the ground hub component of the WAMS communication  system. This PTES joint hub will serve as a DoD enterprise service ground solution for the use of the Protected Tactical Waveform (PTW) of SATCOM communications.  WAMS enables space segment AJ diversity (EHF\/AEHF and WGS), thus enabling NMT ships and submarines equipped with the modem to operate in wideband links closer to threat jammers. WAMS will also include a Mini-Hub component to be fielded on all Force Level platforms to provide operations in the event Shore Communications are eliminated.  WAMS enables the use of WGS X and Ka-band resources to assure access to mission critical communications to provide Assured Command and Control (AC2) capabilities in contested\/degraded environments, formerly known as Anti-Access\/Area Denial (A2AD). The use of WAMS Protected Tactical Waveform (PTW) on WGS will augment AEHF extended data rate (XDR) services to provide the information throughput capacity necessary to support critical Command and Control capability.\n\nJoint Aerial Layer Network-Maritime (JALN-M) is the Navy implementation of the JALN architecture which provides assured communications in any environment, especially in a satellite denied environment. With disruption or loss of Space tier communications, JALN-M establishes and\/or restores connectivity.  A critical component of Assured Command and Control (AC2) capabilities is Adaptive Coding (AC) software development incorporation into the baseline NMT terminal including the Advanced Time Division Multiple Access (TDMA) Interface Processor (ATIP) in addition to supporting the JALN-M demonstration.  This capability autonomously enhances maximum throughput and supports degraded conditions by adjusting End-to-End code rate to provide continuous, mission critical, and protected communications.  \n\nDevelopment efforts, including Adaptive Coding, Time of Day, and the Wideband Anti-Jam Modem System (WAMS) augment the baseline NMT system to pace the evolving threats to the warfighter. The Time of Day (TOD) capability promotes communications reliability and resiliency; when the channel is degraded due to inclement weather or adversarial action. TOD  enables the system to automatically transition to a more robust, lower code rate resulting in ability to maintain satellite link thereby allowing the fleet to preserve communications.\n\nTechnology Insertion, studies and implementation is necessary for military satellite communications systems development to support emerging technologies for Commercial Broadband Satellite Program (CBSP) and Global Broadcast Service (GBS) Terminals in the out years.  \n\nThe FY19 request will provide for the continuation of enhancements to the NMT system and to define the Navy's WAMS technical baseline for integration into NMT.  NMT enhancements include the completion of both the Adaptive Coding and Time of Day (TOD) software design, development, integration and test."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NMT Assured C2 Development"
                                    },
                                    "Description": {
                                        "val": "Software and hardware upgrade development is ongoing to provide Assured Command and Control (AC2) capabilities to pace the evolving threats to the warfighter. These capabilities provide secure SATCOM access in contested\/degraded environments by providing anti jam and improved bandwidth that supports increasing Fleet demands. The Wideband Anti-Jam Modem System (WAMS) will provide an anti-jamming capability that will counter various adversary threats and Adaptive Coding (AC) will autonomously maximize throughput in degraded or benign conditions. Adaptive Coding (AC) software development autonomously enhances maximum throughput and supports degraded conditions by adjusting End-to-End code rate to provide continuous, mission critical, and protected communications. The Time of Day (TOD) capability promotes communications reliability and resiliency; when the channel is degraded due to inclimate weather or adversarial action. TOD  enables the system to automatically transition to a more robust, lower code rate resulting in ability to maintain satellite link thereby allowing the fleet to preserve communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 funding profile resides in PE 0303109N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.154"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin major Time of Day (TOD) software design development efforts, which implements a more robust Adaptive Coding (AC) capability on the affected systems NMT, Advanced Time Division Multiple Access (TDMA) Interface Processor (ATIP), and KIV-7M.  Raytheon and Comtech vendors supporting NMT, ATIP, and KIV-7M will work parallel Engineering Change Proposals (ECPs) to design and ensure interoperability on development efforts for Adaptive Coding software TOD encryption to enable a more robust, lower code rate when the link margin is degraded.  This will ensure ADNS\/ATIP interface data rates changes commensurate with code rate changes are optimized to ensure maximum user data throughput.  The program will undertake NSA certification of AC TOD encryption.  These modifications will allow the ATIP to support TOD for KIV-7M use to prevent crypto losing synchronization during degraded link environment. Start the development of integration and testing plans for the TOD encryption solution and perform technical and system risk reduction.\n\nNMT will be conducting Operational Test-E1 to evaluate the operational effectiveness and operational suitability of the Enhanced Polar System (EPS) modified NMT which utilizes the protected high frequency (EHF) satellite communications in the North Polar.  In addition, NMT will support Air Force Lead Developmental Test Organization (LDTO) EPS events and EPS Multi-Service Operational Test and Evaluation (MOT&E).\n\nContinue development of the WAMS technical baseline for use in NMT and complete Systems Engineering Technical Review (SETR) activities.  Develop requirements and NMT specification changes and commence NMT design changes to improve performance when operating with the WAMS.  Develop design of the Modem Mission Management System (MMS) and Key Management System (KMS) as well as integration strategies for MMS\/KMS operational compatibility with DoD enterprise Protected Tactical Enterprise Service (PTES) (which is the Air Force ground system for waveform operations over the Wideband Global SATCOM (WGS) ground solution architecture. Obtain and certify space assets and ground facilities to support testing and assessment of Engineering Design Model (EDM) modems.  Develop test plans and procedures to commence Navy testing of USAF EDM modems after delivery. Testing will include analysis of three separate vendor EDM designs procured from the USAF Protected Tactical Field Service Demonstration (PTSFD) effort. The testing process will verify and validate the vendor designs ensuring that Navy unique performance (antenna handover) and environmental (shock, vibration, temperature, and humidity) requirements are addressed in the design.  Further refinement of technical and pre-award acquisition documentation for the Modem and Mini-Hub contracts of the WAMS effort including RFP development and coordination as well as technical specifications.  Initiate modem certification and coordination process through NSA. Documentation development will include the WAMS Specification, WAM Mini-Hub specification, Cyber strategy to support the Clinger Cohen Act and Information Support Plan (ISP)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete major Time of Day (TOD) software design development efforts on the affected systems, NMT and ATIP, to implement the more robust AC capability.  The NMT and ATIP vendors will develop parallel Engineering Change Proposals (ECPs) to design and ensure the interoperability of AC software and TOD encryption that will enable a more robust, lower code rate when the link margin is degraded.  The program will undertake NSA certification of AC TOD encryption solution and author a Key Management Plan (KMP) to support key generation, distribution and operation of the AC TOD encryption. The ToD encryption functionality will be hosted in the ATIP and allow for continued operations during degraded link environments using lower code rate \/ data rate without dropping the communications link.  The program will develop test plans and execute test events to verify system of systems capability.  This includes the development of the network interface of Automated Digital Network System (ADNS) to support a dynamic bandwidth capability on the radio to router interface.  This will complete the integration and testing of NMT and ATIP design development as well as development plans for TOD encryption solution and associated technical and system risk reduction.\n \nDefine the Navy's WAMS technical baseline for integration into NMT.  Continue to develop and design the Modem Mission Management System interim (MMSi) and Key Management System interim (KMSi), including integration strategies for MMS\/KMS operational compatibility with the DoD Protected Tactical Enterprise Service (PTES) ground solution architecture.  This will also include Navy specification development and review of the Air Force Technical Requirements Documents (TRD).  Continue Navy testing of both surface and submarine terminal variant EDM WAMS modems in Navy Labs.  Testing will verify and validate waveform and system specification compliance and help refine the Navy test plan and schedule which will allow for the coordination of joint Initial Operational Capability (IOC) test events with the Air Force."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $2.425M from FY18 to FY19 is due to Engineering Design Modems (EDM) Hardware procured in FY18 and associated test plan development that is not required in FY19.  The FY19 funding request was reduced by $1.236M to account for the availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Aerial Layer Network Maritime (JALN-M)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 funding profile resides in PE 0303109N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.107"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete system of systems integration and testing of NMT and ATIP Adaptive Coding during pre-demonstration flights.  This includes completion of design verification of JALN-M capabilities of NMT by testing with the Airborne XDR payload.  Perform systems engineering, test support and document analytical data and findings.  Complete installation of the JALN-M capabilities and execute shipboard\/site verification by using the AEHF satellite for End-to-End SATCOM Adaptive Coding."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $2.107M from FY18 to FY19 is due to the completion of the JALN-M Demonstration in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology Insertion"
                                    },
                                    "Description": {
                                        "val": "Overall program efforts include technology insertion implementation and associated testing required to support satellite communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 funding profile resides in PE 0303109N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform Joint SATCOM Engineering Center (JSEC) testing and certification of the Assured Command and Control (AC2) modems to prepare for operation in the Wideband Global SATCOM system (WGS) in support of Commercial Broadband Spectrum (CBSP) and Navy Multiband Terminal (NMT) programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of -0.1 from FY2018 to FY2019 is due to the completion of JSEC testing and certification of the AC2 modems."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/3216"
                                    },
                                    "Title": {
                                        "val": "NAVY MULTIBAND TERMINAL (NMT)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "33.992"
                                        },
                                        "CurrentYear": {
                                            "val": "69.764"
                                        },
                                        "BudgetYearOne": {
                                            "val": "113.885"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "113.885"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "92.150"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.536"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.279"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.072"
                                        },
                                        "CostToComplete": {
                                            "val": "73.062"
                                        },
                                        "TotalCost": {
                                            "val": "1508.298"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The Other Appropriation represents remaining procurement and installation of NMT production units for Afloat and Shore requirements to reach Full Operational Capability.  Funding also includes the procurement and installation of Assured Command and Control (AC2) modems as well as the installation of Advanced Time Division Multiple Access (TDMA) Interface Processors (ATIPs), X\/KA Back-Fits, and Ashore Antennas."
                        },
                        "AcquisitionStrategy": {
                            "val": "The NMT Follow-On Full Deployment (FOFD) contract will continue NMT production for Afloat platforms and Shore locations, in support of the Chief of Naval Operations and the Department of the Navy (DON), and will allow the NMT Program to complete Full Operational Capability (FOC).  The competitive contract awarded to COMTECH supports the development of Assured Command and Control (AC2) enhancements."
                        },
                        "PerformanceMetrics": {
                            "val": "The RDT&E goal for the NMT program is to create a military satellite communications system that consolidates capabilities of current and future satellite systems into a single terminal."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "FY19 Increase to Software Development Engineering and the continuation of efforts within the NMT Product Development focuses on the completion of software design development across systems and vendors for Adaptive Coding (AC) and Time of Day (TOD) Encryption and finalize development of WAMS technical baseline. The program will perform Navy testing of the PTSFD EDM modems to verify and validate waveform and specification compliance.  FY18 Software Development TOD Plan is a program directed update and aligns funds from Raytheon to COMTECH.  FY18 funding assigned to WAMS EDM Hardware Contracts due to delayed Air Force contract negotiations.  FY17 funds were previously assigned in PE 0303109N."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development Time of Day (TOD)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RAYTHEON"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Marlborough, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.140"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.870"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.870"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development ATIP Adaptive Coding (AC) \/Time of Day (TOD)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "COMTECH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tempe, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.756"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.246"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.246"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NUWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Newport, RI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.062"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.598"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.598"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.581"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.490"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.490"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WAMS EDM Hardware"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RATYTHEON"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Marlborough, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.550"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.550"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WAMS EDM Hardware"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3 Systems West:"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Salt Lake City, UT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.485"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.485"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WAMS EDM Hardware"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ViaSat"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Carlsbad, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.317"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.317"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Integration\/Government Oversight"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NUWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Newport, RI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.254"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.066"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.066"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Integration Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.793"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.675"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.675"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SYSTECH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.348"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.998"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.998"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WAMS Studies and Design"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT\/LL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Marlborough, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.421"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.421"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.921"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "EPS & JALN-M Development Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.728"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.006"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.006"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Operational Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "COMOPTEVFOR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.009"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.009"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San  Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.232"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.170"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.170"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.556"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.139"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.139"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2019PB_1203109N_0728_FILE1.JPG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 0728"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "AEHF Launch SV-5"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "A2AD Adaptive Coding & JALN-M Integration & Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "A2AD Wideband AJ Modem Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Procurement Year (PY8)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Procurement Year (PY9)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Procurement Year (PY10)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FRP PY7 Delivery"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FRP PY8 Delivery"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FRP PY9 Delivery"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "WAM Integration & Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "FRP PY10 Delivery"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "AEHF Launch SV-6"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "A2AD Adaptive Coding\/Time of Day"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "WAMS IOC"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2472"
                    },
                    "ProjectTitle": {
                        "val": "Mobile User Objective Sys (MUOS)"
                    },
                    "MdapCode": {
                        "val": "345"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "13.965"
                        },
                        "BudgetYearOne": {
                            "val": "20.530"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.530"
                        },
                        "BudgetYearTwo": {
                            "val": "14.530"
                        },
                        "BudgetYearThree": {
                            "val": "14.860"
                        },
                        "BudgetYearFour": {
                            "val": "13.915"
                        },
                        "BudgetYearFive": {
                            "val": "14.187"
                        },
                        "CostToComplete": {
                            "val": "82.590"
                        },
                        "TotalCost": {
                            "val": "174.577"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In June 2016, based on the results of the Multi-Service Operational Test and Evaluation-2 (MOT&E-2), Director, Operational Test & Evaluation (DOT&E) assessed the Mobile User Objective System (MUOS) not operationally effective or suitable. Increase of funds from FY18 to FY19 is required to conduct Multi-Service Operational Test and Evaluation-2B (MOT&E-2B) in FY19.  As a result of the program addressing findings and preparing for MOT&E-2B in FY19, Full Operational Capability (FOC) has been moved to FY20.  The MUOS Key Performance Parameter Threshold requires 70% constellation availability through 2030 (FOC + 10 years).  Recent analysis predicts that MUOS Wideband Code Division Multiple Access (WCDMA) will fall below this requirement in 2028, therefore an Ultra-High Frequency (UHF) Narrowband satellite communications (SATCOM) Analysis of Alternatives (AoA) is required to satisfy Narrowband requirements beyond the MUOS service life.  The increase of funds from FY18 to FY19 funds the AoA.\n\nMUOS provides a worldwide, multi-service population of mobile and fixed-site terminal users with UHF Narrowband, beyond line of sight SATCOM.  MUOS significantly increases performance and capacity in support of critical Combatant Command SATCOM priorities.  MUOS is the replacement system for the UHF Follow-on (UFO) system, which is currently beyond its design life.  MUOS consists of Space, Ground, and User Entry Segments.  The Space Segment consists of 5 geosynchronous satellites, one which is an on-orbit spare, and provides both a legacy UHF payload, which is backward compatible with UFO, and a WCDMA payload, which provides 3G cellular-like capability.  The Ground Segment consists of four world-wide Radio Access Facilities (RAFs) and two satellite control facilities.  Each RAF includes three 60 ft. antennas, and numerous racks of equipment.  The RAF in Hawaii includes a Network Management Facility (NMF).  The RAFs in Hawaii and Virginia each include a Switching Facility (SF).  The User Entry Segment consists of the MUOS waveform that is ultimately integrated into MUOS-capable terminals.  The MUOS legacy capability has been in operational use since 2012, and the WCDMA capability transitioned to Early Combatant Command Use in July 2016.\n\nIn addition to providing UHF SATCOM for the Department of Defense, the Navy has the overall responsibility to deliver the End-to-End MUOS capability to the warfighter.  This responsibility involves systems engineering, integration, and test management of all MUOS system of system activities, to include the integration of the MUOS waveform into MUOS-capable terminals and the subsequent terminal certification testing.\n\nThe budget line in FY19 and out is dedicated to completion of the MOT&E-2B activities, system optimization to address the dynamic, worldwide electromagnetic and cybersecurity environment in which MUOS operates, testing to support certification of MUOS-capable terminals, and the UHF Narrowband SATCOM AoA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mobile User Objective Sys (MUOS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "MUOS FY17 funding profile resides in PE 0303109N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.965"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 addresses operational test deficiencies and preparation for FY19 Multi-service Operational Test and Evaluation-2B (MOT&E-2B) activities, particularly addressing the capability to monitor system status and provide situational awareness for system operators.  Execute 5 developmental test assist events in preparation for FY19 MOT&E-2B.  Address emerging cybersecurity requirements.  Support integration of the MUOS waveform into MUOS-capable terminals and execution of certification testing of MUOS-capable terminals in support of Department of Defense terminal programs.  Develop a modernized geolocation Ground Segment subsystem in order to meet baseline requirements.  Address the dynamic, worldwide electronic magnetic environment through system optimization to ensure capacity is available to the end user."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY19 funds activities to prepare for and conduct MOT&E-2B, due to the June 2016 Director, Operational Test & Evaluation (DOT&E) assessment that found MUOS not operationally effective or suitable.  These activities include Development and Operational Test Readiness Reviews, Cooperative Vulnerability Penetration Assessment, formal MOT&E-2B, and Adversarial Assessment. Additionally, FY19 funds support the engineering and research efforts as part of the Ultra-High Frequency (UHF) Narrowband satellite communications (SATCOM) Analysis of Alternatives (AoA) initiative.  FY19 continues support of integration of the MUOS waveform into MUOS-capable terminals and execution of certification testing of MUOS-capable terminals in support of Department of Defense terminal programs.  Continue to address operational test deficiencies, particularly addressing the capability to monitor system status and provide situational awareness for the system operators.  Continue to address emerging cybersecurity requirements.  Continue development of a modernized geolocation Ground Segment subsystem in order to meet baseline requirements.  Continue to address the dynamic, worldwide electronic magnetic environment through system optimization to ensure capacity is available to the end user."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY19 funds activities to prepare for and conduct MOT&E-2B, due to the June 2016 DOT&E assessment that found MUOS not operationally effective or suitable.  These activities include Development and Operational Test Readiness Reviews, Cooperative Vulnerability Penetration Assessment, formal MOT&E-2B, and Adversarial Assessment. Additionally, the FY19 funding increase supports activities for the UHF Narrowband SATCOM AoA: with subject matter experts in support of Space, Ground, Terminal, and Cyber Security, modeling and simulation efforts, research and analysis on the industrial base, contracting options, affordability, concept of operations, and payload alternatives."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN\/2433"
                                    },
                                    "Title": {
                                        "val": "Fleet Satellite Comm Follow-On"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "33.723"
                                        },
                                        "CurrentYear": {
                                            "val": "46.357"
                                        },
                                        "BudgetYearOne": {
                                            "val": "66.779"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "66.779"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "67.380"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.460"
                                        },
                                        "BudgetYearFour": {
                                            "val": "45.985"
                                        },
                                        "BudgetYearFive": {
                                            "val": "46.907"
                                        },
                                        "CostToComplete": {
                                            "val": "617.197"
                                        },
                                        "TotalCost": {
                                            "val": "3044.814"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Currently sustainment and engineering activities are procured via the baseline MUOS Risk Reduction and Design Development contract.  The program is working to transition these activities to dedicated sustainment contracts for the Space, Ground and User Entry Segments.  Integration of the MUOS waveform into MUOS-capable terminals and execution of certification testing of MUOS-capable terminals are executed primarily by the Navy Working Capital Funded SPAWAR Systems Center Pacific."
                        },
                        "PerformanceMetrics": {
                            "val": "MUOS Goal: Achieve Full Operational Capability in FY 2020.\n\nMetric: Successfully complete 5 developmental test assist events in FY18, and Multi-Service Operational Test and Evaluation-2B FY19."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Contract"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.850"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.850"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.550"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Increase in Test and Evaluation efforts from FY18 to FY19 funds Test events in preparation for and conduct of MOT&E-2B."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.515"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.104"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.104"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.619"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Operational Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "COTF"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.048"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.048"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.298"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Increase in Services from FY18 to FY19 funds engineering and research efforts in support of UHF Narrowband SATCOM Analysis of Alternatives."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SBG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.528"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.528"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.028"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2019PB_1203109N_2472_FILE1.JPG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 2472"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Information Assurance Engineering"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Terminal Integration, Certification, and Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Waveform Sustainment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ground System Updates"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test Assist Event 1"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test Assist Event 2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test Assist Event 3"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test Assist Event 4"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test Assist Event 5"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Gate 6\/CSB FY18"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test Readiness Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Tech Eval"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DT Test Report"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Test Readiness Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "MOT&E2B"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Adversarial Assessment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "OT Test Report"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Gate 6\/CSB FY19"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Full Operational Capability (FOC) Objective"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Full Operational Capability (FOC) Threshold"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Gate 6\/CSB FY20"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Gate 6\/CSB FY21"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Gate 6\/CSB FY22"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Gate 6\/CSB FY23"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Cooperative Vulnerability Penetration Assessment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3398"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise SATCOM Gateway Modems (ESGMs)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.510"
                        },
                        "BudgetYearOne": {
                            "val": "0.915"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.915"
                        },
                        "BudgetYearTwo": {
                            "val": "0.002"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.427"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Navy Global Broadcast Service (GBS) Program is the Navy component of the Joint Military Satellite Communications (MILSATCOM) program that delivers the continuous flow of high-speed, high-volume communication and information flow for deploying, deployed, on the move, and garrisoned forces. The GBS system supports the Navy Strategic Plan and equips warfighters with a proven Assured Command and Control (C2) capability.  GBS provides Satellite Communications (SATCOM) capability for forces afloat, ashore, and Naval Special Warfare Command. \n\nThe Enterprise SATCOM Gateway Modem (ESGM) is the DoD Chief Information Officer directed solution to satisfy the Transmission Security (TRANSEC) requirement.  This modem will replace the existing modem in the GBS System.  Testing and fielding of the ESGM is a joint venture, operationally directed by the Defense Information Systems Agency (DISA) and the Air Force as the lead service. Additionally, the ESGM will continue to enable GBS reception of the Digital Video Broadcast - Satellite 2nd Generation (DVB-S2).\n\nFY19 GBS activities will complete Joint GBS integration and support the Joint GBS DT\/OT event."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enterprise SATCOM Gateway Modems (ESGMs)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enterprise SATCOM Gateway Modems (ESGMs) FY17 funding profile resides in PE 0303109N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.510"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "DISA is responsible for the selection of the DoD Wide Modem.  After selection is made, DISA will complete an initial DT\/OT.  Complete integration and testing necessary to support a DISA led Enterprise Satellite Communications Gateway Modems (ESGM) technical baseline.  Complete Navy-specific application integration testing and report on compliance with Navy C4I systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Air Force will follow up with a Joint Services DT\/OT.  Complete integration and testing necessary to support and finalize the Joint led GBS-ESGM technical baseline. Complete test execution, qualification and reporting for Joint-specific GBS and Navy-specific requirements during GBS Joint ESGM DT and OT activities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $.595M from FY18 to FY19 is due to DISA qualification reporting and Navy-specific application integration testing not required for FY19 activities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The GBS program reached a Full Rate Production Decision on 24 Oct 2008 and is in sustainment. The Enterprise Satellite Communications (SATCOM) Gateway Modem (ESGM), the Commercial Off-The-Shelf (COTS) Internet Protocol (IP) modem, provides Transmission Security functionality in support of DoD CIO direction to implement Information Assurance for all transmission media."
                        },
                        "PerformanceMetrics": {
                            "val": "The RDT&E goal for the GBS program is to create a military satellite communications system that supports current and future requirements for Assured Command and Control (AC2) and Information Assurance."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.313"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.188"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.188"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.501"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NUWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Newport, RI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.274"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.165"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.165"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.439"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC LANT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.322"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.522"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SYSTECH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.163"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.163"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.163"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Operational Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "COMOPTEVFOR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.271"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.133"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.133"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.404"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Developmental Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.221"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.221"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.061"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.061"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.161"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Reqn"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.009"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.005"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.005"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.014"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2019PB_1203109N_3398_FILE1.JPG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 3398"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "ESGM Development and Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GBS ESGM DT\/OT"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "ESGM Test Equipment Buy"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}