{
    "id": "2019-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-3aa5750205815470029d4902e3ab7fe43a356ab3f6d3326908075a172dae75b4-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601101E"
        },
        "ProgramElementTitle": {
            "val": "DEFENSE RESEARCH SCIENCES"
        },
        "R1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "356.861"
            },
            "CurrentYear": {
                "val": "432.347"
            },
            "BudgetYearOne": {
                "val": "422.130"
            },
            "BudgetYearOneBase": {
                "val": "422.130"
            },
            "BudgetYearTwo": {
                "val": "413.970"
            },
            "BudgetYearThree": {
                "val": "403.528"
            },
            "BudgetYearFour": {
                "val": "396.635"
            },
            "BudgetYearFive": {
                "val": "384.423"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Research Sciences Program Element is budgeted in the Basic Research Budget Activity because it provides the technical foundation for long-term National Security enhancement through the discovery of new phenomena and the exploration of the potential of such phenomena for Defense applications.  It supports the scientific study and experimentation that is the basis for more advanced knowledge and understanding in information, electronic, mathematical, computer, and materials sciences.\n\nThe Math and Computer Sciences project supports scientific study and experimentation on new mathematical and computational algorithms, models, and mechanisms in support of long-term national security requirements.  Modern analytic and information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness.  Conversely, new classes of threats, in particular threats that operate in or through the cyber domain, put military systems, critical infrastructure, and the civilian economy at risk.  This project aims to magnify these opportunities and mitigate these threats by leveraging emerging mathematical and computational capabilities including computational social science, artificial intelligence, machine learning and reasoning, data science, complex systems modeling and simulation, and theory of computation.  The basic research conducted under the Math and Computer Sciences project will produce breakthroughs that enable new capabilities for national security and homeland defense.\n\nThe Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cyber security.  Information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness.  Meanwhile, cyber threats grow in sophistication and number, and put sensitive data, classified computer programs, mission-critical information systems, and future economic gains at risk.  The basic research conducted under the Cyber Sciences project will produce breakthroughs necessary to enhance the resilience of DoD information systems to current and emerging cyber threats.\n\nThe Electronic Sciences project is for basic exploration of electronic and optoelectronic devices, circuits, and processing concepts to meet the military's need for near real-time information gathering, transmission, and processing. In seeking to continue the phenomenal progress in microelectronics innovation that has characterized the last few decades, the project should provide DoD with new, improved, or potentially revolutionary device options for accomplishing these critical functions. The resulting technologies should help maintain knowledge of the enemy, communicate decisions based on that knowledge, and substantially improve the cost and performance of military systems. The Beyond Scaling programs in this project will support investigations into materials, devices, and architectures to provide continued improvements in electronics performance with or without the benefit of Moore's Law (silicon scaling). Within the next ten years, traditional scaling will start to encounter the fundamental physical limits of silicon, requiring fresh approaches to new electronic systems. \n\nThe Beyond Scaling Sciences project will support investigations into materials, devices, and architectures to provide continued improvements in electronics performance with or without the benefit of Moore's Law (silicon scaling). Within the next ten years, traditional scaling will start to encounter the fundamental physical limits of silicon, requiring fresh approaches to new electronic systems. Over the short term, DoD will therefore need to unleash circuit specialization in order to maximize the benefit of traditional silicon. Over the longer term, DoD and the nation will need to engage the computer, material, and mechanical sciences to explore electronics improvements through vertical circuit integration for improved computation or non-volatile memory devices that combine computation and memory. Other memory devices could also leverage an emerging understanding of the physics of magnetic states, electron spin properties, topological insulators, or phase-changing materials. Beyond Scaling programs will address fundamental exploration into each of these areas. This Project is not a new start. It aggregates and continues Beyond Scaling programs that were initiated in Projects ES-01 and CCS-02 in this same Program Element.\n\nThe Materials Sciences project provides the fundamental research that underpins the design, development, assembly, and optimization of advanced materials, devices, and systems for DoD applications in areas such as robust diagnostics and therapeutics, novel energetic materials, and complex hybrid systems.\n\nThe Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in computing and the computing-reliant subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "362.297"
                },
                "CurrentYear": {
                    "val": "432.347"
                },
                "BudgetYearOne": {
                    "val": "410.178"
                },
                "BudgetYearOneBase": {
                    "val": "410.178"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "356.861"
                },
                "CurrentYear": {
                    "val": "432.347"
                },
                "BudgetYearOne": {
                    "val": "422.130"
                },
                "BudgetYearOneBase": {
                    "val": "422.130"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.436"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "11.952"
                },
                "BudgetYearOneBase": {
                    "val": "11.952"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.140"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.576"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "11.952"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11.952"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017:  Decrease reflects the SBIR\/STTR transfer offset by reprogrammings.\nFY 2018:  N\/A\nFY 2019:  Increase reflects additional funding supporting the Electronics Resurgence Initiative (ERI) in the Beyond Scaling Sciences project."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CCS-02"
                    },
                    "ProjectTitle": {
                        "val": "MATH AND COMPUTER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "145.091"
                        },
                        "CurrentYear": {
                            "val": "169.069"
                        },
                        "BudgetYearOne": {
                            "val": "160.153"
                        },
                        "BudgetYearOneBase": {
                            "val": "160.153"
                        },
                        "BudgetYearTwo": {
                            "val": "181.256"
                        },
                        "BudgetYearThree": {
                            "val": "184.896"
                        },
                        "BudgetYearFour": {
                            "val": "182.536"
                        },
                        "BudgetYearFive": {
                            "val": "181.536"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Math and Computer Sciences project supports scientific study and experimentation on new mathematical and computational algorithms, models, and mechanisms in support of long-term national security requirements.  Modern analytic and information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness.  Conversely, new classes of threats, in particular threats that operate in or through the cyber domain, put military systems, critical infrastructure, and the civilian economy at risk.  This project aims to magnify these opportunities and mitigate these threats by leveraging emerging mathematical and computational capabilities including computational social science, artificial intelligence, machine learning and reasoning, data science, complex systems modeling and simulation, and theory of computation.  The basic research conducted under the Math and Computer Sciences project will produce breakthroughs that enable new capabilities for national security and homeland defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Social Systems"
                                    },
                                    "Description": {
                                        "val": "The social sciences provide essential theories and models that can enable deeper understanding of human social systems and behaviors relevant to national security such as humanitarian aid, disaster relief, and stability support missions, as well as tactical, operational, strategic, and policy-level decision-making across the DoD.  However, current limitations to the speed, scalability and reproducibility of empirical social science research continue to hamper its practical use by the DoD.  One focus area of the Human Social Systems thrust is to develop and validate new methods, models and tools to perform rigorous, reproducible experimental research at scales necessary to understand emergent properties of human social systems.  Another focus area is to identify methods to better characterize and quantify properties, dynamics and behaviors of different social systems to enable better and more confident forecasting of changes in social systems, particularly when under stress.  This research thrust will provide DoD with new, reliable strategies to better understand and respond to social system issues at city scale."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.640"
                                            },
                                            "Text": {
                                                "val": "-  Developed new methods and tools to enhance the reproducibility of experimental results to accelerate discovery in research and modeling of human social behaviors. \n-  Demonstrated the utility of new networked data collection, mathematical, and computational modeling tools for representing complex social interactions.  \n-  Initiated the development of new simulation and computational modeling tools for representing complex social interactions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.400"
                                            },
                                            "Text": {
                                                "val": "-  Develop new capabilities for experimentally testing and validating multiple models of human social systems and behaviors.  \n-  Demonstrate the applicability of newly developed representation and modeling tools for understanding potential social behavioral outcomes. \n-  Test newly developed representation and modeling tools to determine applicability for understanding social behavioral outcomes.  \n-  Begin to leverage inherent bias in artificial intelligence (AI) systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Integrate new capabilities for experimentally testing and validating multiple models of human social systems and behavior.   \n-  Develop scoring methods to quantify the predictive accuracy of different models across different social experimental designs. \n-  Test the efficiency and value of enhanced reproducibility for accelerating rigorous understanding of human social systems and behaviors.  \n-  Develop and deploy increasingly complex social simulations with known causal ground truth as test bed challenges for social science research communities.  \n-  Quantify the diagnostic and predictive accuracy, robustness, and efficiency of social science representation and modeling tools by testing them against simulations.  \n-  Determine the capabilities and limitations of representation and modeling tools for understanding and predicting cause and effect in complex social systems.  \n-  Measure bias in systems trained on distinct training sets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects expansion into testing and modeling phases of understanding human social systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synergistic Discovery and Design (SD2)"
                                    },
                                    "Description": {
                                        "val": "The Synergistic Discovery and Design (SD2) program is developing data-driven methods to accelerate scientific discovery and robust design in domains that lack complete models.  Engineers regularly use high-fidelity simulations to create robust designs in complex domains such as aeronautics and integrated circuits.  In contrast, robust design remains elusive in domains such as synthetic biology, neuro-computation, and synthetic chemistry due to the lack of high-fidelity models.  The SD2 program is developing tools to enable robust design despite the lack of complete scientific models.  This involves collecting raw experimental data into a data and analysis hub, developing computational techniques that extract scientific knowledge directly from experimental data, and creating data sharing tools and metrics that facilitate collaborative design.  SD2 application domains include synthetic biology, solar cell chemistry, and protein design."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Designed computational infrastructure to enable collaborative scientific research on data-driven methods for scientific discovery and design in domains that lack robust models. \n-  Established baseline data ingest, indexing, and sharing methods for collaborative analysis of experimental data from the synthetic biology application domain.\n-  Generated high-quality, integrated experimental data from synthetic biology laboratories."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop baseline scientific discovery algorithms that detect why experiments fail and enhance reproducibility of sensor and circuit design experiments.\n-  Establish automated design tools for biological circuit and protein design to accelerate design of molecular sensors.     \n-  Develop experimental planning tools to optimize cost trade-offs for biological circuit and protein design experiments. \n-  Generate cross laboratory datasets and evaluate the extent to which scientific discovery and design tools accelerate the design of biological circuits and proteins."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "-  Extend scientific discovery algorithms to identify root causes for experimental surprises.\n-  Improve accuracy of protein design tools and extend design tool capabilities to enable biological circuit design. \n-  Extend experimental planning tools to facilitate design of experiments that maximize information gained on a per-experiment basis. \n-  Extend baseline protocol capture software to enable assembly of high-quality, integrated experimental data and evaluate generalizability of approach."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects continued development and refinement of techniques and software tools to enable scientific discovery and design in domains that lack robust models."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Tools for Modeling and Simulation"
                                    },
                                    "Description": {
                                        "val": "The Advanced Tools for Modeling and Simulation thrust will develop foundational mathematical and computational theories, approaches and tools to better represent, quantify and model complex DoD systems from multimodal data analysis through part\/system design and fabrication.  One focus area of this thrust is developing a unified mathematical framework to enable better visualization and analysis of massive, complex data sets.  Rigorous mathematical theories are also being developed to address uncertainty in the modeling and design of complex multi-scale physical and engineering systems, incorporating capabilities to handle noisy data and model uncertainty that are well beyond the scope of current capabilities.  Other work in this thrust focuses on developing the mathematical and computational tools required to generate and better manage the enormous complexity of design, ultimately allowing designers to more easily discover non-intuitive (yet realizable) designs that fully leverage new materials and advanced manufacturing approaches now available.  Outcomes from this thrust will improve the speed and accuracy of modeling and simulation, as well as enable management of complexity across DoD devices, parts and systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.346"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the use of novel representations spanning multiple orders of resolution to capture material architectures at the meso-scale in conjunction with macro-scale shapes.  \n-  Developed techniques to enable efficient computation of integral and differential properties in designs that consider inherent variability.   \n-  Explored the computing capacity offered by nonlinear systems to simulate nonlinear dynamical systems.   \n-  Modeled and developed preliminary analog computing substrates for efficiently simulating systems governed by complex non-linear phenomena.  \n-  Formulated mathematical frameworks to articulate and analyze general machine learning problems and associated limits"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.466"
                                            },
                                            "Text": {
                                                "val": "-  Explore techniques to extract promising designs from a vast multi-dimensional design space.   \n-  Demonstrate novel mathematical and computation tools that integrate geometry with materials, including micro-structure architectures, to accelerate design exploration and optimization subject to a single physics.   \n-  Explore alternative representations to describe design problem formulation.   \n-  Begin to fabricate and evaluate integrated testbeds with novel hybrid analog and digital computational architectures for simulating complex, non-linear systems.  \n-  Develop machine learning and computational techniques based on topological methods and spectral analysis for identifying and tracking non-equilibrium behavior.  \n-  Analyze limits for several current machine-learning problems and assess the performance of state-of-the-art approaches with respect to these limits.  \n-  Propose new methods or principles to guide development of systems based on machine learning.  \n-  Establish new fundamental mathematics and computer science building blocks for conceptual design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.280"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate novel mathematical and computation tools that integrate geometry with materials against DoD relevant challenge design problems.  \n-  Demonstrate ability to extract designs from a vast multi-dimensional design space.   \n-  Transition viable advanced design algorithms to government stakeholders.  \n-  Demonstrate rapidly adaptable conceptual design on a DoD relevant problem.   \n-  Explore use of novel conceptual design mathematics and computer science building blocks for evolutionary design.  \n-  Transition novel conceptual design software prototypes to government partners for exploration.    \n-  Develop general approach to automate creation of adaptable virtual models from heterogeneous data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects new investments in fundamentals of design effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "World Modelers"
                                    },
                                    "Description": {
                                        "val": "The World Modelers program is creating explanatory models for natural and human-mediated systems at regional and global scales.  The world is highly interdependent, and disruption of natural resources, supply chains, and production systems can have severe consequences.  The World Modelers capability is focused on regional and global systems with the goal of generating timely indications and warnings of impending catastrophe.  Water and food security are application domains of particular interest, as persistent drought may cause crops to fail, leading to migration and regional conflicts.  The World Modelers program is developing techniques for automating the creation, maintenance, and validation of large-scale integrated models using publicly available news and analyst reports as a structuring mechanism, and government and commercial data as quantitative inputs.  One critical issue involves determining when correlations are strictly statistical versus when they result from causal relationships; in the latter case, models can reveal effective interventions.  Advances in machine reading and learning, semantic technologies, big data analysis, geo-spatial and economic modeling, and environmental simulation bring this strategic capability within reach."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.863"
                                            },
                                            "Text": {
                                                "val": "-  Explored approaches for integrating numerical and semantic techniques in quantitative and qualitative models.\n-  Initiated construction of large-scale data sets for validating models of challenges such as food security and human migration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.800"
                                            },
                                            "Text": {
                                                "val": "-  Develop an initial capability to model perturbations having the potential to impact theater security.\n-  Implement automated machine reading and learning techniques for updating large-scale models using public literature and government and commercial data.\n-  Expand large-scale data sets, and initiate evaluations of quantitative models of food security and human migration.\n-  Analyze models of regional and global phenomena, and formulate theory to understand the limits of model accuracy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.600"
                                            },
                                            "Text": {
                                                "val": "-  Develop advanced capabilities for perturbation modeling and apply technology to additional use cases.\n-  Integrate technologies into initial workflow: build qualitative models, parameterize quantitative models, automate machine processing from scenarios to actions, and generate uncertainty reporting. \n-  Initiate evaluation of integrated technology on food security, human migration, and additional use cases. \n-  Engage stakeholders through demonstration of technologies on a high-priority use case."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects continued development of techniques and software tools to model perturbations having the potential to impact theater security and initial integration of technologies across the envisioned workflow."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Young Faculty Award (YFA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Young Faculty Award (YFA) program is to encourage junior faculty at universities and their equivalent at non-profit science and technology research institutions to participate in sponsored research programs that will augment capabilities for future defense systems.  This program focuses on cutting-edge technologies for greatly enhancing microsystems technologies, biological technologies and defense sciences.  The long-term goal for this program is to develop the next generation of scientists, engineers and mathematicians in key disciplines who will focus a significant portion of their careers on DoD and national security issues.  The aim is for YFA recipients to receive deep interactions with DARPA program managers, programs, performers and the user community.  Current activities include research in fifteen topic areas spanning from Machine Learning and Many Body Physics to Wideband Transmitter-Antenna Interfaces and Multi-Scale Models of Infectious Disease Dynamics.  A key aspect of the YFA program is DARPA-sponsored military visits; all YFA Principal Investigators are expected to participate in one or more military site visits to help them better understand DoD needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Awarded new FY 2017 grants for new two-year research efforts across the topic areas, establishing a new set of appropriate technologies to solve current DoD problems.\n-  Continued FY 2016 research on new concepts for microsystem technologies, biological technologies and defense sciences, by exercising second year funding and by providing continued mentorship by program managers.\n-  Awarded Director's Fellowships for top FY 2015 participants.  During this additional year of funding, researchers will refine their technology further and align to DoD needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Award new FY 2018 grants for new two-year research efforts across the topic areas which established a new set of appropriate technologies to solve current DoD problems.\n-  Continue FY 2017 research on new concepts for microsystem technologies, biological technologies and defense sciences by exercising second year funding, and by providing continued mentorship by program managers.\n-  Award Director's Fellowships for top FY 2016 participants to refine technology further and align to DoD needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Award new FY 2019 grants for new two-year research efforts across the topic areas which established a new set of appropriate technologies to solve current DoD problems.\n-  Continue FY 2018 research on new concepts for microsystem, biological, strategic, and tactical technologies; information innovation; and defense sciences by exercising second year funding, and by providing continued mentorship by program managers.\n-  Award Director's Fellowships for top FY 2017 participants to refine technology further and align to DoD needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communicating With Computers (CWC)"
                                    },
                                    "Description": {
                                        "val": "The Communicating With Computers (CWC) program is advancing human-computer interaction by enabling computers to comprehend language, gesture, facial expression and other communicative modalities in context.  Human language is inherently ambiguous, so humans depend strongly on perception of the physical world and context to communicate.  CWC will provide computers with analogous capabilities to sense the physical world, encode the physical world in a perceptual structure, and link language to this perceptual encoding.  To accomplish this, CWC will apply and extend research in language, vision, gesture recognition and interpretation, dialog management, cognitive linguistics, and the psychology of visual encoding, which are essential for human communication.  CWC will also extend the communication techniques developed for physical contexts to nonphysical contexts such as virtual constructs in the cyber domain.  CWC advances will impact military application areas such as robotics and command and control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.356"
                                            },
                                            "Text": {
                                                "val": "-  Developed a capability to enable computer inputs using gesture, facial expression and other communicative modalities.\n-  Implemented initial techniques for confirming that communications have been successfully received and extrapolate potentially missing information.\n-  Demonstrated human-machine communication and collaboration on a physical problem solving task."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop human-machine communication techniques for a problem solving task in which humans and machines collaborate to explain physical effects.\n-  Develop techniques for learning communication principles and evaluate through at least one use case.\n-  Demonstrate that increased cognitive bandwidth of communication enables machines to collaborate more effectively with humans in solving problems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.800"
                                            },
                                            "Text": {
                                                "val": "-  Enhance techniques to minimize breakdowns in communication in order to maintain natural pacing.\n-  Develop capability for communication that produces content that is interesting and engaging.\n-  Demonstrate integrated capability for one machine or system to seamlessly address multiple use cases."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects continued development of human-computer interaction technologies and expanded work to integrate and demonstrate human-machine communication capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Complex Hybrid Systems"
                                    },
                                    "Description": {
                                        "val": "This research thrust is focused on exploring fundamental science, mathematics, and computational approaches to collectives, complex hybrid (e.g., human-machine) systems and systems of systems across a variety of DoD-relevant domains.  Efforts include development of foundational, quantitative theories and algorithms for the analysis and design of complex systems, as well as novel testing capabilities for assessing the value of these theories using experimental verification across multiple problem domains.  Results from this thrust will better enable the systematic design of complex hybrid systems that can achieve unprecedented resilience and adaptability in unexpected environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.346"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the impact of team composition parameters on human-machine system performance.  \n-  Began the development of an experimental environment that can test the impact of variation of human-machine system configuration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "-  Design tools for the measurement and representation of collaborative problem solving performance in human-machine systems and systems-of-systems.  \n-  Demonstrate the use of new knowledge representation tools for modeling and optimizing collaborative problem solving performance in human-machine systems and systems-of-systems.  \n-  Begin the development of design tools for the optimization of collaborative problem solving performance in human-machine systems and systems-of-systems. \n-  Begin the development of an experimental environment that can test the impact of variation of human-machine system configuration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.100"
                                            },
                                            "Text": {
                                                "val": "-  Continue the development of design tools for the optimization of collaborative problem solving performance in human-machine systems and systems-of-systems.  \n-  Continue the development of an experimental environment that can test the impact of variation of human-machine system configuration. \n-  Demonstrate the use of knowledge representation and design tools to produce quantitative explanations of the structure and problem solving strategy of high performing teams with machine elements. \n-  Begin to define foundational principles for design of structures and rules to achieve desired strategic outcomes informed by behavioral, economic, information, and artificial intelligence theory."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects expansion of design tools and testing environments for human-machine systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Building Resource Adaptive Software from Specifications (BRASS)"
                                    },
                                    "Description": {
                                        "val": "The Building Resource Adaptive Software from Specifications (BRASS) program is developing an automated framework that permits software systems to seamlessly adapt to changing resource conditions in an evolving operational environment.  Effective adaptation is realized through rigorously defined specifications that capture application resource assumptions and resource guarantees made by the environment.  The current manual adaptation paradigm is based on corrective patching, which is time-consuming, error-prone and expensive.  Predicting the myriad of possible environment changes that an application may encounter in its lifetime is problematic, and existing reactive approaches are brittle and often incorrect.  The use of specification-based adaptation will allow BRASS applications to be correctly restructured in real time whenever stated assumptions or guarantees are broken.  This restructuring is optimized to trade off execution fidelity and functionality for continued operation.  BRASS will create tools to automatically discover and monitor resource changes, build new analyses to infer deep resource-based specifications, and implement compiler and runtime transformations that can efficiently adapt to resource changes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.419"
                                            },
                                            "Text": {
                                                "val": "-  Developed new forms of resource-sensitive specifications capable of defining complex resource changes involving both physical and logical resources.\n-  Built compiler and runtime infrastructure that sense resource changes.\n-  Incorporated monitoring tools capable of runtime verification of adaptive program transformations without incurring significant execution overhead.\n-  Identified applications to UUV, flight test instrumentation systems, and other platforms and coordinated these with potential transition partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.450"
                                            },
                                            "Text": {
                                                "val": "-  Integrate formal methods techniques to verify correctness of adaptive transformations.\n-  Develop real-time capabilities for dynamically updating software systems in response to resource changes.\n-  Implement program synthesis tools that automatically generate new programs in response to underlying resource changes while maintaining important system invariants.\n-  Design continuous testing frameworks capable of identifying salient resource changes and automatically generating specifications based on test observations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.373"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.373"
                                            },
                                            "Text": {
                                                "val": "-  Develop scalable whole-system, resource-aware analysis tools to infer deep resource-based specifications.\n-  Develop optimizing and embeddable compilers to synthesize resource-efficient program variants.\n-  Extend synthesis tools to automatically discover and monitor resource changes for large-scale software systems.\n-  Construct integrated frameworks that automatically permit software systems to seamlessly adapt to changing resource conditions in an evolving operational environment, and demonstrate and evaluate the effectiveness of the adaptation techniques.\n-  Develop techniques to quantify the risk of cyber vulnerabilities in new or existing software systems and enterprise networks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase is the result of development work continuing and additional work to integrate and evaluate the runtime verification and adaptive program transformation techniques."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Mathematics*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Quantifying Uncertainty in Physical Systems\n\nThe Applied Mathematics thrust will create the basic mathematics needed to support complex analysis ranging from uncertainty quantification to integrated, multi-system design. Focus areas of this thrust include: (1) application of geometry to challenge problems in optimization science; and (2) frameworks and advanced tools for propagating and managing uncertainty in the modeling and design of complex physical and engineering systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed new mathematical design techniques for high dimensional, multi-physics problems in the presence of high-dimensional uncertainty.  \n-  Initiated design work on specific DoD multi-fidelity and multi-physics challenge problems.    \n-  Developed new multi-fidelity techniques for model error estimation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop risk-averse stochastic optimization methods to address a complex multi-physics challenge problem and implement the scalable uncertainty quantification (UQ) methods as well as the model error estimates in the optimization framework.  \n-  Demonstrate the efficacy of UQ methodologies in a final stochastic design problem. \n-  Identify complex, high dimensional, nonlinear, hybrid, stochastic application areas to solve the related optimization problems. \n-  Develop novel tools and algorithms to solve high dimensional non-linear complex optimization problems that cannot be optimized with current methods due to intractability or lack of scalability.  \n-  Demonstrate the applicability of novel optimization approaches beyond domain-specific application areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.800"
                                            },
                                            "Text": {
                                                "val": "-  Advance the developed optimization tools to handle substantial complexity and make working progress towards a fully nonlinear, non-convex problem.  \n-  Demonstrate full theoretical and computational development of optimization methodologies with implementation on the real scope\/scale application problem.  \n-  Initiate work on development of codes and software for the tested optimization algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lifelong Learning Machines (L2M)"
                                    },
                                    "Description": {
                                        "val": "The Lifelong Learning Machines (L2M) program will research and develop fundamentally new machine learning mechanisms, enabling machines that learn continuously as they operate.  Current learning machines are fully configured in advance of deployment, meaning that they have difficulty accounting for in-the-field mission changes or for unexpected deviations in the data being processed.  To overcome this limitation, L2M will pursue learning approaches inspired by biological systems, which continuously learn and improve their skills without losing previous knowledge.  Areas of research will include network structures that improve performance by processing new data seen in the field, learn new tasks without forgetting previous tasks, and incorporate context into their understanding of the environment.  These capabilities would impact a broad array of military applications that require processing and understanding data in real-time, often have limited data sets for training, and must be deployed in environments where unpredictable events may occur."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.100"
                                            },
                                            "Text": {
                                                "val": "-  Identify and define lifelong learning component approaches.\n-  Develop preliminary description of application(s) integrating L2M software components.\n-  Perform first evaluation of lifelong learning software components showing initial capabilities to achieve objectives, using test data set.\n-  Develop plans for how new biological mechanisms will be proven and measured in software, including preliminary specifications of test data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects the program moving to Project ES-02."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Machine Common Sense (MCS)"
                                    },
                                    "Description": {
                                        "val": "The Machine Common Sense (MCS) program will explore approaches to commonsense reasoning by machines.  Recent advances in machine learning have resulted in exciting new artificial intelligence (AI) capabilities in areas such as image recognition, natural language processing, and two-person strategy games (Chess, Go).  But in all of these application domains, the machine reasoning is narrow and highly specialized; broad, commonsense reasoning by machines remains elusive.  The program will create more human-like knowledge representations, for example, perceptually-grounded representations, to enable commonsense reasoning by machines about the physical world and spatio-temporal phenomena.  Equipping AI systems with more human-like reasoning capabilities will make it possible for humans to teach\/correct a machine as they interact and cooperate on tasks, enabling more equal collaboration and ultimately symbiotic partnerships between humans and machines."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.200"
                                            },
                                            "Text": {
                                                "val": "-  Develop approaches for machine reasoning about imprecise and uncertain information derived from text, pictures, video, speech, and sensor data.\n-  Design methods to enable machines to identify knowledge gaps and reason about their state of knowledge.\n-  Formulate perceptually-grounded representations to enable commonsense reasoning by machines about the physical world and spatio-temporal phenomena."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mining and Understanding Software Enclaves (MUSE)"
                                    },
                                    "Description": {
                                        "val": "The Mining and Understanding Software Enclaves (MUSE) program is developing program analyses and frameworks for improving the resilience and reliability of complex software applications at scale.  MUSE is applying machine learning algorithms to large software corpora to repair defects and vulnerabilities in existing software, and to create new software programs that conform to desired behaviors and specifications.  Specific technical challenges include generation and analysis of persistent semantic artifacts, identification and repair of defects, and inference and synthesis of specifications.  MUSE research will improve the security of intelligence-related applications and enhance computational capabilities in areas such as automated code maintenance and revision management, low-level systems implementation, graph processing, entity extraction, link analysis, high-dimensional data analysis, data\/event correlation, and visualization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Extended the size of the ingested corpus to deal with increasingly more complex program repair and synthesis tasks.\n-  Applied deep learning algorithms on complex graph structures produced by corpus mining to discover latent relationships among corpus elements.\n-  Exploited techniques such as program sketching, user-guided feedback, and specification-driven analysis to automatically construct implementations of complex protocols from discovered specifications.\n-  Developed use cases in automated software synthesis, vulnerability detection, and repair of interest to potential transition partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop statistical database technologies for scalable feature exploration and mining of the software corpus.\n-  Apply machine learning concepts to predict, repair, and synthesize program properties and structures from purely empirical observations.\n-  Explore the use of both static and dynamic program analyses to discover software anomalies and automatically synthesize program repairs.\n-  Apply natural language processing techniques to discover semantic properties of code from multiple information sources.\n-  Collaborate with potential transition partners to evaluate the effectiveness of the technology on use cases in the areas of automated software synthesis, vulnerability detection, and repair."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Big Mechanism"
                                    },
                                    "Description": {
                                        "val": "The Big Mechanism program is creating new approaches to automated computational intelligence applicable to diverse domains such as biology, cyber, economics, social science, and intelligence.  Mastering these domains requires the capability to create abstract, causal models from massive volumes of diverse data.  Current modeling approaches are heavily reliant on human insight and expertise, but the complexity of these models will soon exceed the capacity for human comprehension.  Big Mechanism will create technologies to extract and normalize information for incorporation in flexible knowledge bases; reasoning engines that can infer general rules from a collection of observations; and knowledge synthesis techniques to create models of extreme complexity consistent with huge volumes of data.  Big Mechanism applications will accommodate an operator-in-the-loop to clarify ambiguities and reconcile detected inconsistencies.  The program has focused on cancer modeling due to the availability of experimental data.  The complexity of this problem is representative of challenges facing the DoD in areas such as cyber attribution and open-source intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.116"
                                            },
                                            "Text": {
                                                "val": "-  Advanced the state of the art in automated machine reading of technical literature.\n-  Created interfaces and tools to support a web-based resource of machine-curated cancer pathways.\n-  Created capabilities to add genomic information to machine-curated cancer pathways.\n-  Published a high-fidelity simulation of the Ras cancer pathway."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.353"
                                            },
                                            "Text": {
                                                "val": "-  Apply information extraction techniques developed for the Ras cancer pathway model to other cancer classes, and extend techniques to additional problem domains."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Knowledge Representation"
                                    },
                                    "Description": {
                                        "val": "The Knowledge Representation thrust will develop much-needed tools to contextualize and analyze heterogeneous scientific data, facilitating field-wide hypothesis generation and testing. This will be accomplished by focusing on two key efforts: (1) the development of domain-agnostic mathematical tools for representing heterogeneous data and (2) the development of domain knowledge in a unified knowledge framework and domain-specific computational tools to embed observable data within the framework and enable tangible discoveries through computational analysis. To demonstrate the applicability of Knowledge Representation technology to multiple complex systems, the thrust will include validation across multiple disparate scientific and engineering fields. The technology developed under this thrust will revolutionize the process of scientific discovery by efficiently maximizing the potential of large, heterogeneous, multi-scale datasets across numerous complex scientific fields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated hypothesis generation and steering using newly developed knowledge representation tools on one or more scientific and engineering use cases.  \n-  Analyzed and optimized knowledge representation system performance in terms of scalability for inference and knowledge ingestion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and test mathematical framework for knowledge representation and knowledge extraction.  \n-  Demonstrate knowledge and representation tools on multiple domains."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Probabilistic Programming for Advancing Machine Learning (PPAML)"
                                    },
                                    "Description": {
                                        "val": "The Probabilistic Programming for Advancing Machine Learning (PPAML) program created an advanced computer programming capability that greatly facilitates the construction of new machine learning applications in a wide range of domains.  This capability increases the number of people who can effectively contribute, makes experts more productive, and enables the creation of new tactical applications that are inconceivable given today's tools.  The key enabling technology is a radically new programming paradigm called probabilistic programming that enables developers to quickly build generative models of phenomena and queries of interest which a compiler then converts into efficient applications.  PPAML technologies were designed for application to a wide range of military domains including Intelligence, Surveillance and Reconnaissance (ISR) exploitation, robotic and autonomous system navigation and control, and medical diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.005"
                                            },
                                            "Text": {
                                                "val": "-  Integrated probabilistic systems to provide tailored functionality within domain-specific contexts including ISR, natural language processing, machinery predictive monitoring, and computer vision.\n-  Built new probabilistic solvers incorporating state-of-the-art machine learning algorithms and integrated these in major open-source analytic packages.\n-  Coordinated with DoD stakeholders to apply probabilistic programming systems in militarily relevant domains."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CYS-01"
                    },
                    "ProjectTitle": {
                        "val": "CYBER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "45.753"
                        },
                        "CurrentYear": {
                            "val": "41.176"
                        },
                        "BudgetYearOne": {
                            "val": "16.251"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.251"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cyber security.  Information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness.  Meanwhile, cyber threats grow in sophistication and number, and put sensitive data, classified computer programs, mission-critical information systems, and future economic gains at risk.  The basic research conducted under the Cyber Sciences project will produce breakthroughs necessary to enhance the resilience of DoD information systems to current and emerging cyber threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Transparent Computing"
                                    },
                                    "Description": {
                                        "val": "The Transparent Computing program is developing technologies to enable the implementation of more effective security policies across distributed systems.  The scale and complexity of modern information systems obscure linkages between security-related events, making it hard to discover attacks such as advanced persistent threats (APTs).  The Transparent Computing program will create the capability to propagate security-relevant information, track complete knowledge of event provenance, and ensure component interactions are consistent with established behavior profiles and policies.  Transparent Computing technologies are particularly important for large integrated systems with diverse components such as distributed surveillance systems, autonomous systems, and enterprise information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.074"
                                            },
                                            "Text": {
                                                "val": "-  Developed provenance graph analytics algorithms for clustering, role discovery, anomaly detection, root cause analysis and extrapolation of security-related events.\n-  Developed integrated provenance tracking mechanisms and a forensic analysis capability for a single system with browser and apps.\n-  Conducted an evaluation against a compromised browser based on an operational APT scenario."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.648"
                                            },
                                            "Text": {
                                                "val": "-  Incorporate technologies in a comprehensive architectural framework to extend new capabilities across various software layers and systems, with coordination among the different tag-and-track mechanisms.\n-  Implement detection or enforcement at a network element, such as a firewall, to demonstrate the collection and analysis of causally linked events\/activities in near real-time to infer the nature of an attack using realistic APT behavior.\n-  Conduct an evaluation against a sophisticated, multi-platform APT that uses different lateral movement techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.911"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.911"
                                            },
                                            "Text": {
                                                "val": "-  Provide a user interface with tracking and visualization of tagged traffic on the network.\n-  Implement policy enforcement and enterprise architecture protection capabilities.\n-  Filter tag streams and information for relevancy without sacrificing precision and accuracy.\n-  Improve scalability of provenance graph construction, and test and evaluate performance and effectiveness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease is the result of development work ramping down and the focus shifting to testing and performance evaluation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SafeWare"
                                    },
                                    "Description": {
                                        "val": "The SafeWare program is developing new code obfuscation techniques for protecting software from reverse engineering.  At present, adversaries can extract sensitive information from stolen software, which could include cryptographic private keys, special inputs\/failsafe modes, and proprietary algorithms.  Today's state-of-the-art in software obfuscation adds junk code (loops that do nothing, renaming of variables, redundant conditions, etc.) that is not resilient against automated tools.  Recent breakthroughs in theoretical cryptography have the potential to make software obfuscation into a mathematically rigorous science, very much like what the Rivest-Shamir-Adleman (RSA) algorithm did for the encryption of messages in the 1970s.  In its present form, cryptographic obfuscation incurs too much runtime overhead to be practical.  The SafeWare program will take this very early-stage obfuscation theory and increase its practicality and efficiency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.319"
                                            },
                                            "Text": {
                                                "val": "-  Developed new obfuscation theory and implementations better suited to codes encountered in operational systems.\n-  Used adversarial techniques to identify side channel vulnerabilities in the obfuscation algorithms and software implementations.\n-  Defined specific obfuscation features and capabilities that address use cases relevant to sensitive systems and missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.955"
                                            },
                                            "Text": {
                                                "val": "-  Develop demonstrations of obfuscation protocols with provable security properties and quantifiable security levels for more complex computational or algorithmic processes.\n-  Create modular approaches that restrict obfuscation to the most sensitive parts of computational or algorithmic processes.\n-  Reformulate classic cryptographic protocols using obfuscation as a basic resource for computational security."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.740"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.740"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate obfuscation of sensitive information and algorithms in pattern matching applications in support of cybersecurity and target recognition.\n-  Scale obfuscation methods and demonstrate interoperability of obfuscated software."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease is the result of development work concluding and efforts being focused on final demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space\/Time Analysis for Cybersecurity (STAC)"
                                    },
                                    "Description": {
                                        "val": "The Space\/Time Analysis for Cybersecurity (STAC) program is developing techniques to detect algorithmic complexity vulnerabilities and side channel attacks in software.  Historically, adversaries have exploited software implementation flaws through buffer and heap overflow attacks.  Advances in operating systems have largely mitigated such attacks, so cyber adversaries are now finding new ways of compromising software.  Algorithmic complexity and side channel attacks are emerging as a new generation of attacks since they depend on intrinsic properties of software algorithms rather than implementation flaws.  The STAC program seeks to develop analysis tools and techniques to detect vulnerabilities to these new attacks in the software which the U.S. government, military, and economy depend."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.360"
                                            },
                                            "Text": {
                                                "val": "-  Developed and demonstrated more reliable detection of algorithmic resource usage vulnerabilities by incorporating fine-grained semantics of the underlying run-time environment and operating system.\n-  Developed tools and evaluated techniques that identify dangerous conditions, either inputs adversaries could use to mount algorithmic complexity attacks or outputs that adversaries could use to mount side channel attacks.\n-  Identified potential users with a need to demonstrate the absence of vulnerabilities to algorithmic complexity and side channel attacks in mission critical systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.573"
                                            },
                                            "Text": {
                                                "val": "-  Identify the most promising analysis tools for finding vulnerabilities to algorithmic complexity and side channel attacks in a corpus of test programs, and integrate these into a best-of-breed prototype.\n-  Engage in experiments or pilot deployments of prototype tools with transition partners and, based on user feedback, improve prototypes to enhance usability in the context of DoD operational needs.\n-  Implement a unified toolset with latest versions of tools from engagements to allow analysis of complete program modules."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.600"
                                            },
                                            "Text": {
                                                "val": "-  Update analysis toolset with latest versions of tools from engagements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease is the result of development work concluding and efforts being focused on final update and delivery of toolsets."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ES-01"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONIC SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "60.591"
                        },
                        "CurrentYear": {
                            "val": "86.626"
                        },
                        "BudgetYearOne": {
                            "val": "49.546"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.546"
                        },
                        "BudgetYearTwo": {
                            "val": "35.783"
                        },
                        "BudgetYearThree": {
                            "val": "34.883"
                        },
                        "BudgetYearFour": {
                            "val": "34.883"
                        },
                        "BudgetYearFive": {
                            "val": "34.883"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Electronic Sciences project is for basic exploration of electronic and optoelectronic devices, circuits, and processing concepts to meet the military's need for near real-time information gathering, transmission, and processing.  In seeking to continue the phenomenal progress in microelectronics innovation that has characterized the last few decades, the project should provide DoD with new, improved, or potentially revolutionary device options for accomplishing these critical functions.  The resulting technologies should help maintain knowledge of the enemy, communicate decisions based on that knowledge, and substantially improve the cost and performance of military systems.  Research areas include analog, mixed signal, and photonic circuitry for communications and other applications; alternative computer architectures; and magnetic components to reduce the size of Electromagnetic (EM) and sensing systems.  Other research could support field-portable electronics with reduced power requirements, ultra-high density information storage \"on-a-chip\", and new approaches to nanometer-scale structures, molecules, and devices.\n\nWithin this project, Beyond Scaling programs will support investigations into materials, devices, and architectures to provide continued improvements in electronics performance with or without the benefit of Moore's Law (silicon scaling).  Within the next ten years, traditional scaling will start to encounter the fundamental physical limits of silicon, requiring fresh approaches to new electronic systems.  Over the short term, DoD will therefore need to unleash circuit specialization in order to maximize the benefit of traditional silicon.  Over the longer term, DoD and the nation will need to engage the computer, material, and mechanical sciences to explore electronics improvements through vertical circuit integration for improved computation or non-volatile memory devices that combine computation and memory.  Other memory devices could also leverage an emerging understanding of the physics of magnetic states, electron spin properties, topological insulators, or phase-changing materials. Beyond Scaling programs will address fundamental exploration into each of these areas. The Beyond Scaling programs move to Project ES-02, Beyond Scaling Sciences, in FY 2019."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC)"
                                    },
                                    "Description": {
                                        "val": "The High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC) program seeks to develop compact Radio Frequency (RF) signal amplifiers for air, ground, and ship-based communications, sensing, and radar systems.  HAVOC amplifiers would enable these systems to access the high-frequency millimeter-wave portion of the Electromagnetic (EM) spectrum, facilitating increased range and other performance improvements.  Today, the effectiveness of combat operations across all domains increasingly depends on DoD's ability to control and exploit the EM spectrum and to deny its use to adversaries.  However, the proliferation of inexpensive commercial RF sources has made the EM spectrum crowded and contested, challenging our spectrum dominance.  Operating at higher frequencies, such as the millimeter-wave, helps DoD to overcome these issues and offers numerous tactical advantages such as high data-rate communications and high resolution and sensitivity for radar and sensors.  HAVOC will fund basic research in vacuum electronics to improve understanding of the various phenomena governing vacuum electronic amplifiers operating at mm-wave frequencies above 75 GHz.  Focus areas will include modeling and simulation techniques, advanced manufacturing methods, novel beam-wave interaction structures, high current density and long-life cathodes, and other relevant topics.  Applied research efforts are funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Identified processing techniques and material structures that correlate well with enhanced electron emission.\n-  Completed initial designs for wideband and high-power beam-wave interaction structures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Verify and validate the performance of high-fidelity, three-dimensional, multi-physics, numerically efficient modeling and simulation techniques on structures representative of advanced vacuum electronic amplifiers.\n-  Fabricate and test wideband and high-power beam-wave interaction structures, and high current-density cathodes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate high-current-density and long life cathodes based on understanding gained from processing and material structure investigations.\n-  Demonstrate wideband and high-power beam-wave interaction structures, and high current-density cathodes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precise Robust Inertial Guidance for Munitions (PRIGM)"
                                    },
                                    "Description": {
                                        "val": "The Precise Robust Inertial Guidance for Munitions (PRIGM) program aims to identify, investigate, and demonstrate inertial sensor technologies for Positioning, Navigation, and Timing (PNT) in GPS-denied environments.  When GPS is not available, these inertial sensors can provide autonomous PNT information.  The program will exploit recent advances in integrating photonic (light-manipulating) components into electronics and in employing Microelectromechanical Systems (MEMS) as high-performance inertial sensors for use in extreme environments.  Whereas conventional MEMS inertial sensors can suffer from inaccuracies due to factors such as temperature sensitivity, new photonics-based PNT techniques have demonstrated the ability to reject these inaccuracies.  PRIGM will focus on two areas.  By 2020, it aims to develop and transition a Navigation-Grade Inertial Measurement Unit (NGIMU), a state-of-the-art MEMS device, to DoD platforms.  By 2030, it aims to develop Advanced Inertial MEMS Sensors (AIMS) that can provide gun-hard, high-bandwidth, high dynamic range navigation for GPS-free munitions.  These advances should enable navigation applications, such as smart munitions, that require low-cost, size, weight, and power inertial sensors with high bandwidth, precision, and shock tolerance.  PRIGM will advance state-of-the-art MEMS gyros from TRL-3 devices to a TRL-6 transition platform, eventually enabling the Service Labs to perform TRL-7 field demonstrations.  Applied research efforts are funded in PE 0602716E, Project ELT-01, and advanced technology development for the program is budgeted in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated laboratory prototype photonic-MEMS inertial sensors with navigation-grade accuracy and stability.\n-  Optimized novel optical and MEMS inertial sensor designs through modeling and simulation after completing initial experimental characterization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "-  Integrate component technology and demonstrate photonic-MEMS inertial sensors with beyond-navigation-grade stability and precision.\n-  Test navigation-grade inertial sensor performance robustness to external perturbations such as vibration and shock."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.400"
                                            },
                                            "Text": {
                                                "val": "-  Package all component technology and test photonic-MEMS inertial sensor performance robustness to environmental temperature variations and for repeatability between routine operations.\n-  Demonstrate inertial sensor survival and operation through laboratory-representative launch events."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Signal Processing at RF (SPAR)"
                                    },
                                    "Description": {
                                        "val": "The Signal Processing at RF (SPAR) program will investigate advanced analog components to process radio frequency (RF) signals for communications, radar, and electronic warfare applications.  Today, electronic components are limited in their ability to distinguish between two or more signals operating at the same frequency when one signal is strong enough to jam the others.  The jamming signal, in this case, saturates the receiver electronics much like loud music drowns out a quiet conversation.  By using advancements in new semiconductor materials, processing, and novel signal interaction mechanisms, SPAR components will be able to pick out friendly RF signals from both intentional and unintentional jamming signals, even when those signals sit on top of one another in frequency.  This capability would enable a range of new applications including communications in contested battlefield RF environments, jamming the RF spectrum while maintaining communication, and full-duplex radio communication.  Other potential applications include equipping mobile radios with SPAR-enabled front ends for simultaneous jam-resistant two-way communication and electronic warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed theoretical framework and modeling of RF signal processing components for rejecting in-band RF interference.\n-  Designed and fabricated Phase 1 RF signal processing components capable of collectively rejecting uncooperative in-band jamming by 10 fold and cooperative self-interference by 100 fold.\n-  Designed and fabricated Phase 1 RF circulators to provide an additional 30x isolation between the transmitter and receiver ports."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform measurement of SPAR RF signal processing components meeting Phase 1 performance.\n-  Design Phase 2 RF signal processing components with commercial communications grade performance capable of rejecting uncooperative in-band jamming by 30x and cooperative self-interference by 100,000x."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.600"
                                            },
                                            "Text": {
                                                "val": "- Design Phase 3 RF signal processing components with DoD communications grade performance capable of rejecting uncooperative in-band jamming by 100x and cooperative self-interference by 1,000,000x.\n-  Fabricate and integrate the components developed during Phase 2 into a system-level design that extends Simultaneous Transmit And Receive (STAR) capability to Commercial, Off The Shelf (COTS) transceiver technology.\n-  Perform field measurements on developed STAR system to demonstrate simultaneous bidirectional voice communications over 1 km capable of rejecting uncooperative in-band jamming by 30x and cooperative self-interference by 10,000x while maintaining communications integrity."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Magnetic Miniaturized and Monolithically Integrated Components (M3IC)"
                                    },
                                    "Description": {
                                        "val": "The Magnetic Miniaturized and Monolithically Integrated Components (M3IC) program aims to integrate magnetic components onto semiconductor materials, improving the size and functionality of electromagnetic (EM) systems for communications, radar, and electronic warfare (EW).  Current EM systems use magnetic components such as circulators, inductors, and isolators that are bulky and cannot be integrated with electronic circuitry.  This limits the utility of the magnetic components as well as their ability to impact overall system performance and function.  Reducing the Size, Weight, And Power (SWaP) of magnetic components and integrating them onto semiconductor chips, however, could enable broader exploitation of magnetic materials and provide new mechanisms for the control and manipulation of EM signals.  For instance, tighter integration could yield smaller radar systems, higher bandwidth communication over longer ranges, improved jam resistance, and more resilient EW systems.  The M3IC program is divided into three technical areas: integration of magnetic materials and systems with semiconductor technology; accurate and efficient modeling of magnetic phenomena from the molecular to the component system level; and exploitation of magnetic phenomena in innovative component designs relevant to DoD EM systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated techniques to grow thick magnetic films on large semiconductor substrates.\n-  Identified techniques to grow thick magnetic films on large semiconductor substrates, and initial experiments are underway.\n-  Completed modeling tool documentation and demonstrated early concept software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.426"
                                            },
                                            "Text": {
                                                "val": "-  Characterize properties of magnetic films deposited on semiconductor substrates.\n-  Design and fabricate prototype integrated magnetic components such as circulators and isolators.\n-  Demonstrate prototype modeling codes with improved accuracy and efficiency.\n-  Demonstrate miniaturized and optimized non-linear magnetic components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.900"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate deposition of high-quality magnetic films greater than 100 microns thick on semiconductor wafers larger than 50 millimeters in diameter.\n-  Characterize properties and evaluate performance of magnetic films."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "A MEchanically Based Antenna (AMEBA)"
                                    },
                                    "Description": {
                                        "val": "The A MEchanically Based Antenna (AMEBA) program seeks to develop efficient radio frequency (RF) transmitters operating in the Ultra-Low Frequency (ULF) and Very Low Frequency (VLF) ranges, for portable applications in underground and underwater communications.  For classical antennas, the minimum antenna size for efficient transmission is related to the wavelength of the RF signal.  This fundamental property prevents reducing the size of today's ULF and VLF transmitting antennas, which are up to a mile wide.  Whereas traditional antennas generate electromagnetic waves by driving current through a conductive material, AMEBA takes a novel approach, mechanically moving an electrical charge or magnet to generate electromagnetic waves at ULF and VLF.  This mechanical coupling provides unique advantages over traditional approaches at these frequencies, most notably greater than 1,000x reduction in antenna size.  AMEBA will focus on developing both the materials and precision-controlled electromechanical systems required for an efficient transmitter system.  This new capability would enable a range of applications including hard-to-jam wireless communications for use over very long distances and short-range underground and underwater RF links.  Other potential applications include terrestrial navigation systems for GPS-denied environments and ground-penetrating radar for detecting unexploded ordnance, underground facilities, and tunnels."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop physics-based models of the electromagnetic field generation and propagation at targeted distances.\n-  Develop high performance electret and ferroelectric materials able to support high charge density with low charge leakage rates.\n-  Develop ferrofluids with improved magnetization and particle conglomeration properties.\n-  Design and develop electromechanical systems and architectures to realize large scale, high-precision mechanical actuation of magnets and electrically polarized materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.400"
                                            },
                                            "Text": {
                                                "val": "-  Continue to improve the performance of electric and magnetic materials employed in the program.\n-  Progressively scale mechanical systems to a larger number of elements, synchronously actuated and modulated at RF frequencies.\n-  Demonstrate small, low frequency transmitters capable of text messaging from 10 m underwater or 30 m underground."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Short Range Independent Microrobotics Program (SHRIMP)"
                                    },
                                    "Description": {
                                        "val": "The Short Range Independent Microrobotics Program (SHRIMP) will develop microrobots with the ability to clandestinely enter tactical environments and perform close-proximity (within 10cm) functions.  These ant-sized microrobots could obtain local sensing data, such as visual, audio, or chemical trace data, whereas similar capabilities today would require hand-placed sensors or not be performed at all.  SHRIMP microrobots should be able to self-navigate to an objective location and operate indefinitely from harvested energy.  The primary technical developments needed are in the efficiency, robustness, and control of millimeter-scale actuators, which allow the robots to move using new materials, processing, and sensor integration techniques.  Recent advances in the strength, efficiency, and robustness of small actuators points to the possibility of efficient land microrobots capable of carrying their power source and traveling nearly 0.5 kilometers on a single battery charge.  Successful execution of the SHRIMP program will advance the micro-robotics field, allowing for practical national security applications such as clandestine tactical data collection or strategic communication disruption enabled by colonies of deployed microrobots."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.246"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.246"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate actuation mechanisms for microrobot mobility with high power efficiency and sufficient payload capacity.\n-  Prove integration of lightweight control and navigation systems.\n-  Demonstrate integration of robust and efficient modalities for locomotion."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct On-Chip Digital Optical Synthesis (DODOS)"
                                    },
                                    "Description": {
                                        "val": "The Direct On-chip Digital Optical Synthesis (DODOS) program will investigate high-performance photonic components for a compact, robust, and highly-accurate optical frequency synthesizer suited to various mission-critical DoD applications.  Frequency synthesis and accurate control of radiofrequency and microwave radiation is the enabling technology for radar, satellite and terrestrial communications, positioning and navigation technology, and many other core DoD capabilities.  Frequency synthesis and control of light or optical waves, however, has been constrained to laboratory experiments due to the size, fragility, and cost of optical frequency synthesizers.  DODOS will leverage recent developments in the field of integrated photonics to enable the development of ubiquitous, low-cost optical frequency synthesizers.  The program could lead to disruptive DoD capabilities, including high-bandwidth optical communications, higher performance Light Detection And Ranging (LiDAR), portable high-accuracy atomic clocks, and high-resolution detection of chemical\/biological threats at a distance.  Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.591"
                                            },
                                            "Text": {
                                                "val": "-  Developed and demonstrated efficient electronic control algorithms to accurately sweep the slave laser across 47 nanometers (nm) of comb bandwidth.\n-  Investigated methods to further reduce the threshold of self-referenced combs and developed techniques for reliable low-noise microcomb soliton generation.\n-  Designed and implemented on-chip photonic components to mitigate issues associated with excess phase noise, cross talk, back reflection and isolation to achieve integrated DODOS system performance metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and implement techniques to improve the laser frequency tuning speed and tuning accuracy using co-integrated electronic and photonic components.\n-  Design components and develop processes for fabrication of high efficiency integrated frequency doublers to reduce the power consumption of the DODOS frequency synthesizer."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Semiconductor Technology Advanced Research Network (STARNet)"
                                    },
                                    "Description": {
                                        "val": "The Semiconductor Technology Advanced Research Network (STARNet) program was a government-industry partnership designed to enable the performance requirements of future sensing, communication, computing, and memory applications.  The program sponsored academic research teams focused on technology areas, determined by government and industry experts that impact long-range DoD needs.  The sponsored academic research base included approximately 46 universities, 188 faculty researchers, 628 students, and more than 112 industry associate personnel.  Industry provided 60% of program funding, while DARPA provided the remaining 40% of funding.  STARNet research was divided into three centers that focused on system issues (design architecture and system design) and three centers that focused on device and materials issues (high-performance and low power devices).  As the projects in the device and materials centers matured, they were expected to be utilized by the system centers to enhance improvements in system design and fabrication."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated low-voltage steep-turn-on transistors beyond traditional CMOS devices to enable digital, memory, or microwave circuits with extremely low power consumption.\n-  Demonstrated spintronics devices for extremely low-power for logic and non-volatile memory circuits with increased complexity.\n-  Demonstrated heterogeneous and domain accelerated parallel systems by leveraging novel silicon-based computing architecture and integration concepts to enable reliable and secure system designs.\n-  Demonstrated statistical information processing architectures for in-memory computing and in-sensor computing by CMOS and beyond CMOS prototypes.\n-  Demonstrated swarm-based architecture and prototypes by leveraging localization and energy harvesting capabilities with built-in privacy and security to connect everything and enable urban or theater monitoring applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Near Zero Energy RF and Sensor Operations (N-ZERO)"
                                    },
                                    "Description": {
                                        "val": "The Near Zero Power RF and Sensor Operations (N-ZERO) program will investigate the innovative technologies required to extend the lifetimes of remotely-deployed sensors from months to years.  Today's state-of-the-art sensors can be pre-placed and remain dormant until awoken by an external trigger or stimulus.  However, the active electronics that monitor for external triggers consume power, limiting sensor lifetimes to between weeks and months.  N-ZERO seeks to replace these electronics with passive or extremely low-power devices that continuously monitor the environment and wake up active electronics upon detection of a specific trigger.  This would eliminate or significantly reduce standby power consumption, ensuring that sensor lifetimes are limited only by the power required to process and communicate confirmed events.  In doing so, N-ZERO could enable wireless sensors with drastically increased mission life and help meet DoD's unfulfilled need for a persistent, event-driven sensing capability.  To enable this possibility, N-ZERO's basic research component will consider highly innovative sensors and sensor architectures as well as signal processing and digitization technologies with near-zero power consumption.  In particular, the program will explore and develop a fundamental understanding of the trade space between power consumption, the minimum detectable signal, and the probability of falsely detecting a trigger.  An applied research component is budgeted under PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Experimentally evaluated component technologies.\n-  Designed and fabricated improved component technologies enabling the zero power detection and classification of progressively reduced signal level RF and physical sensor signatures.\n-  Investigated transition paths for fundamental technologies into RF communications and physical sensor systems under development in the applied research portion of this project."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint University Microelectronics Program (JUMP)"
                                    },
                                    "Description": {
                                        "val": "The Joint University Microelectronics Program (JUMP) is a government-industry joint research program to explore computing, sensing, communication, and data storage innovations for applications beyond the 2030 horizon.  The program recognizes that the densely interconnected microsystems of the future will be built through the use of groundbreaking materials, revolutionary devices, advanced architectures, and unconventional computing.  JUMP will therefore sponsor academic research teams focused on related key technology areas that will impact future DoD capabilities and national security.  The JUMP program will not only push fundamental technology research but also establish long-range microelectronic research themes with greater emphasis on end-application and systems-level computation.  By discovering the science underlying new technologies and overcoming engineering challenges, JUMP will enable DoD applications to exploit the entire electromagnetic spectrum from radio frequency (RF) to terahertz (THz) and to employ both distributed and centralized computing with embedded intelligence and memory."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Launch university research teams to study technical areas with long-term impacts to government and industry.\n-  Explore emerging materials, power efficient Radio Frequency (RF), Terahertz (THz), digital, and storage devices for future microsystems.\n-  Investigate distributed and centralized computing architectures and subsystems for efficient information extraction, processing, and autonomous control applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in FY 2019 reflects the program moving to Project ES-02."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Materials"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Materials program will investigate new materials to support next-generation logic and memory components.  Historically, the DoD provided leadership in shaping the electronics field through research in semiconductor materials, circuits, and processors.  However, as DoD focuses on military-specific components and commercial investments eschew the semiconductor space, U.S. fundamental electronics research is stagnant just as an inflection point in Moore's Law (silicon scaling) is about to occur.  The Beyond Scaling - Materials program will pursue potential enhancements in electronics that do not rely on Moore's Law, including research not only into new materials but also into the implications of those materials at the device, algorithm, and packaging levels.  These basic explorations include: novel mechanisms for computation based on inherent material properties, new methods to accelerate the identification and utilization of emerging materials, and innovative processes to vertically integrate these materials with others to realize superior computational mechanisms.  Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin identifying non-volatile memory solutions that can be integrated on-chip and conduct basic material characterization.\n-  Describe circuit architectures that leverage the unique properties and behaviors of new semiconductor materials.\n-  Demonstrate the capability to fabricate and model stacked logic and memory devices in a single monolithic System on a Chip (SoC) die."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in FY 2019 reflects the program moving to Project ES-02."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Architectures and Designs"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Architectures and Design program will investigate application-specific circuit architectures that ensure continued improvements in electronics performance with or without the benefit of continued scaling in silicon transistors (Moore's Law).  Currently, improvements in electronics largely depend on a regular reduction in the size of silicon components.  As Moore's Law slows and the nation loses the benefit of free, exponential improvements in electronics performance, DoD will need to maximize the benefits of available silicon technologies through circuit specialization.  This program will investigate the potential for lowering the barriers to designing specialized circuits.  Approaches include the use of machine learning and automated design tools to program specialized hardware blocks, integrate them into existing designs, and deploy them in complex systems.  Further research would also develop tools to create exact representations of physical hardware.  Advances under this program will support a new DoD capability to create specialized hardware and provide benefits by improving electronics systems that do not depend on continued rapid improvements in silicon transistors.  Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a mechanism for organically adapting hardware based on the moment to moment performance requirements of the software being executed.\n-  Design a system block through a machine abstracting the capabilities of a large design team.\n-  Develop software approaches to manage new specialization blocks, which speed up processing for selected applications.\n-  Develop an initial reconfigurable design approach and supporting architectural elements to address classes of big data problems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in FY 2019 reflects the program moving to Project ES-02."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ES-02"
                    },
                    "ProjectTitle": {
                        "val": "BEYOND SCALING SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "55.100"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.100"
                        },
                        "BudgetYearTwo": {
                            "val": "55.880"
                        },
                        "BudgetYearThree": {
                            "val": "54.390"
                        },
                        "BudgetYearFour": {
                            "val": "53.600"
                        },
                        "BudgetYearFive": {
                            "val": "53.290"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Beyond Scaling Sciences project will support investigations into materials, devices, and architectures to provide continued improvements in electronics performance with or without the benefit of Moore's Law (silicon scaling). Within the next ten years, traditional scaling will start to encounter the fundamental physical limits of silicon, requiring fresh approaches to new electronic systems. Over the short term, DoD will therefore need to unleash circuit specialization in order to maximize the benefit of traditional silicon. Over the longer term, DoD and the nation will need to engage the computer, material, and mechanical sciences to explore electronics improvements through vertical circuit integration for improved computation or non-volatile memory devices that combine computation and memory. Other memory devices could also leverage an emerging understanding of the physics of magnetic states, electron spin properties, topological insulators, or phase-changing materials. Beyond Scaling programs will address fundamental exploration into each of these areas. This Project is not a new start. It aggregates and continues Beyond Scaling programs that were initiated in Projects ES-01 and CCS-02 in this same Program Element."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Materials"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Materials program will investigate new materials to support next-generation logic and memory components.  Historically, the DoD provided leadership in shaping the electronics field through research in semiconductor materials, circuits, and processors.  However, as DoD focuses on military-specific components and commercial investments eschew the semiconductor space, U.S. fundamental electronics research is stagnant just as an inflection point in Moore's Law (silicon scaling) is about to occur.  The Beyond Scaling - Materials program will pursue potential enhancements in electronics that do not rely on Moore's Law, including research not only into new materials but also into the implications of those materials at the device, algorithm, and packaging levels.  These basic explorations include: novel mechanisms for computation based on inherent material properties, new methods to accelerate the identification and utilization of emerging materials, and innovative processes to vertically integrate these materials with others to realize superior computational mechanisms.  Applied research for this program is funded within PE 0602716E, Project ELT-02."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ability to vertically integrate novel materials for both logic and memory in a monolithic manner in a single System on a Chip (SoC) die.\n-  Demonstrate the basic material properties which would allow for greatly increasing the amount of computational throughput. \n- Demonstrate the performance and physics of unconventional components that enable in new circuit topologies and architectures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2019 reflects the program moving from Project ES-01."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Architectures and Designs"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Architectures and Design program will investigate application-specific circuit architectures that ensure continued improvements in electronics performance with or without the benefit of continued scaling in silicon transistors (Moore's Law).  Currently, improvements in electronics largely depend on a regular reduction in the size of silicon components.  As Moore's Law slows and the nation loses the benefit of free, exponential improvements in electronics performance, DoD will need to maximize the benefits of available silicon technologies through circuit specialization.  This program will investigate the potential for lowering the barriers to designing specialized circuits.  Approaches include the use of machine learning and automated design tools to program specialized hardware blocks, integrate them into existing designs, and deploy them in complex systems.  Further research would also develop tools to create exact representations of physical hardware.  Advances under this program will support a new DoD capability to create specialized hardware and provide benefits by improving electronics systems that do not depend on continued rapid improvements in silicon transistors.  Applied research for this program is funded within PE 0602716E, Project ELT-02."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Show the underlying common configurations for optimal hardware which might exist for classes of big data problems. \n-  Study application domains to understand similar sets of mathematical operations, to influence the selection and number of general purpose processors and specialized accelerators.\n-  Explore increased layers of programming abstraction by designing underlying algorithms to recognize patterns of machine instructions that map to available specialized accelerators. \n-  Exploring algorithms and methodologies for quantitative verification of open source Intellectual Property (IP).\n-  Explore the application of machine learning for automated physical design of circuits."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2019 reflects the program moving from Project ES-01."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lifelong Learning Machines (L2M)"
                                    },
                                    "Description": {
                                        "val": "The Lifelong Learning Machines (L2M) program will research and develop fundamentally new machine learning mechanisms, enabling machines that learn continuously as they operate.  Current learning machines are fully configured in advance of deployment, meaning that they have difficulty accounting for in-the-field mission changes or for unexpected deviations in the data being processed.  To overcome this limitation, L2M will pursue learning approaches inspired by biological systems, which continuously learn and improve their skills without losing previous knowledge.  Areas of research will include network structures that improve performance by processing new data seen in the field, learn new tasks without forgetting previous tasks, and incorporate context into their understanding of the environment.  These capabilities would impact a broad array of military applications that require processing and understanding data in real-time, often have limited data sets for training, and must be deployed in environments where unpredictable events may occur."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.100"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate continual learning by determining the ability of artificial intelligence (AI) systems to improve performance while the systems operate, using their current experience as training data.\n-  Design algorithms that can use previous information and generalize it to never before seen situations.\n-  Invent a method that allows a machine learning system to balance adaptability to handling new environments while keeping some previous knowledge that may be important in later stages.\n-  Generate common test data of interest to the government and distribute to performers for validating lifelong learning core capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2019 reflects the program moving from Project CCS-02."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint University Microelectronics Program (JUMP)"
                                    },
                                    "Description": {
                                        "val": "The Joint University Microelectronics Program (JUMP) is a government-industry joint research program to explore computing, sensing, communication, and data storage innovations for applications beyond the 2030 horizon.  The program recognizes that the densely interconnected microsystems of the future will be built through the use of groundbreaking materials, revolutionary devices, advanced architectures, and unconventional computing.  JUMP will therefore sponsor academic research teams focused on related key technology areas that will impact future DoD capabilities and national security.  The JUMP program will not only push fundamental technology research but also establish long-range microelectronic research themes with greater emphasis on end-application and systems-level computation.  By discovering the science underlying new technologies and overcoming engineering challenges, JUMP will enable DoD applications to exploit the entire electromagnetic spectrum from radio frequency (RF) to terahertz (THz) and to employ both distributed and centralized computing with embedded intelligence and memory."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Expand university research teams to add newly identified technical projects.\n-  Evaluate emerging materials, power efficient radio frequency (RF), terahertz (THz), digital, and storage devices prototype.\n-  Establish novel distributed and centralized computing architectures and subsystems for efficient information extraction, processing, and autonomous control applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2019 reflects the program moving from Project ES-01."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.083"
                        },
                        "CurrentYear": {
                            "val": "75.599"
                        },
                        "BudgetYearOne": {
                            "val": "85.569"
                        },
                        "BudgetYearOneBase": {
                            "val": "85.569"
                        },
                        "BudgetYearTwo": {
                            "val": "83.837"
                        },
                        "BudgetYearThree": {
                            "val": "85.138"
                        },
                        "BudgetYearFour": {
                            "val": "85.138"
                        },
                        "BudgetYearFive": {
                            "val": "85.138"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Materials Sciences project provides the fundamental research that underpins the design, development, assembly, and optimization of advanced materials, devices, and systems for DoD applications in areas such as robust diagnostics and therapeutics, novel energetic materials, and complex hybrid systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Molecular Systems and Materials Assembly"
                                    },
                                    "Description": {
                                        "val": "The Molecular Systems and Materials Assembly thrust is exploring new approaches for the synthesis, assembly, and characterization of molecules and materials from the atomic to the product scale.  Ultimately, materials and methods developed in this thrust will support a wide range of DoD applications that span therapeutics, energetics and next generation optical materials.  Specific approaches include non-traditional synthetic approaches such as the use of extreme pressure and\/or temperature conditions, engineering and controlling atomic-scale processing routes for designer microstructures, and the synthesis and rapid screening of many molecules to more quickly identify those with desired functions and\/or properties.  Efforts in this thrust also include assembly of these and other materials, such as subwavelength engineered shapes, into micro-to-macro-scale objects and devices, as well as fundamental studies of the properties and function of these molecular ensembles and systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.745"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated earlier developed methods to stabilize extended solids at ambient temperatures and pressures. \n-  Demonstrated synthesis and stability of high density extended carbon-based materials (clathrates, allotropes, nitrides, and oxides) at the gram scale. \n-  Demonstrated fabrication of tough ceramic materials at the >100-gram scale and completed initial validation testing. \n-  Demonstrated synthetic pathways to fabricate extended solids at reduced pressures based on retrosynthetic designs and stabilization results.\n-  Developed nanometer and micron-scale mechanical manipulation tools to support assembly tasks. \n-  Built 1 centimeter or larger structures with controlled internal complexity from feedstock consisting of individual atoms or molecules. \n-  Improved the binding affinity of non-natural polymers against DARPA-defined targets. \n-  Generalized developed non-natural polymer library screening strategies across multiple target classes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.290"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the production of micron and larger feedstocks with nanoscale features and properties. \n-  Demonstrate unique nanoscale properties for assemblies of micron feedstocks at 1-cm scale or larger. \n-  Demonstrate rapid discovery of affinity reagents to a series of DARPA-defined challenges, including optimization of binding in a target active site. \n-  Design, synthesize and transition affinity reagents for current DoD therapeutic or diagnostic challenges with partners such as the U.S. Army Medical Research Institute for Infectious Diseases.\n- Begin to investigate new building blocks to form structured materials which have previously unachieved electromagnetic properties."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.400"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate creation of complex hierarchical structures with nanoscale features and properties. \n-  Develop methods for the scale-up of nano- and micro-assembly techniques.\n-  Define limitations associated with scale-up of nano- and micro-assembly processes.\n-  Develop processing maps that allow for controlling atomic-scale interfaces between grains, precipitates, and defects for two-phase metallic systems.\n-  Begin to investigate designer microstructures, with predefined defect types and structures, that increase a metallic systems strength and\/or electrical conductivity over the present state-of-the-art.\n-  Initiate the development of novel multi-scale modeling tools that link atomistic scale to the process scale and allow for the exploration of new metallic systems with unique chemical, mechanical, and electrical properties.\n-  Develop design tools for \"meta-atom or meta-molecule\" building blocks that can be used to create new material responses to electromagnetic radiation. \n-  Investigate breaking metamolecule symmetry and Lorentz reciprocity to create new material designs. \n-  Develop predictive, parametric models for materials for frequency mixing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects completion of affinity reagent binding challenge with the Army partner."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Photon Science"
                                    },
                                    "Description": {
                                        "val": "The Basic Photon Science thrust is examining the fundamental science of photons and their interactions in integrated devices for potential DoD-applications such as communications, signal processing, spectroscopic sensing and imaging. \nOne focus area is development of novel, chip-scale optical frequency comb sources and associated technologies for spectroscopic sensing, identification, and quantification of multiple trace materials in spectrally cluttered backgrounds.  Additional research will explore development of a complex theoretical framework for maximum information extraction from complex scenes to guide development of new imaging technologies.  Work in this thrust will establish the first-principles limits of photon detector performance in a variety of detector technologies to enable better, more sensitive detectors.  Finally, the thrust area will explore how distributed networks of low-resolution cameras can capture information compared to a single high-resolution camera."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.173"
                                            },
                                            "Text": {
                                                "val": "-  Developed a rack-mounted package for mode-locked laser-based optical frequency division microwave source and all components for a chip-scale source.\n-  Demonstrated chip-scale RF photonic down conversion and filtering based on optical frequency comb technology.  \n-  Demonstrated full integration of laser and end-station to realize a micro joule, isolated attosecond beamline, representing a new capability for research in ultrafast electronics. \n-  Demonstrated tabletop sub-wavelength imaging with nanometer spatial resolution (using tabletop high harmonic x-ray source).  \n-  Improved and tailored to specific DoD environments the performance of broadband chip-scale comb sources in multiple spectral regions. \n-  Developed and characterized two-way time\/frequency transfer protocols applicable to moving platforms.  \n-  Expanded bandwidth, stability and robustness of chip-scale comb sources in multiple spectral regions to be compatible with spectroscopy of broadband absorbers such as chemical warfare agents. \n-  Demonstrated proof-of-concept spectroscopy in a lab setting for the detection of multiple trace species using chip-scale frequency combs. \n-  Developed a quantitative, first-principles description of photon detector performance for specific DoD platforms.\n-  Improved the Plenoptic function theoretical framework and began to validate with laboratory experiments to maximally exploit degrees of freedom of light and extract missing information from complex scenes. \n-  Theoretically determined the fundamental limits of maximum light\/scene information extraction from a single viewpoint."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.299"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate operation of rack-mounted package for mode-locked laser-based optical frequency division microwave source in relevant operational environments.  \n-  Demonstrate three dimensional (3D) tabletop sub-wavelength and four-dimensional (4D) imaging of nanostructured technology with nanometer spatial resolution (using tabletop high harmonic x-ray source). \n-  Demonstrate end-user operation of tabletop attosecond source to study electronic and structural dynamics in molecular and semiconductor systems. \n-  Push two-way time and frequency transfer to free-space distances that could advance DoD capabilities. \n-  Develop simulated field test environments for the detection of multiple trace species in a cluttered environment using chip-scale frequency combs in multiple spectral regions. \n-  Demonstrate cavity-enhanced comb-spectroscopy methods for spectroscopy of multiple trace species in a cluttered environment.\n-  Establish and experimentally verify the fundamental trade space for photon detection and create new designs for photon detectors with significant performance metric improvements. \n-  Evaluate the reconstruction of complex 3D scenes based on factors such as fidelity of reconstruction, size of scene, illumination conditions, reconstruction time and projected size, weight and power requirements.\n-  Begin to experimentally demonstrate and evaluate integrated systems for full complex 3D scene reconstruction from a single viewpoint. \n-  Start to develop a generalized theory for maximum information extraction from all photon pathways. \n-  Determine the fundamental imaging limits and potential information efficiency gains for micro- and nano-scale apertures on the order of one to a few hundred wavelengths. \n- Investigate very low frequency (VLF) electromagnetic waves for imaging near field disturbances."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.529"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.529"
                                            },
                                            "Text": {
                                                "val": "-  Compare the fundamental properties of new proof-of-concept detector designs with device performance. \n-  Determine which individual state of the art metrics (efficiency, jitter, bandwidth, and photon number count) are improved by an order of magnitude.\n-  Determine which detector designs result in several state of the art metrics (efficiency, jitter, bandwidth, photon number count) being improved simultaneously by an order of magnitude.\n-  Determine the fundamental requirements and theory (e.g. number of cameras, aperture size, orientation information, resolution, plenoptic variables, etc.) needed for distributed networks of micro- and\/or nano-cameras to be able to reconstruct an arbitrary scene.   \n-  Design initial small-scale experiments to validate theory and algorithms for scene reconstruction from distributed networks of micro- and\/or nano-cameras.  \n-  Establish penetration\/range\/resolution trade space using low frequency electromagnetic waves for imaging. \n-  Demonstrate the possibility of high-resolution imaging in the near field using very low frequency (VLF) detector arrays."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects completion of 3D scene reconstruction activities and final testing of optical spectroscopy methods."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fundamental Limits"
                                    },
                                    "Description": {
                                        "val": "Understanding the fundamental limits (i.e., achievable boundaries) of scientific principles, processes and technologies is critical to better anticipate technological surprise for our adversaries and ourselves.  This thrust explores boundaries across fields such as physics, chemistry, mathematics, biology, and engineering to address critical questions for national security.  This thrust is addressing foundational theory and approaches that include, for example, the fundamental limitations of optical technologies, potential implications for basic biology on national security, leveraging molecular diversity for information storage and processing, and the ability for modeling and simulation to provide a better understanding of complex systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.165"
                                            },
                                            "Text": {
                                                "val": "-  Began development of modeling tools for development of system architectures that utilize engineered optical materials. \n-  Developed initial device design principles to improve the efficiency and bandwidth of engineered optical materials. \n-  Explored the existence of prospective electromagnetic signaling channels within specific biosystems.\n-  Began to make quantitative predictions of transmit-receive characteristics of candidate bio-antennas in situ.\n-  Initiated exploration of new approaches to store and process information with molecules."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate new design architectures and engineered optical materials on the sub-millimeter (sub-mm) scale.  \n-  Develop plans to extend optical device design and fabrication from sub-mm scale to centimeter (cm) scale.\n-  Demonstrate the technical capabilities, both theoretical and experimental, required to definitively determine if electromagnetic signaling is occurring in select biological systems. \n-  Conduct tests of biosystem electromagnetic signaling.\n-  Validate approaches to represent data in molecular form.\n-  Develop strategies to enable direct-access molecular informatics to include integrating elements to directly process molecular data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.090"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.090"
                                            },
                                            "Text": {
                                                "val": "-  Design and optimize cm scale optical systems based on engineered materials.\n-  Fabricate and test cm scale engineered material optical components. \n-  Integrate and demonstrate optical systems and architectures based on engineered materials. \n-  Determine if the selected biological systems use electromagnetic signaling to purposefully communicate. \n-  Compare the accuracy and precision of the theoretical signaling predictions with the experimental measurements within and among biological systems. \n-  Quantify information channel capacity and characteristics of the newly discovered communications pathways in selected biological systems.\n-  Demonstrate approaches for reading molecular data, including random access.  \n-  Validate molecular processing approaches against relevant computational problems. \n-  Initiate integration of storage and processing approaches to develop a molecular computing concept."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase is the result of growth in technologies to anticipate technological surprise and explore boundaries across fields such as physics, chemistry, mathematics, biology, and engineering to address critical questions for national security."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Equilibrium Materials"
                                    },
                                    "Description": {
                                        "val": "The Non-Equilibrium Materials thrust will explore materials and materials structures that acquire novel properties when driven far from equilibrium.  Work in this thrust will examine the physical underpinnings and applications of these systems in areas of interest to the DoD, including next generation electronics, high-performance computing, and sensing.  Efforts will include the development of topologically protected excitations in electronic materials and fundamental studies of exotic quantum states of matter in periodically driven solid-state systems.  This thrust is an outgrowth from Basic Photon Science."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.010"
                                            },
                                            "Text": {
                                                "val": "-  Identify materials that can host nanoscale classical topological excitations for memory, logic, or other applications.\n-  Validate materials that can host quantum topological excitations for topological quantum computing. \n-  Develop techniques for unambiguously measuring and detecting nanoscale topological excitations in electronic systems. \n-  Identify material systems exhibiting novel phenomena when driven far from equilibrium."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.550"
                                            },
                                            "Text": {
                                                "val": "-  Establish the presence of topological excitations with size <10 nm at room temperature in a material system. \n-  Demonstrate low power switching of excitations.\n-  Demonstrate the presence of non-Abelian anyon quantum excitations in a material system. \n-  Demonstrate long-term preservation of coherence in a topologically protected qubit.\n-  Develop techniques to prove the properties of material systems driven far from equilibrium.\n-  Demonstrate improved stability of a material property of interest in a periodically driven system. \n-  Validate the existence of novel phases of matter in systems driven out of equilibrium."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects expanded effort to develop and demonstrate the properties of non-equilibrium materials."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TRS-01"
                    },
                    "ProjectTitle": {
                        "val": "TRANSFORMATIVE SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "46.343"
                        },
                        "CurrentYear": {
                            "val": "59.877"
                        },
                        "BudgetYearOne": {
                            "val": "55.511"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.511"
                        },
                        "BudgetYearTwo": {
                            "val": "57.214"
                        },
                        "BudgetYearThree": {
                            "val": "44.221"
                        },
                        "BudgetYearFour": {
                            "val": "40.478"
                        },
                        "BudgetYearFive": {
                            "val": "29.576"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in information-intensive subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations or threaten National Security.  Specific research in this project will investigate technologies to enable detection of novel threat agents (e.g., bacterial pathogens) as well as create innovative materials of interest to the military (e.g., self-healing materials)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Biological Complexity (BioCom)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Understanding Biological Complexity\n\nThe Biological Complexity (BioCom) program seeks to enhance the understanding of the basic processes associated with biological network interactions, communication, and control to enable novel approaches and technology development to improve warfighter readiness and military platform resilience.  Key advances expected from this research will include the identification of approaches to create stable, predictable, and dynamic control mechanisms of biological networks.  Such information will allow the determination of a biosystem's state and enable the prediction of state.  Applications range from infectious disease mitigation or prevention, to maintain warfighter health, to predicting and leveraging biological systems for managing communities of microorganisms to prevent biofouling on maritime military systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.450"
                                            },
                                            "Text": {
                                                "val": "-  Initiated efforts to assess the utility of new experimental model systems to inform practical engineering with complex biological systems.\n-  Began to identify candidate metrics and measurement technologies relevant to engineering with complex biological systems.\n-  Investigated synergistic integration of disease vector detection and control strategies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.500"
                                            },
                                            "Text": {
                                                "val": "-  Investigate engineering approaches for influencing the controllability of complex biological systems.\n-  Investigate the utility of predictive design rules for engineering complex biological systems.\n-  Assess the feasibility of building engineered controls into biological systems.\n-  Test candidate engineering approaches relevant to control complex biological systems.\n-  Establish effective frameworks for independent verification and validation in engineered biological systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.377"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.377"
                                            },
                                            "Text": {
                                                "val": "-  Develop theoretical and computational approaches to improve design of biological control systems in complex settings.\n-  Characterize performance and verify specifications of measurement technologies for assessing biological control.\n-  Build multiple, integrated system-level controllers within complex biological systems.\n-  Expand the library of well-characterized biological parts relevant to controlling complex biological systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects integration of system level controllers and initiation of independent verification and validation (IV&V) efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Social Simulation (SocialSim)"
                                    },
                                    "Description": {
                                        "val": "The Social Simulation (SocialSim) program is developing a computational capability to simulate the spread and evolution of information in the online environment.  The global information environment is radically changing how and at what rate information spreads and evolves, and both nation-state and sub-state actors are incorporating messaging into their operations to great advantage.  Existing approaches for understanding online information spread and evolution are largely based on specialized exercises that take considerable time to orchestrate and execute, and have limited accuracy.  SocialSim aims to enable a deeper and more quantitative understanding of adversaries' messaging campaigns and their likely outcomes, as well as exploration of potential responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.374"
                                            },
                                            "Text": {
                                                "val": "-  Examined initial approaches for modeling and simulating the spread and evolution of information in online environments.\n-  Explored the potential for social media support tools to simulate online information environments in operational settings.\n-  Studied approaches for simulating online information environments and for assuring privacy when assessing accuracy of simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.451"
                                            },
                                            "Text": {
                                                "val": "-  Develop initial modeling and simulation capabilities for the spread and evolution of information in a single online environment.\n-  Develop techniques for ensuring privacy in data assembled for testing simulations.\n-  Develop techniques for testing simulations of online information dynamics using real-world data from a single online environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.451"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.451"
                                            },
                                            "Text": {
                                                "val": "-  Test the capability to simulate online information evolution.\n-  Evaluate the performance of the social simulator in diverse scenarios in a single online environment.\n-  Extend the underlying models and mechanisms to simulate the spread and evolution of information in multiple interconnected online environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase is the result of development work continuing and technologies being integrated in an initial simulation environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineered Living Materials (ELM)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Engineering Complex Systems\n\nThe Engineered Living Materials program will pursue new approaches to engineer complex, multi-cellular systems for enhanced capabilities and functional materials to improve military infrastructure design and logistics. Complex biological materials and systems have unique properties (e.g., controlled porosity and high strength-to-weight ratios) not only because of the inherent components but also because of how those components are assembled together across length scales.  Engineering biology tools and techniques are now at a stage to pursue the organization and function of multi-cellular systems for a new class of improved capabilities.  This program will develop underlying technological platforms to enable information-driven assembly of hierarchical multi-cellular systems for the development of advanced materials.  Advances in this program will impact military approaches to infrastructure design in austere environments as well as established methods for manufacture and maintenance of military platforms (e.g., tanks, planes, ships)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.495"
                                            },
                                            "Text": {
                                                "val": "-  Investigated methods for specifying cellular behavior in response to environmental cues and positional information.\n-  Began development of biological systems that have genetically encoded three-dimensional forms of specified dimensions.\n-  Began development of gene expression circuits that confer desirable surface properties and autonomous pattern formation to a multi-cellular community.\n-  Researched methods to join living cells to non-living structural materials for the purpose of creating living building materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.584"
                                            },
                                            "Text": {
                                                "val": "-  Investigate methods for programming cellular behavior in response to external cues.\n-  Develop and test biological systems that have genetically encoded three-dimensional forms of specified dimensions.\n-  Initiate testing of gene expression circuits that confer desirable surface properties and autonomous pattern formation to a multi-cellular community.\n-  Demonstrate methods to join living cells to non-living structural materials for the purpose of creating living building materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.393"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.393"
                                            },
                                            "Text": {
                                                "val": "-  Assess the potential for engineered living materials to respond to damage.\n-  Develop methods to control growth in engineered living materials.\n-  Investigate approaches to propagate external signals over long distances in engineered living materials.\n-  Demonstrate stability over relevant time periods in programmed multi-dimensional shapes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects a focused assessment and preliminary technology demonstration for a selected portion of methods initially investigated."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biology for Security (BIOSEC)"
                                    },
                                    "Description": {
                                        "val": "Based on initial research conducted under the Biological Robustness in Complex Settings (BRICS) program, the Biology for Security program seeks to investigate novel approaches to address the DoD need for rapid detection of unknown and\/or emerging biological threats from state actors or violent extremist organizations (VEOs).  This program will investigate approaches for identifying pathogens based on specific behaviors, or phenotypes, such as niche finding or cell toxicity.  Unlike current methods, which rely on a priori knowledge of the pathogen and cannot detect or otherwise analyze unknown threats, this approach will handle scenarios involving engineered or undiscovered bacterial pathogens that do not have known hallmarks.  Advances in this area will produce a completely new capability to assess the emergence of pathogens and to detect pathogens that have been specifically engineered to evade detection by traditional methods.  Resulting systems may be used to alert deployed military personnel operating around the world to new biothreats, or in response to a U.S.-based discovery, outbreak, or pandemic."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.510"
                                            },
                                            "Text": {
                                                "val": "-  Investigate new assays for rapid phenotype and pathogenic characterization of organisms or biological systems.\n-  Initiate research to better connect genetic code with biological functions of interest.\n-  Identify new tools that isolate and manipulate small numbers of microbes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.290"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.290"
                                            },
                                            "Text": {
                                                "val": "-  Develop assays to rapidly screen organisms or biological systems for traits and mechanisms of interest.\n-  Identify genes and pathways associated with complex biological traits.  \n-  Establish the potential for natural or synthetic biological systems as biological threat detectors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects expansion into correlating genetic code with more complex biological functions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of the Living Foundries program is to create a revolutionary, biologically-based manufacturing platform for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale and adapt to changing environments and self-repair, biology represents one of the most powerful manufacturing platforms known.  Living Foundries seeks to develop the foundational technological infrastructure to transform biology into an engineering practice, speeding the biological design-build-test-learn cycle and expanding the complexity of systems that can be engineered.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling adaptable, on-demand production of critical and high-value molecules.\n\nLiving Foundries will develop tools to simplify, abstract, and standardize the biological production pathway optimization process.  Additionally, Living Foundries will identify the fundamental design rules that govern the construction and organization of underlying genetic elements in the production pathways.  Research thrusts include developing the fundamental tools, capabilities, and methodologies to accelerate the biological design-build-test cycle, thereby reducing the extensive cost and time it takes to engineer new systems and expanding the complexity and accuracy of designs that can be built.  The result will be rapid design, construction, implementation, and testing of complex, higher-order genetic networks with programmable functionality.  Applied research for this program is budgeted in PE 0602715E, Project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.100"
                                            },
                                            "Text": {
                                                "val": "-  Improved design tools through incorporation of large-scale process and test data for forward engineering novel genetic systems.\n-  Integrated evaluation tools for high-throughput testing, validation, and verification of engineered systems.\n-  Integrated novel learning systems that enable iterative design of engineered systems using integrated feedback of results to inform subsequent designs.\n-  Optimized integration of design-build-test-learn technologies for high-fidelity, high-throughput, low cost engineering of biological systems.\n-  Implemented new biological chassis for improved yield and production of biochemicals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate novel learning systems of microbial systems using integrated feedback of results to inform subsequent designs.\n-  Utilize improved design and evaluation tools to decrease the cost and increase the speed of biological prototyping.\n-  Demonstrate the capability of new biological chassis for improved yield and production of biochemicals.\n-  Improve the predictability of scaling biological reactions from the lab-scale to the bench-scale."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects completion of basic research efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biological Robustness in Complex Settings (BRICS)"
                                    },
                                    "Description": {
                                        "val": "The Biological Robustness in Complex Settings (BRICS) program will leverage newly developed technologies to enable radical new approaches for engineering biology.  An emerging field, engineering biology is focused on developing the tools to harness the powerful synthetic and functional capabilities of biology.  These tools will facilitate design and biological production of new chemicals and materials, sensing capabilities, therapeutics, and numerous other applications.  This rapidly developing technological capability opens the door to new applications that have previously been out of reach, and offers substantial potential advantages in terms of cost and novel functionality.\n\nFundamental work in this area will focus on understanding the underlying principles for engineering robust and safe microbes and microbial communities that perform as designed over the long-term.  This program has applied research efforts funded in PE 0602715E, Project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.924"
                                            },
                                            "Text": {
                                                "val": "-  Combined consortia engineering technologies to develop communities that can solve specific DoD-relevant problems.\n-  Demonstrated the functional stability of engineered communities in complex environments over relevant time scales.\n-  Demonstrated potential for safe use of engineered consortia under conditions relevant to specific applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.332"
                                            },
                                            "Text": {
                                                "val": "-  Continue development of design rules for functional engineered microbial communities.\n-  Refine parameters that contribute to the functional stability of engineered communities over relevant time scales in complex environments.\n-  Develop new metrics that are relevant to the stability and safe use of engineered consortia outside of a controlled environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects completion of basic research efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Open Manufacturing program will reduce barriers to manufacturing innovation, speed, and affordability of materials, components, and structures.  This will be achieved by investing in technologies to enable affordable, rapid, adaptable, and energy-efficient manufacturing, to promote comprehensive design, simulation and performance-prediction tools, and exposure to best practices.  The applied research component of this program is funded in PE 0602715E, Project MBT-01 under Materials Processing and Manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Established system for model curation, acquire models, and established data formats for simulation and analysis of process, microstructure, and properties for additive manufacturing.\n-  Assessed and quantified the uncertainty in the Open Manufacturing framework model that accurately predicts part performance based on manufacturing method, environment and integrated probabilistic models."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}