{
    "id": "2020-AirForce-PB-3600-MJBOOK-2-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-52",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0207697F"
        },
        "ProgramElementTitle": {
            "val": "Distributed Training and Exercises"
        },
        "R1LineNumber": {
            "val": "206"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.046"
            },
            "CurrentYear": {
                "val": "3.825"
            },
            "BudgetYearOne": {
                "val": "4.303"
            },
            "BudgetYearOneBase": {
                "val": "4.303"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "4.377"
            },
            "BudgetYearThree": {
                "val": "4.467"
            },
            "BudgetYearFour": {
                "val": "4.549"
            },
            "BudgetYearFive": {
                "val": "4.631"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.190"
                },
                "CurrentYear": {
                    "val": "4.225"
                },
                "BudgetYearOne": {
                    "val": "4.303"
                },
                "BudgetYearOneBase": {
                    "val": "4.303"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.046"
                },
                "CurrentYear": {
                    "val": "3.825"
                },
                "BudgetYearOne": {
                    "val": "4.303"
                },
                "BudgetYearOneBase": {
                    "val": "4.303"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.144"
                },
                "CurrentYear": {
                    "val": "-0.400"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.144"
                    },
                    "CurrentYear": {
                        "val": "-0.400"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675190"
                    },
                    "ProjectTitle": {
                        "val": "JFCOM Wargaming"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.046"
                        },
                        "CurrentYear": {
                            "val": "3.825"
                        },
                        "BudgetYearOne": {
                            "val": "4.303"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.303"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.377"
                        },
                        "BudgetYearThree": {
                            "val": "4.467"
                        },
                        "BudgetYearFour": {
                            "val": "4.549"
                        },
                        "BudgetYearFive": {
                            "val": "4.631"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding supports the CSAF Title 10 wargaming efforts to test concepts, capabilities, programming choices, and plans using simulation and other techniques, otherwise known as wargaming.  Based on the Department and Air Force direction, there is a concerted effort in these periods of fiscal restraint to reinvigorate, institutionalize, and systematize wargaming across the Department.  This effort requires continued funding to maintain the level of effort to most effectively pursue an innovative strategy, avoid operational and technical surprise and make best use of limited resources.  The Air Force continues to refine the wargame process and design to better integrate and synergize those efforts in support of the new Air Force Strategy, Planning, and Programming (SP3) process.  Specifically, in addition to maintaining a robust Title 10 Wargame series, Global Engagement, servicing Chief of Staff of the Air Force (CSAF) objectives. The HAF Wargaming Enterprise is executing on-call Wargaming in support of the AF\/A5\/8, the Agile series, along with quick-turning wargame support to the USAF Enterprise Capability Collaboration Team (ECCT) requirements, the Enterprise series,  Plan Blue, and to service AF\/A5S strategy and concept development objectives; all to better address the requirements of the SP3 process and cycles.  Additionally, HAF Wargaming provides and coordinates Air Force representation at other Service and Joint wargames as they execute across the department.  These efforts are providing decision support to senior Air Force leaders involving investment strategies and develop concepts to best employ U.S. forces in future conflicts.\n\nThe Wargame Information Environment (WIE) is a continually evolving system that provides an array of services to game players which enables the accomplishment of game objectives.  The backbone of the WIE is GameNet, a deployable, standalone, Local Area Network (LAN) with servers and laptops that host applications to support virtual battlespace collaboration, decision making, three-dimensional visualizations & mapping, and services.  Behind these applications are cutting edge technologies and database architectures from both commercial off-the-shelf and government developed software that assures relevance to the wargame.  The modeling, simulation, and analysis applications allow participants, adjudicators, and control team members to effectively and efficiently collaborate, make decisions, present those decisions, and execute moves within the wargame; documenting each step in the process.  This information capture enables discovery during the wargame and permits postgame analysis.  These findings inform portfolio rebalancing exercises, concept and strategy development, and very senior leader decision making.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Develop\/ Upgrade M&S Tools for WIE"
                                    },
                                    "Description": {
                                        "val": "Develop air, space and cyber space wargaming specific functionality in existing modeling and simulation and analysis tools and integrate into the latest version of the WIE"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.391"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.290"
                                            },
                                            "Text": {
                                                "val": "-  Extend the WIE to include either the Lemay Center Wargaming Institute BubbleNet or Air Force Space Command Schriever Wargame System in support of an Air Force Title 10 Game event.\n- Integrate tools to capture implications of force structures and capabilities employed in wargames to influence budgeting and programming choices.\n- Continue to expand and develop the WIE, incorporating latest technology and tools, in support of a more flexible and agile wargaming enterprise; quicker to respond and tailorable for a wider range of wargaming. This will require analysis of utility and functionality of additional models and analytical tools used by other wargames, to include creation of custom interfaces to allow interaction within the WIE."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.502"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.502"
                                            },
                                            "Text": {
                                                "val": "- Continue the integration of tools to capture consequences of force structures, capabilities employed in wargames to effect budgeting and programming choices.\n- Continue to expand and develop the WIE, incorporating the latest technology and tools, in support of a more flexible, robust, and agile wargaming enterprise; quicker to respond and tailorable for a wider range of wargaming. This will require analysis of utility and functionality of additional models and analytical tools used by other wargames, to include creation of custom interfaces to allow interaction within the WIE, for example the Integrated Sustainment and Wargaming Analysis Toolkit (ISWAT).\n- Improve the ease and effectiveness of wargame execution by developing new WIE visualizations and user interfaces."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY19 to FY20 accounts for inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Concept Development & Experimentation (JCD&E) Tools"
                                    },
                                    "Description": {
                                        "val": "Develop scenarios and data for future synthetic environment that grounded in truth to support several wargames and mini-wargames."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.655"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.535"
                                            },
                                            "Text": {
                                                "val": "HAF Wargaming will conclude Global Engagement 18 post-game analysis and\nreport writing, as well as, execute Futures Game 18, along with post-game\nanalysis and report writing.  HAF Wargaming will design, develop models,\nresearch concepts, and conduct workshops for Global Engagement 20 (USAF\nFoundation wargame).  HAF Wargaming will conduct  quick-turn wargames in\nsupport of senior leaders (Agile, ECCT) as directed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.801"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.801"
                                            },
                                            "Text": {
                                                "val": "HAF Wargaming will execute Global Engagement 20.  HAF Wargaming will design, develop models,\nresearch concepts, and conduct workshops for Global Engagement 20 and its post-game analysis and\nreport writing.(USAF Foundation wargame).  HAF Wargaming will conduct quick-turn wargames in\nsupport of senior leaders (Agile, ECCT) as directed."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO funds programmed nor executed."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY19 to FY20 accounts for inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In order to achieve an innovative strategy, avoid operational and technical surprise and make best use of limited resources, wargaming requires an evolutionary acquisition approach for every wargame. Contract support is required as wargame and IT specialized expertise resides with industry and is not available organically. The requirements constantly evolve and a challenge to be accurately defined at the outset of the contract; however, we will continue to pursue a firm fixed price (FFP) contract awarded under a full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FA7014-18-C-1003"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFDW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "JBA, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.046"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.825"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.303"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.303"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.174"
                                                    },
                                                    "TargetValue": {
                                                        "val": "22.084"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Wargaming Information Environment"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Develop and Integrate M&S Tools"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Enhance ViewPoint"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Improve GamePoint"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}