{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-56",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605027D8Z"
        },
        "ProgramElementTitle": {
            "val": "OUSD(C) IT Development Initiative"
        },
        "R1LineNumber": {
            "val": "131"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "56.134"
            },
            "PriorYear": {
                "val": "21.312"
            },
            "CurrentYear": {
                "val": "9.568"
            },
            "BudgetYearOne": {
                "val": "15.653"
            },
            "BudgetYearOneBase": {
                "val": "15.653"
            },
            "BudgetYearTwo": {
                "val": "14.274"
            },
            "BudgetYearThree": {
                "val": "14.555"
            },
            "BudgetYearFour": {
                "val": "14.893"
            },
            "BudgetYearFive": {
                "val": "15.266"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "BUDGET REQUEST JUSTIFICATION:  +$15.653 million is required to support the following efforts:\n\n+$8.134 million is required to support Next Generation Resource Management Systems.\n\n+$7.519 million is required to support Defense Repository for Common Enterprise Data.\n\nFY18 funding of $21.312 was in 927 instead of 930."
        },
        "ProgramElementMissionDescription": {
            "val": "As the Department of Defense strategic, operational, and tactical plans and objectives transform the war fighter with new capabilities and doctrine, the budgeting and accountability of funds used to pursue the Department objectives will become more complicated and detailed for senior leaders to make decisions with supporting rationale for the taxpayer.  Incorporating information technology toward current and emerging business processes manifesting into a state-of-the art system of systems will result in increasing efficiencies, timely diagnostics, and reducing lifecycle costs to maintain, sustain and repair.\n\nThis initiative exploits emerging technology, processes, trends, capabilities, and techniques to incorporate state-of-the-art information technology enabling the ability, agility, and level of fidelity to collect, process, administrate and report resource management data and to automate business processes within a more robust analytical environment within the Office of the Under Secretary of Defense (Comptroller) OUSD(C).\n  \nNEXT GENERATION RESOURCE MANAGEMENT SYSTEM:\n\nThe Office of the Under Secretary of Defense (Comptroller) (OUSD(C)) is responsible for advising the Secretary of Defense on all Defense budgetary and fiscal matters, for Defense budget development and execution, and for overseeing financial management across the Department. The OUSD(C) has a broad set of responsibilities in supporting the Planning, Programing, Budget and Execution (PPBE) process. The Office of the Director, Cost Assessment and Program Evaluation (CAPE), provides independent analytic advice to the Secretary of Defense on all aspects of the Defense program, including alternative weapon systems and force structures, the development and evaluation of program and defense program alternatives, and the cost-effectiveness of defense systems. \nThere is a critical need for the development of a state-of-the-art information technology system to modernize and replace multiple, antiquated legacy systems and processes used to formulate, justify, present and defend the entire Department of Defense Budget in the Office of the Under Secretary of Defense (Comptroller) (OUSD(C)) to meet Title 10 and Title 31 mission and reporting requirements.  The Comptroller’s plan for mitigating the deficiencies and capability gaps associated with current systems is development of the Next Generation Resource Management System.\n\nOUSD(C) and CAPE use multiple systems to formulate, justify, distribute, and execute DoD budgets. The information managed by the budget formulation and programming systems is redundant, and reconciliation of information is difficult and inefficient. These systems require extensive manpower investments to give executives the information they need to make key financial decisions in a timely manner.\n\nThe OUSD(C) and CAPE require a more efficient, effective Defense budget environment that optimizes the budget cycle to ensure users are processing and reporting efficiently and DoD Senior Leadership has the information to make informed, critical decisions. \n\nThe OUSD(C) requires capabilities that shall provide for the effective formulation, and justification of the Defense budget. The requirement is for:\n• Automated exchange and reconciliation of budget data\n• Improved efficiency through the utilization of a unified budgetary model\n• Instantaneous ability to generate data for management reviews and decisions\n• Capability to accommodate emerging business practices\n\nMoving forward, the new “to be” system shall be designed as a single system with a unified data source for OUSD(C) and CAPE. The new system shall provide a single, integrated system that employs the latest technologies to fulfill the Department’s financial management responsibilities in an effective and efficient manner. The new system shall provide twenty-first century information technology that shall allow users to view information from multiple fully integrated modules simultaneously, e.g., current year budget submission, decision documents from previous years, and budget execution information.  \n\nDEFENSE REPOSITORY FOR COMMON ENTERPRISE DATA:\n\nDefense Repository for Common Enterprise data (DRCED) support financial audit, cost management, performance management, and readiness.\n\nThe DoD DRCED requires:\n• All supporting Department data that rolls up to the DoD financial statement (detailed accounting data reconciled to the financial statement)\n• Proof of the completeness of all transactional data reported within the UoT (detailed accounting data reconciled to business events)\n• Ability to extract subset populations\n• Ability to secure and protect the data within the UoT\n\nThe failure to meet these requirements will result in the Department unable to successfully conduct and pass an audit.\n\nTo achieve these requirements, the Office of the Under Secretary of Defense (Comptroller) is creating a tool called the Defense Repository for Common Enterprise Data (DRCED).  This tool has the potential to significantly improve DoD’s capability and capacity to handle large volumes of standard and non-standard business and readiness data.  Both an application and analytical platform, the DRCED leverages an open-source software framework for storing data and running applications to deliver a complete DRCED.  \n\nThe first phase of DRCED implementation is a proof of concept with the U.S. Special Operations Command (USSOCOM) systems to develop a baseline application and configuration.  When the first phase has been successfully completed, the second phase will integrate into the full solution any remaining accounting and business feeder systems that execute TI-97 funds and be the solution for DATA Act. The proof of concept was successful and the program moved to an operations phase in FY18.\n\nDRCED is a joint effort between Office of the Deputy Chief Financial Officer (ODCFO), Office of the Chief Management Officer (ODCMO), Office of the Chief Information Officer (OCIO), USSOCOM, and the Defense Finance and Accounting Service (DFAS).\n\nFY19 develops and implements a SIPR environment for Cost Accounting Framework to meet Operations Security (OPSEC) and Information Security (INFOSEC) requirements\n\nFY20 continues the development of a common enterprise data repository to aggregate and fuse multiple data sources to make business and analytical decisions, find data inconsistencies and improve financial audits across the DoD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.312"
                },
                "CurrentYear": {
                    "val": "9.590"
                },
                "BudgetYearOne": {
                    "val": "15.653"
                },
                "BudgetYearOneBase": {
                    "val": "15.653"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.312"
                },
                "CurrentYear": {
                    "val": "9.568"
                },
                "BudgetYearOne": {
                    "val": "15.653"
                },
                "BudgetYearOneBase": {
                    "val": "15.653"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.022"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-0.022"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020 BUDGET REQUEST JUSTIFICATION: +$8.134 million is required to support Next Generation Resource Management System (NGRMS).and $7.519 million is required to support Defense Repository for Common Enterprise Data."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "927"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Resource Management System"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "39.984"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "8.068"
                        },
                        "BudgetYearOne": {
                            "val": "8.134"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.134"
                        },
                        "BudgetYearTwo": {
                            "val": "8.181"
                        },
                        "BudgetYearThree": {
                            "val": "8.279"
                        },
                        "BudgetYearFour": {
                            "val": "8.429"
                        },
                        "BudgetYearFive": {
                            "val": "8.608"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Office of the Under Secretary of Defense (Comptroller) (OUSD(C)) is responsible for advising the Secretary of Defense on all Defense budgetary and fiscal matters, for Defense budget development and execution, and for overseeing financial management across the Department. The OUSD(C) has a broad set of responsibilities in supporting the Planning, Programing, Budget and Execution (PPBE) process. The Office of the Director, Cost Assessment and Program Evaluation (CAPE), provides independent analytic advice to the Secretary of Defense on all aspects of the Defense program, including alternative weapon systems and force structures, the development and evaluation of programs and defense program alternatives, and the cost-effectiveness of defense systems. \n\nOUSD(C) and CAPE use multiple systems to formulate, justify, distribute, and execute DoD budgets. The information managed by the budget formulation and programming systems is redundant, and reconciliation of information is difficult and inefficient. These systems require extensive manpower investments to give executives the information they need to make key financial decisions in a timely manner.\n\nThe OUSD(C) and CAPE require a more efficient, effective Defense budget environment that optimizes the budget cycle to ensure users are processing and reporting efficiently and DoD Senior Leadership has the information to make informed, critical decisions. \n\nThe OUSD(C) requires capabilities that shall provide for the effective formulation, and justification of the Defense budget. The requirement is for:\n• Automated exchange and reconciliation of budget data\n• Improved efficiency through the utilization of a unified budgetary model\n• Instantaneous ability to generate data for management reviews and decisions\n• Capability to accommodate emerging business practices\n\nMoving forward, the new “to be” system shall be designed as a single system with a unified data source for OUSD(C) and CAPE. The new system shall provide a single, integrated system that employs the latest technologies to fulfill the Department’s financial management responsibilities in an effective and efficient manner. The new system shall provide twenty-first century information technology that shall allow users to view information from multiple fully integrated modules simultaneously, e.g., current year budget submission, decision documents from previous years, and budget execution information."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Resource Management System"
                                    },
                                    "Description": {
                                        "val": "Plan, develop, test and evaluate the system components (i.e. unified database, expert system, cross domain security, enterprise service bus, applications, services) and supportability requirements in modernizing the budget formulation, programming execution and reporting capabilities for the Department of Defense.  Activities will include, but not be limited to, the preparation of all documentation required for Clinger-Cohen Compliance and acquisition regulations, developing requests for proposals, and oversight and management of contracts and deliverables."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "After the NGRMS program funding was transferred from DLA to OUSD(C) in FY2017, the Comptroller staff has begun work on developing a comprehensive, integrated plan as part of acquisition planning activities that will describe the business, technical, and support strategies to manage program risks and meet program objectives.  OUSD(C) has taken the first step in getting the program back on track.  OUSD(C) and CAPE are working on a joint spiral development effort to improve the effectiveness and efficiency of the DoD budget formulation process by consolidating multiple budget data collection points into a prototype for programming and budget data.  This would combine the collection of data performed by the existing applications Standard Data Collection System (SDCS) (Manpower, Forces, Pay Rates, DWCF), Comptroller Information System (CIS), Program Resources Collection Process (PRCP) (Procurement, Research Development Test & Development, Military Construction and Procurement) and the Comptroller Information System (CIS).  This serves as an important proof-of-concept for future development of NGRMS.  Certain elements of agile development and the waterfall method are applied to provide incremental, staged improvements in functionality.\n\nThe prototype will provide a single, centralized user interface for the DoD components and agencies to submit their budget requests using a common, integrated budget structure, improving efficiency and effectiveness by removing redundancy and need for data reconciliation across multiple budget systems.  This initial phase will support capabilities to collect and feed the budget request data back to existing Comptroller and CAPE legacy systems (CIS, PRCP, and SDCS) to be further processed as part of the President's Budget submission process.  This effort is intended to expand into the next development phase of the NGRMS.\n\nTo prove the concept, OUSD(C) and CAPE have begun to capture and process Manpower (Military End Strength and Civilian FTEs) data.  The purpose of this prototype is to prove that budget submission data can be captured with a commonly defined data structure, transformed, and exchanged back to CIS, PRCP and SDCS in a seamless manner.  OUSD(C) and CAPE are currently working to define a standard set of submission data elements for collection of Manpower data.  The single submission prototype effort is intended to expand to include capture of all budget transaction types and will lead to NGRMS, the modernization and consolidation of multiple budget systems, implementation of next generation capabilities, and eventually, retirement of multiple legacy systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.068"
                                            },
                                            "Text": {
                                                "val": "FY 2019 planned development will include the build out of MilCloud Development environment, development of business processes for single submission of budget data, and the design and development of a single submission interface that provides a standardized Data Collection Form to populate a standardized Database Structure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.134"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.134"
                                            },
                                            "Text": {
                                                "val": "FY 2020 planned development will include the development, Developmental and operational test, and deployment of the production interfaces. Development and developmental test of reporting\/analytic tool will also be completed in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase was due to the changes in the scope of NGRMS requirements."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Spiral development on a smaller scale to replace legacy mission system by leveraging existing resources.."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon & Contractor Off-site Facility"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.984"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.068"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.134"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.134"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "NGRMS schedule_20180822.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "NGRMS Prototype"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "930"
                    },
                    "ProjectTitle": {
                        "val": "Defense Repository for Common Enterprise Data"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.150"
                        },
                        "PriorYear": {
                            "val": "21.312"
                        },
                        "CurrentYear": {
                            "val": "1.500"
                        },
                        "BudgetYearOne": {
                            "val": "7.519"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.519"
                        },
                        "BudgetYearTwo": {
                            "val": "6.093"
                        },
                        "BudgetYearThree": {
                            "val": "6.276"
                        },
                        "BudgetYearFour": {
                            "val": "6.464"
                        },
                        "BudgetYearFive": {
                            "val": "6.658"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY18 funding was inr 927 instead of 930"
                        },
                        "ProjectMissionDescription": {
                            "val": "Without a single DRCED to support the TI97 General Fund for the 4th Estate the Department will be incapable of asserting readiness for an independent audit of the consolidated financial statements.   All DoD organizations are pursuing the current statutory goal of achieving the state of audit that supports entry into a full financial statement of audit in FY 2018 with an initial opinion rendered in mid-FY 2019.  Without an automated capability to provide a transactional universe for sampling and evidentiary proof the department will not be in compliance with public law. \n\nThe requested funds will be used to buy “Big Data” software and hardware infrastructure and required contractor services to implement the technology to meet the UoT requirement. \nThis funds include subject matter expertise costs for DCFO and funds to be placed on a contract for hardware, software, and labor.  This will not result in hiring additional government personnel. \n\nThe UoT will have the capability to:\n•\tIngest data from multiple accounting and financial feeder systems\n•\tNormalize data from multiple sources providing a common data architecture\n•\tReconcile transactional details to summary financial data\n•\tProvide auditor’s the ability to sample TI-97 detailed transactions\n•\tBusiness Analytics\/Reporting\n•\tDATA Act which is a statutory requirement to be completed by May 2017\n•\tProvide NIPR and SIPR capability for non-sensitive and sensitive data\n\nThis effort will expand in scope to support other enterprise analytics efforts like cost management, performance management, and readiness.  The scope is to bring in data from an estimated 50 systems and demonstrate existence and completeness of business and accounting transaction data, which are capabilities required for audit readiness and other analytical use cases."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Repository for Common Enterprise Data"
                                    },
                                    "Description": {
                                        "val": "Plan, develop, test and evaluate the system components (i.e. unified database, cross domain security, applications, services) and supportability requirements in creating a universe of transactions for the Defense Wide General Fund Appropriation financial audit, cost management, performance management, and readiness.\n\nThe funds will be used to support increments three, four, five, and six per the schedule."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.312"
                                            },
                                            "Text": {
                                                "val": "Reconcile fifteen General Fund accounting systems\nReconcile eighteen business feeder systems to general fund accounting system.\nValidate UoT capabilities  through the audit examinations of DCMA and DoDEA"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "FY19 develops and implements a SIPR environment for Cost Accounting Framework to meet Operations Security (OPSEC) and Information Security (INFOSEC) requirements"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.519"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.519"
                                            },
                                            "Text": {
                                                "val": "FY20 continues the development of a common enterprise data repository to aggregate and fuse multiple data sources to make business and analytical decisions, find data inconsistencies and improve financial audits across the DoD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "As we began planning the design of the long-term IT solution for the Cost Accounting Framework, we incorporated funding requirements into the Defense Repository for Common Enterprise Data FY18 budget to cover a NIPR solution.  Since that budgeting exercise, it has become apparent that we will need funds in the FY19 budget for a SIPR environment to meet project Operations Security (OPSEC) and Information Security (INFOSEC) requirements.  The FY19 funds are needed to support the additional scope of a SIPR implementation for the Cost Accounting Framework database and visualization application."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Leveraging existing contracts to develop and implement SIPR environment."
                        },
                        "PerformanceMetrics": {
                            "val": "97% of the Defense Agencies accounting systems reconcile to the unadjusted trial balance"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Audit Analytics Task"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.150"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "21.312"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.315"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.582"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.582"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Financial Analytics Task"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.323"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.323"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Performance Analytics Task"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.255"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.281"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.281"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Readiness Task"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.225"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.086"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.086"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Enablement Task"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(C)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.645"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.247"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.247"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "DRCED Schedule1.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "DRCED Schedule2.JPG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Acquisiiton Milestone"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Cost management data in DRCED"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Readiness pilot"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Development of SIPR Environment for Cost Accounting Framework"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Development and ingest further data"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}