{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-59",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605294D8Z"
        },
        "ProgramElementTitle": {
            "val": "Trusted and Assured Microelectronics"
        },
        "R1LineNumber": {
            "val": "137"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "59.516"
            },
            "CurrentYear": {
                "val": "95.959"
            },
            "BudgetYearOne": {
                "val": "175.032"
            },
            "BudgetYearOneBase": {
                "val": "175.032"
            },
            "BudgetYearTwo": {
                "val": "66.949"
            },
            "BudgetYearThree": {
                "val": "66.891"
            },
            "BudgetYearFour": {
                "val": "67.287"
            },
            "BudgetYearFive": {
                "val": "68.716"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Funding for the Microelectronic Innovation for National Security and Economic Competitiveness (MINSEC) activities were re-aligned from Project Number 809 to Project Number 822.\n\nThis Program Element (PE) supports activities to ensure critical and sensitive integrated circuits are available to meet the DoD’s needs.  It refines strategies and management planning activities that will: (1) provide support to acquisition programs to address trusted and assured microelectronics supply needs; (2) improve capability to evaluate and validate assurance of microelectronic parts and advance standards to incentivize the commercial marketplace to recognize hardware assurance as a competitive design standard; (3) develop and demonstrate alternative approaches to the DoD Trusted Foundry program to assure the microelectronics supply chain; and (4) provide access to advanced microelectronics that are vital to the national security and economic competitiveness for the U.S. government (USG) in order to enable DoD and broader USG access to commercial state-of-the-art (SOTA) microelectronics technology.\n\nThis PE supports the 2018 National Defense Strategy’s (NDS) line of effort to build a more lethal force through modernization of key capabilities and the NDS defense objective of establishing an unmatched twenty-first century National Security Innovation Base that effectively supports Department operations and sustains security and solvency.\n\nThis activity will be coordinated by the Office of the Under Secretary of Defense for Research and Engineering, and will include performers from the DoD Components, the Defense Microelectronics Activity (DMEA), the Joint Federated Assurance Center (JFAC), the Defense Advanced Research Programs Agency (DARPA), other DoD and Intelligence Community science and technology (S&T) organizations and laboratories, the defense industry, and the broader commercial industrial base.  It will integrate the functions of the DoD Trusted Foundry Program, the Trusted Supplier accreditation program, JFAC, and related science and technology (S&T) activities.  \n\nThis activity implements, maintains, and updates the DoD’s long-term microelectronics strategy.  Additionally this activity places emphasis on incentivizing and proving new microelectronics technology solutions.  Recognizing that  ensured access to a trusted and assured supply of microelectronics is a USG-wide concern, this activity will interface with interagency partners to take into account interagency requirements, opportunities for collaboration, and strategic decisions that can be made to limit the overall cost of these requirements to the USG."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "61.084"
                },
                "CurrentYear": {
                    "val": "56.178"
                },
                "BudgetYearOne": {
                    "val": "57.194"
                },
                "BudgetYearOneBase": {
                    "val": "57.194"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.516"
                },
                "CurrentYear": {
                    "val": "95.959"
                },
                "BudgetYearOne": {
                    "val": "175.032"
                },
                "BudgetYearOneBase": {
                    "val": "175.032"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.568"
                },
                "CurrentYear": {
                    "val": "39.781"
                },
                "BudgetYearOne": {
                    "val": "117.838"
                },
                "BudgetYearOneBase": {
                    "val": "117.838"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "40.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.450"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.118"
                                },
                                "CurrentYear": {
                                    "val": "-0.219"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.162"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.162"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Adjustment for MINSEC P822"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "118.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "118.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 funding in the amount of $40 million was added to support acceleration efforts for MINSEC activities.  FY 2020 funding in the amount of $118 million was added to support a high-mix, low-volume enhanced microelectronics manufacturing domestic capability and a proactive awareness and security effort to identify and mitigate critical microelectronics supply chain threats."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "812"
                    },
                    "ProjectTitle": {
                        "val": "Trusted Mask Trust Approach"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.000"
                        },
                        "BudgetYearThree": {
                            "val": "2.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project staffs and supports operation of a new secure (SECRET-level) photomask manufacturing capability at an existing SOTA commercial photomask manufacturing supplier to secure the masks and design intellectual property (IP) of acquisition programs when using commercial microelectronic fabrication facilities other than the Trusted Foundry.  This capability can be used in conjunction with one or more leading-edge commercial foundries.  This capability will address trusted masks at technology node sizes less than 130 nanometers (nm) down to 14nm."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trusted Mask Trust Approach"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "DMEA will provide management and technical support, as required, to procure secure mask data parsing services for the Department, as well as other Federal entities, by upgrading an existing SOTA commercial photomask manufacturing supplier with a Trusted photomask capability to ensure the integrity of the tape-in\/mask release, mask manufacturing, and authentication process for photomasks.  Starting in FY 2018, a SOTA commercial photomask manufacturing supplier will be equipped with a new secure (SECRET-level) photomask manufacturing capability (note: DMEA is still awaiting receipt of $7.200 million planned for this effort as part of a FY 2017 Defense Production Act (DPA) Title III project) and staffed to provide the required critical Trusted photomask capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Equipping and staffing of the new secure (SECRET-level) photomask manufacturing capability at the SOTA commercial photomask manufacturing supplier will be continued.  DMEA will also continue to provide management and technical support, as required, to procure secure mask data parsing services for the Department, as well as other Federal entities, through operation of this Trusted photomask capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continuation of FY 2019 plan to equip and staff the new secure (SECRET-level) photomask manufacturing capability at the SOTA commercial photomask manufacturing supplier."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2019 and FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance for this project is monitored in the following ways:\n• Number of photomasks created using the secure photomask manufacturing capability.\n• Number of acquisition programs using the secure photomask manufacturing capability.\n• Number of technology node sizes supported by the secure photomask manufacturing capability.\n• Number of foundries supported by the secure photomask manufacturing capability."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "NA"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Trusted Mask Trust Approach"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Microelectronics Activity (DMEA)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "California"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Trsuted mask facility operation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Trusted mask facility operation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "809"
                    },
                    "ProjectTitle": {
                        "val": "New Trust Approach Demonstration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "59.516"
                        },
                        "CurrentYear": {
                            "val": "13.098"
                        },
                        "BudgetYearOne": {
                            "val": "13.381"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.381"
                        },
                        "BudgetYearTwo": {
                            "val": "23.215"
                        },
                        "BudgetYearThree": {
                            "val": "23.101"
                        },
                        "BudgetYearFour": {
                            "val": "25.547"
                        },
                        "BudgetYearFive": {
                            "val": "25.724"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds a program of research to develop and demonstrate the next generation, technology-driven approach to microelectronics trust and assurance, to include state-of-the-art (SOTA) microelectronics, to ensure continued access to SOTA microelectronic technologies, while maintaining the required level of assurance in all environments.  DoD’s ability to access commercial technology for its custom secure, trusted and assured needs is diminishing as SOTA suppliers become fewer and more focused on serving the global commercial market.  DoD’s technology needs are broad, and relying on a single source supplier is not feasible.  Alternative, advanced manufacturing methods, technologies, and design tools are needed to produce secure, trusted and assured SOTA parts from commercial sources and to preserve access to these advanced nodes while protecting DoD and Defense Industrial Base (DIB) intellectual property (IP) from exploitation.  It is also intended to dramatically improve the capabilities of the Joint Federated Assurance Center (JFAC) with regard to verification and validation in support of microelectronics assurance.\n\nThis program of research will demonstrate innovative design, manufacturing, imaging, tagging, and control and assessment approaches for protecting DoD’s microelectronics supply chain and IP, including alternatives for trusted, strategic radiation-hardened electronics in advanced technology nodes for next-generation strategic systems, obfuscation and disaggregation technologies, and other assurance mitigations.  It will demonstrate advanced imaging technologies and forensics, Design for Assurance techniques, active hardware assurance controls, electronic component markers, and a data and analysis capability to enable auditing and independent verification and validation of commercial designs.  It also demonstrates and implements concepts for the cost-effective production of custom microelectronics in low volumes and protection of sensitive IP from exploitation.\n\nAssurance technologies that can be applied in a broad range of trusted and commercial environments can mitigate the risks associated with sole-source suppliers, and increase the ability of the U.S. Government (USG) to leverage commercial capabilities.  The suite of demonstrated technologies, e.g., alternative manufacturing methods and design tools, will enable DoD to obfuscate the purpose of sensitive devices, verify their origin and function, and protect sensitive IP from exploitation even while using the global supply chain for most hardware.  In cases where the risk involved precludes that level of commercial collaboration, low-volume manufacturing technologies demonstrated under this project would permit DoD to more cheaply produce low volumes of sensitive microelectronics in trusted environments.  The project will also support demonstration of a repository of third-party IP and electronic design automation (EDA) tools to expedite circuit design and transition promising technologies to use."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Trust Approach Demonstration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "59.516"
                                            },
                                            "Text": {
                                                "val": "Primary activities will include demonstration of acquisition program pilots and technology demonstrations, followed by transition of these capabilities to new programs in the following fiscal years.\n\nThese activities will mature and evaluate trust technologies and techniques through efforts that may include the conduct of studies, Broad Agency Announcements (BAAs) and other efforts to coordinate research programs across USG research and development (R&D) organizations, academia and industry.\n\nThis project will engage early on with potential stakeholders to identify potential transition issues and aid in transition through joint collaboration between research teams and stakeholders with a focus on evaluations of prototypes, test articles and beta versions of tools, IP, techniques, methods, etc. and their use in operationally-realistic scenarios."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.098"
                                            },
                                            "Text": {
                                                "val": "Primary activities will continue to include demonstration of acquisition program pilots and technology demonstrations, followed by transition of these capabilities to new programs in the following fiscal years. \n\nThese activities will continue to mature and evaluate assurance technologies and techniques through efforts that may include the conduct of studies, broad agency announcements (BAAs), and other efforts to coordinate research programs across USG R&D organizations, academia and industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.381"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.381"
                                            },
                                            "Text": {
                                                "val": "Continuation of FY 2019 activities including the following:\n• Demonstrate acquisition program pilots and technology demonstrations, followed by transition of these capabilities to new programs in the following fiscal years\n• Evaluate assurance technologies and techniques through efforts that may include the conduct of studies, broad agency announcements (BAAs), and other efforts to coordinate research programs across USG R&D organizations, academia and industry\n• Identify potential transition issues and aid in transition through joint collaboration between research teams and stakeholders with a focus on evaluations of prototypes, test articles and beta versions of tools, IP, techniques, methods, etc. and their use in operationally-realistic scenarios."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2019 and FY 2020. Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance for this project is monitored in the following ways:\n• Effectiveness of developed technologies, as measured by:  \n   - The speed and reliability of new validation and verification techniques in identifying known microelectronics issues (e.g., tampering) in laboratory and non-laboratory situations.\n   - Successful testing of advanced, alternative manufacturing techniques, such as disaggregated manufacturing.\n   - Resilience of microelectronics protected by new trust approach technologies in red teaming exercises.\n• Adoption of next-generation assurance technologies, as measured by:  \n   - The number of DoD and other USG programs employing these assurance technologies, design approaches, or best practices.\n   - The volume and criticality of components employing these technologies, design approaches, or best practices.\n   - Promulgation in DoD guidance and program protection plans."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "NA"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "New Trust Approach Demonstration Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various (DARPA, Air Force, Army, Navy, NSA)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "59.516"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.098"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.381"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.381"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "New Trust Approach Demonstration"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "FPGA integrated assurance analysis\/logical and physical verification tool demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Automated design and verification and demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Validation of custom integrated circuits and demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Cloud hardware emulation\/virtual instrumentation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Third Party Intellectual Property (IP) and EDA tool repository development and demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC technical capability improvement development and demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain demonstrations"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USG and industry engagement"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain policy and guidance development\/update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "822"
                    },
                    "ProjectTitle": {
                        "val": "Microelectronics Innovation for National Security and Economic Competitiveness (MINSEC) Enhancement and Demonstration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "80.861"
                        },
                        "BudgetYearOne": {
                            "val": "159.651"
                        },
                        "BudgetYearOneBase": {
                            "val": "159.651"
                        },
                        "BudgetYearTwo": {
                            "val": "41.734"
                        },
                        "BudgetYearThree": {
                            "val": "41.790"
                        },
                        "BudgetYearFour": {
                            "val": "41.740"
                        },
                        "BudgetYearFive": {
                            "val": "42.992"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the DoD microelectronics strategy by ensuring the availability of and access to the advanced, assured microelectronics that are critical for DoD and national security systems.  It will support the development and delivery of tools to protect the intellectual property (IP) confidentiality and integrity for a broad range of systems and missions and will provide a path for the production of these articles.  It will allow the DoD to 1) maintain technological leadership and a secure domestic microelectronics ecosystem; 2) promote access to all necessary current and future semiconductor technologies, including design, fabrication, packaging, and testing, from a robust base of suppliers; 3) provide multiple options for programs and the Defense Industrial Base to quickly upgrade microelectronic components; 4) create a competitive industrial base of microelectronics suppliers that can rapidly adjust to the dynamics of the industry including the initiation of modernization pilots with DoD programs and industry to deliver new capabilities in artificial intelligence (AI) processors, co-development of advanced commercial-off-the-shelf (COTS) programmable devices, and addressing select IP obsolescence risks; and 5) provide DoD’s captive specialty needs suppliers and dedicated facilities with cost-effective upgrade capabilities and resources so they can deliver advanced technologies.\n\nThis project supports a broader national strategy to focus resources, policies, and incentives to enhance current and next generation defense capability by 1) maintaining access to U.S. domestic production of state-of-the-art (SOTA) technology; 2) enhancing state-of-the-practice (SOTP) foundries in the U.S. to produce more advanced technologies to better serve low-volume customers in the aerospace and defense community; 3) investing in research and development (R&D) for the next generation of microelectronics for new materials, devices, architectures, and designs in coordination with the Defense Advanced Research Projects Agency (DARPA) Electronics Resurgence Initiative (ERI); 4) promoting threat awareness, proactive protection, and supply chain security to ensure these investments continue to benefit the U.S.; and 5) exploring incentives for market growth through dual-use technologies, piloting acquisition reforms and providing incentives for cooperative R&D and trade.\n\nMINSEC activities are categorized into the following focus areas:  next generation disruptive R&D; capture and secure microelectronics R&D; new microelectronics development, demonstration, and capability insertion; COTS programmable integrated circuit (IC) co-development; microelectronics obsolescence and replacement; microelectronics-focused workforce development; radiation hardening by process (RHBP) and radiation hardening by design (RHBD); and radio frequency (RF) and optoelectronic (OE) microelectronics.\n\nThis project received additional funding in FY 2019 to support MINSEC efforts in the COTS programmable IC co-development focus area. FY 2020 funding for this project will continue the ongoing FY 2019 MINSEC COTS programmable IC co-development activities."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Next Generation Microelectronics"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "40.000"
                                        },
                                        "Text": {
                                            "val": "• Enhance service lab design (demonstration hardware) and verification (formal verification, layout, etc.) expertise through on-site subject matter experts and engagement with commercial entities.\n• Evaluate specialized field programmable gate array designs from multiple commercial vendors for potential benefits and vulnerabilities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Microelectronics Innovation for National Security and Economic Competitiveness (MINSEC)"
                                    },
                                    "Description": {
                                        "val": "This project’s activities will mature and evaluate microelectronics assurance technologies and techniques through efforts that may include the conduct of studies and Broad Agency Announcements (BAAs) and other efforts to coordinate research programs across USG R&D organizations, academia, and industry."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.861"
                                            },
                                            "Text": {
                                                "val": "This project will initiate and support MINSEC activities in the COTS programmable integrated circuit co-development technical focus area, to include a pilot program to secure design capabilities using commercially-available cloud-based services and supply chain tools with\/at commercial co-development partners.  These activities with key industry partners will support secure co-design efforts of their components’ security features and capabilities that are required to meet future DoD needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "159.651"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "159.651"
                                            },
                                            "Text": {
                                                "val": "This project will continue the following R&D activities in the COTS programmable IC co-development focus area:\n• Pilot secure co-design capabilities and supply chain tools using commercially-available cloud-based services with\/at commercial co-development partners to secure commercial IP.\n• Develop and promote security features and software and hardware assurance tools and capabilities that meet future DoD needs.\n• Support proactive awareness and security of the microelectronics supply chain including supply chain intelligence\/counterintelligence, crypto-provenance\/tracking, informed authorities, and standards.\n• Stand up a small targeted team, co-led by DoD and the Office of the Director of National Intelligence, to define the full end-to-end supply chain issues and address critical security threats.\n• Leverage and enhance investments from local, state, federal government, and industry to develop domestic and agile high-mix, low-volume microelectronics manufacturing and packaging capabilities.\n\nThis project will engage early on with potential stakeholders to identify potential transition issues and aid in transition through joint collaboration between research teams and stakeholders with a focus on evaluations of prototypes, test articles, and beta versions of tools, IP, techniques, methods, etc. and their use in operationally-realistic scenarios."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional FY 2019 funding in the amount of $40 million was added to support acceleration efforts for MINSEC COTS co-development activities.  FY 2020 funding in the amount of $118 million was added to support a high-mix, low-volume enhanced microelectronics manufacturing domestic capability and a proactive awareness and security effort to identify and mitigate critical microelectronics supply chain threats."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance for this project is monitored in the following ways:\n• Expanded access to leading SOTA technology and enhanced availability of essential SOTP design and fabrication capabilities.\n• Number of qualified SOTA IP and COTS programmable devices for DoD applications.\n• Test articles for JFAC verification and validation.\n• Number of secure design environment pilots\/programs initiated.\n• Expanded library of assured IP and security features for DoD use.\n• Number of DoD and other USG programs employing assured access to SOTP and SOTA technologies, design approaches, and best practices developed in cooperation with commercial partners."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Microelectronics Innovation for National Security and Economic Competitiveness (MINSEC) Innovation and Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DARPA, Air Force, Army, Navy, NSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "80.861"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "159.651"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "159.651"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "MINSEC Enhancement and Demonstration"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "COTS programmable integrated circuit co-development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Government and industry engagement"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain policy and guidance development\/update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}