{
    "id": "2020-AirForce-PB-3600-MJBOOK-1-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-97",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605807F"
        },
        "ProgramElementTitle": {
            "val": "Test and Evaluation Support"
        },
        "R1LineNumber": {
            "val": "128"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "735.688"
            },
            "CurrentYear": {
                "val": "692.784"
            },
            "BudgetYearOne": {
                "val": "717.895"
            },
            "BudgetYearOneBase": {
                "val": "717.895"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "721.615"
            },
            "BudgetYearThree": {
                "val": "761.252"
            },
            "BudgetYearFour": {
                "val": "765.736"
            },
            "BudgetYearFive": {
                "val": "779.877"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides resources to operate the Air Force Test Center (AFTC) test activities which are included in the Department of Defense (DoD) Major Range and Test Facility Base (MRTFB).  Test facilities\/capabilities include wind tunnels, rocket and jet engine test cells, hypersonic and subsonic testing, modeling and simulation, technology, limited space environmental simulation chambers, armament test ranges, hardware-in-the-loop test facilities, climatic test facilities, avionics test facilities, aircraft testbeds, dry lake bed landing sites, instrumented test ranges, and test aircraft maintenance, as well as USAF Test Pilot School.  \n\nTest and Evaluation (T&E) Support funds institutional test infrastructure activities including:  Command and supervisory staffs; supply stocks; maintenance, repair, and replacement of worn or obsolete test equipment and facilities; test infrastructure for data collection, transmission, reduction, and analysis; civilian salaries; temporary duty travel; range operations and material support contract costs for hardware and software engineering and maintenance; and minor improvement and modernization projects.  It also funds institutional test aircraft depot level maintenance such as:  Programmed Depot Maintenance (PDM), the calendar-based cyclic scheduling of aircraft into depots for update\/inspection; modifications and any other depot level repairs required by the aircraft System Program Directors (SPD); engine overhauls; depot-provided area assistance; and assorted ground support equipment overhauls.  \n\nWithin AFTC there are three test wings. The first is Arnold Engineering and Development Complex (AEDC), located at Arnold Air Force Base (AFB), TN. The AEDC institutional test infrastructure supports operations of the largest complex of ground test facilities in the world (including transonic, supersonic, and hypersonic wind tunnels; rocket motor and turbine engine test cells; space environmental test chambers, hyper ballistic ranges; and other specialized facilities). AEDC also supports geographically separated facilities which include the National Full-Scale Aerodynamic Complex (NFAC) located at NASA's AMES Research Center, California, Tunnel 9 located at White Oak, Maryland, and the McKinley Climatic Lab located on Eglin AFB, Florida. The 412 Test Wing (TW) is located at Edwards AFB, CA. Its institutional test infrastructure supports weapons system development and operational test and evaluation for aircraft, aircraft subsystems and aircraft weapon systems, aerospace research vehicles, unmanned miniature vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, communications, information operations, and Electronic Warfare (EW) systems for DoD and allied forces.  The 412TW mission also includes the USAF Test Pilot School. Lastly, the 96 TW, located at Eglin AFB, FL, is a joint test and training complex comprised of 724 square miles of land area, and approximately 123,000 square miles of water area. The 96TW provides the institutional test infrastructure required to conduct developmental and operational test and evaluation of non-nuclear air armaments (including aircraft guns, ammunition, and air-to-surface and air-to-air guided munitions); Command, Control, Communications, Computers and Intelligence\/Surveillance\/Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; and special operations aircraft systems.  96TW provides a scientific test process that supports the development, production, sustainment, and enhancement of munitions systems that support tri-service digital weapons development. T&E support services contracts are awarded on the basis of full and open competition.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 6, RDT&E Management Support because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "678.289"
                },
                "CurrentYear": {
                    "val": "692.784"
                },
                "BudgetYearOne": {
                    "val": "719.900"
                },
                "BudgetYearOneBase": {
                    "val": "719.900"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "735.688"
                },
                "CurrentYear": {
                    "val": "692.784"
                },
                "BudgetYearOne": {
                    "val": "717.895"
                },
                "BudgetYearOneBase": {
                    "val": "717.895"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "57.399"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.005"
                },
                "BudgetYearOneBase": {
                    "val": "-2.005"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "57.399"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.005"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.005"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18:  Test and Evaluation Support received $57.4 million in Congressional adds. $23.0 million was provided for a one-time increase to the Flying Hour Program to supports the AFMC test fleet. $4.4 million was a program increase to support weapon system cyber resiliency test and evaluation. The remaining $30.0 million was a general program increase that is being used to address budget shortfalls in areas such as facility security upgrades and operations.  \n\nFY20:  $2.005 million decrease due to civ pay reprice ($3.633 million decrease),fuel reprice ($1.820 million increase), and increase of 0.060 million to support the Dynamic Radar Cross Section (RCS) Range investment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "6606TG"
                    },
                    "ProjectTitle": {
                        "val": "704th Test Group"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.485"
                        },
                        "CurrentYear": {
                            "val": "37.558"
                        },
                        "BudgetYearOne": {
                            "val": "37.948"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.948"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "38.633"
                        },
                        "BudgetYearThree": {
                            "val": "44.843"
                        },
                        "BudgetYearFour": {
                            "val": "43.956"
                        },
                        "BudgetYearFive": {
                            "val": "41.282"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project infrastructure support is provided for the unique capabilities of the 704th Test Group (TG) facilities: Central Inertial and Global Positioning System (GPS) Test Facility (CIGTF\/746th Test Squadron), the Holloman High Speed Test Track (HHSTT\/846th Test Squadron) and the National Radar Cross Section (RCS) Test Facility (NRTF\/704 TG Det 2), the 586th Flight Test Squadron including Detachment 1 (Det 1), 704 TG Operating Location (704 TG OL-AA) at Kirtland AFB, and 704 TG Operation Location (704 TG OL-AC) at Wright-Patterson AFB.  \n\nCIGTF provides independent test and evaluation of inertial, Global Positioning System, and integrated systems used for aircraft navigation and missile guidance systems, including vulnerability to electronic interference.  \n\nHHSTT capabilities include full-scale testing in flight representative environments, realistic live-fire simulations, test item and target fragment recovery, precision trajectory analysis and high speed photography.  \n\nNRTF provides radar cross section (RCS) monostatic and bistatic amplitude and phase measurements, antenna pattern measurements, glint and near field measurements for low observable targets.  \n\nThe 586th Flight Test Squadron executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.  Det 1 provides the liaison function for coordinating and scheduling all US Air Force test and training operations at White Sands Missile Range (WSMR).  OL-AA provides test support for the Air Force Research Lab (AFRL) Directed Energy Division.  \n\nThe 704 TG OL-AC includes the Landing Gear Test Facility (LGTF) with capabilities such as variable and fixed inertia dynamometers, compression\/tension load applicators, 4 drop towers, a burst pit and a dynamic load simulator.  The 704 TG OL-AC also includes the Air Vehicle Survivability Office that provides support for Air Force aircraft acquisition programs.  The 704th TG support services contracts are awarded on the basis of full and open competition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "704th Test Group"
                                    },
                                    "Description": {
                                        "val": "Provide infrastructure at the 704th Test Group (TG) to support testing of DoD, other Government Agencies, foreign military sales, and commercial weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.485"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.558"
                                            },
                                            "Text": {
                                                "val": "Total consists of utilities, contractor services, and civilian pay."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.948"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.948"
                                            },
                                            "Text": {
                                                "val": "Total consists of utilities, contractor services, and civilian pay."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Not applicable."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6606TS"
                    },
                    "ProjectTitle": {
                        "val": "Test and Evaluation Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "698.203"
                        },
                        "CurrentYear": {
                            "val": "655.226"
                        },
                        "BudgetYearOne": {
                            "val": "679.947"
                        },
                        "BudgetYearOneBase": {
                            "val": "679.947"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "682.982"
                        },
                        "BudgetYearThree": {
                            "val": "716.409"
                        },
                        "BudgetYearFour": {
                            "val": "721.780"
                        },
                        "BudgetYearFive": {
                            "val": "738.595"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides resources to operate the Air Force Test Center (AFTC) test activities which are included in the Department of Defense (DoD) Major Range and Test Facility Base (MRTFB).  Test facilities\/capabilities operated through this program include wind tunnels, rocket and jet engine test cells, hypersonic and subsonic testing, modeling and simulation, technology, limited space environmental simulation chambers, armament test ranges, hardware-in-the-loop test facilities, climatic test facilities, avionics test facilities, aircraft testbeds, dry lakebed landing sites, instrumented test ranges, and test aircraft maintenance, as well as USAF Test Pilot School.  \n\nTest and Evaluation (T&E) Support funds institutional test infrastructure activities including:  Command and supervisory staffs; supply stocks; maintenance, repair, and replacement of worn or obsolete test equipment and facilities; test infrastructure for data collection, transmission, reduction, and analysis; civilian salaries; temporary duty travel; range operations and material support contract costs for hardware and software engineering and maintenance; and minor improvement and modernization projects.  It also funds institutional test aircraft depot level maintenance such as:  Programmed Depot Maintenance (PDM), the calendar-based cyclic scheduling of aircraft into depots for update\/inspection; modifications and any other depot level repairs required by the aircraft System Program Directors (SPD); engine overhauls; depot-provided area assistance; and assorted ground support equipment overhauls.  \n\nThe AFTCs three test wings are supported by this project:  (1) Arnold Engineering and Development Complex (AEDC), located at Arnold Air Force Base (AFB), TN, whose institutional test infrastructure supports operations of the largest complex of ground test facilities in the world (includes transonic, supersonic, and hypersonic wind tunnels;rocket motor and turbine engine test cells; space environmental test chambers, hyperballistic ranges; and other specialized facilities). Included are operations at the National Full-Scale Aerodynamic Complex (NFAC) located at NASA's AMES Research Center, California as well as operations at Tunnel 9 located at White Oak, Maryland.(2) 412 Test Wing (TW), located at Edwards AFB, CA, whose institutional test infrastructure supports weapons system development and operational test and evaluation for aircraft, aircraft subsystems and aircraft weapon systems, aerospace research vehicles, unmanned miniature vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, communications, information operations, and Electronic Warfare (EW) systems for DoD and allied forces.  The 412TW mission includes the USAF Test Pilot School.  (3) 96 TW, located at Eglin AFB, FL, is a joint test and training complex of 724 square miles of land area, and approximately 123,000 square miles of water area.  96TW provides the institutional test infrastructure required to conduct developmental and operational test and evaluation of non-nuclear air armaments (including aircraft guns, ammunition, and air-to-surface and air-to-air guided munitions); Command, Control, Communications, Computers and Intelligence\/Surveillance\/Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; the McKinley Climatic Lab, multi-service climatic simulation capability, located at Eglin AFB, FL; and special operations aircraft systems.  96TW provides a scientific test process that supports the development, production, sustainment, and enhancement of munitions systems that support tri-service digital weapons development. T&E support services contracts are awarded on the basis of full and open competition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AEDC, 412TW, 96TW"
                                    },
                                    "Description": {
                                        "val": "Provide infrastructure to support testing at Arnold Engineering and Development Complex (AEDC), the 412TW and USAF Test Pilot School at Edwards AFB, and the 96TW at Eglin AFB."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "698.203"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "655.226"
                                            },
                                            "Text": {
                                                "val": "Total consists of utilities, contractor services, civilian pay, and the test and evaluation flying hour program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "679.947"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "679.947"
                                            },
                                            "Text": {
                                                "val": "Total consists of utilities, contractor services, civilian pay, and the test and evaluation flying hour program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "$24.721 million increase due to an increase in the F-15 Aircraft Flying Hour Program ($5 Million), addition of Periodic Depot Maintenance funds for a B-1B Aircraft ($8.8 Million), and increase for the Joint Simulation Environment ($10.6 Million), with minor adjustments to pay, fuel, and inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}