{
    "id": "2020-AirForce-PB-3600-JBOOK-9cab6ddab5e5dde0a5f3a422686e60d747cb1b2bb20d871dd7edec860a0b0bf3-28",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603788F"
        },
        "ProgramElementTitle": {
            "val": "Battlespace Knowledge Development and Demonstration"
        },
        "R1LineNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "45.481"
            },
            "CurrentYear": {
                "val": "60.017"
            },
            "BudgetYearOne": {
                "val": "56.414"
            },
            "BudgetYearOneBase": {
                "val": "56.414"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "56.746"
            },
            "BudgetYearThree": {
                "val": "60.569"
            },
            "BudgetYearFour": {
                "val": "62.299"
            },
            "BudgetYearFive": {
                "val": "63.968"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates Air Force enterprise-centric information technologies for the warfighter. The Anticipatory Operations Intent and Response project develops the technologies for dynamic planning and execution with the accuracy, fidelity, and timeliness needed to dominate the battlespace. The Assured Worldwide Connectivity project provides advanced net-enabled architectures and communications technologies in support of global military operations, including a secure information grid for worldwide information exchange of near-real-time multimedia (i.e., voice, data, video, and imagery) information. In addition, this project develops and demonstrates advanced optical networking and communications for Air Force air and space-based information exchange on and between platforms. These optical networks will be rapidly deployable, mobile, interoperable, and seamless between Air and Space Operations Centers (AOCs) and air and space- based platforms either en route or in theater. This project also provides tools and applications leading to the development and integration of cyber deterrence technologies resulting in a strategic capability of cyber dominance within the secure information grid. The Global Battlespace Awareness project develops, integrates, and demonstrates advanced technologies to achieve comprehensive net-centric operations and total battlespace awareness by using and exploiting information from all sources. The Knowledge Management and Computing project develops the technology applications that will provide for a secure, tailored, seamless exchange of information among producers, consumers, and managers of information relevant to a particular community of interest (COI). The project also provides the development of interactive and real-time computing technologies that greatly improve the usability of high-performance computing for the exchange, utilization, and management of information in the enterprise. The Cyber Battlespace Development and Demonstration project develops the ability to deliver sovereign options in cyberspace through the development and integration of cyber attack, cyber defense, and cyber support technologies for a strategic capability of cyber dominance.\n\nThe National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. Operational agility will require flexibility (manifested as multi-domain operations), speed (manifested as superior decision speed), coordination (manifested as dynamic command and control), balance (manifested as presenting a balanced capability mix), and strength (manifested as performance-optimized teams). In order to enable operational agility, this program will begin to shape future research and development (R&D) to focus on technologies in support of operational agility through multi-domain command and control (MDC2) capabilities.\n\nThis program has been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication.\n\nIn FY 2020, Project 635319, Anticipatory OPS Intent and Response efforts will be transferred to Project 635321, C4I Battlespace Dev and Demo, in order to realign planning and decision support advanced technology development.\n\nIn FY 2020, Project 635320, Assured Worldwide Connectivity efforts will be transferred to Project 635321, C4I Battlespace Dev and Demo, in order to realign intelligent networking transport and management advanced technology development.\n\nIn FY 2020, Project 635322, Knowledge Management and Computing efforts will be transferred to Project 635321, C4\/Battlespace Dev and Demo, in order to realign information management advanced technology development.\n\nIn FY 2020, Project 635321 C4I Battlespace Dev and Demo changed from Global Battlespace Awareness.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.011"
                },
                "CurrentYear": {
                    "val": "51.064"
                },
                "BudgetYearOne": {
                    "val": "56.961"
                },
                "BudgetYearOneBase": {
                    "val": "56.961"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.481"
                },
                "CurrentYear": {
                    "val": "60.017"
                },
                "BudgetYearOne": {
                    "val": "56.414"
                },
                "BudgetYearOneBase": {
                    "val": "56.414"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.530"
                },
                "CurrentYear": {
                    "val": "8.953"
                },
                "BudgetYearOne": {
                    "val": "-0.547"
                },
                "BudgetYearOneBase": {
                    "val": "-0.547"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.029"
                    },
                    "CurrentYear": {
                        "val": "-0.047"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "9.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.580"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.921"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.547"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.547"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2018 in Other Adjustments is due to realignment of funds to PE 0602212F to support Research and Development Projects, 10 U.S.C. Section 2358."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635319"
                    },
                    "ProjectTitle": {
                        "val": "Anticipatory OPS Intent and Response"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.709"
                        },
                        "CurrentYear": {
                            "val": "6.099"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.808"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In order to achieve information dominance, the Air Force must be able to monitor, assess, plan, and execute missions rapidly across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict (pre-conflict, conflict through stability operations). This project develops and integrates decision support technologies that will enhance the commander's ability to anticipate and dominate the future battlespace by more effectively forecasting the evolution of the battlespace and by more rapidly generating options to \"virtually checkmate\" the adversary. It develops the decision aid technologies and processes to plan the use of various assets and assess their effects in the battlespace. It provides a tailorable information environment to effectively portray complex data sets accurately in real-time.\n\nThe National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on technologies in support of multi-domain command and control.\n\nIn FY 2020, Project 635319, Anticipatory OPS Intent and Response efforts will be transferred to Project 635321, C4I Battlespace Dev and Demo in order to realign technology areas that better support both the Air Force Future Operating Concept and National Defense Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Planning and Decision Tools"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate the integration of planning tools and information-based intelligent agents for adaptive replanning and decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.825"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.739"
                                            },
                                            "Text": {
                                                "val": "Continue to execute experiments, based on operational scenarios, which incorporate process management execution into the extensible Space command and control framework, and which integrate disparate data and applications, providing a pedigree for proposed tasking options to decision makers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work is performed under the Multi-Domain Command and Control effort within Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $1.739 million. Funding decreased due to realignment of adaptive planning and decision support tool research under Project 635321, C4I Battlespace Dev and Demo."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Planning and Assessment Tools"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an effects-based approach for the next generation of planning and assessment techniques that enable decision makers to determine operational effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.884"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.360"
                                            },
                                            "Text": {
                                                "val": "Continue to develop software capabilities that employ cyber, directed energy, and electronic warfare weaponry. Provide on-the-fly valuable quantitative evaluations of cyber assets to cyber operators, enabling them to present viable cyber options to commanders in multi-domain settings. Identify and implement state of the art learning models. Develop data-efficient learning.  Integrate within the StreamlinedML framework. Develop end-to-end baseline learning capability. Develop model recommendation & user workflow capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work is performed under both Multi-Domain Command and Control, and Artificial Intelligence\/Autonomy\/Machine Learning efforts within Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $4.360 million. Funding decreased due to realignment of planning and assessment tool development under Project 635321, C4I Battlespace Dev and Demo."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635320"
                    },
                    "ProjectTitle": {
                        "val": "Assured Worldwide Connectivity"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.831"
                        },
                        "CurrentYear": {
                            "val": "21.658"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "34.489"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires advanced, net-enabled architectures and communications technologies in support of global kinetic and non-kinetic military operations, including a secure information grid for worldwide information delivery and exchange of near-real-time information including voice, data, video, and imagery.  This secure environment will be rapidly deployable, mobile, interoperable, and seamless between the Air Operations Center and aircraft, either en route or in theater.  This project provides secure information transmission capabilities for a persistent, global, survivable communications backbone network accessible for warfighters operating in all domains. It provides self-healing, self-configuration, anti-jam communication networking capabilities, and provides enterprise networking capabilities for agile, policy-based network management.  In addition, this project develops and demonstrates flight ready systems consisting of high capacity radio frequency (RF) and optical components and architectures for next generation communications.\n\nThe National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. In order to enable multi-domain operations, the Air Force requires world-wide connectivity that is resilient and self-healing in the face of enemy attacks on communication and information assurance, able to withstand breaks in connectivity while still allowing users to collaborate with other connected operators to maintain localized situational awareness. The network balances the respective strengths of both forward-deployed forces and rear-based nodes.\n\nIn FY 2020, Project 635320, Assured Worldwide Connectivity efforts will be transferred to Project 635321, C4I Battlespace Dev and Demo in order to realign technology areas that better support both the Air Force Future Operating Concept and National Defense Strategy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase - Assured Worldwide Connectivity"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not Applicable"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "9.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally directed efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Connectivity Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate intelligent networking transport and management technology to provide assured, seamless, battlespace connectivity to the Air Force tailored to anti-access\/area denial environments and contested operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.831"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.658"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration for rapid waveform development of multi-mission radio frequency capability. Continue Wideband high frequency waveform development and testing. Investigate ionospheric research, propagation modeling and simulation. Perform beacon data collection on both the V and W frequency bands along with waveform development and simulation. Perform airborne testing of very low frequency software defined radio. Develop test platform for Common Very Low Frequency Receiver Increment Two. Demonstrate directional networking prototype. Demonstrate the Variable Rate - multiple-input and multiple-output clustered delay line technology and a targeting and force protection operational demonstration of integrated and field tested tactical-to-enterprise information management services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work is performed under both Assured Communications & Networks and Nuclear C3 Modernization efforts within Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $12.658 million. Funding decreased due to realignment of intelligent networking transport and management technology development under Project 635321, C4I Battlespace Dev and Demo."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635321"
                    },
                    "ProjectTitle": {
                        "val": "C4I Battlespace Dev and Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.429"
                        },
                        "CurrentYear": {
                            "val": "11.242"
                        },
                        "BudgetYearOne": {
                            "val": "36.303"
                        },
                        "BudgetYearOneBase": {
                            "val": "36.303"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "35.564"
                        },
                        "BudgetYearThree": {
                            "val": "37.095"
                        },
                        "BudgetYearFour": {
                            "val": "38.153"
                        },
                        "BudgetYearFive": {
                            "val": "39.173"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on technologies in support of multi-domain command and control.\n\nIn order to achieve operational agility, the Air Force must be able (a) to monitor, assess, plan, and execute missions rapidly across the full spectrum of operations at all levels of war and during all phases of conflict; (b) to field advanced, secure, net-enabled architectures and communications\/network technologies in support of persistent, global, and survivable kinetic and non-kinetic military operations; (c) to process and exploit data and information from a variety of sources and domains to create a common operating picture of the battlespace; and (d) to provide the decision maker and staff with seamless access to tailored information within a mobile, dynamic, and scalable, globally distributed Air Operations Center, as well as among other producers, consumers, and managers of information relevant to other particular Communities of Interest (COI).\n\nIn FY 2020, Project 635319, Anticipatory OPS Intent and Response efforts will be transferred to Project 635321, C4I Battlespace Dev and Demo in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept.\n\nIn FY 2020, Project 635320, Assured Worldwide Connectivity efforts will be transferred to Project 635321, C4I Battlespace Dev and Demo in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept.\n\nIn FY 2020, Project 635322, Knowledge Management and Computing efforts will be transferred to Project 635321, C4I Battlespace Dev and Demo in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept.\n\nIn FY 2020, Project 635321 renamed from Global Battlespace Awareness to C4I Battlespace Dev and Demo."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Signal and Data Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Demonstrate advanced signal and data exploitation technologies for detection, tracking, identification, and targeting of time-critical targets, and information extraction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.517"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.168"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and test technologies for ultra-wideband electronics intelligence signal detection and prosecution. Demonstrate enhanced emitter feature extraction capabilities. Demonstrate automated electronics intelligence analysis tool sets. Complete development, integrate, and demonstrate cyber-physical measurement and signature intelligence capabilities with the Twenty-Fifth Air Force and United States Special Operations Command as transition partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work is performed under the Data to Decisions effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $5.168 million. Funding decreased due to realignment of advanced signal and data exploitation development to the Data to Decisions effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Data Handling, Visualization and Distributed Data Fusion"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced data handling, event visualization technologies, and distributed data fusion to enable a more effective utilization of data available."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.365"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.363"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of intelligence analysis capabilities from multiple intelligence sources for both near-real time and post mission. Continue research and development in data analytics and strategic indications and warnings.  Demonstrate Seeded Language Modeling demonstration. Advance investigations of real-time deep learning algorithms. Perform service-based capability development. Complete cloud based data and information sharing environment.  Continue with Object Based Production optimized processing and automated-association capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work is performed under the Data to Decisions effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $4.363 million. Funding decreased due to realignment of data handling, event visualization, and distributed data fusion development to the Data to Decisions effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Text Exploitation"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate capabilities for reasoning and learning, text understanding, link and group discovery, and advanced analysis for situational awareness and understanding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.977"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2019, this work is performed under the Advanced Signal and Data Exploitation Technologies effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Not Applicable"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adversary Courses of Action"
                                    },
                                    "Description": {
                                        "val": "Develop models to provide detailed understanding of the adversary's probable intent and future strategy to identify adversary courses of action, the most likely course of action, and the course of action most dangerous to friendly forces and mission accomplishment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.570"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.711"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of full-spectrum targeting and intelligence software tools. Perform operational testing and experimentation on developed semantic capabilities and provide a cross-organization work-flow within intelligence and targeting software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work is performed under the Multi-Domain Command and Control effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $1.711 million. Funding decreased due to realignment of all model and course of action development to the Multi-Domain Command and Control effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Domain Command and Control"
                                    },
                                    "Description": {
                                        "val": "Perform research and development (R&D) that will advance existing, or discover new, command and control capabilities to support multi-domain operations (MDO) for air, space, cyberspace, land, sea, and undersea."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under both Adaptive Planning and Decision Tools and Next Generation Planning and Assessment Tools efforts within Project 635319, Anticipatory OPS Intent and Response, and, under the Adversary Courses of Action effort within Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.418"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.418"
                                            },
                                            "Text": {
                                                "val": "Continue to execute experiments, based on operational scenarios, which incorporate process management execution into the extensible Space command and control framework, and which integrate disparate data and applications, providing a pedigree for proposed tasking options to decision makers. Continue to develop software capabilities that employ cyber, directed energy, and electronic warfare weaponry. Provide on-the-fly valuable quantitative evaluations of cyber assets to cyber operators, enabling them to present viable cyber options to commanders in multi-domain settings."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $8.418 million. Funding increased due to realignment of  adaptive planning, decision support, effects-based planning and assessment tool development from Project 635319, Anticipatory OPS Intent and Response, and from the Adversary Courses of Action effort within Project 635321, C4I Battlespace Dev and Demo."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear C3 Modernization"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate the advancement of existing nuclear capable forces to ensure command, control, and connectivity for the President without constraints."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this is performed under the Connectivity Technologies effort within Project 635320, Assured Worldwide Connectivity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.804"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.804"
                                            },
                                            "Text": {
                                                "val": "Continue to perform real-time monitoring of ionospheric conditions over the Continental United States (CONUS). Continue testing of very-low-frequency (VLF) stubb antenna for reachback. Continue testing of prototype compact high-frequency (HF) antennas."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $4.804 million. Funding increased due to the realignment of nuclear command, control, and communications development from Project 635320, Assured Worldwide Connectivity."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Artificial Intelligence\/Autonomy\/Machine Learning"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate to harness the speed and scale of computers and machines to address problems of complexity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under the Next Generation Planning and Assessment Tools effort within Project 635319, Anticipatory OPS Intent and Response."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.295"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.295"
                                            },
                                            "Text": {
                                                "val": "Continue to identify and implement state of the art learning models. Continue development of data-efficient learning.  Continue to integrate within the StreamlinedML framework. Continue development of end-to-end baseline learning capability. Continue development of model recommendation & user workflow capabilities. Continue investigations of real-time deep learning algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $5.295 million. Funding increased due to realignment of artificial intelligence, autonomy, and machine learning development from Project 635319, Anticipatory OPS Intent and Response."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data to Decisions"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate the collection, management, analysis, and exploitation of complex data for availability to Air Force and other stakeholders."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under both the Advanced Signal and Data Exploitation Technologies and the Advanced Data Handling, Visualization and Distributed Data Fusion efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.254"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.254"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and test technologies for ultra-wideband electronics intelligence signal detection and prosecution. Continue development and demonstration of intelligence analysis capabilities from multiple intelligence sources for both near-real time and post mission. Continue research and development in data analytics and strategic indications and warnings. Perform service-based capability development. Continue with Object Based Production optimized processing and automated-association capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $7.254 million. Funding increased due to realignment of open source and intelligence complex data set collection, management, analysis, and exploitation tool development within both the Advanced Signal and Data Exploitation Technologies and the Advanced Data Handling, Visualization and Distributed Data Fusion efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured Communications & Networks"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure and reliable communications to ensure the delivery of timely, reliable, and actionable information to warfighters and systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this effort performs the work under the Connectivity Technologies effort within Project 635320, Assured Worldwide Connectivity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.532"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.532"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration for rapid waveform development of multi-mission radio frequency capability. Continue Wideband high frequency waveform development and testing. Investigate ionospheric research, propagation modeling and simulation. Continue beacon data collection on both the V and W frequency bands along with waveform development and simulation. Continue airborne testing of very low frequency software defined radio. Continue development of test platform for Common Very Low Frequency Receiver Increment Two."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $10.532 million. Funding increased due to realignment of all secure and reliable communications development from Project 635320, Assured Worldwide Connectivity."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635322"
                    },
                    "ProjectTitle": {
                        "val": "Knowledge Management and Computing"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.299"
                        },
                        "CurrentYear": {
                            "val": "3.782"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.081"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that will provide the decision maker and staff with seamless access to tailored information within a mobile, dynamic, and scalable, globally distributed Air Operations Center, as well as among other producers, consumers, and managers of information relevant to other particular Communities of Interest (COI).  This project demonstrates the enterprise management capabilities needed for the rapid distribution of actionable information, as well as the needed advances in high performance computing to ensure this complex capability.  This project develops an agile information environment that focuses on quality of service, transformation and brokering, a federated information environment focusing the relationship among the members of the environment, a secure cross-domain information sharing capability that focuses on the security layer and inter-COI information exchange in different security domains, and a collaboration environment focusing on the information workflow layer of the enterprise.\n\nThe National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on technologies in support of multi-domain command and control.\n\nIn FY 2020, Project 635322, Knowledge Management and Computing efforts will be transferred to Project 635321, C4I Battlespace Dev and Demo in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Information Management"
                                    },
                                    "Description": {
                                        "val": "Demonstrate how a publish, subscribe, and query information management paradigm can enable vertical and horizontal integration of Air Force information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.299"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.782"
                                            },
                                            "Text": {
                                                "val": "Continue plans to develop, demonstrate and transition information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared situational awareness across the theater of war for targeting and force protection operations. Continue with capability enhancements and technology hardening based on operational user assessments and collaboration. Execute a Technology Readiness Level 6 targeting and force protection operational demonstration of integrated and field tested tactical-to-enterprise information management services. Improve and update runway survey toolkit plug-in to aid aircraft runway surveys in austere locations. Spearhead geo-location capabilities in Global Positioning System denied environments using elevation, formations, and constellations. Ensure transition and hand-off special tactics plug-ins with Air Force Life Cycle Management Center support to the Battlefield Airman System Program Office."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work is performed under the Multi-Domain Command & Control effort within Project 635321, C4I Battlespace Dev and Demo."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $3.782 million. Funding decreased due to realignment of all information management technology development under Project 635321, C4I Battlespace Dev and Demo."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635329"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Battlespace Dev & Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.213"
                        },
                        "CurrentYear": {
                            "val": "17.236"
                        },
                        "BudgetYearOne": {
                            "val": "20.111"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.111"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.182"
                        },
                        "BudgetYearThree": {
                            "val": "23.474"
                        },
                        "BudgetYearFour": {
                            "val": "24.146"
                        },
                        "BudgetYearFive": {
                            "val": "24.795"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires the ability to deliver sovereign options in cyberspace through the development and integration of cyber-attack, cyber defense, and cyber support technologies for a strategic capability of cyber dominance. This project develops the ability to deliver cyber-attack capabilities (access, stealth, persistence, intelligence, and weapons delivery), cyber defense capabilities (attack detection, attack attribution, and response automation) and cyber support capabilities (situation awareness and war gaming).  This project will also develop 1) a science and engineering capability demonstrating new models of computation, 2) novel approaches for high performance, interactive, net-centric, distributed and embedded computing systems, and 3) the technological tools enabling affordable, large-scale, and complex software-intensive systems.\n\nThe National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on cyber technologies in support of multi-domain command and control."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Offense"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate offensive cyber operations capabilities in a series of experimental technology demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.244"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.881"
                                            },
                                            "Text": {
                                                "val": "Continue to develop systems to identify items of interest associated with the Internet of Things. Facilitate the development of a counter small unmanned aerial system open architecture specification to enable interoperability between disparate protection systems. Demonstrate ground-based and airborne delivery of mitigation (disrupt, deny, degrade, destroy, or deceive) effects, both cyber and physical\/kinetic. Integrate and transition multiple Air Force Research Laboratory and Air Force Lifecycle Management Center counter small unmanned aerial system capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work is performed under the Cyber Power Projection effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $3.881 million. Funding decreased due to realignment of offensive cyber development to Cyber Power Projection effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Effects-based Cyber Defense"
                                    },
                                    "Description": {
                                        "val": "Integrate technology to demonstrate an effects-based strategic approach to cyber defense that focuses on avoiding, deterring, and minimizing the threat, and rendering the adversary ineffective."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.084"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This effort was completed in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Not Applicable"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resiliency"
                                    },
                                    "Description": {
                                        "val": "Integrate and demonstrate a resilient and self-generating information enterprise that dynamically recognizes, characterizes, and understands novel cyber attacks, and then reconfigures and self-optimizes itself to resist new attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.997"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.464"
                                            },
                                            "Text": {
                                                "val": "Develop and evolve software capabilities and Concept of Operations for active guidance and automated processes addressing cyber resiliency and survivability using a relevant system laboratory. Continue capability migration to form factors which more readily align with operational systems. Demonstrate automated cyber survivability using integrated cyber technologies within the operational system laboratory in the context of risk management framework requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.339"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.339"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and evolve of software capabilities and Concept of Operations for active guidance and automated processes addressing cyber resiliency and survivability. Continue to advance capability migration to form factors which more readily align with operational systems. Continue to demonstrate automated cyber survivability using integrated cyber technologies within the operational system laboratory in the context of risk management framework requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.125 million. Justification for this decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Game Changing Computing Power"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate computer architectures with greater capacity and sophistication to enable game-changing computing power to the warfighter anywhere, anytime."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.663"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.779"
                                            },
                                            "Text": {
                                                "val": "Develop inherently trusted and resilient embedded computing. Improve software specifications using evolutionary approaches and make them inherently tolerant to the unexpected or unforeseen. As part of a trusted and resilient architecture, test and document the secure processor (T-CORE) cyber defenses and other features. Provide support to transition partners and application programmers or the T-CORE specification. Release T-CORE version 2. Continue with Robust Machine Learning upgrades and development. Demonstrate a trusted and resilient embedded system (e.g. autonomous vehicle) that is capable of identifying, localizing and automatically repairing previously unknown or unintended vulnerabilities in the software that is used to support the mission and fight through zero day attacks that exploit these vulnerabilities to cause harm and\/or failure to the mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.962"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.962"
                                            },
                                            "Text": {
                                                "val": "Continue to sustain development of inherently trusted and resilient embedded computing. Continue to improve software specifications using evolutionary approaches and make them inherently tolerant to the unexpected or unforeseen. Extend Robust Machine Learning upgrades and development. Continue to demonstrate a trusted and resilient embedded system (e.g. autonomous vehicle) that is capable of identifying, localizing and automatically repairing previously unknown or unintended vulnerabilities in the software"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.183 million. Justification for this increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous, Multi-level Access and Transfer"
                                    },
                                    "Description": {
                                        "val": "Develop autonomous, secure information access and sharing capabilities required by the Air Force net-centric information enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.225"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.112"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and integrate a polyglot file identification filter to mitigate data exfiltration risk.  Continue to develop a modularized filter store to maximize filter re-usability and increase the agility of cross-domain solutions to support new file types.  Demonstrate a Commercial Solution for Classified compliant secure mobile solution that can enforce security policies beyond commercial solutions to satisfy unique Air Force requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.422"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.422"
                                            },
                                            "Text": {
                                                "val": "Extend development and integration of polyglot file identification filter to mitigate data exfiltration risk.  Sustain development of a modularized filter store to maximize filter re-usability and increase the agility of cross-domain solutions to support new file types."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.310 million. Justification for this increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Power Projection"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate offensive cyber capabilities in contested environments through a series of experiments and exercises."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under the Cyber Offense effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.388"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.388"
                                            },
                                            "Text": {
                                                "val": "Extend development of systems to identify items of interest associated with the Internet of Things. Advance the development of a counter small unmanned aerial system open architecture specification to enable interoperability between disparate protection systems. Continue to integrate and transition multiple Air Force Research Laboratory and Air Force Lifecycle Management Center counter small unmanned aerial system capabilities. Provide capability to enable the warfighter access into congested environments as directed by warfighter requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $6.388 million. Funding increased due to realignment of offensive cyber operations development from Cyber Offense effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}