{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-6",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602668D8Z"
        },
        "ProgramElementTitle": {
            "val": "Cyber Security Research"
        },
        "R1LineNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.429"
            },
            "CurrentYear": {
                "val": "14.935"
            },
            "BudgetYearOne": {
                "val": "15.118"
            },
            "BudgetYearOneBase": {
                "val": "15.118"
            },
            "BudgetYearTwo": {
                "val": "15.396"
            },
            "BudgetYearThree": {
                "val": "15.662"
            },
            "BudgetYearFour": {
                "val": "15.956"
            },
            "BudgetYearFive": {
                "val": "16.294"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Cyber Applied Research program focuses on innovative and sustained research in both cybersecurity and computer network operations by developing new concepts to harden key network and computer components, designing new and resilient cyber infrastructures, increasing the military’s ability to disrupt, fight and survive nation-state actors’ cyber-attacks, measuring the state of health in cybersecurity, exploring and exploiting new ideas in cyber warfare for agile cyber operations and mission assurance, along with the ability to protect tactical networks, weapons systems and platforms.\n\nThis program is unique in that it integrates both the defensive and offensive cyber research from each of the Services to develop interoperable, defense-wide technology options to meet Combatant Command (CCMD) needs and requirements.  More specifically, by increasing cross-laboratory collaboration, this program is able to take Service-specific technologies and expand their applications to the Joint Force."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.775"
                },
                "CurrentYear": {
                    "val": "14.969"
                },
                "BudgetYearOne": {
                    "val": "15.162"
                },
                "BudgetYearOneBase": {
                    "val": "15.162"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.429"
                },
                "CurrentYear": {
                    "val": "14.935"
                },
                "BudgetYearOne": {
                    "val": "15.118"
                },
                "BudgetYearOneBase": {
                    "val": "15.118"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.346"
                },
                "CurrentYear": {
                    "val": "-0.034"
                },
                "BudgetYearOne": {
                    "val": "-0.044"
                },
                "BudgetYearOneBase": {
                    "val": "-0.044"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.318"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.028"
                                },
                                "CurrentYear": {
                                    "val": "-0.034"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.044"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.044"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "003"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.429"
                        },
                        "CurrentYear": {
                            "val": "14.935"
                        },
                        "BudgetYearOne": {
                            "val": "15.118"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.118"
                        },
                        "BudgetYearTwo": {
                            "val": "15.396"
                        },
                        "BudgetYearThree": {
                            "val": "15.662"
                        },
                        "BudgetYearFour": {
                            "val": "15.956"
                        },
                        "BudgetYearFive": {
                            "val": "16.294"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "As adversaries develop more sophisticated technology tactics, the cyber Science and Technology (S&T) community must remain agile, vigilant, and evermore creative in response.  Starting in late FY 2016, the Office of Under Secretary of Defense for Research and Engineering (USD(R&E)) reviewed new cyber threats and the emerging needs of the joint operational community.  As a result, a new strategic vision was developed to enhance the DoD’s tactical edge in a rapidly evolving cyber domain.  Beginning in FY 2018, the following new projects were initiated in the research areas (described below): \n\n•\tBehavioral Cyber Science:  Exploring the interaction between computers and human behavior by moving beyond binary electronic signals towards understanding human behavior.  New insights from behavioral science will increase the effectiveness of tools, increase the effectiveness of the cyber workforce, and improve the utility of cyber solutions.  Behavioral cyber science seeks to uncover details about how humans (represented by operators, users, adversaries, and\/or defenders) react to cyber actions and how those reactions can be understood, from a behavioral science standpoint, and leveraged to create more effective actions and outcomes.\n\n•\tSelf-Securing Systems:  Prevailing in a contested cyber environment will require new sciences and mechanisms for autonomous cybersecurity to protect the increasingly complex weapon systems and platforms that help DoD operators react more quickly to cyber-attacks.  Exploring foundational research in self-securing systems will arm future DoD systems with the capability to proactively, autonomously, and seamlessly assess cyber threats.  Additionally, future systems will be able to deploy self-defense mechanisms to neutralize cyber-attacks, and enable blue forces to maneuver at will.  Autonomous cyber defenses will need to apply the most current advances in artificial intelligence research.\n\n•\tPrecise Cyber Effects:  Precision offensive campaigns for the cyber domain require accurate and timely predictions of cyber effects to enable DoD leadership to achieve the desired outcomes from cyber operations and help manage risks associated with collateral damage.  Exploring methods to derive quantifiable metrics will help improve the precision control of selecting cyber mission targets and raise the accuracy of effects; achieving an understanding of second and third order of effects will provide commanders with a higher confidence of success and limit collateral damage.\n\n•\tApplied Mathematics:  Advancing mathematical foundations that are intrinsically linked to all branches of cyber science and technology, will cut across focus areas producing new methods to design, secure, and reason about complex cyber systems.  This area of research will characterize the cyber domain, maintain the integrity of data, harden systems, and analyze potential solutions. \n\nAdvances in these cyber S&T areas will promote strong foundations, while disruptive innovations will create surprise, shape the fight, and ensure a decisive advantage.  The research areas are critical to the development of innovative and sustainable research that takes cybersecurity beyond the incremental escalation of attack and defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Behavioral Cyber Science"
                                    },
                                    "Description": {
                                        "val": "The point where hardware, software, and humans interact has formed a new area of research – Behavioral Cyber Science.  Research in behavioral cyber science will advance the understanding and technical rigor of modeling and predicting human responses to cyber activities which will ultimately enhance cyber operations through planning, and training.  Future research must broaden the scope beyond the impacts of cyber actions on equipment to include the impact that these cyber actions will have on human behavior and our adversary’s forces.  Just as an adversary’s behavior may be better understood using behavioral cyber science, behavioral science can be used to improve the actions of cyber defenders and the performance of the cyber workforce.  Data gleaned from observing effects of various cyber operations on users’ productivity, performance, and security will help the DoD design better techniques and processes for use in cyber defense and operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.614"
                                            },
                                            "Text": {
                                                "val": "Begin execution of Joint research effort aimed at addressing scientific challenges, to broaden the scope of cyber activities through an understanding of human behavioral sciences and its responses to cyber effects.  Research will focus on human performance for cyber, developing techniques to measure effectiveness of cyber tools and cyber mission planning based on behavior of network defenders; human responses to cyber effects, identifying and documenting human responses to cyber defense and offense activities; and evidence-based validation, which identifies behavioral responses to network activity that correlate with information on network security and readiness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "\"Performance Assessment Suite for the Cyber Mission Force” project will develop an analytics platform to accommodate future sensors, interactive data-mining, and workflow monitoring plug-ins.  The initial framework for platforms will be developed for U.S. Cyber Command and tested in-house using observer tablets.  Research will build a better understanding of the cyber information environment by developing Cyber Mission Force (CMF) knowledge acquisition and observational assessments. \n\n\"Designing a Contextualized Operator Perspective (COP) to Enable Joint Cyber Operations” project identifies key cyber terrain, defined as the overlap between protected mission’s system needs and the supporting network, to uncover potential threats for Cyber Protection Team (CPT).  The discovery supports CPT analyses for developing technical and data requirements for preliminary work support systems.  The research measures and explores aspects of situational awareness (SA) theory to determine the applicable methodologies to evaluate work support system designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.753"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.753"
                                            },
                                            "Text": {
                                                "val": "The Performance Assessment Suite project will develop a prototype of workflow monitoring, addressing human-in-the-loop protocols, by refining its design through simulation-based software.  The research will document results from laboratory and capstone experiments at U.S. Cyber Command’s Cyber Immersion Laboratory.\n\nDesigning COP will analyze explainable artificial intelligence (XAI) to enhance the capabilities of the work support system.  XAI will create a suite of machine learning techniques, enabling human users to understand, trust, and manage the emerging generation of artificially intelligent applications.  Developing XAI will provide researchers with extensive search, gathering, reviewing, and assimilating capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional resources will be used to complete development phase of projects under the Behavioral Cyber Science thrust."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Self-Securing Systems"
                                    },
                                    "Description": {
                                        "val": "The pervasive nature of software-reliant systems in today’s modern military creates new opportunities for sophisticated adversaries.  The vast majority of DoD weapons systems, platforms, and networks rely on software to operate.  Software can often be disrupted remotely, which necessitates a new kind of security to protect against such cyber-attacks.  Defending the software and network-based aspects of critical weapon systems is challenging for a number of reasons, chief among which is the advanced nature of the adversary in the cyber realm.  Future cyber adversaries will be well-funded, well-informed, and agile.  Building weapon systems, platforms, and networks that defend themselves in real time will be vital in protecting ourselves against this adversary.  The Department needs systems that can autonomously monitor and manage their own health and security posture through advanced sensing and perception, reasoning, and planning.  Such systems identify and classify threats much more quickly than a human operator, and therefore, neutralize the threat more quickly and effectively.  However, researchers must be cognizant of the potential unintended consequences of turning security over to autonomous systems.  Verification techniques must be developed to ensure that autonomous and dynamic system changes maintain correct mission-focused capabilities without introducing unintended vulnerabilities.  Conversely, developing techniques to track and audit actions taken by autonomous systems ensures that direct control can be reasserted."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.615"
                                            },
                                            "Text": {
                                                "val": "Begin execution of Joint research effort aimed at developing novel adaptive techniques to model adversary options and predict the security of future system configurations, even under unknown attacks; develop cyber immunology so that systems can monitor health and develop identification\/classification mechanisms for cyber threats; develop autonomy methods and self-healing techniques couple with rigorous experimentation; develop experimental approaches to prove robust and unique metrics; and use advanced modeling and simulation to develop and validate cyber security metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.822"
                                            },
                                            "Text": {
                                                "val": "“Robust Low-Level Cyber Attack-resilience for Military Defense (ROLL CAGE)” will develop fast and lightweight autonomous advanced intrusion detection systems (IDS) to immediately sense anomalous behavior.  Research will develop and incorporate aspects of moving target defense (MTD) and deception techniques into the IDS, based on the identification of threats.  The IDS will have the ability to respond proactively to adversary actions and to detect and mitigate cyber threats.  Research will explore the threat taxonomy and fine-tune development of monitoring agents under various platforms.  ROLL CAGE will demonstrate system specific vulnerabilities and protection against cyber-attacks using modularized agents.  These agents will establish systems operation baselines, conduct real-time monitoring, identify abnormalities, and alert users\/operators of potential cyber threats and vulnerabilities.\n\n“Autonomous Intelligent Resilient Systems (AIRS)” will develop a reference architecture for command and control (C2) \/ Internet of Battlefield Things (IoBT) software-defined networks.  The architecture allows researchers to harness the predicative analytics of intelligent command and control and battlefield services.  The framework will include network topology of data and the control plane model.\n\n“Self-Securing Systems: Autonomous Cyber Defense” project will develop an autonomous cyber deception system prototype.  The research will design hybrid games and hyper-games for cyber deception used to investigate an AI technique called Reinforcement Learning.  In addition research will develop adversary simulator (in future years to be refined by computer network operations operator survey results)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.925"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.925"
                                            },
                                            "Text": {
                                                "val": "ROLL CAGE will develop MTD and deception defense techniques based on game theoretic modeling to reflect realistic interactions of attackers and defenders.  The research considers attack scenarios \/ patterns developed by an ally’s Artificial Intelligence \/ Machine Learning (AI\/ML) based intrusion detection simulator and tests the technologies using new attack patterns.  The project will host a final demonstration.\n\nAIRS refines the reference architecture, ensuring that the system is able to understand and represent machine understandable languages.  AIRS requires a high level understanding of machine understandable languages to make accurate system diagnoses.  To ensure that the system has situational awareness, researchers will develop a representative simulation test environment with the requisite instrumentation to evaluate AIRS.  \n\nSelf-Securing Systems project will demonstrate a prototype of autonomous cyber defense using deception techniques based on human operator defender goals.  The demonstration will test and simulate different AI techniques, using both deception and cyber defense tactics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional resources will be used to complete development phase of projects under the Self-Securing Systems thrust."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precise Cyber Effects"
                                    },
                                    "Description": {
                                        "val": "When compared to traditional methods of kinetic warfare, cyber conflicts are still relatively new and untested. Cyber operators often have incomplete information about their targets prior to completing an action. This deficit makes it difficult to predict the precise outcomes or collateral damage caused by a cyber operation. With this uncertainty, military leaders may act with an undue sense of caution in using cyber capabilities. Improving technology and techniques for quantifying cyber effects will increase the effectiveness of cost estimation, enhance consequence prediction and ensure precision. Highly precise and predictable cyber effects can also achieve mission goals despite the presence of both incomplete and maliciously-created false information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.235"
                                            },
                                            "Text": {
                                                "val": "Begin execution of Joint research effort aimed at developing greater precision and accuracy of cyber effects to achieve targeted cyber mission impacts.  Research will focus on developing modeling techniques, based on limited data, capable of predicting the range of possibilities that unfold due to a planned cyber effect; developing methods to collect technical information from in-accessible cyber systems, while employing covert deceptive techniques; developing methods to identify key pieces of missing information to advance situational awareness; developing abductive reasoning techniques; developing intelligent systems that can reason and provide actionable guidance despite the presence of both incomplete and maliciously-created false information; developing methods for autonomous cyber operations to provide enhanced control and execution that allow cyber operators to timely and accurately respond to events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.340"
                                            },
                                            "Text": {
                                                "val": "Identify and fund cyber seedling project(s) with potential impacts (intended and unintended) of employing cyber effects while limiting collateral damage. \n\nUS-Australian bilateral Mission Assurance Research Collaboration (MARC) project arrangement will analyze data collected during TALISMAN SABRE (TS) 2017 command post exercise by applying mission mapping algorithms and machine learning processes.  The algorithms, including identifying workflows, will characterize computing resources, and resolve individuals’ identities across multiple modes of communication.  The team will develop plans for strategic science and technology (S&T) inject into Pacific Sentry 2019 exercise.  Researchers will identify use cases for validating dynamic mission mapping algorithms and processes through instrumentation of the field training exercise and command post exercise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.387"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.387"
                                            },
                                            "Text": {
                                                "val": "MARC will curate and index data collected during the S&T inject of Pacific Sentry 2019 exercise."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional resources will be needed to further develop methods and tools for autonomous cyber operations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Mathematics for Cyber"
                                    },
                                    "Description": {
                                        "val": "Mathematics is intrinsically linked to all branches of science and technology, including cyber security research.  There is a need for an array of formal and informal modeling techniques, backed by various rigorous mathematical theories, to capture and support the richness of the cyber domain.  This area of research is needed to help characterize the cyber domain and cyber security, maintain the integrity of data, harden systems, and analyze potential solutions.  Continued research in mathematical theory is crucial to maintain and increase the security of cyber systems.  The goal of this effort is to provide the tools and techniques to improve the design and operation of cyber systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.965"
                                            },
                                            "Text": {
                                                "val": "Execution of a Joint research effort aimed at developing and enhancing foundational work underpinning cyber technology in the areas of advanced mathematics.  Possible research areas include mathematical logic and formal methods; network science; information theory; decision sciences; risk analysis; and modeling and simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.023"
                                            },
                                            "Text": {
                                                "val": "\"Stealthy Communications and Situational Awareness” project will initiate the integration of Linear Statistical Network Analysis (LSNA) matrix with the Naval Research Laboratory's Extensible Stealthy Protocol (NExtSteP) testbed to identify and classify channel embedding methods.  In addition, research will also initiate production of high fidelity traffic using the NExtSteP testbed to analyze the types of channels that appear in candidate carrier protocols. \n\n\"Mitigating Adversarial Machine Learning\" (MAML) project will develop a prototype that simulates a framework for two- and three-model ensembles.  The research composes models into ensembles to test for potential weaknesses and exploits within the overall system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.053"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.053"
                                            },
                                            "Text": {
                                                "val": "The Stealthy project will continue to develop the LSNA infused NExtSteP testbed and determine whether metrics for “stealthiness” and throughput are consistent with the proof-of-concept overlay protocol.  \n\nResearch under the MAML project will investigate at least two evasion, inversion, and\/or extraction attacks in a laboratory environment.  The results will inform research on both ML model resilience and its effects on decision support and human operators."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional resources are needed to complete the development phase of projects under the thrust."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "─\tNumber of publications in refereed journals and peer reviewed reports or conference proceedings;\n─\tNumber of external research collaborations and interactions with the broader cyber community;\n─\tTransition of tools, techniques and methodologies for use in DoD, Federal or commercial entities;\n─\tImproved technology readiness levels; and\n─\tAffordability."
                        }
                    }
                }
            ]
        }
    }
}