{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-24",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603716D8Z"
        },
        "ProgramElementTitle": {
            "val": "Strategic Environmental Research and Development Program (SERDP)"
        },
        "R1LineNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "355.287"
            },
            "PriorYear": {
                "val": "63.055"
            },
            "CurrentYear": {
                "val": "76.340"
            },
            "BudgetYearOne": {
                "val": "66.157"
            },
            "BudgetYearOneBase": {
                "val": "66.157"
            },
            "BudgetYearTwo": {
                "val": "67.942"
            },
            "BudgetYearThree": {
                "val": "62.654"
            },
            "BudgetYearFour": {
                "val": "64.610"
            },
            "BudgetYearFive": {
                "val": "65.075"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Congress established the Strategic Environmental Research and Development Program (SERDP) in 1990 (10 U.S.C. Section 2901-2904) to address Department of Defense (DoD) and Department of Energy (DOE) environmental concerns.  It is conducted as a DoD program, jointly planned and executed by the DoD, DOE, and the Environmental Protection Agency (EPA), with strong participation by other Federal agencies, industry, and academia.  SERDP`s objective is to improve DoD mission readiness and environmental performance by providing new scientific knowledge and cost-effective technologies in the areas of Environmental Restoration, Munitions Response, Resource Conservation and Resilience, and Weapons Systems and Platforms.  SERDP does this by addressing high priority DoD environmental technology requirements.  SERDP enhances military operations, improves military systems` effectiveness, enhances military training\/readiness, sustains DoD’s training and test ranges and installation infrastructure, and helps ensure the safety and welfare of military personnel and their dependents by eliminating or reducing the generation of pollution and use of hazardous materials and reducing the cost of remedial actions and compliance with environmental laws and regulations.  As a secondary benefit, SERDP helps solve significant national and international environmental problems.  The keys to a growing list of SERDP technological successes are the ability to respond aggressively and proactively to priority defense environmental needs; the pursuit of world-class technical excellence; and an emphasis on constant technology transfer."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "71.832"
                },
                "CurrentYear": {
                    "val": "76.514"
                },
                "BudgetYearOne": {
                    "val": "75.088"
                },
                "BudgetYearOneBase": {
                    "val": "75.088"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "63.055"
                },
                "CurrentYear": {
                    "val": "76.340"
                },
                "BudgetYearOne": {
                    "val": "66.157"
                },
                "BudgetYearOneBase": {
                    "val": "66.157"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.777"
                },
                "CurrentYear": {
                    "val": "-0.174"
                },
                "BudgetYearOne": {
                    "val": "-8.931"
                },
                "BudgetYearOneBase": {
                    "val": "-8.931"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-7.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.652"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.125"
                                },
                                "CurrentYear": {
                                    "val": "-0.174"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Chemical Biological Defense Program"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.481"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.481"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Realign for A&S Core Mission"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-6.450"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.450"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Changes in support of Chemical Biological Defense Program as well as other A&S core mission requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "470"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Environmental Research and Development Program (SERDP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "355.287"
                        },
                        "PriorYear": {
                            "val": "63.055"
                        },
                        "CurrentYear": {
                            "val": "76.340"
                        },
                        "BudgetYearOne": {
                            "val": "66.157"
                        },
                        "BudgetYearOneBase": {
                            "val": "66.157"
                        },
                        "BudgetYearTwo": {
                            "val": "67.942"
                        },
                        "BudgetYearThree": {
                            "val": "62.654"
                        },
                        "BudgetYearFour": {
                            "val": "64.610"
                        },
                        "BudgetYearFive": {
                            "val": "65.075"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congress established the Strategic Environmental Research and Development Program (SERDP) in 1990 (10 U.S.C. Section 2901-2904) to address Department of Defense (DoD) and Department of Energy (DOE) environmental concerns.  It is conducted as a DoD program, jointly planned and executed by the DoD, DOE, and the Environmental Protection Agency (EPA), with strong participation by other Federal agencies, industry, and academia.  SERDP`s objective is to improve DoD mission readiness and environmental performance by providing new scientific knowledge and cost-effective technologies in the areas of Environmental Restoration, Munitions Response, Resource Conservation and Resilience, and Weapons Systems and Platforms.  SERDP does this by addressing high-priority DoD environmental technology requirements.  Technologies developed by SERDP enhance military operations, improve military systems’ effectiveness, enhance military training\/readiness, sustain DoD’s training and test ranges and installation infrastructure, and help ensure the safety and welfare of military personnel and their dependents by eliminating or reducing the generation of pollution and use of hazardous materials and by reducing the cost of remedial actions and compliance with environmental laws and regulations.  As a secondary benefit, SERDP helps solve significant national and international environmental problems.  The keys to a growing list of SERDP technological successes are the ability to respond aggressively and proactively to priority defense environmental needs; the pursuit of world-class technical excellence; and an emphasis on constant technology transfer."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Restoration"
                                    },
                                    "Description": {
                                        "val": "Environmental Restoration (ER) reduces DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.828"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water.  Specific Statements of Need were released that address 1) Improved Understanding of Per- and Polyfluoroalkyl Substance Source Zones, 2) In Situ and Ex Situ Remediation of Per- and Polyfluoroalkyl Substance Contaminated Groundwater, 3) Improved Understanding of Stormwater Impacts and Control on Sediment Recontamination and Recovery, and 4) Innovative Approaches for Monitoring and Implementing In Situ Remediation of Contaminated Aquatic Sediments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.624"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water.  The planned increase will support projects related to the detection, quantification, treatment, and bioavailability of per- and polyfluoroalkyl substances."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.485"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.485"
                                            },
                                            "Text": {
                                                "val": "Continue the research into the detection, quantification, treatment, and bioavailability of PFAS (per- and polyfluoroalkyl substances).  New projects will be initiated in \"fingerprinting\" for PFAS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Completion of initial projects on PFOS and PFOA contamination on DoD installations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Response (MR)"
                                    },
                                    "Description": {
                                        "val": "Munitions Response (MR) develops detection, classification, and remediation technologies for Unexploded Ordnance (UXO) to address the significant DoD liability in the Military Munitions Response Program.  Investments are also made to improve active range clearance and to reduce generation of UXO during live fire testing and training operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.435"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements in underwater UXO detection and protocols to reduce the costs associated with detecting, remediating, or managing UXO underwater. A specific Statement of Need was released that addresses Detection, Classification, and Remediation of Military Munitions Underwater."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.962"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements in underwater UXO detection and protocols to reduce the costs associated with detecting, remediating, or managing UXO underwater with a focus on low-frequency acoustic imaging as a detection\/classification system.  Several projects will also be initiated aimed at constructing a physics-based model of munitions penetration on land to aid DoD project managers assess the suitability of competing remediation technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.729"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.729"
                                            },
                                            "Text": {
                                                "val": "Detailed analysis of previously-collected low-frequency acoustic data to maximize value in the detection and identification of unexploded ordnance underwater.  Two new projects initiated on the mobility and burial of munitions in muddy sediments (as contrasted to the sandy bottoms previously investigated)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor changes in the funding required for the ongoing acoustic system development projects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resource Conservation and Resilience (RC)"
                                    },
                                    "Description": {
                                        "val": "Resource Conservation and Resilience (RC) develops the science and technologies required to sustain training and testing ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.762"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop the science and technologies required to sustain training and testing ranges.  Specific Statements of Need were released to address 1) Advanced Approaches for Managing Individual Species and Ecosystems Across Jurisdictional Boundaries in a Non-Stationary World and 2) Climate Change Vulnerability Assessment of Major Habitats on and Around DoD lands."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.925"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on understanding wildfire initiation and spread to construct models to be used by installation natural resource managers in planning their managed fire programs, understanding the role of a changing environment on the management of threatened and endangered species, and resiliency initiatives for installations in the Arctic."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.458"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.458"
                                            },
                                            "Text": {
                                                "val": "In depth examination of the interplay of fire and threatened and endangered species will be continued.  New efforts on the definition of a sustainable installation will be initiated."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Several projects on the impacts of climate change on Pacific Island installations and the Southwest US have concluded."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapons Systems and Platforms (WP)"
                                    },
                                    "Description": {
                                        "val": "Weapons Systems and Platforms (WP) develops technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.030"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts.  Specific Statements of Need were released to address: 1) Advancing Emulsion Science for Application in Armed Forces Vessels, 2) Non-Chemical, Non-Media Removal Process for Thick, Elastomeric Specialty Coatings Used on DoD Weapon Systems, 3) Systems Approaches in Propulsion and Explosives Toward Replacing Materials Such as Ammonium Perchlorate (AP), RDX, and TNT, and 4) Development of Agile, Novel Expeditionary Battlefield Manufacturing Processes Using Recycled and Reclaimed Materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.829"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on jet engine noise measurement and control, additive manufacturing for battlefield applications, sustainable pyrotechnics, and corrosion assessment and prediction applied to DoD weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.485"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.485"
                                            },
                                            "Text": {
                                                "val": "Initiation of a suite of projects on alternatives to Aqueous Fire Fighting Foam (AFFF) that do not contain fluorine.  The current AFFF formulation is a major contributor to the PFAS contamination of DoD Installations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "A suite of projects focused on environmentally benign signal flares have concluded."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance in this program is monitored at two levels.  At the lowest level, each of the more than 160 individual projects is measured against both technical and financial milestones on a quarterly and annual basis.  At a program-wide level, progress is measured against DoD's environmental requirements and the development of technologies that address these requirements as well as the transition of these technologies to either to demonstration and validation programs or to direct use in the field."
                        }
                    }
                }
            ]
        }
    }
}