{
    "id": "2020-Navy-PB-1319-JBOOK-9da760a8280e5c477a40ce5d303141285b83ab4a577b7d5903632d5298d41e17-2",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601153N"
        },
        "ProgramElementTitle": {
            "val": "Defense Research Sciences"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "448.084"
            },
            "CurrentYear": {
                "val": "499.102"
            },
            "BudgetYearOne": {
                "val": "470.007"
            },
            "BudgetYearOneBase": {
                "val": "470.007"
            },
            "BudgetYearTwo": {
                "val": "472.158"
            },
            "BudgetYearThree": {
                "val": "483.223"
            },
            "BudgetYearFour": {
                "val": "492.588"
            },
            "BudgetYearFive": {
                "val": "502.242"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) addresses basic research efforts including scientific study and experimentation directed toward increasing knowledge and understanding in national security related aspects of physical, engineering, environmental and life sciences. Basic research efforts are developed, managed, and related to more advanced aspects of research on the order of a hundred technology and capability-related 'thrusts', which are consolidated into about fifteen research areas.  These in turn support the major research areas of the Navy and Marine Corps: Autonomous Systems; Artificial Intelligence\/Machine Learning; Command, Control, Communications and Computers (C4); Marine as a System; Information Analysis and Decision Support; Intelligence, Surveillance and Reconnaissance; Logistics; Materials; Operational Environments; Platforms; Power and Energy Technology; Sensors and Electronics; Warrior Performance and Protection; Weapons and Support (Education and Outreach).\n\nThis PE sustains U.S. Naval Science and Technology (S&T) superiority, provides new technological concepts for the maintenance of naval power and national security, and helps avoid scientific surprise. It is based on investment directions as defined in the Naval Research and Development Framework. This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It exploits scientific breakthroughs and provides options for new Future Naval Capabilities (FNCs) and Innovative Naval Prototypes (INPs).  \n\nS&T investment in basic research also includes the National Naval Responsibilities (NNRs), fields upon which a wide range of fundamental Naval capabilities depend. There are currently five NNRs.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "458.333"
                },
                "CurrentYear": {
                    "val": "458.708"
                },
                "BudgetYearOne": {
                    "val": "456.885"
                },
                "BudgetYearOneBase": {
                    "val": "456.885"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "448.084"
                },
                "CurrentYear": {
                    "val": "499.102"
                },
                "BudgetYearOne": {
                    "val": "470.007"
                },
                "BudgetYearOneBase": {
                    "val": "470.007"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-10.249"
                },
                "CurrentYear": {
                    "val": "40.394"
                },
                "BudgetYearOne": {
                    "val": "13.122"
                },
                "BudgetYearOneBase": {
                    "val": "13.122"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.106"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "40.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-10.176"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "15.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "15.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.878"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.878"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.073"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The program increase in FY 2020 is a associated with the Science and Technology investment in the development of naval application of artificial intelligence (AI)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Defense Research Sciences"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "448.084"
                        },
                        "CurrentYear": {
                            "val": "458.602"
                        },
                        "BudgetYearOne": {
                            "val": "470.007"
                        },
                        "BudgetYearOneBase": {
                            "val": "470.007"
                        },
                        "BudgetYearTwo": {
                            "val": "472.158"
                        },
                        "BudgetYearThree": {
                            "val": "483.223"
                        },
                        "BudgetYearFour": {
                            "val": "492.588"
                        },
                        "BudgetYearFive": {
                            "val": "502.242"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) addresses basic research efforts including scientific study and experimentation directed toward increasing knowledge and understanding in national security related aspects of physical, engineering, environmental and life sciences. Basic research efforts are developed, managed, and related to more advanced aspects of research on the order of a hundred technology and capability-related 'thrusts', which are consolidated into about fifteen research areas.  These in turn support the major research areas of the Navy and Marine Corps: Autonomous Systems; Command, Control, Communications and Computers (C4); Marine as a System; Information Analysis and Decision Support; Intelligence, Surveillance and Reconnaissance; Logistics; Materials; Operational Environments; Platforms; Power and Energy Technology; Sensors and Electronics; Warrior Performance and Protection; Weapons and Support. Activities in this area also support maintenance of the Science and Engineering Workforce and STEM Education and Outreach.\n\nThis PE sustains U.S. Naval Science and Technology (S&T) superiority, provides new technological concepts for the maintenance of naval power and national security, and helps avoid scientific surprise. It is based on investment directions as defined in the Naval Science & Technology Strategy. This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It exploits scientific breakthroughs and provides options for new Future Naval Capabilities (FNCs) and Innovative Naval Prototypes (INPs).  \n\n\nS&T investment in basic research also includes the National Naval Responsibilities (NNRs), S&T areas that are uniquely important to maintaining U.S. Naval superiority. With the designation in 2011 of Sea-Based Aviation as an NNR, there are currently five NNRs.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AIR, GROUND AND SEA VEHICLES"
                                    },
                                    "Description": {
                                        "val": "Efforts include research in surface\/subsurface signatures; free-surface, subsurface, and propulsor hydromechanics; hull life assurance; advanced ship concepts; distributed intelligence for automated survivability; advanced electrical power systems; air vehicles; air platforms propulsion and power; air platforms survivability and signature control; special aviation projects; Unmanned Air Vehicle\/Unmanned Combat Air Vehicle (UAV\/UCAV); environmental quality; logistics; power generation, energy conversion, and storage; and advancements in naval technology innovations.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "55.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Air Vehicles\n\nBasic research investments include fixed-wing, rotary wing, and Vertical\/Short Takeoff and landing (V\/STOL) aircraft, ship\/aircraft dynamic interface, air vehicle management, and control, aerodynamics, and aeromechanics. Additional research investments include airframe structures and materials science address durability, service life, readiness, affordability, and future capabilities development. Most airframe challenges are not platform or design specific; they are fully represented in both current new-build and planned next-generation platform designs. Additional areas of research include metallic structures and materials, composite structures and materials, and advanced concepts related to: design, failure analysis, materials selection, fabrication, and sustainment of air-vehicle structures. Conducting university research supports rotorcraft technology areas such as tilt rotor aeromechanics, rotor flow field\/ship air wake coupling during shipboard operations, flight simulation of advanced ducted fan air vehicles, active rotor control for enhanced shipboard operations, autonomous rotorcraft operations in shipboard environment, and innovative rotor design concepts for naval applications. Continuing Sea-Based Aviation National Naval Responsibility (NNR) research in Virtual Dynamic Interface (VDI), advanced manned\/unmanned handling qualities and control for Naval operations, improved fixed wing launch and recovery high lift aerodynamics and performance, Enhanced fixed wing V\/STOL operations, and autonomous deck operations. Continuing SBA Structures and Materials NNR research for advanced airframes in metallic structures, combined loading mechanics, lightweight advanced polymer and ceramic composites, inspection and repair of composite structures, material coatings and sealants, and advanced concepts in manufacturing and multifunctional structures.\n\nScience of Autonomy\n\nConduct basic research related to critical multidisciplinary autonomy challenges that cut across areas\/domains, including air, sea, undersea and ground. This includes multi-disciplinary research into the science of autonomy focuses on four interrelated areas: scalable and robust distributed collaboration among autonomous systems; human\/unmanned system collaboration; autonomous perception and intelligent decision-making; and intelligent architectures for autonomous systems.\n\nAdvanced Naval Power Systems\n\nConduct basic research related to critical S&T to investigate efforts related to thermal science and engineering; power electronics\/electro-magnetics; and energy conversion, storage and generation. Pursue research in computer-aided material design; scarce materials mitigation strategies; electrochemical materials; and functional polymeric materials.  \n\nAdvanced Sea Platform Performance\n\nConduct basic research related to critical S&T to investigate efforts related to propulsor, surface ship, and subsurface hydrodynamics; platform mobility; alternative hull materials; and structural acoustics. Expand research related to naval engineering and platform design, including Ohio Replacement Program efforts, and centers for innovative naval technology.  \n\nSea Platform Survivability Science\n\nConduct basic research related to critical S&T to investigate efforts related to platform structural reliability; advanced control; acoustic and non-acoustic (electromagnetic) signatures; computational mechanics; metamaterials; and multihull design and optimization.\n\nMaterials, Coatings and Corrosion Control Science\n\nConduct basic research related to critical S&T to investigate corrosion control technologies. Pursue research in identifying new materials and coatings for naval applications.\n\nShip and Air Platform Machinery and Systems\n\nConduct basic research to advance the technical superiority of Sea-Based Aviation Science and Technology NNR in propulsion, power and thermal management related technologies with emphasis on propulsion cycles, subsystems, and integration, turbomachinery and drive systems, jet noise reduction, hot section materials and coatings, and small UAV propulsion. Conduct research to improve the power density, fuel efficiency, range and operating reliability of future large, medium and small engines. Continue studies to obtain a better fundamental understanding of the technologies involved with Rotating Detonation Engines and integration into platforms and weapon systems using thermodynamic models, Computational Fluid Dynamics and sub-scale experiments. Pursue research for better fundamental understanding of the underlying physics of jet noise production from multi-stream, hot, supersonic jets, and control schemes through fundamental modeling of unsteady and turbulent flow fields and development of more accurate and efficient computational tools. Continue basic research to improve jet engine material durability and temperature and temperature rate capabilities in both benign and corrosive environments. Increase the technical maturity of lightweight ceramic heat exchangers for small engines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "57.754"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Air Vehicles\n\nContinue Basic research investments include fixed-wing, rotary wing, and vertical\/short takeoff and landing (V\/STOL) aircraft, ship\/aircraft dynamic interface, air vehicle management, and control, aerodynamics, and aeromechanics. Additional research investments include airframe structures and materials science address durability, service life, readiness, affordability, and future capabilities development. Most airframe challenges are not platform or design specific; they are fully represented in both current new-build and planned next-generation platform designs. Additional areas of research include metallic structures and materials, composite structures and materials, and advanced concepts related to: design, failure analysis, materials selection, fabrication, and sustainment of air-vehicle structures. Conducting university research supports rotorcraft technology areas such as tilt rotor aeromechanics, rotor flow field\/ship air wake coupling during shipboard operations, flight simulation of advanced ducted fan air vehicles, active rotor control for enhanced shipboard operations, autonomous rotorcraft operations in shipboard environment, and innovative rotor design concepts for naval applications. Continuing Sea-Based Aviation National Naval Responsibility (NNR) research in Virtual Dynamic Interface (VDI), advanced manned\/unmanned handling qualities and control for Naval operations, improved fixed wing launch and recovery high lift aerodynamics and performance, Enhanced fixed wing V\/STOL operations, and autonomous deck operations. Continuing SBA Structures and Materials NNR research for advanced airframes in metallic structures, combined loading mechanics, lightweight advanced polymer and ceramic composites, inspection and repair of composite structures, material coatings and sealants, and advanced concepts in manufacturing and multifunctional structures.\n\nScience of Autonomy\n\nContinue basic research related to critical multidisciplinary autonomy challenges that cut across areas\/domains, including air, sea, undersea and ground. This includes multi-disciplinary research into the science of autonomy focuses on four interrelated areas: scalable and robust distributed collaboration among autonomous systems; human\/unmanned system collaboration; autonomous perception and intelligent decision-making; and intelligent architectures for autonomous systems.\n\nAdvanced Naval Power Systems\n\nConduct basic research related to critical S&T to investigate efforts related to thermal science and engineering; power electronics\/electro-magnetics; and energy conversion, storage and generation. Pursue research in computer-aided material design; scarce materials mitigation strategies; electrochemical materials; and functional polymeric materials.  \n\nAdvanced Sea Platform Performance\n\nConduct basic research related to critical S&T to investigate efforts related to propulsor, surface ship, and subsurface hydrodynamics; platform mobility; alternative hull materials; and structural acoustics. Expand research related to naval engineering and platform design, including Ohio Replacement Program efforts, and centers for innovative naval technology.  \n\nSea Platform Survivability Science\n\nConduct basic research related to critical S&T to investigate efforts related to platform structural reliability; advanced control; acoustic and non-acoustic (electromagnetic) signatures; computational mechanics; metamaterials; and multihull design and optimization.\n\nMaterials, Coatings and Corrosion Control Science\n\nConduct basic research related to critical S&T to investigate corrosion control technologies. Pursue research in identifying new materials and coatings for naval applications.\n\nShip and Air Platform Machinery and Systems\n\nContinue basic research to advance the technical superiority of Sea-Based Aviation Science and Technology NNR in propulsion, power and thermal management related technologies with emphasis on propulsion cycles, subsystems, and integration, turbo machinery and drive systems, jet noise reduction, hot section materials and coatings, and small UAV propulsion. Conduct research to improve the power density, fuel efficiency, range and operating reliability of future large, medium and small engines. Continue studies to obtain a better fundamental understanding of the technologies involved with Rotating Detonation Engines and integration into platforms and weapon systems using thermodynamic models, Computational Fluid Dynamics and sub-scale experiments. Pursue research for better fundamental understanding of the underlying physics of jet noise production from multi-stream, hot, supersonic jets, and control schemes through fundamental modeling of unsteady and turbulent flow fields and development of more accurate and efficient computational tools. Continue basic research to improve jet engine material durability and temperature and temperature rate capabilities in both benign and corrosive environments. Increase the technical maturity of lightweight ceramic heat exchangers for small engines.with no new efforts identified."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Air Vehicles\n\nBasic research investments include fixed-wing, rotary wing, and vertical\/short takeoff and landing (V\/STOL) aircraft, ship\/aircraft dynamic interface, air vehicle management, and control, aerodynamics, and aeromechanics. Additional research investments include airframe structures and materials science address durability, service life, readiness, affordability, and future capabilities development. Most airframe challenges are not platform or design specific; they are fully represented in both current new-build and planned next-generation platform designs. Additional areas of research include metallic structures and materials, composite structures and materials, and advanced concepts related to: design, failure analysis, materials selection, fabrication, and sustainment of air-vehicle structures. Conducting university research supports rotorcraft technology areas such as tilt rotor aeromechanics, rotor flow field\/ship air wake coupling during shipboard operations, flight simulation of advanced ducted fan air vehicles, active rotor control for enhanced shipboard operations, autonomous rotorcraft operations in shipboard environment, and innovative rotor design concepts for naval applications. Continuing Sea-Based Aviation National Naval Responsibility (NNR) research in Virtual Dynamic Interface (VDI), advanced manned\/unmanned handling qualities and control for Naval operations, improved fixed wing launch and recovery high lift aerodynamics and performance, Enhanced fixed wing V\/STOL operations, and autonomous deck operations. Continuing SBA Structures and Materials NNR research for advanced airframes in metallic structures, combined loading mechanics, lightweight advanced polymer and ceramic composites, inspection and repair of composite structures, material coatings and sealants, and advanced concepts in manufacturing and multifunctional structures.\n\nScience of Autonomy and Control of Unmanned Systems \nConduct basic research related to critical multidisciplinary autonomy and unmanned systems challenges that cut across areas\/domains, including air, sea, undersea and ground. This includes multi-disciplinary research into the science of autonomy and unmanned control and focuses on four interrelated areas: scalable and robust distributed collaboration among autonomous or unmanned systems; human\/unmanned system collaboration; autonomous perception and intelligent decision-making; and intelligent architectures for autonomous systems. \n\nScience of Advanced Naval Power and Energy Systems \nConduct basic research related to critical S&T to investigate efforts related to thermal science and engineering; power electronics\/electro-magnetics; distribution and control of power; power management; and energy conversion, storage and generation. Pursue research in computer-aided material design; scarce materials mitigation strategies; electrochemical materials; and functional polymeric materials, leading to technological underpinnings for advanced energy capture and power storage and distribution. \n\nScience of Advanced Naval Platform Performance \nConduct basic research related to critical S&T to investigate efforts related to propulsor, surface, and subsurface hydrodynamics; platform dynamics and performance; alternative hull materials; structural acoustics; and submarine security. Expand research related to naval engineering, platform design, and multiple platform control, including COLUMBIA CLASS Program, SSN(X), unmanned surface vessels, and swarm boats efforts, and support to the centers for innovative naval technology.\n\nSea Platform Survivability Science \nConduct basic research related to critical S&T to investigate efforts related to platform structural reliability; acoustic and non-acoustic (electromagnetic) signatures; computational mechanics and signatures; metamaterials; and digital ship design and optimization, and improving the understanding of the generation, radiation, propagation, scatter, and detection of a variety of signal types (acoustic, chemical, optical, electromagnetic, hydrodynamic and radiological) associated with a submarine's operation.\n\nMaterials & Coatings Science\nPursue research in identifying new nanostructured materials and coatings processing, ultimately for naval applications. \n\nCorrosion Control Science \nConduct basic research related to critical S&T to investigate corrosion control technologies. \n\nShip and Air Platform Machinery and Systems \nConduct basic research to advance the technical superiority of Sea-Based Aviation Science and Technology NNR in propulsion, power and thermal management related technologies with emphasis on propulsion cycles, subsystems, and integration, turbo machinery and drive systems, jet noise reduction, hot section materials and coatings, and small UAV propulsion. Conduct research to improve the power density, fuel efficiency, range and operating reliability of future large, medium and small engines. Continue studies to obtain a better fundamental understanding of the technologies involved with Rotating Detonation Engines and integration into platforms and weapon systems using thermodynamic models, Computational Fluid Dynamics and sub-scale experiments. Pursue research for better fundamental understanding of the underlying physics of jet noise production from multi-stream, hot, supersonic jets, and control schemes through fundamental modeling of unsteady and turbulent flow fields and development of more accurate and efficient computational tools. Continue basic research to improve jet engine material durability and temperature and temperature rate capabilities in both benign and corrosive environments. Increase the technical maturity of lightweight ceramic heat exchangers for small engines with no new efforts identified."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease from FY 2019 to FY 2020 IS due to Basic Catalysis research from this R2 Activity being conducted out of R2 Activity Science and Engineering Education, Career Development and Outreach."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ATMOSPHERE AND SPACE SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: Marine Meteorology and Prediction, and Space Sciences. This program supports innovative basic research on physical process studies, fundamental observations, new sources of data, and modeling in the atmosphere and space with the goal of improving predictive capabilities in the major research area of Operational Environments. Emphasis is placed on the marine atmosphere, the tropics, polar regions, the ionosphere and other areas where new understanding is needed in order to overcome predictability barriers that limit the accuracy of current forecast models. Efforts are underway to understand the interactions of physics between the atmosphere, space, land, ocean and ice, represent these coupled processes in models, and extend them across scales from local to planetary, with the goal extending the skill of predictions to longer timescales (i.e. seasonal to interannual). Recent efforts have also focused on the processes that control tropical cyclone formation, structure and intensity changes and phenomena that affect electromagnetic and electro-optic propagation in the marine atmosphere. Accomplishments and plans described below are examples for each effort category. Accomplishments and plans described below are examples for each effort category. \n\nThe program is strongly aligned with the Oceanographer of the Navy and the research topics addressed by this sub activity reflects the priorities for improved forecasts of the operational environment and the development and use of autonomous systems for the collection of environmental observations and continuing support to research vessels of the U.S. Academic Research Fleet for operations and maintenance that enable science at sea.This Program requires field research that involves participation in Navy environmental planning efforts including environmental planning documents (Environmental Impact Statements). The use of active acoustic transmissions requires modeling of the acoustic effects of sound on marine life."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.976"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Marine Meteorology and Prediction\n\nComplete a research initiative to improve the sub-grid scale parameterization of clouds, radiation and mixing in the marine boundary layer that developed several innovative new \"scale-aware\" parameterizations; transition these to applied research and, in one case, directly into a new version of the Navy's global numerical weather prediction system (NAVGEM), which resulted in a major improvement of several objective measures of predictive skill related to clouds and precipitation over the oceans. Conduct high-altitude airborne field experiments over major hurricanes during which an unprecedented set of high-resolution soundings covering the full depth of the storms will be obtained that allow detailed physical processes to be observed for the first time. These results will be analyzed, applied to existing models and have demonstrated the potential to make a substantial improvement in the ability to predict intensity and structure change in tropical cyclones.\n\nIntramural Battlespace Environments\n\nConduct basic research into the understanding of atmospheric processes ranging from thousands of kilometers down to meters, including interactions of the atmosphere with the land, sea, wave, and ice.  Continue research to improve our ability to exploit environmental observations to help us characterize those processes more accurately. Conduct research in the littoral zone, where complex topography and air-sea-land contrasts affect the environment on very short time and space scales, as well as in the tropics and sub-tropics, where longer time scale oscillations and seasonal signals also affect short-term weather events.  Develop a better fundamental understanding, measurements and predictive models to mitigate shortfalls.  Continue investigation of the interface between the troposphere and stratosphere is gaining increased attention because of its possible effect upon medium term weather prediction.\n\nExtramural Space Sciences\n\nContinue investigation of methods to assimilate these observations into space weather models, with an eventual goal of a prediction system that could provide detection and warnings of tsunamis as a variety of observational systems will be utilized to increase the understanding of the physics of ionospheric irregularities and other space weather phenomena.  Recent observations have shown that a number of phenomena, including tsunamis, can generate acoustic gravity waves that have an airglow signature in the thermosphere\/ionosphere.\n\nIntramural Space Research\n\nConduct basic research integrated across three environmental areas -- geospace, heliospace, and high-energy space -- which underpin, connect, and inform successful operations, with metrics to increase technology readiness and to foster transition.  Initiate geospace efforts to investigate the physical mechanisms responsible for the formation of sporadic ionospheric mesoscale structures that impact ionospheric radiowave propagation, to improve high-frequency (HF) systems performance for operational planning purposes.  Initiate heliospace efforts to develop the science base necessary to forecast geo-effective solar energetic particle (SEP) events that are hazardous to spacecraft operations and human activities in space.  Initiate high-energy space efforts to advance understanding about millisecond pulsars and the physics that underpins their use as space-based clocks for navigation and timing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.777"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The overall objective of this research is to improve the quality of the atmospheric and space environmental products that are provided to the warfighter and to allow accurate assessment of the impact of space and atmospheric phenomena on the performance of weapon systems. These objectives require advancing our basic understanding of atmospheric and space processes ranging from space to the sea surface, including interactions of the atmosphere with the land, sea, wave, and ice. \n\nBattlespace Environments\n\nNavy operations in the littoral zone are affected by complex topography and air-sea-land contrasts and phenomena occurring on very short time and space scales.  Clouds and moisture phenomena require further study to improve their representation in models. Non-conventional observational data sources require new and novel data assimilation methodologies to be developed before their potential is fully realized. Systems are being employed which operate in or through the earth's upper troposphere, middle and upper atmosphere and the near space environment where environmental supports are crude or non-existent. The interface between the troposphere and stratosphere is gaining increased attention because of its possible effect upon medium term weather prediction.\n\nMarine Meteorology and Prediction\n\nResearch initiatives to improve the sub-grid scale parameterization of clouds, radiation and mixing in the marine boundary layer that developed several innovative new \"scale-aware\" parameterizations; transition these to applied research and, in one case, directly into a new version of the Navy's global numerical weather prediction system (NAVGEM), which resulted in a major improvement of several objective measures of predictive skill related to clouds and precipitation over the oceans. High-altitude airborne field experiments over major hurricanes during which an unprecedented set of high-resolution soundings covering the full depth of the storms will be obtained that allow detailed physical processes to be observed for the first time. These results will be analyzed, applied to existing models and have demonstrated the potential to make a substantial improvement in the ability to predict intensity and structure change in tropical cyclones.\n\nSpace Research\n\nPerform best-in-class, experimentally-led sensing research and development (R&D) that is integrated across three environmental areas -- geospace, heliospace, and high-energy space -- which underpin, connect, and inform successful operations, with metrics to increase technology readiness towards rapidly prototyping solutions for accelerated delivery.    Geospace research could include Remove key scientific and computational impediments to a future physics-based Navy ionospheric prediction capability recently identified as a critical capability gap for high frequency (HF) radio-wave technologies for electromagnetic maneuver warfare, by means of focused scientific research on identification of which key drivers from the lower atmosphere and thermosphere are necessary to achieve short term forecasts of HF propagation globally.  Heliospace efforts may advance our understanding of solar magnetic fields and how they influence the near-earth environment.  High-energy space development will assist in understanding particle acceleration mechanisms in high energy solar flares by studying gamma-ray and neutron emissions that are measured in space. \n\nSpace Sciences\n\nOn-going investigation to assimilate observations into space weather models, with an eventual goal of a prediction system that could provide detection and warnings of tsunamis as a variety of observational systems will be utilized to increase the understanding of the physics of ionospheric irregularities and other space weather phenomena. Recent observations have shown that a number of phenomena, including tsunamis, can generate acoustic gravity waves that have an airglow signature in the thermosphere\/ionosphere."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The overall objective of this research is to improve the quality of the atmospheric and space environmental products that are provided to the warfighter and to allow accurate assessment of the impact of space and atmospheric phenomena on the performance of weapon systems. These objectives require advancing our basic understanding of atmospheric and space processes ranging from the surface to space, including interactions of the atmosphere with the land, sea, waves, and ice.\n \nBattlespace Environments\n\nNavy operations in the littoral zone are affected by complex topography and air-sea-land contrasts and phenomena occurring on very short time and space scales. Research is supported to investigate key physical processes, clouds\nand moisture phenomena in order to improve their representation in models. Efforts are focused on those phenomena that affect the predictability of parameters of most relevance to Naval operations (e.g. coastal meteorology,surface winds, visibility, refractivity, etc.). New and non-conventional observational data sources are explored through efforts that develop novel data assimilation methodologies in order to realize the full potential of such observations.  Systems are being employed which operate in or through the earth's upper troposphere, middle and upper atmosphere and the near\nspace environment where environmental supports are crude or non-existent,thus, efforts are supported that seek to extend the range of prediction systems to much higher altitudes. Research is supported to improve understanding of the physics of the upper atmosphere and ionosphere, and to improve the representation of the interface between the troposphere and stratosphere because of its effects upon medium term weather prediction.\n\nMarine Meteorology and Prediction\n\nResearch initiatives to improve the sub-grid scale parameterization of clouds, radiation and mixing in the marine boundary layer that developed several innovative new \"scale-aware\" parameterizations; transition these to applied research and directly into a new version of the Navy's global numerical weather prediction system (NAVGEM). This activity is scheduled to be completed in FY 2020. High-altitude airborne field experiments over major hurricanes during which an unprecedented set of high-resolution soundings covering the full depth of the storms were obtained allowed detailed physical processes to be observed for the first time.This activity is scheduled to be completed in FY 2020.\nResults from airborne observations over tropical cyclones will be analyzed and applied to new and existing models to make a substantial improvement in the skill for predicting intensity and structure change in tropical cyclones.\nAtmospheric process research will seek to advance our understanding of atmospheric and space processes ranging from the surface to space.  This includes marine boundary layer physics, air-sea-wave-ice coupling, processes affecting electro-optic and electromagnetic propagation, and better representation of clouds and moisture in numerical weather prediction models. A new research initiative will be initiated to focus on the origin, evolution and effects of Arctic cyclones that are poorly predicted but are believed to have a strong influence on Arctic ice.  Airborne observations over the Arctic from high-altitude research aircraft will be used to investigate processes from the stratosphere to the surface in order to improve their representation in numerical weather prediction models that can be coupled to the physics of the ocean and ice. \n\nSpace Research\n\nPerform best-in-class, experimentally-led sensing research and development (R&D) that is integrated across three environmental areas -- geospace, heliospace, and high-energy space -- which underpin, connect, and inform successful operations, with metrics to increase technology readiness towards rapidly prototyping solutions for accelerated delivery. Geospace research will attempt to overcome key scientific and computational impediments to a future physics-based Navy ionospheric prediction capability recently identified as a critical capability gap for high frequency (HF) radio-wave technologies for electromagnetic maneuver warfare, by means of focused scientific research on key drivers from the lower atmosphere and thermosphere that are necessary to achieve short term forecasts of HF propagation globally. Heliospace efforts may advance our understanding of solar magnetic fields and how they influence the near-earth environment. High-energy space development will assist in understanding particle acceleration mechanisms in high energy solar flares by studying gamma-ray and neutron emissions that are measured in space. \n \nSpace Sciences  \n\nOn-going investigation to assimilate observations into space weather models, with an eventual goal of a prediction system that could provide detection and warnings of tsunamis as a variety of observational systems will be utilized to increase the understanding of the physics of ionospheric irregularities and other space weather phenomena. Recent observations have shown that a number of phenomena, including tsunamis, can generate acoustic gravity waves that have an airglow signature in the thermosphere\/ionosphere."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant changes from FY2019 to FY2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SCIENCE ADDRESSING HYBRID THREATS"
                                    },
                                    "Description": {
                                        "val": "The Sciences Addressing Hybrid Threats (SAHT) (formerly Counter Improvised Explosive Device (IED)) Sciences program provides research for Naval Forces to fight hybrid threats, and adversaries in expeditionary operations. Naval Expeditionary Forces need science advances to address a range of Basic Research challenges that result from physical and operational environmental limitations so harsh that solutions push basic discovery and invention. Naval Forces able to operate amphibiously and in the littoral will have all of their capabilities exposed to degrading sea and land physical effects. Expeditionary forces operating austerely must be agile and lethal but will be constrained by size, weight, and power requirements and must be sustained across distributed forces covering large areas. Further complicating the problem context is the nature of hybrid threats, and adversaries. A hybrid adversary can be state or non-state using a combination of conventional and irregular methods and weapons. For example a hybrid threat could use criminal acts in concert with conventional artillery and IEDs and in turn social media for combined effects greater and broader than the sum of the parts. These coordinated multivariate threats occur across the spectrum of conflict with a dynamic but unified strategy. A hybrid adversary is flexible and adapts quickly, synchronizing advanced state weapons systems, disruptive commercial technologies, cheap expedient homemade weapons, and a variety of tactics. The Sciences Addressing Hybrid Threats program seeks to establish and nurture science to address these threats not covered in more conventional warfare science efforts and in environments not researched elsewhere.\n\nWithin the above threat and environmental context numerous warfighting capability dependencies are considered resulting in a broad range of science research areas. Examples include: physics addressing the electromagnetic spectrum for use in Command and Control and high energy physics addressing Directed Energy Weapons; machine perception, reasoning and collaborative behaviors of autonomy enabling numerous potential expeditionary autonomous systems; artificial intelligence enabling future Intelligence systems; optics, electronics, and photonics research to enable revolutionary spectral awareness in small low power sensors; computer and network science to enable expeditionary computing coupled with Data Science research to conduct data analysis; fundamental chemistry and materials science research to advance technologies to support sustainment; basic materials research to explore and improve armor and structural materials; electrochemical energy conversion and storage research to sustain the force; chemistry and physics to provide disruptive energetics for expeditionary Fires; and biology, physiology, and cognitive sciences addressing the Naval Expeditionary warfighters human abilities.\n\nThe program also seeks to establish and nurture a multidisciplinary Science and Technology community of Government, academic and industry researchers to accelerate the transition of new science and technology into fielded systems.\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.166"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sciences Addressing Complex Hybrid Warfare Threats (Formally Known as Counter-Improvised Explosive Device (IED) Sciences)\n\nThe following Sciences Addressing Complex Hybrid Warfare Threats (SAHT) efforts initiated prior continue in FY18:\n\n- Continued effort in the area of Prediction to develop theoretical and technical approaches that permit prediction and analysis of IED emplacement as well as the assembly of IEDs. This included recognition of emplacement patterns, human activity recognition from video and other sensing systems, human intelligence and social network analysis of terrorist networks, modeling and simulation of the full spectrum of IED activities, analysis of communications, and knowledge management systems to combine diverse data sources.\n- Continued effort in the area of Detection to develop concepts that would permit stand-off detection and localization of the explosive, the case materials, the environment in which the device is located, and other components of the IED.\n- Continued effort in the area of Neutralization to develop scientific concepts that may be applied to remotely render an IED ineffective without necessarily having to detect or destroy it.\n- Continued effort in the area of Destruction to develop scientific concepts that may be applied to quickly and remotely destroy IEDs without necessarily having to detect them.\n- Continued creation of new spectroscopy for sensitive characterization of semiconductor nanostructures, ultrathin molecular films and chemical\/biological threat materials and explosives.\n- Continued development of a new chemical explosive detection concept based on pump\/probe ultra-short pulse lasers.\n- Continued research on characterizing background noise in urban and riverine environments in support of IED signature detection.\n- Continued effort to directly observe lattice deformations in explosives under shock impact.\n- Continued investigations into sociological and cultural aspects of defeating insurgent networks.\n- Continued investigations into standoff wide area neutralization and pre-detonation of IEDs.\n- Continued investigations into stronger lightweight armor including nanoparticle designs.\n- Continued investigations into detection of physical and temporal device characteristics.\n- Continued investigations into challenges within the Riverine environment.\n- Continued an effort to integrate observable behaviors with social behavior models to provide inputs for predictions and validation.\n- Continued research into emerging very-broad-band spectroscopic capabilities to achieve a low-fidelity mosaic of partial pressure detection of explosives.\n- Continued study of energy transduction through soft armor.\n- Continued a Neutralize effort to investigate the identification of techniques to deflagrate or detonate explosives by creating hot spots or other localized effects that do not quench.\n- Continued a Neutralize effort to investigate new energy conversion schemes and extraction mechanisms for high-powered microwave sources that have potential to dramatically reduce the size, weight, and power required.\n- Continued a Neutralize effort to research compact wideband metamaterial multifunctional antennas.\n- Continued a Mitigate effort to explore new chemistry techniques to optimize polymer fiber growth and hardening.\n- Continue a Mitigate effort to develop in-situ analytical tools to observe nano to micro structure of materials during fabrication and treatment processes.\n- Continued study of Evaluation of the Dynamic Behavior and Material Parameters of the Human Brain.\n- Continued study of Real-Time Control of NMR Relaxation for Improved Sensitivity and Resolution.\n- Continued research on lightweight flexible materials that can selectively absorb, dissipate, and convert high energy electromagnetic waves or blast waves.\n- Continued an effort to detect a wider variety of homemade explosives.\n- Continued research into the improved biomechanics and physiology of detection dogs for use in the detection of explosive hazards.\n- Continued research efforts to produce the knowledge and understanding necessary to detect and locate asymmetric explosive threats and their components by exploring combination of their unique passive and active characteristic responses at safe stand-off distances from various expeditionary platforms.\n- Continued research efforts to explore new lightweight multifunctional material design and techniques to optimize existing materials to improve protection from detonation effects.\n- Continued research efforts to neutralize or prevent explosive threats with or without direct knowledge of their locations.\n- Continued research efforts to provide understanding of the human and social elements and their relationships with asymmetric explosive threats to predict and prevent explosive events.\n- Continued research efforts to improve stimulated electromagnetic explosive signature collection efficiencies.\n- Continued research efforts to explore compact rapid high selectivity spectroscopic detection in distributed unmanned platforms.\n\nExtramural SAHT\n\nInitiate Sciences Addressing Complex Hybrid Warfare Threats efforts. S&T efforts will address multi-faceted threats that employ both conventional and unconventional forces. This activity was originally formed to address Counter-Improvised Explosive Device (IED) Sciences, which are a component of Complex Hybrid Warfare Threats. However, there are additional emerging components of complex hybrid threats that must be addressed with these efforts as well as the challenges imposed by Naval Expeditionary Operations and as such the PE will address a broad range of hybrid threats not only IEDs and the science challenges associated with these environments. This activity will also incorporate Expeditionary Operations activities to facilitate the consolidation described above.\n\nComplete basic materials research to explore and improve high strain and stress rate performance of high performance fibers, armor inserts, and structural materials. Complete fundamental chemistry and materials science research to advance water purification technologies. Complete basic research to advance electrochemical energy conversion and storage. Initiate Investigations into novel hybrid devices, making use of the optical, electrical, and acoustic regimes. These devices will enable photonic and electronic domain access and manipulation of the electromagnetic spectrum across multiple octaves of bandwidth. Such devices will enable previously-unattainable real-time spectral awareness and performance. Initiate basic research to advance machine perception, reasoning and collaborative behaviors of autonomous systems during Amphibious Operations.\n\nExtramural C-IED Science\n\nComplete investigations into challenges in the temporal domain in various land environments.  Complete the program to investigate nano-technologies applied to miniaturized remote molecular sensors, with an additional emphasis on low fidelity detection of trace explosive vapor partial-pressures. Complete research on compact and efficient high voltage pulsed switches that can rapidly charge and discharge at a high repetition rate. Complete C-IED mitigation and destruction activities.\n\nIntramural Information Technology\n\nResearch to support the identification of previously unsuspected people caught on camera engaging in hostile acts by developing a robust approach for identifying people given only one or a small number of photos by comparing these photos to images on the Internet and in existing databases.  \n\nIntramural Materials and Chemistry\n\nEvaluate and quantify the changes in electrical signaling, resulting from strain on the neuronal cells subjected to shock and blast waves.  The study is critical to define and understand blast and impact injuries at the cellular level resulting in mild or severe traumatic brain injury.  Study hearing loss from repeated exposure to high levels of acoustic waves created by high performance jet engines operating on ocean platforms.  Develop an understanding of fundamental changes on IR optical standoff and point detection of improvised explosives, chemical warfare agents and toxic industrial chemicals.  Develop and demonstrate a predictive framework of IR spectral signatures based on the fundamental optical properties of materials.  \n\nIntramural Electronics\n\nCreate new knowledge and understanding and explore new concepts, techniques and methods, for the design, growth, and characterization of electronic and electro-optic sensors to counter IED's."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics\n\nCreate new knowledge and understanding and explore new concepts, techniques and methods, for the design, growth, and characterization of electronic and electro-optic sensors to counter Improvise Explosive Device (IED's). \n\nMaterials and Chemistry\n\nEvaluate and quantify the changes in electrical signaling, resulting from strain on the neuronal cells subjected to shock and blast waves.  The study is critical to define and understand blast and impact injuries at the cellular level resulting in mild or severe traumatic brain injury.  Studies on hearing loss from repeated exposure to high levels of acoustic waves created by high performance jet engines operating on ocean platforms.  Understanding of fundamental changes on IR optical standoff and point detection of improvised explosives, chemical warfare agents and toxic industrial chemicals.  Develop and demonstrate a predictive framework of IR spectral signatures based on the fundamental optical properties of materials.  Earlier studies on related topics have provided design and fabrication of protection garments from IED explosives and advanced design concepts for helmets to significantly reduce neuronal damage caused by shock and blast waves."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.823"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.823"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct work in hazard defeat to understand new concepts, techniques and methods, for the design, growth, and characterization of electronic, electro-optic, and bio sensors to counter hybrid explosive hazards threats, immersive sciences for automated methods for generating content and\/or behaviors for use augmented and mixed reality technologies, and neuromorphic computing and novel opto-electronic technologies. End perovskite chemistry based solar cell efforts. Initiate efforts in understanding multifunction machine learning and artificial intelligence systems operating in realistic electromagnetic threat environments.  \n\nEvaluate and quantify the changes in electrical signaling, resulting from strain on the neuronal cells subjected to shock and blast waves.  The study is critical to define and understand blast and impact injuries at the cellular level resulting in mild or severe traumatic brain injury.  Studies on hearing loss from repeated exposure to high levels of acoustic waves created by high performance jet engines operating on ocean platforms.  Understanding of fundamental changes on IR optical standoff and point detection of improvised explosives, chemical warfare agents and toxic industrial chemicals.  Develop and demonstrate a predictive framework of IR spectral signatures based on the fundamental optical properties of materials.  Earlier studies on related topics have provided design and fabrication of protection garments from IED explosives and advanced design concepts for helmets to significantly reduce neuronal damage caused by shock and blast waves. Novel biomaterials that enable epidermal electronics for warfighter protection to light weight distributed chemical sensors."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 is a result of the realignment of funds within this Program Element (PE), from Basic Research Challenge Activity into Sciences Addressing Hybrid Threats Activity to better identify and continue automated intelligence for logistics, neuromorphic computing for drone navigation and scene interpretation, and immersive sciences for virtual reality that were initiated as part of the FY 2019 Basic Research Challenge program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "Discovery research on attention and decision making in human and human-machine teaming tasks related to Naval missions, including command decision making, cognitive systems for human-machine teaming; computational neuroscience, human interactions with autonomous systems, attention and sensory processing; social cultural and behavioral modeling, and social network and computational social sciences.  \n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.153"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Human Computer Interaction\/Visualization\n\nConduct basic research in the computer centric environment of today's Navy and Marine Corps. Study human systems integration to reduce workload and increase operator situational awareness in a command information center environment. Investigate human sensory performance for optimizing video and audio human-electronic device interfaces and computational neuroscience for novel pattern recognition and sensory augmentation. Continue research on socially guided machine learning to include robotic teammates learning from human teachers by demonstration and verbal instruction. Conduct research of human-robot interaction to support team collaboration and research to address visualization and synthesis from multiple data sources to support autonomous systems and small hybrid teams. Continue research on brain-inspired intelligent systems to enable high-level interaction between warfighters and autonomous systems.\n\nCommand Decision Making (CDM)\n\nConduct basic research to explore the development of algorithms to automate assessment of the information value of Command and Control (C2) related data for next generation C2 systems. Research strategies to incorporate uncertainty into mission planning and asset allocation in naval missions and to understand and dynamically model context in operational decision making. Explore decision support as it applies to rapid mission planning, re-planning and execution at command and combatant echelons. Research thrust to include dynamic mapping of decision space and decision-based, dynamic task allocation algorithms. Continue research on geography, health and disaster for next generation information systems for collaborative humanitarian assistance. Seek a unified theory of the overall decision process, including the role of judgment with the goal that the unified theory will link currently existing, but isolated, conceptual theories of decision making, judgment, sensing, and detection.\n\nSocial Network Analysis\n\nConduct basic research of social networks for counterterrorism including research to create social modeling tools for understanding the responses of adversaries, determining the best practices for containing and deterring the adversary, and developing effective course of action in non-Western environments for humanitarian and civilian-military operations. Develop an empirical understanding and prediction of the behaviors of individuals and social groups and networks, computational approaches to social network theory and the co-evolution of adversarial tactics and strategies; algorithms for exploring scenarios that take into account socio-cultural factors; political and economic factors; and local attitudes, values, and social structure. Execute research efforts to extend the representational capabilities of cognitive architectures to accommodate aspects of social cognition and teamwork. Investigate social cyber-behavior, information operations and hybrid warfare. Study data visualization, data fusion and novel information streams to understand warfighting problems. Initiate research on competitive narrative and digital media assessment.\n\nHybrid Human Computer Systems\n\nConduct basic research into creating systems in which the functions of a human operator (or a group of operators) and a machine are integrated. Perform research to explore concepts of operations for the management of information in hybrid autonomous systems. Execute research to improve collaborative systems and trust in computer mediated environments.  Investigate statistical language translation for content analysis of threat behaviors and human security issues.  Conduct research of neuro-control of high-lift bio-inspired Unmanned Underwater Vehicles and active vision and cognitive navigation skills in mobile robots. Continue program on implantable electronics for performance enhancement.\n\nEnhancing Warfighter Cognitive Capability\n\nConduct basic research into probabilistic reasoning in computation cognitive architectures and the expansion of the cognitive architectural modeling capability to increase coverage, including spatial reasoning, multitasking, and impact of physiological and stress variables. Extend research into a program to combine cognitive architectures with computational neuroscience to better predict human performance. Research the output human performance usability models with actual human performance results obtained in usability testing on systems under development. These systems include future Naval Combat Systems and Homeland Security Operation Centers. Continue research of human activity and intend recognition and dynamic biometrics for improved human system interfaces and force protection. Conduct research of human cognition and performance to create more realistic simulations for training, including research into cost effectively adapting current intelligent tutoring technologies to wider dissemination across Navy schoolhouses. Extend training scientific study into the development of intelligent, embedded assessment for Intelligent Tutoring System (ITS).  Research cognitive modeling for cybersecurity and research on human performance sources of cyber vulnerabilities of unmanned vehicle (UxV) systems. Develop computational models for predicting human error on procedural tasks.  Investigate training efforts on neuro-cognitive plasticity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Human Computer Interaction\/Visualization\n\nConduct basic research in the computer centric environment of today's Navy and Marine Corps. Study human systems integration to reduce workload and increase operator situational awareness in a command information center environment. Investigate human sensory performance for optimizing video and audio human-electronic device interfaces and computational neuroscience for novel pattern recognition and sensory augmentation. Continue research on socially guided machine learning to include robotic teammates learning from human teachers by demonstration and verbal instruction. Conduct research of human-robot interaction to support team collaboration and research to address visualization and synthesis from multiple data sources to support autonomous systems and small hybrid teams. Continue research on brain-inspired intelligent systems to enable high-level interaction between warfighters and autonomous systems.\n\nCommand Decision Making (CDM)\n\nConduct basic research to explore the development of algorithms to automate assessment of the information value of Command and Control (C2) related data for next generation C2 systems. Research strategies to incorporate uncertainty into mission planning and asset allocation in naval missions and to understand and dynamically model context in operational decision making. Explore decision support as it applies to rapid mission planning, re-planning and execution at command and combatant echelons. Research thrust to include dynamic mapping of decision space and decision-based, dynamic task allocation algorithms. Continue research on geography, health and disaster for next generation information systems for collaborative humanitarian assistance. Seek a unified theory of the overall decision process, including the role of judgment with the goal that the unified theory will link currently existing, but isolated, conceptual theories of decision making, judgment, sensing, and detection.\n\nSocial Network Analysis\n\nResearch on computational social science models for course of action and forecast in support of information environment maneuvers for strategic communication.\n\nHybrid Human Computer Systems\n\nConduct basic research into creating systems in which the functions of a human operator (or a group of operators) and a machine are integrated. Perform research to explore concepts of operations for the management of information in hybrid autonomous systems. Execute research to improve collaborative systems and trust in computer mediated environments.  Investigate statistical language translation for content analysis of threat behaviors and human security issues.  Conduct research of neuro-control of high-lift bio-inspired Unmanned Underwater Vehicles and active vision and cognitive navigation skills in mobile robots. Continue program on implantable electronics for performance enhancement.\n\nEnhancing Warfighter Cognitive Capability\n\nConduct basic research into probabilistic reasoning in computation cognitive architectures and the expansion of the cognitive architectural modeling capability to increase coverage, including spatial reasoning, multitasking, and impact of physiological and stress variables. Extend research into a program to combine cognitive architectures with computational neuroscience to better predict human performance. Research the output human performance usability models with actual human performance results obtained in usability testing on systems under development. These systems include future Naval Combat Systems and Homeland Security Operation Centers. Continue research of human activity and intend recognition and dynamic biometrics for improved human system interfaces and force protection. Conduct research of human cognition and performance to create more realistic simulations for training, including research into cost effectively adapting current intelligent tutoring technologies to wider dissemination across Navy schoolhouses. Extend training scientific study into the development of intelligent, embedded assessment for Intelligent Tutoring System (ITS).  Research cognitive modeling for cybersecurity and research on human performance sources of cyber vulnerabilities of unmanned vehicle (UxV) systems. Develop computational models for predicting human error on procedural tasks.  Investigate training efforts on neuro-cognitive plasticity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.563"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.563"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Command Decision Making\n\nDevelop approaches for proactive decision support for Naval command and control tasks, with an emphasis on supervised machine learning of expert planning and dynamic re-planning. \n\nHuman-Machine Teaming\n\nDevelop empirical and computational models of cognition and create algorithms and architectures that aspire to human-level intelligence or ability. The algorithms and cognitive models serve to: (i) Advance the understanding of human cognition; (ii) Enable systems to recognize, understand, predict, perform, assist, and evaluate human behavior; and (iii) Improve the effectiveness of intelligent systems, human users\/operators, and hybrid human-machine teams in Naval operations. \n\nNeurosciences and Human Interaction With Autonomous Systems\n\nDevelop neuroscience principles to identify neural circuits, architectures, and algorithms that can be emulated to develop novel sensing, control, pattern recognition, neuromorphic processors, and intelligent systems. Conduct research on neural mechanisms of memory consolidation, working memory, and retrieval to enable intelligent systems with human-like associative memory skills. \n\nAttention In Sensory Processing\n\nDevelop mechanisms of attention, including its role in skilled perceptual and cognitive performance. Understand attention to task-relevance as a factor in personnel selection and training. Incorporate mechanisms of attention into machine learning. \n\nSocial, Cultural, and Behavioral Modeling\n\nDevelop computationally-efficient methods to model human behavior and social network analytics. Efforts include modeling information and cyber warfare, as well future sensor and weapon developments and their impact on Warfighter performance. Use machine learning to create synthetic decision makers. \n\nSocial Networks and Computational Social Science\n\nDevelop methods and tools pertaining to social media network analysis, including problems of monitoring social media, social hysteria propagation, and group polarization to support methods for information environment assessment, humanitarian assistance, and disaster response."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 is a result of the realignment of funds within this Program Element (PE), into the Human Systems Activity, to better identify and continue emerging sciences, including warfighter performance, command decision making, cognitive systems for human-machine teaming, computational neuroscience, human interactions with autonomous systems, attention and sensory processing, social cultural and behavioral modeling, and social network and computational social sciences efforts that were initiated as part of the FY 2019 Basic Research Challenge \nprogram."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MATHEMATICS, COMPUTER, & INFORMATION SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: Mathematical foundation and computational theory and tools for design, communication, and control of intelligent autonomous systems; theory, algorithms and tools for decision support; decision theory, algorithms, and tools; heterogeneous information integration, management, and presentation; information assurance, computation and information foundation for cyber defense, secure and reliable information infrastructure for command and control; mathematical optimization for optimal resource allocation and usage; modeling and computation of complex physical phenomena; modeling and computation for electromagnetic and acoustic wave propagation and scattering; seamless, robust connectivity and networking; foundations for novel computing hardware, including nanoscale materials, emerging devices and circuits, emerging computational architecture and nanofabrication.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "44.376"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Communications and Networking\n\nContinued basic research in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, SATCOM performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management.\n\nExtramural Quantum Information Sciences\n\nContinued basic research of quantum key distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable; and research of algorithms for naval functions such as routing, weapon-target pairing, etc., a key application such as radar cross section calculation.\n\nExtramural Nanoscale Computing Devices and Systems\n\nDiscovered and developed novel techniques for synthesis, assembly and characterization of molecular scale (sub-10nm) nanographene structures for their electronic, optical, magnetic and quantum functionalities. Research, assess, test and develop alternative computing architectures (beyond von-Neumann), including but not limited to, various implementations of neuromorphic architectures and quantum information systems.\n\nExtramural Mathematical Data Science\n\nContinued basic research in mathematics, probability, statistics, signal processing, machine learning, data engineering, and information theory. The program aims to develop rigorous mathematical and algorithmic answers to questions that are currently addressed using heuristics or non-principled approaches. Focus is on problems in learning and inference from both big and small data, representation of data, modeling dynamical properties of and determining causal effects in complex networks, multi-modal, multi-scale information integration, and decision making under uncertainty.\n\nExtramural Machine Learning, Reasoning and Intelligence\n\nContinued basic research in the area of building intelligent agents that can function in the environments in which warfighters operate, that is, environments that are unstructured, open, complex and dynamically changing. Agents (cyber or physical) do not yet have the level of intelligence needed to operate in such open, uncertain and unpredictable environments either independently or alongside warfighters. In the area of Intelligence for Autonomous Agents, basic research includes the development of principles for machine intelligence, efficient computational methods, algorithms and tools for building versatile smart agents that can perform missions autonomously with minimal human supervision and collaborate seamlessly with teams of warfighters and other agents. In the area of Image Understanding, basic research includes the development of theory and algorithms for understanding surveillance imagery, for semantic search of visual datasets, and for autonomous agent perception. The main focus is on reconstructing 3D scenes, recognizing object classes and specific objects, recognizing activities and events, inferring intentions, as well as succinct natural language descriptions of images and video.\n\nExtramural Applied and Computational Analysis Program\n\nContinued basic research in modern and classical mathematical analysis with emphasis on mathematical and computational models of physical phenomena. Naval interest in waves, flows, materials, structures, and information processing motivates research in the areas of multi-phase, multi-physics, including analytically rigorous and computationally robust and efficient modeling of fatigue, fracture, dislocation, nucleation, shocks and contact lines; dynamical systems, and oceanic and atmospheric modeling, including fluid transport, mixing, and predictability of models for nonlinear dynamics; and inverse problems arising from acoustic and electromagnetic wave propagation and scattering.\n\nExtramural Cyber Security and Complex Software Systems\n\nContinued basic research in computing systems and complex software systems that meet required assurances for security, safety, reliability and performance to measurably improve the information-processing challenges of future naval systems.  Cyber Security sub-program investigates and develops wide-ranging principles and techniques for continuously maintaining confidentiality, integrity, and availability of information and information infrastructures, focusing on the software, the hardware and the network. The program seeks to establish an autonomic, secure and dependable informational infrastructure toward achieving Information Dominance. Complex Software sub-program investigates principles, algorithms and methods, and develops software engineering tools for achieving efficient, timely, robust and secure software executables, focusing on science for software construction, correctness and efficiency by revisiting software development and deployment methodology. Efficient, timely, robust and secure software is a requirement for secure information infrastructure toward achieving Information Dominance.\n\nExtramural Networked Sensing\n\nContinued basic research in optical components and infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors for the purpose of imaging through clouds, fog, haze and dust; persistent surveillance for severely size constrained airborne applications; detecting anomalies and targets; and autonomous sensing for UAV platforms and networked sensing over multiple sensors and\/or sensor platforms.\n\nExtramural Mathematical Optimization and Operations Research\n\nContinued basic research in mathematical optimization. The primary focus of the program's basic-research portion is linear, nonlinear, integer and combinatorial optimization. Theoretical development, algorithm design and analysis, computational techniques, and software prototypes for solving large-scale problems are of interest. Techniques that produce provably optimal or near-optimal solutions, as well as techniques applicable to large problem domains are favored.  This includes, but is not limited to, cutting-plane and polyhedral techniques for mixed-integer programming and interior-point and first- order algorithms for conic\/convex optimization. Decentralized optimization is an area of growing interest, as are innovative techniques for dealing with uncertainty, such as stochastic, robust, and online optimization.\n\nIntramural Information Technology\n\nConduct basic research to address the continued need for improving the operational capability of Naval information and communication systems in the areas of: high assurance software; secure tactical connectivity; intelligent autonomy; and the processing, integration, and presentation of information. The expected payoff is: the development of improved methods for producing, analyzing, and securing Naval software systems; new design concepts for future Naval tactical communication systems and networks; intelligent autonomy and improved interaction with autonomous systems; and improved methods for analyzing, integrating, and presenting information to users. Given the pervasiveness of software, the techniques developed in this task area should also reduce cost and increase quality of Naval systems and are expected to be applicable to a wide variety of military and civilian problems.  Accomplishments include:  Developed a machine perception algorithm that detects anomalies with a true positive rate of 91.4% and a false positive rate of 8.71%;  Developed and prototyped several new algorithms for proving security properties of computer code;  Developed and initiated evaluation of a near-real time system (2-10ms lag) for detecting procedural uncertainty which can indicate when a human subject is about to make an error."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communications and Networking\n\nConduct basic research in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, SATCOM performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management.\n\nQuantum Information Sciences\n\nContinue basic research of quantum key distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable; and research of algorithms for naval functions such as routing, weapon-target pairing, etc., a key application such as radar cross section calculation.\n\nNanoscale Computing Devices and Systems\n\nDevelop novel techniques for synthesis, assembly and characterization of molecular scale (sub-10nm) Nano graphene structures for their electronic, optical, magnetic and quantum functionalities. Research, assess, test and develop alternative computing architectures (beyond von-Neumann), including but not limited to, various implementations of neuromorphic architectures and quantum information systems.\n\nMathematical Data Science\n\nConduct basic research in mathematics, probability, statistics, signal processing, machine learning, data engineering, and information theory. The program aims to develop rigorous mathematical and algorithmic answers to questions that are currently addressed using heuristics or non-principled approaches. Focus is on problems in learning and inference from both big and small data, representation of data, modeling dynamical properties of and determining causal effects in complex networks, multi-modal, multi-scale information integration, and decision making under uncertainty.\n\nMachine Learning, Reasoning and Intelligence\n\nConduct basic research in the area of building intelligent agents that can function in the environments in which warfighters operate, that is, environments that are unstructured, open, complex and dynamically changing. Agents (cyber or physical) do not yet have the level of intelligence needed to operate in such open, uncertain and unpredictable environments either independently or alongside warfighters. In the area of Intelligence for Autonomous Agents, basic research includes the development of principles for machine intelligence, efficient computational methods, algorithms and tools for building versatile smart agents that can perform missions autonomously with minimal human supervision and collaborate seamlessly with teams of warfighters and other agents. In the area of Image Understanding, basic research includes the development of theory and algorithms for understanding surveillance imagery, for semantic search of visual datasets, and for autonomous agent perception. The main focus is on reconstructing 3D scenes, recognizing object classes and specific objects, recognizing activities and events, inferring intentions, as well as succinct natural language descriptions of images and video.\n\nApplied and Computational Analysis Program\n\nConduct basic research in modern and classical mathematical analysis with emphasis on mathematical and computational models of physical phenomena. Naval interest in waves, flows, materials, structures, and information processing motivates research in the areas of multi-phase, multi-physics, including analytically rigorous and computationally robust and efficient modeling of fatigue, fracture, dislocation, nucleation, shocks and contact lines; dynamical systems, and oceanic and atmospheric modeling, including fluid transport, mixing, and predictability of models for nonlinear dynamics; and inverse problems arising from acoustic and electromagnetic wave propagation and scattering.\n\nCyber Security and Complex Software Systems\n\nConduct basic research in computing systems and complex software systems that meet required assurances for security, safety, reliability and performance to measurably improve the information-processing challenges of future naval systems.  Cyber Security sub-program investigates and develops wide-ranging principles and techniques for continuously maintaining confidentiality, integrity, and availability of information and information infrastructures, focusing on the software, the hardware and the network. The program seeks to establish an autonomic, secure and dependable informational infrastructure toward achieving Information Dominance. Complex Software sub-program investigates principles, algorithms and methods, and develops software engineering tools for achieving efficient, timely, robust and secure software executables, focusing on science for software construction, correctness and efficiency by revisiting software development and deployment methodology. Efficient, timely, robust and secure software is a requirement for secure information infrastructure toward achieving Information Dominance.\n\nNetworked Sensing\n\nConduct basic research in optical components and infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors for the purpose of imaging through clouds, fog, haze and dust; persistent surveillance for severely size constrained airborne applications; detecting anomalies and targets; and autonomous sensing for UAV platforms and networked sensing over multiple sensors and\/or sensor platforms.\n\nMathematical Optimization and Operations Research\n\nConduct basic research in mathematical optimization. The primary focus of the program's basic-research portion is linear, nonlinear, integer and combinatorial optimization. Theoretical development, algorithm design and analysis, computational techniques, and software prototypes for solving large-scale problems are of interest. Techniques that produce provably optimal or near-optimal solutions, as well as techniques applicable to large problem domains are favored.  This includes, but is not limited to, cutting-plane and polyhedral techniques for mixed-integer programming and interior-point and first- order algorithms for conic\/convex optimization. Decentralized optimization is an area of growing interest, as are innovative techniques for dealing with uncertainty, such as stochastic, robust, and online optimization.\n\nInformation Technology \n\nTo address the continued need for improving the operational capability of Naval information and communication systems in the areas of: high assurance software; secure tactical connectivity; intelligent autonomy; and the processing, integration, and presentation of information. The expected payoff is: the development of improved methods for producing, analyzing, and securing Naval software systems; new design concepts for future Naval tactical communication systems and networks; intelligent autonomy and improved interaction with autonomous systems; and improved methods for analyzing, integrating, and presenting information to users. Specific research examples include security for systems that employ Systems-on-a Chip Integrated Processor architectures, AI systems that understand causal reasoning, robotic systems that take advantage of emerging neuromorphic processors, new algorithms for performing data analytics, and networks that take into account the age of the information on the network for routing decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "62.032"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "62.032"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communications and Networking\n\nConduct basic research in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, satellite communications (SATCOM) performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management.\n\nQuantum Information Sciences\n\nConduct basic research of quantum key distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable; and research of algorithms for naval functions such as routing, weapon-target pairing, etc., a key application such as radar cross section calculation.\n\nNanoscale Computing Devices and Systems\n\nDevelop novel techniques for synthesis, assembly and characterization of molecular scale (sub-10 nanometers) nanographene structures for their electronic, optical, magnetic and quantum functionalities. Research, assess, test and develop alternative computing architectures (beyond von-Neumann), including but not limited to, various implementations of neuromorphic architectures and quantum information systems.\n\nMathematical Data Science\n\nConduct basic research in mathematics, probability, statistics, signal processing, machine learning, data engineering, and information theory. The program aims to develop rigorous mathematical and algorithmic answers to questions that are currently addressed using heuristics or non-principled approaches. Focus is on problems in learning and inference from both big and small data, representation of data, modeling dynamical properties of and determining causal effects in complex networks, multi-modal, multi-scale information integration, and decision making under uncertainty.\n\nMachine Learning, Reasoning and Intelligence\n\nConduct basic research in the area of building intelligent agents that can function in the environments in which warfighters operate, that is, environments that are unstructured, open, complex and dynamically changing. Agents (cyber or physical) do not yet have the level of intelligence needed to operate in such open, uncertain and unpredictable environments either independently or alongside warfighters. In the area of Intelligence for Autonomous Agents, basic research includes the development of principles for machine intelligence, efficient computational methods, algorithms and tools for building versatile smart agents that can perform missions autonomously with minimal human supervision and collaborate seamlessly with teams of warfighters and other agents. In the area of Image Understanding, basic research includes the development of theory and algorithms for understanding surveillance imagery, for semantic search of visual datasets, and for autonomous agent perception. The main focus is on reconstructing 3D scenes, recognizing object classes and specific objects, recognizing activities and events, inferring intentions, as well as succinct natural language descriptions of images and video.\n\nApplied and Computational Analysis Program\n\nConduct basic research in modern and classical mathematical analysis with emphasis on mathematical and computational models of physical phenomena. Naval interest in waves, flows, materials, structures, and information processing motivates research in the areas of multi-phase, multi-physics, including analytically rigorous and computationally robust and efficient modeling of fatigue, fracture, dislocation, nucleation, shocks and contact lines; dynamical systems, and oceanic and atmospheric modeling, including fluid transport, mixing, and predictability of models for nonlinear dynamics; and inverse problems arising from acoustic and electromagnetic wave propagation and scattering.\n\nCyber Security and Complex Software Systems\n\nConduct basic research in computing systems and complex software systems that meet required assurances for security, safety, reliability and performance to measurably improve the information-processing challenges of future naval systems.  Cyber Security sub-program investigates and develops wide-ranging principles and techniques for continuously maintaining confidentiality, integrity, and availability of information and information infrastructures, focusing on the software, the hardware and the network. The program seeks to establish an autonomic, secure and dependable informational infrastructure toward achieving Information Dominance. Complex Software sub-program investigates principles, algorithms and methods, and develops software engineering tools for achieving efficient, timely, robust and secure software executables, focusing on science for software construction, correctness and efficiency by revisiting software development and deployment methodology. Efficient, timely, robust and secure software is a requirement for secure information infrastructure toward achieving Information Dominance.\n\nNetworked Sensing\n\nConduct basic research in optical components and infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors for the purpose of imaging through clouds, fog, haze and dust; persistent surveillance for severely size constrained airborne applications; detecting anomalies and targets; and autonomous sensing for Unmanned Autonomous Vehicle (UAV) platforms and networked sensing over multiple sensors and\/or sensor platforms.\n\nMathematical Optimization and Operations Research\n\nThe primary focus of the Mathematical Optimization program is the development of new, cutting-edge theory and algorithms for most efficiently solving problems in linear, nonlinear, integer, and combinatorial\noptimization. Theoretical development, algorithmic design and analysis, computational methods, and software prototypes for large-scale problems are of interest. This directive includes, but is not limited to, cutting plane\nand polyhedral techniques for mixed-integer programming, decomposition approaches for large (non)convex problems, and interior-point and first-order algorithms for conic\/convex optimization. Advances that produce provably optimal or near-optimal solutions, as well as those applicable to large problem domains are favored. Innovative strategies for dealing with uncertainty from stochastic optimization, robust optimization, and simulation-based optimization are of growing interest. Research supported by this program is expected to make fundamental contributions to the areas of\nmathematical optimization and operations research.\n\nInformation Technology: To address the continued need for improving the operational capability of Naval information and communication systems in the areas of: high assurance software; secure tactical connectivity; AI and autonomy; and the processing, integration, and presentation of information. The expected payoff is: the development of improved methods for producing, analyzing, and securing Naval software systems; new design concepts for future Naval tactical communication systems and networks; intelligent autonomy and improved interaction with autonomous systems; and improved methods for information analysis, fusion, and presentation. New research projects will deliver technology for improved AI inference and human\/AI interaction,  predictive models for human cognitive performance, models for predicting and controlling complex networks in uncertain and hostile environments, and technology for improved presentation of complex, information-rich datasets.\n\nIntegration of domain knowledge and machine learning to enable fast and robust learning of diverse, complex concepts and tasks. Development of artificial intelligence in support of: (i) Informing and assisting different stages of the decision making process, and (ii) Developing interfaces and dialogue systems for human-machine teaming. Efforts in distributed artificial intelligence will identify principles and tractable computational methods for flexible and resilient approaches to learning, sharing, reasoning, and decentralized planning for situation awareness. Efforts will develop brain-inspired artificial intelligence algorithms and architectures and neuromorphic hardware to accelerate deep learning."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 is a result of the realignment of funds within this PE, from Basic Research Challenge Activity and Science of Artificial Intelligence Activity into Mathematics, Computer & Information Sciences Activity.  Better identify and continue Quantum Information Sciences, Mathematical Data Science, and Applied and Computational Analysis Program efforts initiated as part of the FY 2019 Basic Research Challenge program. This funding increase is also responsive to Navy guidance to the Navy Science and Technology (S&T) community to provide substantial leadership and stewardship to the overall development of artificial intelligence and its military applications."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MATERIALS\/PROCESSES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: structural materials; functional materials; maintenance reduction; environmental sciences; undersea warfare, materials and chemistry, and manufacturing science. Accomplishments and plans described below are examples for each effort category. This activity also includes peer-review basic research to develop innovative solutions and enhance the science and engineering base.\n\nAccomplishments and plans described below are examples for each effort category.\n\nBeginning in FY 2020, The Environmental Science thrust has been relabeled Functional Materials to address the evolution of work within this program area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "55.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Structural Materials\n\nConduct basic research related to critical S&T for structural materials, including, but not limited to, the following: computer-aided materials design (CAMD), structural metals, polymer composite materials, solid mechanics, propulsion materials, sensors & NDE prognostics and structural cellular materials.\n\nExtramural Functional Materials\n\nConduct basic research related to critical S&T for functional materials, including, but not limited to, the following: electronic materials, transduction materials, nanoparticles, bacterial nanowires and oxide materials. Expand research related to acoustic transduction science.\n\nExtramural Maintenance Reduction\nConduct basic research related to critical S&T for maintenance reduction, including, but not limited to, the following: corrosion models, stainless steel carburization, corrosion, and coatings.\n\nExtramural Environmental Science\n\nConduct basic research related to critical S&T for environmental science, including, but not limited to, the following: examination of scientific methods for pollution prevention, waste reduction, and hazardous material reduction for Naval Operations, anti-fouling and fouling release coatings including investigation of effect of new polymers, materials, processes, and novel testing methodologies for coating efficacy, and Reverse Osmosis (RO) pre-treatment strategies. Expand research related to naval environmental science.\n\nExtramural Manufacturing Science\n\nConduct basic research related to critical S&T for manufacturing science, including, but not limited to, the following: multidisciplinary research task into furthering the sciences associated with advances in manufacturing processes.\n\nIntramural Undersea Warfare  \n\nConduct basic research focused on creating new techniques for detecting, visualizing, understanding, predicting, exploiting, and controlling the interactions between acoustic and elastic waves, structures, the fluid in which they are immersed, and other fields; building compliant based multifunctional material platforms for the advancement of acoustic sensors, receivers, and filters in underwater battle space environments; and enabling enhanced capabilities, such as passive signal modulation, larger acoustic attenuation in confined spaces, and structural overlays, that can render an otherwise opaque material transparent to acoustic propagation.  This work strives to control and exploit the \"structural acoustic\" response of underwater structures for both stealth and sensor system applications and relates directly to the Navy's need for acoustic materials having improved performance for shallow water Anti-Submarine Warfare (ASW).\n\nIntramural Materials and Chemistry\n\nConduct basic research in advanced materials which depends on novel synthesis, processing, characterization, and performance. This effort addresses all materials including metals, alloys, ceramics, composites, semiconducting and superconducting material and bimolecular materials.  Studies include, to uncover the mechanisms in the nanometer scale, the effect of coatings on the conductions of iron and electrons. A key part includes developing a better understanding on the performance of spin-polarized electrons for advanced electronic switches and memories.  Develop fundamental understanding of electron transfer pathways in microbial consortia and relate the indefinite power generation in benthic regions.  Continue research into understanding the mechanism of the order of magnitude in advance composites consisting of soft polymers and nanoparticles with an effort to design advanced light weight armor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "58.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Structural Materials\n\nConduct basic research related to critical S&T for structural materials, including, but not limited to, the following: computer-aided materials design (CAMD), structural metals, polymer composite materials, solid mechanics, propulsion materials, sensors & NDE prognostics and structural cellular materials.\n\nFunctional Materials\n\nConduct basic research related to critical S&T for functional materials, including, but not limited to, the following: electronic materials, transduction materials, nanoparticles, bacterial nanowires and oxide materials. Expand research related to acoustic transduction science.\n\nMaintenance Reduction\n\nConduct basic research related to critical S&T for maintenance reduction, including, but not limited to, the following: corrosion models, stainless steel carburization, corrosion, and coatings.\n\nEnvironmental Science\n\nConduct basic research related to critical S&T for environmental science, including, but not limited to, the following: examination of scientific methods for pollution prevention, waste reduction, and hazardous material reduction for Naval Operations, anti-fouling and fouling release coatings including investigation of effect of new polymers, materials, processes, and novel testing methodologies for coating efficacy, and Reverse Osmosis (RO) pre-treatment strategies. Expand research related to naval environmental science.\n\nManufacturing Science\n\nConduct basic research related to critical S&T for manufacturing science, including, but not limited to, the following: multidisciplinary research task into furthering the sciences associated with advances in manufacturing processes.\n\nUndersea Warfare\n\nPerform laboratory and theoretical\/numerical studies focused on creating new techniques for detecting, visualizing, understanding, predicting, exploiting, and controlling the interactions between acoustic and elastic waves such as:  underwater coupling architectures that achieve a broad range of acoustic impedances, refractive indices and loss tangents; and the creation of high efficiency silicon based thin film thermoelectric modules for undersea warfare applications by exploiting nanocrystallization, multilayering to control thermal conductivity. \n\nMaterials and Chemistry\n\nDesigning advanced materials depends on novel synthesis, processing, characterization, and performance. This effort addresses all materials including metals, alloys, ceramics, composites, semiconducting and superconducting material and bimolecular materials.  Some examples of ongoing studies are (1) uncovering the mechanisms in the nanometer scale, (2) understanding the effect of coatings on the conductions of ions and electrons, (3) developing better understanding on the performance of spin-polarized electrons for advanced electronic switches and memories, (4) developing fundamental understanding of electron transfer pathways in microbial consortia and relate the indefinite power generation in benthic regions, (5) understanding the mechanism of the order of magnitude in advance composites consisting of soft polymers and nanoparticles with an effort to design advanced light weight armor. Demonstrate materials using 3D printing, mobility of electrons of one spin, design of microbial cells to extract power from the coastal ocean sediments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "58.636"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "58.636"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Structural Materials\n \nConduct basic research related to critical science and technology (S&T) for structural materials, including, but not limited to, the following: structural metals, polymer composite materials, solid mechanics, propulsion materials, sensors & non-destructive evaluation (NDE) prognostics and structural cellular materials. \n\nFunctional Materials (Formerly Environmental Science)\n\nConduct basic research related to critical S&T for functional materials, including, but not limited to, the following: transduction materials, acoustic transduction science, nanoparticles, oxide materials, and anti-fouling and fouling release coatings including investigation of effect of new polymers, materials, processes, and novel testing methodologies for coating efficacy for environmental quality control.\n\nMaintenance Reduction \n\nConduct basic research related to critical S&T for maintenance reduction, including, but not limited to, the following: corrosion models, stainless steel carburization, corrosion, and coatings. \n\nManufacturing Science\n\nAdditive Manufacturing (AM) using structural metals is of particular interest to the Navy for a wide variety of applications. However, the composition and properties of the AM alloy can change significantly during deposition, requiring new alloy development efforts to determine the initial composition that will produce the intended composition and properties in the AM-fabricated component.  This effort will begin to address the need by designing, developing and optimizing new metallic alloy compositions for AM that are resistant to the effects of the Naval\/maritime environment.\n\nMaterials and Chemistry\n\nDesigning advanced materials depends on novel synthesis, processing, characterization, and performance. This effort addresses all materials including metals, alloys, ceramics, composites, semiconducting and superconducting material and bimolecular materials.  Some examples of ongoing studies are (1) uncovering the physical, chemical, optical and biological phenomena in the nanometer scale, (2) understanding the effect of coatings on the conductions of ions and electrons, (3) developing better understanding on the performance of spin-polarized electrons for advanced electronic switches and memories, (4) developing fundamental understanding of electron transfer and carbon fixation pathways in microbial consortia and relate them to energy harvesting, material synthesis ans sensing, (5) understanding the mechanism of bioactuation for novel would healing applications, biocatalysis for mitigation and sensing, biocorrosion\/fouling for improving operational efficiency and reducing operational maintanace cost, (6) computational capabilities to understand the microstructures\/defects in metals and alloys of Naval interest, computational fluid dymnamics simulations for jet engine noise reduction, flapping wing design to hypersonics. Several accomplishments have been demonstrated for materials using 3D printing, mobility of electrons of one spin, design of microbial cells to extract power from the coastal ocean sediments.\n\nUndersea Warfare  \n\nLaboratory and theoretical\/numerical studies focused on creating new techniques for understanding, predicting, and controlling the interactions between acoustic and elastic waves such as:  underwater coupling architectures that achieve a broad range of acoustic impedances; and the creation of high efficiency silicon based thin film thermoelectric modules for undersea warfare applications by exploiting nanocrystallization, multilayering to control thermal conductivity."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY2019 to FY2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MEDICAL\/BIOLOGY"
                                    },
                                    "Description": {
                                        "val": "Discovery research on bio-inspired autonomous systems; biorobotics; bioengineering; synthetic biology; microbial electrochemical systems and microbiome research; augmented Warfighter performance; sensory neuroscience; stress physiology; Naval force health protection; undersea medicine and performance; and health and welfare of the Navy's marine mammals. To avoid duplication of efforts, research is coordinated with other Services through interactions with the Defense Health Agency, Armed Services Biomedical Research Evaluation and Management (ASBREM) Community of Interest, and Human Systems Community of Interest."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Medical Sciences: \n\nUndersea Medicine\n\nConduct basic research into stress physiology, hyperbaric physiology, and biological effects of Naval operational exposure. Explore the mechanisms of decompression illness, hyperbaric oxygen toxicity and \"ultrasonic\" hearing in divers. Determine ways to mitigate underwater sound\/blast effects. Improve trauma management in submarine Special Forces operators. Research the physiological and genetic effects of long-term diving including in extreme environments (hypoxic and\/or hypobaric conditions). Assess the effects of hyperbaric oxygen therapy on blast-induced histopathological changes. Continue research into the effects of hyperbaric environments on cellular biology (metabolism and signaling).\n\n\nBiomedical Sciences and Environmental Physiology\nConduct basic research to explore systematic relationships between cognitive and physiological responses under operational conditions. Research the effects of psychological and physiological stress, sleep deprivation and fatigue on the immune system and human performance. Investigate novel mechanisms to manage the mammalian circadian system for optimized health and performance. Research the mechanisms of nitrogen narcosis\/high pressure nervous syndrome. Explore novel opioids with minimal side effects. Study bioderived systems to produce fieldable therapeutics. Develop strategies for nerve cell regeneration. Research regenerative medicine in concert with the Armed Forces Institute for Regenerative Medicine (AFIRM). \n \nCombat and Operations BioMedicine\n\nConduct basic research in casualty care and management and casualty prevention, including mechanisms investigations of hemorrhagic shock, blast injury, tissue repair, and the biomedical effects of military operational exposure such as directed energy, hazardous chemicals, and sound. Explore health and individual performance under various military environments such as heat, cold, enclosed space, pressure and acceleration. Investigate the mechanisms of blast-induced neurotrauma at the cellular level, including underwater blasts. Initiate investigations of multi-scalar mechanisms of military occupational hazard and injury generation, detection, and repair, such as cavitation and directed energy.  \n\nBiological Sciences:\n\nNaval Biosciences\n\nComplete basic research into tubeworm adhesion and marine biofouling. Investigate microbe-materials interfacial interactions for detection of materials defects\/failures, including corrosion, and for improved energy harvesting.  Investigate \"smart cell engineering\" to design microbes that can sense and destroy other microbes and provide feedback to the user. Continue research on invertebrate larval response to biofilms and various inhibitors of adhesion.  Identify molecular biomarkers for battlefield injuries, and high-fidelity biosensors for detection in vivo. Study biomolecular 'logic controllers' for in vivo biosensor and drug delivery systems. Research into synthetic biology to further efforts for designing organisms with non-natural functions (e.g., light detection, electrical 'switch' capability, magnetic field production). Identify natural product inhibitors of bacterial folate biosynthesis for development as antibiotics. Control the synthesis of patterned materials from the nano to micro-scale using bionanotechnology. Understand the role of human gut microbiome to behavioral and physical stressors. Integrate programmable, externally-controlled \"sensor\" cells into micro-robotic devices. Study synthetic biology bioelectronics and information processing. Initiate synthetic biology of gut microbes for warfighter resilience.\n\nLife Sciences and Bioengineering\n\nComplete the development of molecular diagnostic tests for recently discovered viral pathogens in marine mammals.  Conduct basic research into combinatorial chemical screens for bacterial communication pathway inhibitors as potential antibiotics or fouling control agents. Identify plasma biomarkers of domoic acid toxicosis and leptospirosis in California sea lions, and develop a multiplexed assay to measure those plasma biomarkers. Research the potential clinical role of marine mammal stem cells.  Investigate DNA-scaffold-directed assembly of protein nanoarrays for control over orientation and position of proteins, and investigate triggered isothermal assembly of DNA nanostructures. Compare commensal\/pathogenic microbiomes in Atlantic bottlenose dolphin, California sea lion, and in dolphin diagnosed with chronic\/active gastritis. Develop new tools and techniques to engineer and characterize DNA nanostructures and control DNA based nanodevices. Investigate the material properties of silk proteins to facilitate application development. Develop field portable sensing platforms for explosives detection. Study environmental effects on marine invertebrate biofouling.\n\nNeural, Sensory and Biomechanical Systems\n\nConduct basic research into the development of bio-inspired sensors, vehicles and systems for local Intelligence, Surveillance and Reconnaissance (ISR), Weapons of Mass Destruction (WMD) detection, personnel protection and affordability including microfabrication, biological materials, processing techniques, robustness and systems efficiency. Research the elucidation of mechanisms of fish electric sense and near field low frequency acoustic perception. Investigate bacterial\/cellular controllers for nano\/micro-systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.601"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Medical Sciences: \n\nUndersea Medicine\n\nConduct basic research into stress physiology, hyperbaric physiology, and biological effects of Naval operational exposure. Explore the mechanisms of decompression illness, hyperbaric oxygen toxicity and \"ultrasonic\" hearing in divers. Determine ways to mitigate underwater sound\/blast effects. Improve trauma management in submarine Special Forces operators. Research the physiological and genetic effects of long-term diving including in extreme environments (hypoxic and\/or hypobaric conditions). Assess the effects of hyperbaric oxygen therapy on blast-induced histopathological changes. Continue research into the effects of hyperbaric environments on cellular biology (metabolism and signaling).\n\nBiomedical Sciences and Environmental Physiology\n\nConduct basic research to explore systematic relationships between cognitive and physiological responses under operational conditions. Research the effects of psychological and physiological stress, sleep deprivation and fatigue on the immune system and human performance. Investigate novel mechanisms to manage the mammalian circadian system for optimized health and performance. Research the mechanisms of nitrogen narcosis\/high pressure nervous syndrome. Explore novel opioids with minimal side effects. Study bioderived systems to produce fieldable therapeutics. Develop strategies for nerve cell regeneration. Research regenerative medicine in concert with the Armed Forces Institute for Regenerative Medicine (AFIRM). \n \nCombat and Operations BioMedicine\n\nConduct basic research in casualty care and management and casualty prevention, including mechanisms investigations of hemorrhagic shock, blast injury, tissue repair, and the biomedical effects of military operational exposure such as directed energy, hazardous chemicals, and sound. Explore health and individual performance under various military environments such as heat, cold, enclosed space, pressure and acceleration. Investigate the mechanisms of blast-induced neurotrauma at the cellular level, including underwater blasts. Initiate investigations of multi-scalar mechanisms of military occupational hazard and injury generation, detection, and repair, such as cavitation and directed energy.  \n\nBiological Sciences:\n\nNaval Biosciences\n\nInvestigate microbe-materials interfacial interactions for detection of materials defects\/failures, including corrosion, and for improved energy harvesting.  Investigate \"smart cell engineering\" to design microbes that can sense and destroy other microbes and provide feedback to the user. Continue research on invertebrate larval response to biofilms and various inhibitors of adhesion.  Identify molecular biomarkers for battlefield injuries, and high-fidelity biosensors for detection in vivo. Study biomolecular 'logic controllers' for in vivo biosensor and drug delivery systems. Research into synthetic biology to further efforts for designing organisms with non-natural functions (e.g., light detection, electrical 'switch' capability, magnetic field production). Identify natural product inhibitors of bacterial folate biosynthesis for development as antibiotics. Control the synthesis of patterned materials from the nano to micro-scale using bionanotechnology. Understand the role of human gut microbiome to behavioral and physical stressors. Integrate programmable, externally-controlled \"sensor\" cells into micro-robotic devices. Study synthetic biology bioelectronics and information processing. Initiate synthetic biology of gut microbes for warfighter resilience.\n\nLife Sciences and Bioengineering\n\nConduct basic research into combinatorial chemical screens for bacterial communication pathway inhibitors as potential antibiotics or fouling control agents. Identify plasma biomarkers of domoic acid toxicosis and leptospirosis in California sea lions, and develop a multiplexed assay to measure those plasma biomarkers. Research the potential clinical role of marine mammal stem cells.  Investigate DNA-scaffold-directed assembly of protein nanoarrays for control over orientation and position of proteins, and investigate triggered isothermal assembly of DNA nanostructures. Compare commensal\/pathogenic microbiomes in Atlantic bottlenose dolphin, California sea lion, and in dolphin diagnosed with chronic\/active gastritis. Develop new tools and techniques to engineer and characterize DNA nanostructures and control DNA based nanodevices. Investigate the material properties of silk proteins to facilitate application development. Develop field portable sensing platforms for explosives detection. Study environmental effects on marine invertebrate biofouling.\n\nNeural, Sensory and Biomechanical Systems\n\nConduct basic research into the development of bio-inspired sensors, vehicles and systems for local Intelligence, Surveillance and Reconnaissance (ISR), Weapons of Mass Destruction (WMD) detection, personnel protection and affordability including microfabrication, biological materials, processing techniques, robustness and systems efficiency. Research the elucidation of mechanisms of fish electric sense and near field low frequency acoustic perception. Investigate bacterial\/cellular controllers for nano\/micro-systems.\n\nCombat and Operations BioMedicine\n \nResearch improved hemorrhage resuscitation with enhanced endothelial treatments.\n\nNaval Biosciences\n\nResearch synthetic biology for bioelectronics devices, materials and information processing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.707"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.707"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Bio-Inspired Autonomous Systems\n\nDevelop bio-inspired propulsion and control systems that enable high-lift, stealthy propulsion without propellers and achieve high maneuverability for underwater vehicles. Efforts include: (i) Bio-sensing for sensorimotor control; (ii) Bio-inspired design principles for distributed sensing, actuation and control in soft biological structures; and (iii) Principles of locomotion of amphibious animals to enable bio-inspired amphibious and cross-domain vehicles. \n\nBioengineering and Life Sciences\n\nDevelop DNA-based nanostructures for fundamental circuits and biosensing; biomimetic and bio-inspired underwater adhesives; biopolymer energy sources; and explore approaches to generate nanomaterials by design. Pursue research in biological and bio-inspired, water-responsive materials for energy conversion and actuators. Maintain the health and fitness of the U.S. Navy's marine mammals for duty and readiness.\n\nNaval Biosciences and Synthetic Biology for Naval Applications\n\nDevelop research on synthetic biology for bioelectronics devices, materials, and information processing. Efforts include: (i) Elucidating microbe-materials interactions and extracellular electron transfer mechanisms for detection of materials defects\/failures, identifying novel biogenic structures, and improving microbial electrochemical functions; (ii) Exploring the role of the human microbiome in host response to behavioral and physical stressors; (iii) Developing synthetic biology approaches to enable manipulation of microbiome organisms for Warfighter resilience or status monitoring; (iv) Executing research on synthetic biology approaches to enable novel bioelectronics and information processing strategies. \n\nWarfighter Augmentation\n\nDevelop cognitive and physiological systems that enable human performance to exceed current limitations, including novel adaptations to inhospitable environments. Efforts include: Alternative oxygen sources, epigenetic modifications of globin protein expression for variable regulation of oxygen tissue supplies, bionics, texture-shifting of biological organisms, and multi-functional textiles. \n\nSensory Neuroscience and Physiology\n\nInvestigate neurological pathways of sensory systems including: (i) Examining mechanisms of nerve cell and axonal fiber deterioration in high noise environments; (ii) Accelerating understanding of nerve cell and axonal regeneration; and (iii) Exploring novel treatment strategies for hearing restoration. \n\nPhysiological Monitoring and Modeling\n\nDevelop fundamental mechanisms that enable prediction and identification of cognitive and physical performance levels in extreme expeditionary environments. Design novel low-powered sensing capabilities. \n\nNaval Force Health Protection\n\nDiscover technologies including: (i) Novel modeling and simulation approaches to improve Warfighter protection; (ii) Maritime casualty care; and (iii) Medical logistics through optimized design, development, and operational planning. \n\nUndersea Medicine and Performance\n\nDevelop cognitive and physiological responses in undersea environments to expand the operational envelope (e.g. depth and time) for divers and combat swimmers. Explore enhancement of human physiology with pharmacological agents and other therapies to protect humans from undersea environmental challenges.\n\nStress Responses\n\nDevelop impact of military operational environments on biomarkers predictive of individual Warfighter's reactivity to stress. Explore effects of chronic stress in conjunction with circadian cycle changes on these biomarkers."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OCEAN SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: The Ocean Sciences sub activity supports basic research in the ocean domain and the impact that this complex and changing environment has on naval operations. The effort encompasses research over a wide variety of regions, including the open ocean, Arctic, and littorals, and addresses scientific issues relevant to Anti-Submarine Warfare (ASW) including acoustic propagation and the impact of acoustics on marine mammal behavior. The improved understanding of the ocean environment enables the development of fully coupled (ocean-atmosphere-wave-ice) global, regional and local predictive models that can be used for operational planning at tactical, strategic and climate scales. The program is strongly aligned with the Oceanographer of the Navy and the research topics addressed by this sub activity reflects the priorities for improved forecasts of the operational environment and the development and use of autonomous systems for the collection of environmental observations and continuing support to research vessels of the U.S. Academic Research Fleet for operations and maintenance that enable science at sea. Research performed under this Sub Activity includes efforts in the following areas: littoral geosciences and optics, marine mammals and biology, physical oceanography and prediction, and ocean acoustics. Accomplishments and plans described below are representative highlights from these efforts. This Program requires field research that involves participation in Navy environmental planning efforts including environmental planning documents (Environmental Impact Statements). The use of active acoustic transmissions requires modeling of the acoustic effects of sound on marine life."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "73.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Physical Oceanography and Prediction\n\nConduct research on ocean variability generated by flow encountering abrupt topography in the Western Pacific; Carry out field experiments to investigate changes in Arctic stratification and circulation and related physical processes in the Beaufort and Chukchi Seas. Carry out a multidisciplinary field effort to characterize and understand monsoon intra-seasonal  variability in the Indian Ocean. Finish analysis from a study of the structure and variability of the Northern Arabian Sea circulation using autonomous, unmanned sampling systems.\n\nExtramural Littoral Geosciences and Optics\n\nComplete all efforts from previous fiscal years. Initiate development of methodologies and\/or observing technologies which are: a) nimble, cost-effective, rapidly re-locatable, or will offer bold insight into littoral dynamics, or b) utilize sensors on operational platforms (termed organic) in ways which increase battlespace awareness or can be used to map the maritime domain while idle. Initiate studies and modeling of shelf, near-shore, delta, estuarine, and riverine dynamics, including surface and internal waves, currents, stratification, sediment transport and the seabed response and coastal winds driving shallow water response. Understanding shallow water features which will affect acoustic propagation or acoustic system performance and\/or events which cause swimmer or navigational hazards (bathymetry-wave-current-wind interactions), navigationally significant bathymetry or trafficability changes, are of particular interest. Initiate studies using remote sensing of the coastal and riverine environment, above and below the sea surface and canopy, e.g., from EO, IR, radar, SAR, inSAR and acoustic, from land or ship-based, unmanned vehicles, airplanes or satellites. New remote sensing tools and algorithms that can be used to initialize forecast models in distant, remote and\/or denied areas are of particular interest.  Initiate studies of optical processes in the littoral environment, including the atmosphere, sea surface, water column, sea bed and suspended or dissolved materials. Predicting the timing (initiation, transport and clearance) of materials that negatively affect optical clarity, is of particular interest.\n\nExtramural Marine Mammals and Biology\n\nIntegrated Ecosystem Research - Conduct basic research to understand the patterns and causes of variability in the distribution and abundance of marine mammals over space and time. Initiate a multidisciplinary approach using tagging, visual surveys, and passive acoustics to collect baseline measures of marine mammal behaviors and distributions relative to environmental features and marine mammal prey fields. Investigate using animal tagging and passive acoustic monitoring to study behaviors and distributions of marine mammals relative to key environmental properties (biotic and abiotic).  This includes providing a context for interpreting behavioral responses to external stimuli (i.e. anthropogenic sound), and providing basic knowledge needed for predictive models of species of concern.\n\nEffects of Sound - Conduct basic research on behavioral, physiological (hearing and stress response), and potentially population-level consequences of sound exposure on marine life. Initiate research to characterize the causal chain of events leading from sound exposure to \"biologically significant\" behavioral reactions that might increase risks of population-level effects and\/or the potential for stranding. An additional focus is to characterize the gas management and kinetics (stores and use) in marine mammals. Conduct research into the mechanisms that enable marine mammals to dive to deep depths for long durations while mitigating, if not avoiding, health threats. Initiate research to advance our understanding of sound reception mechanisms in mysticetes (large whales) will require a thorough exploration of the anatomy surrounding the ear and the whole head combined with modeling sound propagation through various tissues of whale heads and\/or bodies.  Another research focus is better understand the stress response in marine mammals to sound exposure. Conduct research to develop an understanding of the natural variation of stress markers, better understand and characterize the relationships among hormones or other biomarkers in different matrices, define and compare the quantitative and temporal relationships of hormones across the different matrices, and evaluate and characterize the relationship between the physiological stress response in marine mammals and acoustic exposure and 'biologically significant' disturbance. Continue research to develop statistical models of the population consequences of acoustic disturbance to be fitted to data from marine mammal populations and lead collaborative development of transferable models of the effects of disturbance on marine mammals.\n\nMonitoring and Detection - Conduct research to develop and test new and existing technology to detect and classify marine mammals in the marine environment and during periods of low light such as passive acoustics, and IR. Continue research and development of passive acoustic signal processing algorithms for detection, classification, and localization of marine mammals. Continue the development and testing of autonomous hardware platforms using passive acoustics and\/or IR to detect and classify marine mammals using a variety of fixed, towed, floating, and profiling platforms.\n\nExtramural Ocean Acoustics \n\nConduct research to understand propagation and scattering of acoustic energy in shallow-water ocean environments.  Areas of research include: shallow-water scattering mechanisms related to reverberation and clutter; seabed acoustic measurements supporting geoacoustic inversion; acoustic propagation through internal waves and coastal ocean processes and the development of unified ocean\/seabed\/acoustic models, including scattering from rough surfaces, biologics and bubbles; and penetration\/propagation within the porous seafloor.\n\nIntramural Battlespace Environments\n\nThe overall objective of this research is to improve basic understanding of physical, seafloor and biological oceanographic processes on space and time scales of naval interest. Emphasis is on improved measurements, laboratory and model based experiments to quantify and understand important oceanographic processes that lead to the development of ocean dynamic models from global to submesoscale scales, and to couple these oceanographic models with atmospheric, ice, biological, sediment response, and optical models. Surveillance of coastal land areas and waters is important to support Navy operations and difficult. The Navy\/Marine Corps needs include an improved use of overhead (airborne and satellite) active and passive microwave sensors, overhead optical sensors, surface-based (ships and ground-based) grazing angle microwave sensors. To predict bottom boundary physical, geological, geochemical, geoacoustic and geotechnical properties in shallow-water operating areas requires:  a) an improved understanding of processes that generate and modify the shape, structure and physical properties of the seafloor, subseafloor, ocean water column and ice-cover and topography\/morphology;  b) use of rapid, airborne characterization of littoral environments including time-varying coastal topography, littoral bathymetry, sea-level height, land and seafloor sedimentary structures to explain\/predict the observed changes; c) remote sensing of bulk properties of Arctic sea-ice over broad two-dimensional areas that previously could be sampled only at spot locations by in-situ sampling; and d) quantification of the influence of turbulence generated at the seafloor boundary layer on vertical mixing and stratification in shallow water outside the surf zone."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "76.135"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Physical Oceanography and Prediction\n\nCarry out field experiments to investigate changes in Arctic stratification and circulation and related physical processes in the Beaufort and Chukchi Seas. Carry out a multidisciplinary field effort to characterize and understand monsoon intra-seasonal  variability in the Indian Ocean. Complete field studies\/modeling to predict propagation and effect on acoustics of non-linear internal waves in the western Pacific. Complete studies of internal waves and strait dynamics emphasizing field studies in the Celebes, Philippine, and Sulu Seas. Complete analysis of the structure and variability of the Northern Arabian Sea circulation using autonomous, unmanned sampling systems. Initiate studies of prediction and observations of 3-D Lagrangian studies and abilities to predict the vertical pathways in the ocean. Initiate studies of the input and fate of near-initial shear and energy in the ocean via observational and predictive studies in the GIUK regions.\n\nLittoral Geosciences and Optics\n\nInitiate studies and modeling of shelf, near-shore, delta, estuarine, and riverine dynamics, including surface and internal waves, currents, stratification, sediment transport and the seabed response and coastal winds driving shallow water response. Understanding shallow water features which will affect acoustic propagation or acoustic system performance and\/or events which cause swimmer or navigational hazards (bathymetry-wave-current-wind interactions), navigationally significant bathymetry or trafficability changes, are of particular interest. Initiate studies using remote sensing of the coastal and riverine environment, above and below the sea surface and canopy, e.g., from EO, IR, radar, SAR, inSAR and acoustic, from land or ship-based, unmanned vehicles, airplanes or satellites. New remote sensing tools and algorithms that can be used to initialize forecast models in distant, remote and\/or denied areas are of particular interest.  Initiate studies of optical processes in the littoral environment, including the atmosphere, sea surface, water column, sea bed and suspended or dissolved materials. Predicting the timing (initiation, transport and clearance) of materials that negatively affect optical clarity, is of particular interest. Studies emphasize methodologies and\/or observing technologies which are cost-effective, rapidly re-locatable, and offer insight into littoral phenomena. Studies to enable use of organic sensors on operational platforms to enhance battlespace situational awareness in continental shelf, nearshore, delta, estuarine, and riverine environments, including such phenomena as surface gravity waves and internal waves, currents, stratification, sediment transport and coastal winds. Understanding very shallow water acoustic propagation in coastal, nearshore, deltaic and riverine environments.\n\nMarine Mammals and Biology\n\nIntegrated Ecosystem Research \n\nBasic research to understand the patterns and causes of variability in the distribution and abundance of marine mammals over space and time. Research a multidisciplinary approach using tagging, visual surveys, and passive acoustics to collect baseline measures of marine mammal behaviors and distributions relative to environmental features and marine mammal prey fields. Investigate using animal tagging and passive acoustic monitoring to study behaviors and distributions of marine mammals relative to key environmental properties (biotic and abiotic). This includes providing a context for interpreting behavioral responses to external stimuli (i.e. anthropogenic sound), and providing basic knowledge needed for predictive models of species of concern.\n\nEffects of Sound\n \nBasic research on behavioral, physiological (hearing and stress response), and potentially population-level consequences of sound exposure on marine life. Research to characterize the causal chain of events leading from sound exposure to \"biologically significant\" behavioral reactions that might increase risks of population-level effects and\/or the potential for stranding. An additional focus is to characterize the gas management and kinetics (stores and use) in marine mammals. Research the mechanisms that enable marine mammals to dive to deep depths for long durations while mitigating, if not avoiding, health threats. Initiate research to advance our understanding of sound reception mechanisms in mysticetes (large whales) will require a thorough exploration of the anatomy surrounding the ear and the whole head combined with modeling sound propagation through various tissues of whale heads and\/or bodies. Another research focus is to better understand the stress response in marine mammals to sound exposure. Research an understanding of the natural variation of stress markers, better understand and characterize the relationships among hormones or other biomarkers in different matrices, define and compare the quantitative and temporal relationships of hormones across the different matrices, and evaluate and characterize the relationship between the physiological stress response in marine mammals and acoustic exposure and 'biologically significant' disturbance. Research to develop statistical models of the population consequences of acoustic disturbance to be fitted to data from marine mammal populations and lead collaborative development of transferable models of the effects of disturbance on marine mammals.\n\nMonitoring and Detection \n\nBasic research to develop and test new and existing technology to detect and classify marine mammals in the marine environment and during periods of low light such as passive acoustics, and IR. Research and development of passive acoustic signal processing algorithms for detection, classification, and localization of marine mammals. Continue the development and testing of autonomous hardware platforms using passive acoustics and\/or IR to detect and classify marine mammals using a variety of fixed, towed, floating, and profiling platforms.\n\nOcean Acoustics\n\nResearch to understand propagation and scattering of acoustic energy in shallow-water ocean environments. Areas of research include: shallow-water scattering mechanisms related to reverberation and clutter; seabed acoustic measurements supporting geoacoustic inversion; acoustic propagation through internal waves and coastal ocean processes and the development of unified ocean\/seabed\/acoustic models, including scattering from rough surfaces, biologics and bubbles; and penetration\/propagation within the porous seafloor.\n\nBattlespace Environments \n\nEmphasis is on improved measurements, laboratory and model based experiments to quantify and understand important oceanographic processes that lead to the development of ocean dynamic models from global to submesoscale scales, and to couple these oceanographic models with atmospheric, ice, biological, sediment response, and optical models. Surveillance of coastal land areas and waters is important to support Navy operations and difficult. The Navy\/Marine Corps needs include an improved use of overhead (airborne and satellite) active and passive microwave sensors, overhead optical sensors, surface-based (ships and ground-based) grazing angle microwave sensors. To predict bottom boundary physical, geological, geochemical, geoacoustic and geotechnical properties in shallow-water operating areas requires:  a) an improved understanding of processes that generate and modify the shape, structure and physical properties of the seafloor, subseafloor, ocean water column and ice-cover and topography\/morphology;  b) use of rapid, airborne characterization of littoral environments including time-varying coastal topography, littoral bathymetry, sea-level height, land and seafloor sedimentary structures to explain\/predict the observed changes; c) remote sensing of bulk properties of Arctic sea-ice over broad two-dimensional areas that previously could be sampled only at spot locations by in-situ sampling; and d) quantification of the influence of turbulence generated at the seafloor boundary layer on vertical mixing and stratification in shallow water outside the surf zone."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "81.641"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "81.641"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Physical Oceanography and Prediction\n\nComplete studies of the flow encountering abrupt topography in the Western Pacific on the mean and transient circulation structures. Continue the study of multi-scale embedded modeling and prediction. Conduct the studies of the prediction of and observations of 3-D Lagrangian studies and abilities to predict the vertical pathways in the ocean. Conduct the evaluation of novel employment of instrumentation including drifters and unmanned undersea vehicles to study these 3-D Lagrangian structures. Conduct the studies of the input and fate of near-initial shear and energy in the ocean via observational and predictive studies in the Greenland, Ireland, United Kingdom (GIUK) regions. Conduct the evaluation and testing and \"hardening\" of ocean instrumentation in high wave states and austere conditions. Conduct the study of the improvement of prediction systems by identifying, targeting, and obtaining key observations in critical targeted areas. Continue the evaluation of novel delivery systems of expeditionary ocean instrumentation to support targeted observing.\n  \nLittoral Geosciences and Optics  \n\nDevelop methodologies and\/or observing technologies, for air, sea surface or subsurface, manned or unmanned, which are: a) nimble, cost-effective, rapidly re-locatable, or will offer bold insight into littoral dynamics, (e.g., tagging of marine seabirds in the Distributed, Autonomous, Scalable Hydrographic Charting and Meteorology and Oceanography (METOC) Sampling (DASHCAMS) Department Research Initiative (DRI)), or b) utilize sensors on operational platforms in ways which increase battlespace awareness or can be used to map the maritime domain while idle. Conduct studies and modeling of shelf, near-shore, delta, estuarine, and riverine dynamics, including surface and internal waves, currents, stratification, sediment transport and the seabed response (Inner Shelf DRI) and coastal winds driving shallow water response (Coastal Land-Air-Sea DRI). Conduct studies to understand shallow water features which will affect acoustic propagation or acoustic system performance (Undersea Remote Sensing DRI) and\/or events which cause swimmer or navigational hazards (bathymetry-wave-current-wind interactions). Conduct studies using remote sensing of the coastal and riverine environment, above and below the sea surface and canopy, using electro-optic (EO), infrared (IR), radar, synthetic aperture radar (SAR),interferometric SAR (inSAR) and acoustic, from land or ship-based, unmanned vehicles, airplanes or satellites (Undersea Remote Sensing DRI). Develop new remote sensing tools and algorithms that can be used to initialize forecast models in distant, remote and\/or denied areas. Conduct modeling and field studies of storm processes affecting the littoral environment, including the atmosphere, sea surface, water column, sea bed and suspended or dissolved materials. Predicting the initiation, transport and\/or erosion of materials in response to storm events that create navigationally significant bathymetry or traffic-ability changes and\/or changes in optical clarity.\n\nMarine Mammals and Biology \n\nAreas of research include monitoring and detection, integrated ecosystem, and effects of sound on marine mammals. Conduct basic research to develop and test new and existing technology to detect, classify, localize and potentially track marine mammals in the marine environment, which are used to develop density and abundance estimates of marine mammals as a required input for all Navy sound effects modeling done under mandate of the federal Marine Mammal Protection Act and National Environmental Policy Act. Conduct multidisciplinary studies including tagging, visual surveys, and passive acoustics to collect baseline measures of marine mammal behaviors and distributions relative to environmental features and marine mammal prey fields. These baseline measures provide a context for interpreting responses to naval acoustic sources. Also, continue research on the effects of sound include behavioral, physiological (hearing and stress response), and population-level consequences of sound exposure on marine life. Conduct research to characterize the gas management and kinetics (stores and use) in marine mammals. Conduct research using increase in funds to characterize and quantify the cumulative effects of multiple stressors on marine mammal populations. Conduct research to advance our understanding of sound reception mechanisms in mysticetes (large whales).\n\nEffects of Sound \n\nResearch on behavioral, physiological (hearing and stress response), and potentially population-level consequences of sound exposure on marine life. Research to characterize the causal chain of events leading from sound exposure to biologically significant behavioral reactions that might increase risks of population-level effects and\/or the potential for stranding. An additional focus is to characterize the gas management and kinetics (stores and use) in marine mammals. Research the mechanisms that enable marine mammals to dive to deep depths for long durations while mitigating, if not avoiding, health threats. Initiate research to advance our understanding of sound reception mechanisms in mysticetes (large whales) will require a thorough exploration of the anatomy surrounding the ear and the whole head combined with modeling sound propagation through various tissues of whale heads and\/or bodies. Another research focus is to better understand the stress response in marine mammals to sound exposure. Research on understanding of the natural variation of stress markers, better understand and characterize the relationships among hormones or other biomarkers in different matrices, define and compare the quantitative and temporal relationships of hormones across the different matrices, and evaluate and characterize the relationship between the physiological stress response in marine mammals and acoustic exposure and biologically significant disturbance. Research to develop statistical models of the population consequences of acoustic disturbance to be fitted to data from marine mammal populations and lead collaborative development of transferable models of the effects of disturbance on marine mammals.\n\nMonitoring and Detection\n\nResearch to develop and test new and existing technology to detect and classify marine mammals in the marine environment and during periods of low light such as passive acoustics, and infrared (IR). Research and development of passive acoustic signal processing algorithms for detection, classification, and localization of marine mammals. Continue the development and testing of autonomous hardware platforms using passive acoustics and\/or IR to detect and classify marine mammals using a variety of fixed, towed, floating, and profiling platforms. \n\nArctic sciences \n\nResearch to improve the understanding of physical processes in the Arctic environment that impact current and projected Naval operations. Efforts include research to characterize the behavior of sea ice, including melt and reformation, ice rheology and motion, and interactions with ocean stratification, surface waves, and the atmosphere. The research program includes development of Arctic System models and data assimilation techniques for improved prediction, exploration and development of new sensors and unmanned platforms to collect observations of the Arctic environment, and the research into new algorithms to characterize sea ice from space-based remote sensing. An effort to better understand processes controlling the stratification of the Arctic Ocean will conclude this year. \n\nOcean Acoustics \n\nExpand research to understand propagation and scattering of acoustic energy in a wide range of ocean environments. New emphasis will be placed on the information content contained in underwater acoustic signals for use in machine learning\/big-data analytics. Areas of research include shallow-water scattering mechanisms related to reverberation and clutter; seabed acoustic measurements supporting geo-acoustic inversion; acoustic propagation through internal waves and coastal ocean processes and the development of unified ocean\/seabed\/acoustic models, including scattering from rough surfaces, biologics and bubbles; and penetration\/propagation within the porous seafloor. In deep water research will include the effects of environmental variability induced by ocean internal waves, internal tides and mesoscale processes, and by bathymetric features including seamounts and ridges, on the stability, statistics, spatial distribution, and predictability of broadband acoustic signals. Also of interest is the coherence and depth dependence of deep-water ambient noise. An increasing emphasis will be placed on understanding the effects of Arctic conditions on acoustic propagation and ambient noise, particularly in under-ice environments, as facilitated by a basin wide data collection effort scheduled to begin in FY 2020.\n\nBattlespace Environments \n\nThe overall objective of this research is to improve basic understanding of physical, seafloor and biological oceanographic processes on space and time scales of naval interest. The work includes studies of aspects of ocean\ncirculation (fronts, eddies and turbulence), thermodynamics (mixing and acoustic impacts), waves (including their impact on sea ice and rogue waves), sea ice (including land fast ice) as well as ocean boundary layer processes.\nEmphasis is on improved measurements, laboratory and model based experiments to quantify and understand important oceanographic processes that lead to the development of ocean dynamic\/thermodynamic models from global to submesoscale\nscales, and to couple these oceanographic models with atmospheric, ice, biological, sediment response, and optical models. Surveillance of coastal land areas and waters is important to support Navy operations, so the research\nfoci include an improved use of overhead (airborne and satellite) active and passive microwave sensors, overhead optical sensors, surface-based (ships and ground-based) grazing angle microwave sensors. To predict bottom boundary\nphysical, geological, geochemical, geoacoustic and geotechnical properties in shallow-water operating areas requires: a) an improved understanding of processes that generate and modify the shape, structure and physical properties of the seafloor, subsea floor, ocean water column and ice-cover and topography\/morphology; b) use of rapid, airborne characterization of littoral environments including time-varying coastal topography, littoral bathymetry, sea-level height, land and seafloor sedimentary structures to explain\/predict the observed changes; c) remote sensing of bulk properties of Arctic sea-ice over broad two-dimensional areas that previously could be sampled only at spot\nlocations by in-situ sampling; and d) quantification of the influence of turbulence generated at the seafloor boundary layer on vertical mixing and stratification in shallow water outside the surf zone."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 is a result of the realignment of funds within the PE from Basic Research Challenge program into Ocean Sciences Activity to better identify and continue understanding the effects of Arctic conditions on acoustic propagation and ambient noise, particularly in under-ice environments, as facilitated by a basin-wide data collection effort scheduled to begin in FY 2020. These efforts were initiated as part of the FY 2019 Basic Research Challenge program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SCIENCE AND ENGINEERING EDUCATION, CAREER DEVELOPMENT AND OUTREACH"
                                    },
                                    "Description": {
                                        "val": "Science and Engineering Education and Career Development activities include Department of the Navy (DON) participation in science fairs, summer research interns\/fellows at Navy laboratories, graduate fellowships for individuals expected to become members of the engineering faculty at Historically Black Colleges and Universities and Minority Institutions (HBCU\/MIs), and curricular enrichment programs. It is centered on Naval S&T efforts supporting Science, Technology, Engineering and Math (STEM). Outreach includes the encouragement, promotion, planning, coordination and administration of Naval Science and Technology. \n\nThe Department of the Navy's (DON) Historically Black Colleges and Universities\/Minority Institutions (HBCU\/MI) program oversees the Navy's efforts to engage and support our nation's HBCU\/MIs and is responsible for developing and managing efforts that strengthen and support the capabilities of HBCU\/MIs to participate in basic, applied, and advanced research programs within the Naval Research Enterprise (NRE). \n\nSCHOOLHOUSE TRAINING: Discovery research on instructional strategies and techniques for schoolhouse training including virtual, augmented, and mixed reality environments. Correlate effective schoolhouse training and measures of downstream performance, including development of theories into skill acquisition and decay.\n\nThe ONR Young Investigator Program (YIP) was established in 1985 to attract outstanding faculty members to the Department of Navy's basic research program by identifying individuals that show exceptional promise for doing creative research and encourage their teaching and research careers through long term support.  Young Investigator awards are for a period of three years. Annual request for proposals are solicited via a funding opportunity announcement and is open to tenure-track faculty in science, engineering, and mathematics. Topics are competitively selected based on faculty achievements, technical proposal, benefit to the Navy and Marine Corps, and institution support.\n\nNaval Research Institution:Through a Memorandum of Understanding between the United States Naval Academy (USNA) and the Office of Naval Research, this program contributes to the technical education of midshipmen by providing an opportunity to enhance their experience in research and knowledge of the positive impact that understanding of Science, Technology, Engineering, and Mathematics (STEM) has on fleet and forces capabilities.  \n\nFunding also supports the Office of Naval Research (ONR) Global mission to serve as the preeminent external facilitator for the NRE.  This is accomplished by establishing quality, relevant connections between the international research and development community, Naval fleet\/forces, Department of Defense (DOD), other US Government agencies and international partners. The direct impact of this investment is to leverage international basic research during increasingly dynamic global interdependence and improve the ability to solve DON Science & Technology challenges through shared knowledge with partners. \n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.639"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Science, Technology, Engineering and Math (STEM)\n\nInitiated STEM initiatives and multi-year efforts that are intended to be approximately three years in length and in topics supporting STEM education relevant to naval science and technology workforce development by improving STEM education curriculum enrichment and student experiences in higher education and high schools, coordination and support of STEM efforts across DON, and participation of naval personnel in science fairs.\n\nInternational Outreach - ONR Global\n\nONR Global will support 26 PhD level scientists engaging with international scientists and engineers through liaison visits to research institutions in more than 60 countries. ONR will be establishing a new office in India."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "44.229"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support STEM initiatives and multi-year efforts that are intended to be approximately three years in length and in topics supporting STEM education relevant to naval science and technology workforce development. Start development of pilot efforts to improve STEM through the development of new curricula and experiential learning activities that respond to new naval Science and Technology personnel and knowledge needs.  Expand existing successes to scale working projects and achieve greater impact and implementation of funded efforts.  Support new activities to targeting regional efforts to drive greater impact on educational systems and increase workforce opportunity for the naval Science and Technology community. Continue coordination of DON STEM efforts.  Enhance and maximize HBCU\/MIs faculty and student awareness of STEM and other defense-related educational research opportunities to make significant contributions to Naval Research Enterprise. Support efforts to provide student internships and faculty fellowships that will increase the capability of Science and Technology efforts into a new age of discovery.\n\nONR Global will continue fostering international collaboration and issuing basic research grants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.014"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.014"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support Science, Technology, Education and Mathematics (STEM) initiatives and multi-year efforts that are intended to be approximately three years in length and in topics supporting STEM education relevant to naval science and technology workforce development. Start development of pilot efforts to improve STEM through the development of new curricula and experiential learning activities that respond to new naval Science and Technology personnel and knowledge needs.  Expand existing successes to scale working projects and achieve greater impact and implementation of funded efforts.  Support new activities to targeting regional efforts to drive greater impact on educational systems and increase workforce opportunity for the naval Science and Technology community. Continue coordination of Department of the Navy (DON) STEM efforts.  \n\nThis effort will continue to  support programs that provide hands-on research experiences in STEM fields for United States Naval Academy (USNA) midshipmen and faculty members to enhance the midshipmen's educational environment at the USNA.\n\nEnhance and maximize HBCU\/MI's faculty and student awareness of STEM and other defense-related educational research opportunities to make significant contributions to the NRE by increasing the number of students and faculty participating in DoN HBCU\/MI fellowships and internships and increasing the number of Research and Development grants awarded by the DoN HBCU\/MI Program to HBCU\/MIs. Support efforts to provide student internships and faculty fellowships that will increase the capability of Science and Technology efforts into a new age of discovery. Ongoing efforts include attracting student veterans to research and career opportunities in STEM related fields.\n\n25 to 35 Young Investigators are selected for award annually from the many proposals received. Ongoing efforts cover a wide range of topics of naval S&T interest. Recent topics include innovative technical approaches to: vortex flow in hypersonic aerodynamics; real-time accurate positioning in robotics, acoustic meta-materials for marine surfaces, cyclone intensity forecasting, advanced mathematical optimization for statistical applications, cephalopod inspired camouflage, digitization of human performance, soil characterization capability from remote sensing, thermal transport at solid-solid interfaces, and high-temperature multi-principal alloys. These and other research topics will benefit today's and the next generation warfighter by improving lethality, survivability, communications, and training. Additionally, many of these investigators will provide long-term support and knowledge in solving naval related S&T challenges.\n\nONR Global will foster collaboration with international organizations and researchers by awarding grants in innovative basic research to discover, access and assess revolutionary, high-payoff technologies for future Naval missions and capabilities.\n\nSCHOOLHOUSE TRAINING: Discovery research efforts include: (i) Developing optimized training and retention models; (ii) Designing better training schedules; and (iii) Developing skill tutors for maintenance tasks."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 is a result of the realignment of funds from within this PE, Basic Research Challenge Activity into the Science and Engineering Education, Career Development and Outreach Activity, to better identify and continue Science and Engineering Education, Career Development and Outreach effort(s) initiated as part of the FY 2019 Basic Research Challenge program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SENSORS, ELECTRONICS AND ELECTRONIC WARFARE (EW)"
                                    },
                                    "Description": {
                                        "val": "Efforts include the basic research portions of: sensing, diagnostics, and detectors; navigation and timekeeping; nanoelectronics; wide band gap power devices; real-time targeting; Electro-Optical\/Infra-Red (EO\/IR) electronics; EO\/IR electronic warfare; EO\/IR sensors for surface\/aerospace surveillance; Radio Frequency (RF) sensors for surface\/aerospace surveillance; solid state electronics; vacuum electronics; and RF electronic warfare.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.645"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Sensors, Electronics and Electronic Warfare (SEEW)\n\nContinued basic research in the areas of solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, simultaneous signal functionality for conventional system contexts, including, but not limited to, satellite communications (SATCOM), Surveillance, Electronic Warfare (EW), signal intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals; and continue research to advance navigation, timekeeping and sensing technology, including cooling and trapping of atoms and ions; Bose-Einstein condensation and coherent matter- wave physics; optically-based frequency standards; improved time and frequency metrology using quantum entanglement and quantum logic processing; quantum optomechanics; and coherence and control of quantum systems.\n\nIntramural Undersea Warfare  \n\nConducted research focused on using a broad spectrum of techniques, including acoustic holography, new optical\/electrical\/magnetic measurement technologies, phonon transport measurement and control, and advanced numerical methods.  Investigates physical phenomena related to acoustic propagation in oceanic environments that exhibit variations in impedances, sound speeds, density, sedimentation, bathymetry, and oceanography to improve system prediction performance, sonar processing, and to discover novel concepts for ASW.  The work relates directly to the Navy's need for thermoelectric power generation, devices and systems having improved performance for shallow water Anti-Submarine Warfare (ASW), acoustic and electric signature measurement and control, and energy generation.  \n\nIntramural Electromagnetic Warfare\n\nFundamental research is being conducted looking at revolutionary mechanisms for advance tracking techniques for the joint battle space.  A very novel concept of using radars for long range speech reception and playback is ongoing.  RCS prediction capabilities for naval vessels is being researched to cover ultra-wide bandwidths, significantly expanding our predictive narrow band capabilities.  When coupled with another developmental effort on multistatic radar theory will provide a broad perspective of target signatures essential to defining radar and EW performance requirements.\n\nIntramural Materials and Chemistry\n\nDesign novel experiments and theoretical models to create advanced or improved materials using new concepts and techniques for applications and sensors and advanced electronics. For applications to improve target identification algorithms utilizing non linier dynamics to understand and demonstrate the principles and mechanisms of DNA-based molecule-scale machines to amplify detection of biochemical agents. Fabricate single normal layer of materials to create monolayer ferromagnets and semiconductors. The material of choice will be single layer MoS2 for utilization as indirect gap semiconductors. The Navy unique single stage accelerator mass spectrometer to evaluate the fine scale detection limits of fusion products and isotopes.  Understanding of the protein-surface interactions will be directed to fabricate biosensors. First principle theoretical models are developed to understand the principles governing the interactions between surfaces and small molecules. \n\nIntramural Electronics\n\nCreate new knowledge and understanding and explore new concepts, components, techniques and methods, for the design, growth, and characterization of electronic, electromagnetic, and electro-optical materials, fabrication processes, electronic and electro-optic components, including novel electromagnetic concepts and techniques, and plasma phenomena and theory."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "48.386"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Expanded the efforts identified within Undersea Warfare, Electromagnetic Warfare, and  Materials and Chemistry\n\nSensors, Electronics and Electronic Warfare (SEEW)\n\nConduct basic research in the areas of solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, simultaneous signal functionality for conventional system contexts, including, but not limited to, satellite communications (SATCOM), Surveillance, Electronic Warfare (EW), signal intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals; and continue research to advance navigation, timekeeping and sensing technology, including cooling and trapping of atoms and ions; Bose-Einstein condensation and coherent matter- wave physics; optically-based frequency standards; improved time and frequency metrology using quantum entanglement and quantum logic processing; quantum optomechanics; and coherence and control of quantum systems.\n\n\nElectronics  \n\nCreate new knowledge and understanding and explore new concepts, components, techniques and methods, for the design, growth, and characterization of electronic, electromagnetic, and electro-optical materials, fabrication processes, electronic and electro-optic components, including novel electromagnetic concepts and techniques, and plasma phenomena and theory. \n\nElectromagnetic Warfare\n\nFundamental research is being conducted looking at revolutionary mechanisms for advanced tracking techniques for the joint battle space.  A very novel concept of using radars for long range speech reception and playback is ongoing.  RCS prediction capabilities for naval vessels is being researched to cover ultra-wide bandwidths, significantly expanding our predictive narrow band capabilities.  Other promising avenues of research will allow for asymmetric warfare through image recovery in previously denied conditions, provide the necessary theoretical foundation and produce algorithmic tools for performing target detection and discrimination via multiple resource constrained antennas operating in highly cluttered environments, and significantly improve the ability to track extremely maneuverable targets and handle nonlinear measurements in radar and sonar systems. \n\nMaterials and Chemistry \n\nDesign novel experiments and theoretical models to create advanced or improved materials using new concepts and techniques for applications and sensors and advanced electronics. Improve target identification algorithms utilizing nonlinear dynamics. Understand and demonstrate the principles and mechanisms of DNA-based molecular-scale machines to amplify detection of biochemical agents. Fabricate single atomic layer of materials to create 2-dimensional ferromagnets and semiconductors. The material of choice will be single layer MoS2 for utilization as indirect gap semiconductors. The Navy unique single stage accelerator mass spectrometer to evaluate the fine scale detection limits of fusion products and isotopes.  Understand protein-surface interactions leading highly sensitive biosensors. First principle theoretical models are developed to understand the principles governing the interactions between surfaces and small molecules. Previous studies in these areas have demonstrated success in designing biological and chemical sensors with parts per trillion sensitivity as well as understanding of electronic mobility of graphene due to the effects of edge and defects.\n\nUndersea Warfare \n\nPerform laboratory, field, and theoretical\/numerical studies to investigate physical phenomenon related to acoustic propagation and scattering in oceanic environments such as: approaches to predict the scattering signature of a structure using noise sources of opportunity; investigate the fundamental physical phenomena of wave propagation in ocean environments; and approaches to separate of an acoustical field from turbulent flow on an acoustic array."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.804"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.804"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors, Electronics and Electronic Warfare (SEEW)\n\nConduct basic research in the areas of solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, simultaneous signal functionality for conventional system contexts, including, but not limited to, satellite communications (SATCOM), Surveillance, Electronic Warfare (EW), signal intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals; and continue research to advance navigation, timekeeping and sensing technology, including cooling and trapping of atoms and ions; Bose-Einstein condensation and coherent matter- wave physics; optically-based frequency standards; improved time and frequency metrology using quantum entanglement and quantum logic processing; quantum optomechanics; and coherence and control of quantum systems.\n\nElectronics  \n\nCreate new knowledge and understanding and explore new concepts, components, techniques and methods, for the design, growth, and characterization of electronic, electromagnetic, quantum phenomenology, and electro-optical materials, fabrication processes, electronic and electro-optic components, including novel electromagnetic concepts and techniques, and plasma phenomena and theory. Create new knowledge and understanding for quantum computing algorithms and their use to create new understanding of materials by design, process optimization, and quantum simulation.\n\nElectromagnetic Warfare \n\nFundamental research is being conducted looking at a very novel concept of using radars for long range speech reception and playback is ongoing.  Radar Cross Section (RCS) prediction capabilities for naval vessels is being researched to cover ultra-wide bandwidths, significantly expanding our predictive narrow band capabilities.  When coupled with another developmental effort on multistatic radar theory will provide a broad perspective of target signatures essential to defining radar and EW performance requirements.  Research in the Electro-Optical\/Infra-Red (EO\/IR) domain will demonstrate new filtering technique enabling 30x gain in sensitivity  and 3x gain in resolution for multi-color image sensors.\n\nMaterials and Chemistry  \n\nDesign novel experiments and theoretical models to create advanced or improved materials using new concepts and techniques for applications and sensors and advanced electronics. Improve target identification algorithms utilizing nonlinear dynamics. Understand and demonstrate the principles and mechanisms of DNA-based molecular-scale machines to amplify detection of biochemical agents. Fabricate single atomic layer of materials to create 2-dimensional ferromagnets and semiconductors. The material of choice will be single layer Molybdenum disulfide (MoS2) for utilization as indirect gap semiconductors. The Navy unique single stage accelerator mass spectrometer to evaluate the fine scale detection limits of fusion products and isotopes.  Understand protein-surface interactions leading highly sensitive biosensors. First principle theoretical models are developed to understand the principles governing the interactions between surfaces and small molecules. Previous studies in these areas have demonstrated success in designing biological and chemical sensors with parts per trillion sensitivity as well as understanding of electronic mobility of graphene due to the effects of edge and defects.\n\nUndersea Warfare \n\nLaboratory, field, and theoretical\/numerical studies to investigate physical phenomenon related to acoustic propagation and scattering in oceanic environments such as: prediction of the scattering signature of a structure using noise sources of opportunity; fundamental physical phenomena of wave propagation in ocean environments; approaches to separate of an acoustical field from turbulent flow on an acoustic array; and new structural acoustics theory."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WEAPONS"
                                    },
                                    "Description": {
                                        "val": "This Program focuses on a number of fundamental scientific areas that are aimed at expanding the underlying understanding of disciplines that are broadly useful for a wide range of Naval applications, including: undersea weaponry; air weaponry; energetic materials and solid rocket propulsion; expeditionary operations, including communications, materials, landmine detection, human sensory enhancements, lightweight power sources and information efficiency; directed energy and counter directed energy, hypersonic aerodynamics and materials, and applied electromagnetics. This activity includes peer-review basic research to develop fundamental knowledge and enhance the science and engineering workforce and technology base."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.502"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Weaponry\n\nConduct basic research related to critical S&T for undersea weapons and supercavitation. Expand research related to the Undersea Weapons initiative to provide a further infusion of educated and career minded scientists and engineers in support of the National Naval Responsibility (NNR) for Undersea Weapons Research.\n\nEnergetic Materials and Propulsion\n\nConduct basic research into the science of energetic materials and advanced propulsion technology. Researched advanced energetic material which provide reactive, explosive, and propulsive phenomena including high energy ingredient synthesis, modeling, characterization, and the fundamentals of initiation and decomposition mechanisms. Program has explored the bounds of energy management between conventional electron bonding energies and that of nuclear binding energies. Current investigations focus on both theoretical and experimental processes using molecular design and crystal morphology theory for the selection of new insensitive munition (IM)-compliant commodity energetic material ingredients. Investigate development of a new methodology coordinating both theoretical and synthetic chemistry to maximize molecular design and predicted molecule stabilities facilitating insight into the next generation of energetic materials including research to develop ability to synthesize and quantitatively predict energetic material performance. Pursue research into sub-nano scale molecular systems and the energetic phenomena including initiation techniques, novel nozzle, tube and flow approaches, and sensing and propulsive control technology. Investigating efforts to explore alternative fuel concepts for Naval applications to include hydrogen, electric propulsion, synthetic diesel, and biodiesel. Conduct basic research into solid rocket motor system technologies for increased range, speed, improved stealth, and maneuverability. Pursuing research into Rotating Detonation Engines (RDEs) and their application to air vehicles and weapons including detonation initiation techniques, low-loss combustor isolation, fuel-air mixing, tube and flow approaches, and sensing and control technology.\n\nExpeditionary Operations\n\nTransfer all efforts of FY 2017 to the Sciences Addressing Hybrid Threats Activity within this same Program Element.\n\nCounter Directed Energy\n\nConduct research into the basic science and technology issues relevant to the propagation of directed energy in the atmosphere and its interaction with sensors, electronics and structural materials. Pursue investigation of the most promising physics, science, and mathematic solutions to protect naval assets against directed energy threats. Execute an assessment of theoretical constructs for directed energy (DE) systems detection and geolocation. Current research pursues the investigation into the susceptibility of critical naval electronic components to electromagnetic radiation. Conduct performance of laboratory experimentation on laser and High Power Microwave protection methods for future naval aviation systems and platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.306"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research will focus on undersea weaponry; energetic materials and propulsion; expeditionary operations (communications, materials for forensic sensing, landmine detection, human sensory enhancements, lightweight power sources and information efficiency); directed energy, counter directed energy and applied electromagnetics hypersonics.\n\nEnergetic Materials and Propulsion\n\nConduct basic research into the science of energetic materials and advanced propulsion technology. Researched advanced energetic material which provide reactive, explosive, and propulsive phenomena including high energy ingredient synthesis, modeling, characterization, and the fundamentals of initiation and decomposition mechanisms. Program has explored the bounds of energy management between conventional electron bonding energies and that of nuclear binding energies. Current investigations focus on both theoretical and experimental processes using molecular design and crystal morphology theory for the selection of new insensitive munition (IM)-compliant commodity energetic material ingredients. Investigate development of a new methodology coordinating both theoretical and synthetic chemistry to maximize molecular design and predicted molecule stabilities facilitating insight into the next generation of energetic materials including research to develop ability to synthesize and quantitatively predict energetic material performance. Pursue research into sub-nano scale molecular systems and the energetic phenomena including initiation techniques, novel nozzle, tube and flow approaches, and sensing and propulsive control technology. Investigating efforts to explore alternative fuel concepts for Naval applications to include hydrogen, electric propulsion, synthetic diesel, and biodiesel. Conduct basic research into solid rocket motor system technologies for increased range, speed, improved stealth, and maneuverability. Pursuing research into Rotating Detonation Engines (RDEs) and their application to air vehicles and weapons including detonation initiation techniques, low-loss combustor isolation, fuel-air mixing, tube and flow approaches, and sensing and control technology.\n\nUndersea Weaponry \n\nPursue advanced concepts for sea warfare and weapons to include conducting basic science and research to explore new ideas and technologies to enhance the performance of existing power & energy sources, undersea weapons, unmanned vehicles, aircraft, ships and submarines for the Navy.  Expand autonomous control  technology for surface and subsurface vehicles.\n\nDirected Energy\n\nExplore the scientific limitations of laser technology for utilization at tactically significant ranges.  The goals of the program include research of laser sources, adaptive optic compensation techniques, understanding of long range atmospheric propagation physics, and characterization of laser-matter interactions. This program will lead to understanding which DE is best for Naval defense applications.\n\nCounter Directed Energy \n\nInvestigate ability to counter directed energy weapons in high energy lasers or high power radiofrequency devices. Conduct performance assessments of laboratory components in phased experimentation on laser and High Power Microwave protection methods for future naval aviation and surface ship systems and platforms.\n\nHypersonics \n\nBasic research will address long-range weapon components able to survive high temperature exposure for several minutes and thwart anti-access\/ area denial countermeasures. Additional areas of research include Boundary layer physics in shock-wave dominated flows around highly-swept or slender bodies, Aero-thermo-elastic and\/or aero-servo-elastic effects arising from control surface actuation at high speeds, descriptions of high-speed boundary layer transition that unify theories across disparate external conditions, novel strategies for extending regions of laminar flow and advanced hypersonic aerodynamic design tools that incorporate modern predictions of transition pathways, freestream noise contributions, time\/heating-dependent surface finish effects, and unsteady aerodynamics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research will focus on undersea weaponry; energetic materials and rocket propulsion; directed energy, counter directed energy, applied electromagnetics, and hypersonics.\n\nUndersea Weaponry\nPursue advanced concepts for sea warfare and weapons to include conducting basic science and research to explore new ideas and technologies to enhance the performance of existing power & energy sources, undersea weapons, unmanned vehicles, aircraft, ships and submarines for the Navy. Sunset efforts on supercavitation and expand autonomous control technology for surface and subsurface vehicles and weapons.\n\n\nAir Weaponry\nResearch will focus on the areas of solid and hybrid rocket propulsion, advanced structural and aperture materials, navigation, aerodynamics, single and multi-missile control, and power management.  This effort will enable missiles with greatly increased speed, range and lethality to meet future naval warfare needs.\n\nDirected Energy\nResearch will focus on the scientific limitations of laser technology for utilization at tactically significant ranges. The goals of the program include research of laser sources, adaptive optics compensation techniques, understanding of long range atmospheric propagation physics, and characterization of laser-matter interactions. This program will lead to understanding which directed energy (DE) is best for Naval defense applications.\n\nCounter Directed Energy\nResearch will investigate ability to counter directed energy weapons in high energy lasers or high power radiofrequency devices. Analytical models, modeling and simulation, and laboratory experiments on laser and High Power Microwave protection methods for future naval aviation, missiles, and surface ship systems and platforms.\n\nEnergetic Materials and Rocket Propulsion \nResearch will investigate new energetic chemical compounds with superior specific energy and energy density, brisance, insensitivity, etc. for useful warhead fills and solid rocket propellants. Methods for improved understanding of formulations and advanced modeling and simulations on composite energetic materials will be investigated along with new methods and instruments for characterization.   \n\nHypersonics\nResearch will address the fundamental understanding of the underlying phenomena unique to hypersonic flight where extreme temperatures and other unique flow and material conditions arise. Areas of research include boundary layer physics in shockwave dominated flows around highly-swept or slender bodies, Aero-thermo-elastic and\/or aero-servo-elastic effects arising from control surface actuation at high speeds, descriptions of high-speed boundary layer transition that unify theories across disparate external conditions, novel strategies for extending regions of laminar flow and advanced hypersonic aerodynamic design tools that incorporate modern predictions of transition pathways, freestream noise contributions, time\/heating dependent surface finish effects, and unsteady aerodynamics. Ultra-high temperature materials, coatings, and thermal protection systems will also be investigated."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 is a result of the realignment of funds within the PE from Basic Research Challenge program into Weapons Activity to better identify and continue basic research in the areas of solid and hybrid rocket propulsion, advanced structural and aperture materials, navigation, aerodynamics, single and multi-missile control, and power management effort(s) initiated as part of the FY 2019 Basic Research Challenge program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BASIC RESEARCH CHALLENGE"
                                    },
                                    "Description": {
                                        "val": "The ONR Basic Research Challenge (BRC) program was established in 2008 to competitively select and fund promising research programs in new areas not addressed by the current basic research program. The program stimulates new, high-risk basic research projects in multidisciplinary and departmental collaborative efforts, and funds topics that foster leading edge science and attract new principal investigators and organizations. Basic Research Challenge awards are for a period of four years. Topics are submitted by Office of Naval Research (ONR) program officers and are selected for BRC awards. Basic Research Challenge award topics are then issued as a broad agency announcement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.918"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Basic Research into, high-risk multidisciplinary research areas including: autonomy, de-centralized on-line optimization, carbon molecular electronics, co-prime sensor array signal processing, small unit decision making training, biologically inspired flow field computation, algorithm optimization for multi-physics based models, composite explosive compounds, advanced analysis techniques for materials, and active supersonic jet noise control.  \n\nInitiate basic research topics in emerging fields of science including: multiscale theory for cavitation in complex soft materials; phase-resolved bottom-side IONosphere (BSION); decentralized perception in data-rich dynamic environments; enhanced manufacturability with electrical currents; distributed sensing, actuation and control in soft materials for flexible appendages; predictive and causal modeling; and new opportunities to transform wall-bounded turbulence understanding."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.059"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct basic research into, high-risk multidisciplinary research areas including: autonomy, de-centralized on-line optimization, carbon molecular electronics, co-prime sensor array signal processing, small unit decision making training, biologically inspired flow field computation, algorithm optimization for multi-physics based models, composite explosive compounds, advanced analysis techniques for materials, and active supersonic jet noise control.  \n\nConduct basic research topics in emerging fields of science including: multiscale theory for cavitation in complex soft materials; phase-resolved bottom-side IONosphere (BSION); decentralized perception in data-rich dynamic environments; enhanced manufacturability with electrical currents; distributed sensing, actuation and control in soft materials for flexible appendages; predictive and causal modeling; and new opportunities to transform wall-bounded turbulence understanding."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Beginning in FY 2020, the Basic Research Challenge program resources have been realigned into associated research efforts across the basic research portfolio to better align these resources with Navy Basic Research opportunities and priorities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2019 to FY 2020 is a result of the realignment of funds from within this PE from Basic Research Challenge Activity into Weapons; Mathematics Activity, Computer & Information Sciences; Human Systems Activity; Ocean Sciences;Science and Engineering Education, Career Development and Outreach Activity; and Science Addressing Hybrid Threats Activity to better identify and continue specific efforts associated with those Activities as initiated as part of the FY 2019 Basic Research Challenge program."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Defense Basic Research seeks to improve the quality of defense research conducted predominantly through universities and government laboratories. It also supports the education of engineers and scientists in disciplines critical to national defense needs through the development of new knowledge in an academic environment. Initial research focus is generally conducted in an unfettered environment because of the nature of basic research, but as more is learned and applications emerge, individual research projects take on a more applied focus. Individual project metrics then become more tailored to the needs of specific applied research and advanced development programs. Example metrics include a biporous wick structure for thermal management of power electric modules capable of removing 900 watts per square centimeter which was recently developed by an academia\/industry team. The National Research Council of the National Academies of Science and Engineering's congressionally directed \"Assessment of Department of Defense Basic Research\" concluded that the DoD is managing its basic research program effectively."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "40.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "40.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "35.000"
                                        },
                                        "Text": {
                                            "val": "Conduct basic research efforts including scientific study and experimentation directed toward increasing knowledge and understanding in national security related aspects of physical, engineering, environmental and life sciences. Basic research effort subject areas include: Autonomous Systems; Artificial Intelligence\/Machine Learning; Command, Control, Communications and Computers (C4); Marine as a System; Information Analysis and Decision Support; Intelligence, Surveillance and Reconnaissance; Logistics; Materials; Operational Environments; Platforms; Power and Energy Technology; Sensors and Electronics; Warrior Performance and Protection; Weapons and Support (Education and Outreach)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy ROTC Cybersecurity Training Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.500"
                                        },
                                        "Text": {
                                            "val": "Explore and implement a collegiate program to train Navy ROTC and civilian students to be  able to provide and enhance Naval cybersecurity as military or civilian experts. Funding will also support professorial mentoring and continued\neducation outreach."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}