{
    "id": "2020-Navy-PB-1319-MJBOOK-3-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-15",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605866N"
        },
        "ProgramElementTitle": {
            "val": "Navy Space & Electr Warfare Supt"
        },
        "R1LineNumber": {
            "val": "189"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "16.274"
            },
            "CurrentYear": {
                "val": "16.227"
            },
            "BudgetYearOne": {
                "val": "15.773"
            },
            "BudgetYearOneBase": {
                "val": "15.773"
            },
            "BudgetYearTwo": {
                "val": "17.632"
            },
            "BudgetYearThree": {
                "val": "17.789"
            },
            "BudgetYearFour": {
                "val": "16.952"
            },
            "BudgetYearFive": {
                "val": "17.136"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Project 0706, Electromagnetic Compatibility (EMC) and Radio Frequency (RF) Management Program: Develops advanced technology to identify and eliminate Electromagnetic Interference (EMI) sources from Navy systems.  Supports research and development technology efforts, develops top-level plans, and supports systems in the Space and Electronic Warfare (SEW) mission area.\n\nProject 3239, The Real-Time Spectrum Operations (RTSO) Program researches the Electromagnetic (EM) Environmental Effects (E3) between shipboard transmitters and receivers on ships and the interactions of the EM systems within the other systems installed on units within a strike group."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.341"
                },
                "CurrentYear": {
                    "val": "16.227"
                },
                "BudgetYearOne": {
                    "val": "22.450"
                },
                "BudgetYearOneBase": {
                    "val": "22.450"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.274"
                },
                "CurrentYear": {
                    "val": "16.227"
                },
                "BudgetYearOne": {
                    "val": "15.773"
                },
                "BudgetYearOneBase": {
                    "val": "15.773"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.067"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-6.677"
                },
                "BudgetYearOneBase": {
                    "val": "-6.677"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.067"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.177"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.177"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 funding was reduced by $1 Million for SEWIP Block 3 efforts and by $67 Thousand for Execution Realignment SBIR.\n\nFY 2020 funding was realigned into PU 3239 (SPAWAR) from PU 0706 (NAVSEA) starting in FY20 to support Real-Time Spectrum Operations (RTSO) transition to the designated lead capability integrator. Funding was realigned from NAVSEA to SPAWAR.\n\nFY 2020 funding request was reduced by $3 million (Proj 0706) to account for the availability of prior year balances.\n\nTransfer from RDTE&N  BA 6, Navy Space & Electronic Warfare Support (0605866N) to OMN BA 1, Ship Operational Support and Training (1B2B) for sustainment and integration for Real-Time Spectrum Operations (RTSO).   (Baseline $0)\n\nTransfer from RDTE&N  BA 6, Navy Space & Electronic Warfare Support (0605866N) to OMN BA 3, Specialized Skill Training (3B1K) for sustainment and integration for Real-Time Spectrum Operations (RSTO).   (Baseline $0)"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0706"
                    },
                    "ProjectTitle": {
                        "val": "EMC & RF Mgmt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "16.274"
                        },
                        "CurrentYear": {
                            "val": "16.227"
                        },
                        "BudgetYearOne": {
                            "val": "2.233"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.233"
                        },
                        "BudgetYearTwo": {
                            "val": "3.150"
                        },
                        "BudgetYearThree": {
                            "val": "3.104"
                        },
                        "BudgetYearFour": {
                            "val": "2.960"
                        },
                        "BudgetYearFive": {
                            "val": "3.014"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Electromagnetic Compatibility (EMC) and Radio Frequency (RF) Management Program. This project develops tools, processes, and algorithms to identify and mitigate EMI sources for Navy systems and platforms. \n\n(a) It will support the Afloat Electromagnetic Spectrum Operations Program (AESOP), an automated spectrum Fleet operational capability. The application will be enhanced to comply with fleet operational requirements and streamline Strike Force frequency management processes. It will provide automated Spectrum Management (SM) tools for development of operational task communication and radar\/weapon plans to support fleet deployments, exercises, and contingency operations. It will provide identification and mitigation of EMI in Navy, North Atlantic Treaty Organization (NATO), Allied, Ashore and Joint Combat Operations. It will provide analysis related to spectrum reallocation proposals to assess impacts on Navy operations and systems, as well as for the Spectrum Supportability Risk Assessments.\n\n(b) It will support the Shipboard Electromagnetic Compatibility Improvement Program (SEMCIP) to identify, engineer, and evaluate effectiveness of potential EMI corrections. The program also characterizes and quantifies the operational impact of EMI problems on system's mission performance.\n\n(c) It will support the Nuclear Electromagnetic Pulse (EMP) Survivability Program. The program assesses the EMP survivability of all mission critical systems and funds development of a hardness assurance and maintenance program. It will develop improved modeling capability to reduce hardness validation costs at delivery and over the lifetime of the system\/platform. The program develops new and updated design criteria, test methodology, test limits, and survivability validation procedures for all Navy systems, ships, submarines and shore facilities.\n\n(d) It will support the Real-Time Spectrum Operations Program (RTSO). The program researches the Electromagnetic (EM) Environmental Effects (E3)between shipboard transmitters and receivers on ships and the interactions of the EM systems within the other systems installed on units within a strike group.  The program will develop a capability to monitor the EM Spectrum Usage on a ship and be able to validate the spectrum plan to ensure Electromagnetic Capability (EMC) is achieved within the strike group.  The program will develop a capability to display compliance with the spectrum plan in a Common Operational Picture (COP) display.  These initial capabilities of Own Force Monitoring provide Battlespace Awareness and will be instrumental in enabling Electromagnetic Maneuver Warfare.  These capabilities of self-awareness will further enhance the Navy's ability to perform Command and Control (C2) of the EM Spectrum warfighting domain. \n\nAt the direction of OPNAV, in the beginning of FY2018 the project changed the technical approach to mitigate cost, schedule, and performance risks associated with the original Hardware (H\/W) solution that required extensive\nintegration and networking of all spectrum dependent systems.  The revised technical approach simplifies the original hardware plan required in favor of a centralized radio frequency monitoring capability with software applications that can still meet fleet requirements of own force monitoring.  This has resulted in near term schedule delay that is recoverable in FY19."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Afloat Electromagnetic Spectrum Operations Program (AESOP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.680"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Researched International, National, DoD and Navy spectrum processes that could impact Naval operations.  - -     - - Evaluated COMSEVENTHFLT draft littoral radiation restrictions for technical accuracy and assisted with corrective actions.\n- Identified new\/modified military equipment, including new allied radars impacting USN systems, and reviewed equipment spectrum usage and requirements to provide automated capability to ships.\n- Performed analysis of new\/modified systems against existing Fleet equipment spectrum use, and developed potential scenarios for further testing and evaluation.\n- Evaluated, tested, and integrated software updates to toolkits and application programming interfaces (APIs); ArcGIS, SQL Server, and Advanced Propagation Models (APM).\n- Documented electromagnetic compatibility criteria in the NAVSEA Operational Publication S9407-AA-GYD-010\/(S) OP-3840 \"Electromagnetic Compatibility Criteria for Navy Systems (U)\"."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.324"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Identify new\/modified military equipment and update AESOP models and database to de-conflict and coordinate spectrum use.\n- Research and update spectrum usage in Numbered Fleet Standing Communications Plans to accommodate new\ncommunications systems and host nation infrastructure spectrum usage.\n- Develop and refine spectrum coordination new software for Zumwalt and Gerald R Ford class high-power radars and operational concepts.\n- Develop and refine software and database modifications to support new Navy shipboard and airborne spectrum-dependent systems (SDSs), i.e., AMDR and EASR slated for 2020-2021 fielding aboard USN ships.\n-Research, assess, and implement in software the international, national, DoD, and Navy spectrum littoral restrictions, laws, treaties, and policies to ensure compliance.\n- Conduct analysis for Spectrum Supportability Risk Assessments.\n- Update electromagnetic compatibility criteria in the NAVSEA Operational Publication S9407-AA-GYD-010\/(S) OP-3840 \"Electromagnetic Compatibility Criteria for Navy Systems (U)\"."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Identify new or modified military equipment, and prioritize systems and their impacts. \n- Develop software updates, for spectrum models, develop revised electromagnetic compatibility (EMC) criteria, spectrum coordination procedures, and update required databases.\n- Document electromagnetic compatibility criteria in the NAVSEA Operational Publication S9407-AA-GYD-010\/(S) OP-3840 \"Electromagnetic Compatibility Criteria for Navy Systems (U)\".\n- Research and update spectrum usage and revised coordination procedures based on updates to Numbered Fleet Standing Communications Plans. \n- Research and update spectrum usage and revised coordination procedures based on updates to international or national guidance to ensure compliance.\n-Research and assess data sources for Navy ships and submarine location data. \n- Develop software architectures and spectrum compatibility and coordination procedures for Navy systems.\n- Monitor and assess revised cybersecurity regulations for potential impacts to deployed spectrum management software.\n- Develop mitigation strategies, and develop software updates."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of -0.018 from FY 2019 to FY 2020 is due to ExecRealign SB."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Shipboard Electromagnetic Compatibility Improvement Program (SEMCIP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Identified and performed EMI Problem Characterization and Quantification to identify level of problem severity.  EMI problems with a high severity level debilitate combat capability of strike force capability and operational readiness are added to the priority list for evaluating potential EMI solutions.\n- Evaluated the Navy's Next Generation: Radars (i.e., Multi-Band and Dual Band Radars), Electronic Warfare Systems (i.e., Ships Signal Exploitation Equipment Increment F), Satellite Communication (i.e., the Navy Multi-Band Terminal and the Commercial Broadband Satellite Program), and Common Data Link (CDL) Programs.\n- Evaluated Commercial Off the Shelf (COTS) systems\/radars and the integration of Unmanned Aircraft Systems (UAS).\n- Developed and evaluated effectiveness of proposed EMI solutions and coordinated with system program managers for proper integration of final EMI solutions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.677"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop instrumentation to extract digital data and raw video from several different search radars enabling quantitate (instead of qualitative) assessment of performance degradation and electromagnetic interference.\n- Develop instrumentation to perform non-invasive (i.e. off satellite) bit error rate test methods for SATCOM system enabling EMI quantification at the modem later, rather than spectral layer, to quantify impacts in terms of data rate and satellite resources.   \n- Develop and evaluate effectiveness of proposed EMI solutions and coordinate with system program managers for proper integration of the final EMI solution.\n- Perform EMI Problem Characterization and Quantification on approximately 60 specific EMI problems to identify level of problem severity and prioritize EMI mitigation efforts.\n- Evaluate the Navy's Next Generation: Radars (i.e., Enterprise Air Search Radar, Air & Missile Defense radar, Dual Band Radar, Next Gen Surface Search Radar, etc.), Electronic Warfare Systems (i.e., Surface Electronic Warfare Improvement Program and Ships Signal Exploitation Equipment Mods), Satellite Communication (i.e., the Navy Multi-Band Terminal and the Commercial Broadband Satellite Program), and Common Data Link Programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Characterize and quantify operational impact of Electromagnetic Interference (EMI) on approximately 60 specific EMI problems to identify level of problem severity and prioritize EMI mitigation efforts, with Fleet commanders, system and ship or submarine program managers.\n- Provide engineering, analytical, and technical support to achieve electromagnetic compatibility (EMC) among and between shipboard electronic\/electric systems and\/or equipment.  \n- Develop and evaluate the effectiveness of proposed Electromagnetic Interference (EMI) solutions to mitigate interference among and between shipboard electronic\/electric systems and\/or equipment.  \n- Coordinate the proposed solutions with the system and ship or submarine program managers for ensure proper integration, and long term logistic support. \n- Develop and field limited production fixes, and evaluate their effectiveness in mitigating shipboard Interference.  \n- Investigate the operational impacts to deployed shipboard radars, based on the Radar Spectrum Engineering Criteria (RSEC) to ensure continued operational capability.  \n- Develop innovative measurement capabilities, to reduce test time and to quantify electromagnetic environmental effects of Navy platforms, systems, subsystems, and equipment to and from their intended operational electromagnetic environment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of 0.033 from FY 2019 to FY 2020 due to the required technical support needed to perform Radar Spectrum Engineering Criteria analysis."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Pulse (EMP) Survivability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Performed Modeling and Simulation (M&S) Verification, Validation, & Accreditation (VV&A) efforts\n- Supported Development of obtaining a higher confidence, low cost High Altitude Electromagnetic Pulse (HEMP) survivability assessment in lieu of full ship threat level testing.\n- Conducted HEMP survivability assessments using existing methods onboard an existing ship and compare measurements to multiple, independent M&S investigations leveraging different methodologies \n- Investigated Data Acquisition capability conceptual design\n- Initiated conceptual at-sea HEMP demonstration plan"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.811"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop computational electromagnetic (CEM) modeling capability to assist in ship hardness design.\n- Develop small-scale test capability to assist in understanding phenomena associated with complex shipboard electrical design and energy coupling\/cross-coupling to the cables in order to support EMP critical item design, testing, maintenance, and repair required to incorporate EMP survivability into the fleet. \n- Complete Modeling and Simulation (M&S) Verification, Validation, & Accreditation (VV&A) efforts\n- Continue investigation of obtaining high confidence, low cost HEMP testing technology\n- Continue support for Naval Ordinance Transient Electromagnetic Simulator (NOTES)\n- Refine at-sea HEMP demonstration plan\n- Initiate Data Acquisition capability\n- Develop and\/or improve design criteria, test methodology, test limits, and survivability validation procedures for Navy systems, ships, submarines and shore facilities. Continue research and development of integrated solutions that can be used for EMP hardening improvement and benefiting EMI reduction such as cable shield ground adapters (CSGAs) and terminal protection devices (TPDs).\n- Enhance CSGA RDTE and Navy Pulse Current Injection (PCI) testing to meet requirements in Appendix C of MILSTD-4023, Shipyard Protective Elements Testing. Update appropriate MIL-STD procedures to reflect appropriate test methodologies and validation procedures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.660"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.660"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete computational electromagnetic (CEM) modeling capability to assist in ship hardness design.\n- Develop new Hybrid-Based High Altitude Electrometric Pulse (HEMP) evaluation technique to evaluate HEMP hardness of navy ships via a low-cost, low potential for equipment damage and quicker method of analysis (decreasing costs in the performance of tests).\n- Investigate small, inexpensive measurement devices for incorporation into Hybrid-Based HEMP evaluation methodology.\n- Develop instrumentation and data acquisition capability in support of the HEMP Ashore Test Facility [i.e., Naval Ordinance Transient Electromagnetic Simulator].\n- Develop and\/or improve design criteria, test methodology, test limits, and survivability validation procedures for Navy systems, ships, submarines and shore facilities.\n- Perform research and development of integrated solutions that for EMP hardening. Investigate improvements to the cable shield ground adapters, terminal protection devices and cable maintenance procedures."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of 0.087 from FY 2019 to FY 2020 is due to support development of new Hybrid-Based High Altitude Electromagnetic Pulse (HEMP) evaluation technique"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Real-Time Spectrum Operations (RTSO)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.623"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Developed, integrated and lab tested ship's positional updates to enable real-time calculations of electromagnetic interference\/feed to resolve real-time interference identification and mitigation.\n- Investigated and integrated Meteorological and Oceanographic (METOC), refractivity, climatology data and update propagation models to include in the real-time calculations into RTSO version 1.0 software \n- Demonstrated RTSO-BUILDER interface during East Coast USN-USMC Spectrum Summit 24-25 April 2018.\n- Completed Authority to Operate (ATO) for RTSO version 1.0 software upload to Consolidated Afloat Networks and Enterprise Services (CANES) network installation in a stand-alone configuration, ISNS, TRA-NET, ONEnet, and SubLAN.\n- Submitted Authority to Operate (ATO) for RTSO version 1.0 software for approval on cNMCI networks and the Crytpo Carry-On Program (CCOP) Own-Force Monitor computers.\n- Achieved first edition of RTSO Spectrum Common Operating Picture (COP) enabling Electromagnetic Maneuver Warfare (EMW) capabilities providing spectrum situational awareness of the strike group within the AOR.\n- Developed and published RTSO v1.0 software to output the Common Operational Spectrum Report, Net Connectivity, and EMI Interactions graphical picture.  \n- Developed and integrated multiple user defined displays and Graphical User Interfaces (GUIs) enabling operator to tailor views based on operational needs.\n- Developed and integrated first generation Satellite Communications (SATCOM) tools (i.e., blockage, jamming\/interference, and coverage) into a RTSO GUI for mission critical SATCOM systems.  (Next generation will address mitigation options, within the constraints of the national-level SATCOM frequency assignment processes.)\n- Investigated and developed RTSO Software interface requirements for Combat Systems baselines [i.e., AEGIS and Ship Self-Defense System (SSDS)].   Developed RTSO software interface to the baseline 9 Aegis Combat System via the ERDDS (Enhanced Radar Data Display System) external box for demonstration of dynamic sector blanking.\n- Defined RTSO Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, Facilities and Policy (DOTMLPF-P) requirements that effect Manpower, Personnel, Training and Education (MPT&E) requirements and solutions.\n- Began incorporation of Spectrum Management tools in EMSOC COI and FSM COI to include RTSO V1.0\n- Developed a plan for RTSO training and certification requirements analysis for course development and implementation within the RTSO NTSP and Theater\/Fleet Training Plans.\n- Developed\/updated Job Duty Task Analysis (JDTA) requirements to support RTSO equipment basic and tactical operation to support Task Unit and Strike Group personnel.\n- Identified the Knowledge, Skills, and Abilities (KSAs) necessary for leaders, warfighters, civilians, and contractor personnel to understand and effectively utilize RTSO. Developed\/updated Personnel Qualification Standard (PQS) to support RTSO JDTA requirements.\n- Developed and fielded fleet-wide the \"Spectrum Access and Awareness Guide\" document, which provides the information necessary for leaders, warfighters, civilians, and contractor personnel to develop the knowledge, skills, and abilities to understand and effectively utilize RTSO."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Based on evolving fleet requirements and feedback on prior versions of RTSO software, research, develop, enhance, and refine recommended actions to;\n(a.) resolve interferences;\n(b.) refractivity, climatology, and propagation model accuracy;\n(c.) spectrum common operational picture, tailored to multiple users' perspectives and a chain of command spectrum briefing package generator;\n(d.) navigation, location, and position data interfaces; \n(e.) frequency plan compliance validation; and\n(f.) automated Emissions Control (EMCON) bill generator.\n- Conduct research, development, testing, and evaluation for own-force spectrum monitoring capabilities, including commercial and military sensors, antenna, and network connections.\n- Research and develop proof-of-concept capabilities for spectrum mission planning decision aids and intelligent sectoring\/cut-outs for radiating systems\n- Initiate research and development efforts for models to estimate effective RF performance ranges of spectrum dependent systems in the complex electromagnetic environment (one-on-one and multi-on-one effects)\n- Define RTSO Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, Facilities and Policy (DOTMLPF-P) requirements that effect Manpower, Personnel, Training and Education (MPT&E) requirements and solutions.\n- Perform initial DOTMLPF-P analysis to assess RTSO training requirements.\n- Perform review\/update\/development of Navy Tactical Tasks (NTAs) measures, standards, and criteria to support RTSO operation and maintenance.\n- Perform review\/update of Defense Readiness Reporting System-Navy (DRRS-N) to evaluate RTSO Personnel, Equipment, Supply, Training, Ordnance and Facilities (PESTOF) resource measures.\n -Develop plan for RTSO training and certification requirements analysis for course development and implementation within the RTSO NTSP and Theater\/Fleet Training Plans. \n- Develop\/update Job Duty Task Analysis (JDTA) requirements to support RTSO equipment basic operation\/maintenance; and tactical operation to support Task Unit and Strike Group personnel.\n-Identify Knowledge, Skills, and Abilities (KSAs) necessary for leaders, warfighters, civilians, and contractor\npersonnel to understand and effectively utilize RTSO. \n- Develop\/update Personnel Qualification Standard (PQS) to support RTSO JDTA requirements.  NSWCDD developed and fielded fleet-wide the \"Spectrum Access and Awareness Guide\" document providing the information necessary for leaders, warfighters, civilians, and contractor personnel to develop knowledge, skills, and abilities to understand and effectively utilize RTSO.\n- Continue incorporation of Spectrum Management tools in EMSOC COI and FSM COI to include RTSO V1.0."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of 2.996 from FY 2019 to FY 2020 reduces FY 2020 funding due to FY 2018 under execution"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "An acquisition strategy is not required."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics will consist of quarterly program reviews."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3239"
                    },
                    "ProjectTitle": {
                        "val": "Real-Time Spectrum Operations (RTSO)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "13.540"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.540"
                        },
                        "BudgetYearTwo": {
                            "val": "14.482"
                        },
                        "BudgetYearThree": {
                            "val": "14.685"
                        },
                        "BudgetYearFour": {
                            "val": "13.992"
                        },
                        "BudgetYearFive": {
                            "val": "14.122"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Funding has been realigned into PU 3239 from PU 0706 starting in FY20 to support Real-Time Spectrum Operations (RTSO) transition to the designated lead capability integrator."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Real-Time Spectrum Operations (RTSO) Program researches the Electromagnetic (EM) Environmental Effects (E3) between shipboard transmitters and receivers on ships and the interactions of the EM systems within the other systems installed on units within a strike group. The program will develop a capability to monitor the EM Spectrum Usage on navy platforms and be able to validate the spectrum plan to ensure Electromagnetic Capability (EMC) is achieved within the strike group. The program will develop a capability to display compliance with the spectrum plan in a Common Operational Picture (COP) display. These initial capabilities of Own Force Monitoring provide Battlespace Awareness and will be instrumental in enabling Electromagnetic Maneuver Warfare (EMW). These capabilities of self-awareness will further enhance the Navy's ability to perform Command and Control (C2) of the EM Spectrum warfighting domain."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Accomplishment\/Planned Program Entry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.540"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.540"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop and field a capability to perform Frequency Plan Compliance Verification monitoring ship's radiating spectrum dependent systems ensuring compliance to frequency plans.\n- Develop new multi-mode radar coordination procedures and assignments to ensure new U.S. Navy radars are electromagnetically compatible within the strike group.\n- Leverage FY2019 Plans to build an initial Spectrum Operational Planning Tool (SOPT) developing alternate operational and map views, utilizing a Naval Tactical Data System (NTDS) type displays.\n- Develop a spectrum restrictions visualization map for shipboard personnel.\n- Develop the process and method to publish the emissions control (EMCON) bill for a given ship.\n- Develop the process and software capability for numbered fleet commands, combatant commands, and Navy Marine Corps Spectrum Offices to develop and publish littoral radiation restriction regulations.\n- Participate in the CANES Application Integration (AI) System Integration Test (SIT). \n- Participate in exercises and experiments. \n- Continue updates to Real-Time Spectrum Operations (RTSO) software documents and artifacts to include, but not limited to, the Top Level Requirements (TLR), Requirements Traceability Matrix (RTM), Requirements Definition Package (RDP), functional Architecture, RMF cybersecurity accreditation documentation, test and fielding plans, training development and consolidated training strategy, and sustainment plans."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding has been realigned into PU 3239 from PU 0706 starting in FY20 to support Real-Time Spectrum Operations (RTSO)transition to the designated lead capability integrator."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "An Acquisition strategy is not required"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics will consist of quarterly program reviews."
                        }
                    }
                }
            ]
        }
    }
}