{
    "id": "2020-Army-PB-2040-JBOOK-c3dfc4efbfac46da70170659364c6c2d720e705db77d6ab495afa846698c0b96-27",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA5C-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605625A"
        },
        "ProgramElementTitle": {
            "val": "Manned Ground Vehicle"
        },
        "R1LineNumber": {
            "val": "167"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "378.4"
            },
            "BudgetYearOneBase": {
                "val": "378.4"
            },
            "BudgetYearTwo": {
                "val": "320.1"
            },
            "BudgetYearThree": {
                "val": "218.7"
            },
            "BudgetYearFour": {
                "val": "65.7"
            },
            "BudgetYearFive": {
                "val": "52.3"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "1035.200"
            }
        },
        "ProgramElementNote": {
            "val": "This is a parallel effort continued from PE 0603645A \/ Armored System Modernization - Adv Dev, project EV7: Combat Vehicle Prototyping.  \nThis is a new start in FY 2020."
        },
        "ProgramElementMissionDescription": {
            "val": "The Next Generation Combat Vehicle-Optionally Manned Fighting Vehicle (NGCV-OMFV) is a purpose built manned platform that maneuvers Soldiers to a point of positional advantage to engage in close combat. It is designed to operate with or without a crew and Soldiers under armor based on the commander's decision. It delivers decisive lethality during the execution of combined arms maneuver while also controlling maneuver robotics and semi-autonomous systems. The platform will be optimized for operations in dense urban terrain and with significantly reduced logistical burdens. The vehicle will include an architecture to allow for increased capability and growth margin.\n\nIn close combat, the Optionally Manned Fighting Vehicle (OMFV) will deliver decisive lethality during the execution of combined arms maneuver. The changing character of warfare drives changes in how the Army delivers, operates, and sustains future combat capabilities. The Army's first priority is to replace the Bradley with the OMFV. The OMFV will be developed using an incremental approach to the integration of advanced lethality and sensing technologies, with focus of increment one to gain growth margins in power, weight and vehicle computing architecture as the NGCV Cross Functional Team's (CFT) first priority, followed by an Increment II to integrate weapon system, targeting and sensing technologies that are matured and qualified within Science and Technology programs.  OMFV will be joined later by a purpose built Robotic Combat Vehicle (RCV) and future capability upgrades for the OMFV."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "378.4"
                },
                "BudgetYearOneBase": {
                    "val": "378.4"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "378.4"
                },
                "BudgetYearOneBase": {
                    "val": "378.4"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "378.4"
                                },
                                "BudgetYearOneBase": {
                                    "val": "378.4"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "This is a parallel effort continued from PE 0603645A \/ Armored System Modernization - Adv Dev, project EV7: Combat Vehicle Prototyping."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CF6"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Combat Vehicle (NGCV)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "378.4"
                        },
                        "BudgetYearOneBase": {
                            "val": "378.4"
                        },
                        "BudgetYearTwo": {
                            "val": "320.1"
                        },
                        "BudgetYearThree": {
                            "val": "218.7"
                        },
                        "BudgetYearFour": {
                            "val": "65.7"
                        },
                        "BudgetYearFive": {
                            "val": "52.3"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1035.200"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is a parallel effort continued from PE 0603645A \/ Armored System Modernization - Adv Dev, project EV7: Combat Vehicle Prototyping.\nThis is a new start in FY 2020.  This program supports the Cross Functional Team (CFT)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Next Generation Combat Vehicle-Optionally Manned Fighting Vehicle (NGCV-OMFV) is a purpose built manned platform that maneuvers Soldiers to a point of positional advantage to engage in close combat. It is designed to operate with or without a crew and Soldiers under armor based on the commander's decision. It delivers decisive lethality during the execution of combined arms maneuver while also controlling maneuver robotics and semi-autonomous systems. The platform will be optimized for operations in dense urban terrain and with significantly reduced logistical burdens. The vehicle will include an architecture to allow for increased capability and growth margin.\n\nIn close combat, the Optionally Manned Fighting Vehicle (OMFV) will deliver decisive lethality during the execution of combined arms maneuver. The changing character of warfare drives changes in how the Army delivers, operates, and sustains future combat capabilities. The Army's first priority is to replace the Bradley with the OMFV. The OMFV will be developed using an incremental approach to integration of advanced lethality and sensing technologies, with focus of increment one to gain growth margins in power, weight and vehicle computing architecture as the NGCV Cross Functional Team's (CFT) first priority, followed by an Increment II to integrate weapon system, targeting and sensing technologies that are matured and qualified within Science and Technology programs.  OMFV will be joined later by a purpose built Robotic Combat Vehicle (RCV) and future capability upgrades for the OMFV."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Government Engineering & Program Management"
                                    },
                                    "Description": {
                                        "val": "Provides Government System Engineering and Program Management support.  Funding will cover the costs of government and direct support contractor labor, travel, training, supplies, equipment and facilities to effectively manage the NGCV-OMFV program."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.964"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.964"
                                            },
                                            "Text": {
                                                "val": "Provides Government System Engineering and Program Management support.  Covers the costs of government and direct support contractor labor, travel, training, supplies, equipment and facilities to effectively manage the NGCV-OMFV program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Management has increased in FY 2020 due to the acceleration of the OMFV procurement strategy (Bradley replacement)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Procures NGCV-OMFV prototypes for developmental testing.  Develops government\/contractor logistics plans and user documentation."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "352.436"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "352.436"
                                            },
                                            "Text": {
                                                "val": "NGCV-OMFV Knowledge Point 2 (MTA Section 804 approval replaces Milestone B (MS B)) approval is scheduled for 2QFY 2020 followed by Engineering and Manufacturing Development (EMD) contract awards with up to 2 vendors providing 12 prototypes each (24 total) and test assets. Conduct start of work meeting, Design Maturity Review (DMR) and contractor\/government program management reviews. Planning activities associated with delivery of prototypes and test assets in FY 2021. Concurrently, planning for logistics assessments, technical manual development, and provisioning conferences to support Contractor Logistics Support (CLS), transitioning to organic support by First Unit Equipped (FUE) in 2026. \n\nThis funding will be used for Developmental Engineering, Producibility Engineering and Planning, Developmental Tooling, Prototypes, Contractor SEPM, Contractor Support to EMD Test, Training, Data, and Support Equipment Development. Leverage the Non Development Initiative (NDI) Active Protection System (APS) installation and characterization initiative to evaluate NGCV-OMFV performance with an APS solution installed. This cost includes engineering, logistics, test, and program management to continue development. Project Manager (PM) NGCV-OMFV will characterize a Non Developmental Items (NDI) and leverage Product Manager Vehicle Protection Systems (PM VPS) to develop force protection and survivability improvements to counter evolving threats.\n\nNGCV-OMFV will have increased lethality through improved target acquisition capability along with other technology upgrades and insertions (i.e. laser pointing, color camera, laser range finder, etc). PM NGCV-OMFV will leverage the XM-913 development to increase lethality, and will characterize and develop other lethality improvements to counter evolving threats. This cost includes engineering, logistics, test, and program management to continue development and maturation.  The 3GEN FLIR system will be developed by Product Manager, Ground Sensors (PM GS) and will be provided to PM NGCV-OMFV as a Horizontal Technology Insertion effort. This cost includes engineering, logistics, test, and program management to continue development and technology integration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Product development increases in FY 2020 to ensure that the NGCV-OMFV development program is not delayed and the Army's desired capabilities gap will be met as quickly as possible. The funding increase completes Source Selection and will be used for EMD contract award."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "G86000"
                                    },
                                    "Title": {
                                        "val": "Next Generation Combat Vehicle (NGCV)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1564"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2242"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603645A"
                                    },
                                    "Title": {
                                        "val": "Armored System Modernization - Adv Dev"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "41.431"
                                        },
                                        "CurrentYear": {
                                            "val": "84.297"
                                        },
                                        "BudgetYearOne": {
                                            "val": "157.656"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "157.656"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "151.624"
                                        },
                                        "BudgetYearThree": {
                                            "val": "172.864"
                                        },
                                        "BudgetYearFour": {
                                            "val": "50.703"
                                        },
                                        "BudgetYearFive": {
                                            "val": "44.7"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "703.275"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The NGCV-OMFV is designed to maneuver Soldiers in the Forward Operating Environment to a position of advantage to engage in close combat and deliver decisive lethality during the execution of combined arms maneuver. NGCV must exceed current capabilities while overmatching similar threat class systems. It must be optimized for dense urban areas while also defeating pacing threats on rural (open, semi-restricted and restricted) terrain and be characterized by the ability to spiral in advanced technologies as they mature. The capabilities desired focus to improve lethality, protection, mobility, range, and sustainment."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contractor Section 804 (x2 Vendors)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "314.451"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "314.451"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "314.451"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Support Costs"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "FFPLOE"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "14.518"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "14.518"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.518"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMO\/PEO Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Warren, MI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "25.964"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "25.964"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "25.964"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "23.467"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "23.467"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.467"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444561_CF6.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Knowledge Point 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Knowledge Point 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EMD Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test & Evalutation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Source Selection"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LRIP Contract award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}