{
    "id": "2020-Army-PB-2040-JBOOK-d4529ef378113a22e46d90a5ffc16ec0a0dd87dc0f92151e453e9dfdda5354ee-8",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604822A"
        },
        "ProgramElementTitle": {
            "val": "General Fund Enterprise Business System (GFEBS)"
        },
        "R1LineNumber": {
            "val": "137"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "47.575"
            },
            "CurrentYear": {
                "val": "36.810"
            },
            "BudgetYearOne": {
                "val": "46.683"
            },
            "BudgetYearOneBase": {
                "val": "46.683"
            },
            "BudgetYearTwo": {
                "val": "28.725"
            },
            "BudgetYearThree": {
                "val": "1.729"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "161.522"
            }
        },
        "ProgramElementNote": {
            "val": "Effective February 2, 2017, the Department of Defense Instruction (DoDI) 5000.75 was issued to establish policy for use of Business Capability Acquisition Cycle for Defense Business Systems, applying to the General Fund Enterprise Business System (GFEBS).  This DoDI supersedes DoDI 5000.02, improving the alignment of business systems to commercial best practices as well as optimizing efficiencies and effectiveness across DoD for the acquisition of business systems.  Decisions rendered by the Milestone Decision Authority, as outlined in DoDI 5000.75, are referred to as \"Authority To Proceed\" and replace DoDI 5000.02 \"Milestones.\""
        },
        "ProgramElementMissionDescription": {
            "val": "GF5 - General Fund Enterprise Business System (GFEBS): GFEBS is the Army's core financial management system for administering its General Fund. Full Deployment was reached in 2012 and the system is currently in sustainment while also conducting capability enhancements to meet policy and user needs. GFEBS follows the DoD Business Enterprise Architecture which is aligned to the mandated Federal Enterprise Architecture. GFEBS was implemented to fulfill the needs and comply with the Federal Financial Management Improvement Act, The Chief Financial Officers Act of 1990, the Government Performance and Results Act of 1993, the Government Management Reform Act of 1994, the Clinger-Cohen Act of 1996, and to fulfill the stated mission of the Assistant Secretary of the Army for Financial Management and Comptroller. GFEBS subsumed the capabilities, in full or in part, of financial systems operating in excess of 40 years including the Standard Finance System and other costly feeder systems which do not allow the Department of Defense or the U.S. government to achieve an unqualified audit opinion on its financial statements. GFEBS was developed using a commercial off-the-shelf Enterprise Resource Planning system that is certified by the Chief, Financial Officer Council and provides six core financial functions (United States General Ledger (USGL), Cost Management, Funds Control, Payable Management, Real Property, Receivable Management and Reports). GFEBS allows tactical commanders to make informed decisions with virtually real time information. On 1 October 2008, GFEBS deployed Wave 1 to end users at Fort Jackson Garrison, Defense Finance Accounting Service (DFAS) Indianapolis, and several other organizations. The Full Deployment Decision was received by the Milestone Decision Authority on 24 June 2011, and Full Deployment was achieved on 1 July 2012. In addition to providing general sustainment efforts, the program requires RDTE funding to provide system upgrades needed to meet audit readiness, compliance, and SAP standards. Additionally, GFEBS continues to make system changes as requested by the user community through the Process Owners Group; an Senior Executive Service\/General Officer-level board that prioritizes user needs; many of these changes require RDT&E funding as determined through a set of established business rules.\n\nEV4 - Project not used. In accordance with DoDI 5000.75 capability enhancements will be performed in the GFEBS baseline (Project GF5).\n\nDV6 - General Fund Enterprise Business System-Sensitive Activities (GFEBS-SA): GFEBS-SA is a designated National Security System (NSS) leveraging the GFEBS base system as the Army's core financial management system certified by the Chief Financial Officers Council. The GFEBS base system has reached Full Deployment and is currently in sustainment; however, the Army still has classified and sensitive financial activity remaining in legacy systems that cannot be processed in the fully-fielded GFEBS system without compromising classified information or missions, or endangering soldiers.\" . Therefore, GFEBS-SA is an essential financial program designed to enable the auditability that is needed to comply with the Chief Financial Officers (CFO) Act, the Federal Financial Management Improvement Act (FFMIA), and prevent compromise of data that could cause grave harm to U.S. forces. To protect sensitive information and enable clean auditability, the Army requires a separate instance of GFEBS operated on a secure network for processing sensitive and classified financial transactions. GFEBS-SA will integrate with GFEBS to provide secure, web-based financial execution and reporting capabilities for the Army's classified and sensitive activities. GFEBS-SA is envisioned as a fully functional GFEBS application operated on a secure network (SIPR), leveraging off of the sustained system design while providing additional implementation that includes additional performance requirements designed to protect sensitive intelligence operations and special operations missions. It will process Secret Collateral and below information while providing GFEBS capabilities such as distribution and execution of appropriated funds, cost management, financial reporting, and asset management. GFEBS-SA will be implemented and deployed to 3,000 users across 100 locations worldwide. GFEBS-SA will support information exchanges with organizations that support the Army's sensitive activities mission, including cross-security domain integration between SIPR and NIPR with GFEBS and other system partners. Services will be capable of being upgraded throughout the life of the program in order to incorporate advances in best business practices and technology. The funding requested in FY 2020 supports continued system development in order to allow communication to other systems supporting the auditability of classified financial data, system hosting in the cloud environment, testing, and pre-deployment activities. Overall, the RDT&E funding in FY 2020 supports the transition from development to deployment of the GFEBS-SA effort."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.554"
                },
                "CurrentYear": {
                    "val": "37.851"
                },
                "BudgetYearOne": {
                    "val": "35.699"
                },
                "BudgetYearOneBase": {
                    "val": "35.699"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "47.575"
                },
                "CurrentYear": {
                    "val": "36.81"
                },
                "BudgetYearOne": {
                    "val": "46.683"
                },
                "BudgetYearOneBase": {
                    "val": "46.683"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.979"
                },
                "CurrentYear": {
                    "val": "-1.041"
                },
                "BudgetYearOne": {
                    "val": "10.984"
                },
                "BudgetYearOneBase": {
                    "val": "10.984"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.04"
                    },
                    "CurrentYear": {
                        "val": "-0.046"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-0.995"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.939"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "10.984"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.984"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "For FY 2020, the change comes from an increase in RDTE funding to the GFEBS line (GF5). This increase reflects the additional effort focused on completing the audit-related system enhancements which will give the Army an auditable financial system. The GFEBS Process Owners Group and Functional Governance Board have developed a list of enhancement items and have put the highest priority on those items which move the Army closer to realizing a fully auditable system, and the increase in RDTE is to more quickly develop those enhancement items."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DV6"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.974"
                        },
                        "CurrentYear": {
                            "val": "35.257"
                        },
                        "BudgetYearOne": {
                            "val": "35.782"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.782"
                        },
                        "BudgetYearTwo": {
                            "val": "17.601"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "126.614"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project DV6 is for General Fund Enterprise Business System - Sensitive Activities (GFEBS-SA)."
                        },
                        "ProjectMissionDescription": {
                            "val": "General Fund Enterprise Business System-Sensitive Activities (GFEBS-SA): GFEBS-SA is a designated National Security System (NSS) leveraging the GFEBS base system as the Army's core financial management system certified by the Chief Financial Officers Council. The GFEBS base system has reached Full Deployment and is currently in sustainment; however, the Army still has classified and sensitive financial activity remaining in legacy systems that cannot be processed in the fully-fielded GFEBS system without compromising classified information or missions, or endangering soldiers.\" . Therefore, GFEBS-SA is an essential financial program designed to enable the auditability that is needed to comply with the Chief Financial Officers (CFO) Act, the Federal Financial Management Improvement Act (FFMIA), and prevent compromise of data that could cause grave harm to U.S. forces. To protect sensitive information and enable clean auditability, the Army requires a separate instance of GFEBS operated on a secure network for processing sensitive and classified financial transactions. GFEBS-SA will integrate with GFEBS to provide secure, web-based financial execution and reporting capabilities for the Army's classified and sensitive activities. GFEBS-SA is envisioned as a fully functional GFEBS application operated on a secure network (SIPR), leveraging off of the sustained system design while providing additional implementation that includes additional performance requirements designed to protect sensitive intelligence operations and special operations missions. It will process Secret Collateral and below information while providing GFEBS capabilities such as distribution and execution of appropriated funds, cost management, financial reporting, and asset management. GFEBS-SA will be implemented and deployed to 3,000 users across 100 locations worldwide. GFEBS-SA will support information exchanges with organizations that support the Army's sensitive activities mission, including cross-security domain integration between SIPR and NIPR with GFEBS and other system partners. Services will be capable of being upgraded throughout the life of the program in order to incorporate advances in best business practices and technology. \n\nThe funding requested in FY 2020 supports continued system development in order to allow communication to other systems supporting the auditability of classified financial data, system hosting in the Cloud environment, testing, and pre-deployment activities. Overall, the RDT&E funding in FY 2020 supports the transition from development to deployment of the GFEBS-SA effort. Additionally, funds support efforts to integrate sensitive activity capability across the Enterprise.\n\nBackground: Initial implementation of the GFEBS-SA project did not require development funds beyond FY 2016; however, based on a detailed analysis of the original System Integrator, an Army determination was made that they could not deliver a solution to meet the GFEBS-SA requirement. The program was restructured with an Acquisition Decision Memorandum (ADM) on 9 September 2016 in alignment with an Army-validated Operational Needs Statement. A new System Integrator contract began work on 1 May 2017 with a schedule that supports the Army's timeline; minimizing operational risks to the Army's sensitive activity commands."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Development"
                                    },
                                    "Description": {
                                        "val": "Software development includes all RDT&E activities related to the development of the GFEBS-SA system itself. This includes the systems engineering management, planning, and blueprinting as well as the system integrator putting hands on keyboards to integrate the GFEBS solution into the Secret (SIPR) environment to include developing the required interfaces to allow GFEBS-SA to interact with partner systems; and the hardware and software tools necessary to facilitate development. \n\nNote:  The FY 2019 and FY 2020 RDT&E activities are separated into more defined buckets than in previous years to give more insight into program requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.894"
                                            },
                                            "Text": {
                                                "val": "Funds in FY 2018 are required to support system development to include: System Integrator labor, interface development, DISA development and hosting, initial test activities, training equipment and tools, and pre-deployment site surveys. Additionally, FY 2018 funding supports Program Office costs including System Engineering tools, RMF\/Cyber Security support, Support Contract Labor, system interfaces, and DISA Cross Domain Solution development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.633"
                                            },
                                            "Text": {
                                                "val": "FY 2019 funding supports the software development of the GFEBS-SA product; development of interfaces with partners involved in auditability of classified financial information; system engineering, planning, and analysis; establishment and hosting costs in the Cloud environment; cybersecurity support; and pre-deployment planning activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.937"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.937"
                                            },
                                            "Text": {
                                                "val": "During FY 2020, the team will conduct the final stages of development and fully deploy the system.  The RDT&E funding will include costs for the final delivery of the GFEBS-SA solution, the systems engineering management and planning to finalize and deliver all system blueprints and other documentation, and the completion of all cybersecurity processes in order to receive Authority to Operate. Additionally, funds support efforts to integrate sensitive activity capability across the Enterprise."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Costs for software development will decrease in FY 2020 because a majority of the development will have been completed and the system will move into the testing and deployment phases."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Testing"
                                    },
                                    "Description": {
                                        "val": "Testing includes all efforts related to test planning, Developmental Testing (DT), User Acceptance Testing (UAT), Operational Test & Evaluation (OT&E), and the system integrator labor and site services aligned with each. \n\nNote:  The FY 2019 and FY 2020 RDT&E activities are separated into more defined buckets than in previous years to give more insight into program requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.19"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.96"
                                            },
                                            "Text": {
                                                "val": "FY 2019 testing support includes test planning activities for the Developmental Test and User Acceptance Test, as well as funding for external services such as the Joint Interoperability Test Command (JITC)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.388"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.388"
                                            },
                                            "Text": {
                                                "val": "During FY 2020, User Acceptance Testing and Developmental Testing will occur prior to and post IOC. These costs support the Government Test requirements with JITC and the Army Test and Evaluation Command (ATEC) as well as ensuring the SI and Command Test Operators are available to support"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in testing costs from FY 2019 to FY 2020 are because all major development activities conclude at the end of FY 2019 and testing activities are conducted throughout FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Support"
                                    },
                                    "Description": {
                                        "val": "Program Support includes program management and training activities. Costs include government management and travel, facilities, and development of recurring training materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.403"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.664"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Program Support includes all activities within the program office. Costs include government management; government technical support; facilities; system engineering and program management tools associated with program execution (i.e., logistics software, program management database and tracking tools, office software, etc.); and support contractors who provide technical expertise, day-to-day program execution, and acquisition support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.715"
                                            },
                                            "Text": {
                                                "val": "Program support costs in FY 2020 includes Program Management Office personnel providing non-technical support (acquisition, operations, financial, logistics, etc.), organizational change management planning and execution of roadshows to communicate the GFEBS-SA mission and purpose to partner commands, and the development of recurring training tools."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The overall level of Program Support has decreased from FY 2019 to FY 2020 because the bulk of costs in FY 2019 was associated with oversight of software development activities. Testing is the major RDT&E activity in FY 2020 and those activities are performed on government installations with portions of overall program support conducted by personnel at the testing site. Therefore, less direct program support is needed by the program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Center Hosting"
                                    },
                                    "Description": {
                                        "val": "Data center hosting includes all costs associated with hosting of each environment in the Cloud and other recurring resources that makes up the GFEBS-SA infrastructure. Those environments include pre-development, staging, production, continuity of operations (COOP), Quality Assurance, and program management tools. Other resources included in these costs are HANA, the cross-domain investment, the SIPR circuit Attribute Based Access Control (ABAC) data hosting."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.487"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.742"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.742"
                                            },
                                            "Text": {
                                                "val": "By the end of FY 2020, GFEBS-SA will be fully operational on each hosting environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY19 to FY20 as a result of system development and standing up the cloud environment."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B55511"
                                    },
                                    "Title": {
                                        "val": "GFEBS SENSITIVE ACTIVITIES"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "6.424"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.248"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.248"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.656"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "25.328"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Procurement dollars for GFEBS-SA will be used for the procurement of licenses (for system access and data storage), on-site support, user training, and deployment to all users.\n\nGFEBS-SA OMA requirements are minimal in FY 2020, and will be covered under the base program. Requirements after FY 2020 have been incorporated into the Future Years Defense Program."
                        },
                        "AcquisitionStrategy": {
                            "val": "Plan, develop, and manage GFEBS-SA as a separate instance from GFEBS base program on the SIPRNet to support delivery of capabilities for this designated National Security System (NSS) in support of the sensitive activity commands. The GFEBS-SA solution will be acquired as a sole source contract with Accenture Federal Services as a single increment. The contract will be a hybrid of Firm Fixed Price and Cost Plus Fixed Fee CLINs to support development efforts and to encourage Accenture Federal Services to deliver a solution in support of the Vice Chief of Staff of the Army recommendation to accelerate the schedule to ensure operational security and Army audit requirements. The contract was awarded in April 2017.\n\nSoftware will be developed through a single build to achieve full capability. GFEBS-SA will consist of a single release delivered in a limited deployment (size not capability) to the Initial Operational Test and Evaluation (IOT&E) unit, followed by a full deployment to all other users upon successful completion of IOT&E.\n\nThe program will require modernization enhancements after full deployment. These modernization enhancements will require a stream of RDT&E funding to keep the GFEBS-SA system synchronized with the base system by making modifications needed for audit readiness, compliancy, and upgrades required to keep the system up-to-date with SAP standards and Functional Governance Board requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "The contract is a hybrid of FFP, CPFF and CR CLINs for system development, landscape configuration, test and evaluation, solution delivery and certification\/accreditation."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Accenture Federal LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.044"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "24.894"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "27.633"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.937"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.937"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "29.672"
                                                    },
                                                    "TotalCost": {
                                                        "val": "111.180"
                                                    },
                                                    "TargetValue": {
                                                        "val": "88.300"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Center Hosting"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Information Systems Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Meade, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.487"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.742"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.742"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.229"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PdM GFEBS SA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.641"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.403"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.664"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.715"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.715"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "24.752"
                                                    },
                                                    "TotalCost": {
                                                        "val": "55.175"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC\/ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.96"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.19"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.96"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.388"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.388"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "5.855"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.353"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443321_DV6.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Program Management"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone B (ATP 3)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operating Capabiity (IOC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment (FD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "License Procurement"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Sustainment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "GF5"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.601"
                        },
                        "CurrentYear": {
                            "val": "1.553"
                        },
                        "BudgetYearOne": {
                            "val": "10.901"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.901"
                        },
                        "BudgetYearTwo": {
                            "val": "11.124"
                        },
                        "BudgetYearThree": {
                            "val": "1.729"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "34.908"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The General Fund Enterprise Business System (GFEBS) is the Army's core financial management system for administering its General Fund. Full Deployment was reached in 2012 and the system is currently in sustainment while also conducting capability enhancements to meet policy and user needs. It follows the DoD Business Enterprise Architecture which is aligned to the mandated Federal Enterprise Architecture. GFEBS was implemented to fulfill the needs and comply with the Federal Financial Management Improvement Act, The Chief Financial Officers Act of 1990, the Government Performance and Results Act of 1993, the Government Management Reform Act of 1994, the Clinger-Cohen Act of 1996, and to fulfill the stated mission of the Assistant Secretary of the Army for Financial Management and Comptroller. GFEBS subsumed the capabilities, in full or in part, of financial systems operating in excess of 40 years, including the Standard Finance System and other costly feeder systems which do not allow the Department of Defense or the U.S. government to achieve an unqualified audit opinion on its financial statements. GFEBS is used to administer the Army's General Fund. GFEBS was developed using a commercial off-the-shelf Enterprise Resource Planning system that is certified by the Chief, Financial Officer Council and provides six core financial functions (United States General Ledger (USGL), Cost Management, Funds Control, Payable Management, Real Property, Receivable Management and Reports). GFEBS allows tactical commanders to make informed decisions with virtually real time information. On 1 October 2008, GFEBS deployed Wave 1 to end users at Fort Jackson Garrison, Defense Finance Accounting Service (DFAS) Indianapolis, and several other organizations. The Full Deployment Decision was received by the Milestone Decision Authority on 24 June 2011, and Full Deployment was achieved on 1 July 2012. Current efforts include sustaining the system and infrastructure, making modifications needed for audit readiness, compliancy, and upgrades required to maintain the system and meet SAP standards. Additionally, GFEBS continues to make changes as requested by the user community through the Process Owners Group; an Senior Executive Service\/General Officer-level board that prioritizes user needs.  Some of these changes require developmental funding and support auditable business environment, financial analytics and enablement of sunsetting of legacy systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Capability Enhancement"
                                    },
                                    "Description": {
                                        "val": "Capability enhancements provide changes to the system that are needed to update the infrastructure as required to meet SAP requirements and best practices, and to support evolving statutory and regulatory requirements. The capability enhancement initiatives are needed to increase the GFEBS capability and performance to maintain compliance with Federal Financial Management Improvement Act (FFMIA), Business Enterprise Agency (BEA), Standard Financial Information Structure (SFIS) requirements, and auditability. These requirements are established and prioritized through a General Officer (GO)\/Senior Executive Service (SES)-level Process Owners Group and Functional Governance Board."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.601"
                                            },
                                            "Text": {
                                                "val": "FY 2018 RDTE funding supports the enhancements requested by the Financial Integration Process Owners Group, as well as enhancements and new capabilities related to audit, compliance, and legacy system retirement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.553"
                                            },
                                            "Text": {
                                                "val": "FY 2019 RDTE funding supports the enhancements requested by the Financial Integration Process Owners Group, as well as enhancements and new capabilities related to audit, compliance, and legacy system retirement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.901"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.901"
                                            },
                                            "Text": {
                                                "val": "FY 2020 RDT&E funding will be used to perform system enhancements\/upgrades as requested by the Process Owners Group and Functional Governance Board. With increased focus on making the Army auditable, many of these upgrades are aligned with the auditability of GFEBS and have been highly prioritized. The focus for enhancements funded with RDT&E during FY 2020 will be on these audit-related enhancements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This increase in FY 2020 reflects the additional effort focused on completing the audit-related system enhancements which will give the Army an auditable financial system. The GFEBS Process Owners Group and Functional Governance Board have developed a list of enhancement items and have put the highest priority on those items which move the Army closer to realizing full auditability. The RDT&E has increased to allow GFEBS to develop those enhancement items more quickly."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BE4168"
                                    },
                                    "Title": {
                                        "val": "General Fund Enterprise Business System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.465"
                                        },
                                        "CurrentYear": {
                                            "val": "4.552"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.554"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.554"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.453"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.571"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "22.595"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "FY 2020 Procurement dollars in the amount of $4.554 million supports software and hardware infrastructure upgrades to bring GFEBS reporting and analytics in-line with processing performance thresholds established in the GFEBS Capabilities Production Document (CPD). Software upgrades support auditability and compliancy requirements, as well as the maintenance of the system's required software standards."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "IBM Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bathesda, Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "120.968"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.601"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.553"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.901"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.901"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HQAES Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "VAR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.118"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.118"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443321_GF5.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Map\/Blueprint\/Build Release 1.1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2005"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2006"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Realization -  Release 1.2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2006"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.3 - Replace STANFINS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment Decision Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Release 1.4:  Replace SOMARDS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment Decision Review 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Hardware Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2009"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HQAES Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Sustainment Development Task Order Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements FY18"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements FY19"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements FY20"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements FY21"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements FY22"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements FY23"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements FY24"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}