{
    "id": "2020-AirForce-PB-3600-MJBOOK-3-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-59",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0901554F"
        },
        "ProgramElementTitle": {
            "val": "Defense Enterprise Acntng and Mgt Sys (DEAMS)"
        },
        "R1LineNumber": {
            "val": "288"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "46.789"
            },
            "BudgetYearOneBase": {
                "val": "46.789"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "57.016"
            },
            "BudgetYearThree": {
                "val": "55.151"
            },
            "BudgetYearFour": {
                "val": "50.064"
            },
            "BudgetYearFive": {
                "val": "50.965"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY20, PE 0901554F, DEAMS, changed from PE 0901538F, Financial Management Information Systems Development.\nIn FY20, Project 675178, DEAMS Continuous Capability Development, changed from Defense Enterprise Accounting Management System Increment 2 (DEAMS Inc. 2)."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element develops upgrades to existing financial management systems. These upgrades are required to comply with auditability and transparency requirements as well as efficiencies in processing financial transactions. This program element also supports studies and analysis to improve future program planning and execution.\n\nThere are two projects within this program element: Defense Enterprise Accounting and Management System (DEAMS) Increment 1 (Inc 1), and DEAMS Continuous Capability Development (CCD), formerly known as DEAMS Increment 2. Project 675178: DEAMS Continuous Capability Development (CCD) started in FY19 under PE 0901538F. Project 675179: DEAMS Increment 1 was under PE 0901538F through FY19.\n\nThe Defense Enterprise Accounting and Management System (DEAMS) is a commercial-off-the-shelf (COTS), Oracle-based software implementation effort that will provide an auditable, modern accounting and finance system. The DEAMS implementation will replace many existing accounting and finance legacy systems and will provide core funds execution management functions consistent with financial management laws, regulations and policy, general ledger, funds management, payments, receivables, cost and revenues, and fiduciary reporting. DEAMS is compliant with the Clinger-Cohen Act, Business Enterprise Architecture (BEA), and integrates into Global Combat Support System-Air Force (GCSS-AF). DEAMS is a key enabler and provides the core accounting system for all enterprise business system development necessary to sustain financial statement auditability.\n\nDEAMS enhancements will be governed in Capability Support Phase after Increment 1 Full Deployment (FD).\n\nDEAMS is the Air Force's target core accounting and financial management solution and is a key component of the long-term business process improvements needed to sustain auditability and correct financial system weaknesses.\n\nActivities also include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver financial management information systems capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "46.789"
                },
                "BudgetYearOneBase": {
                    "val": "46.789"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "46.789"
                },
                "BudgetYearOneBase": {
                    "val": "46.789"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "46.789"
                                },
                                "BudgetYearOneBase": {
                                    "val": "46.789"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675178"
                    },
                    "ProjectTitle": {
                        "val": "DEAMS Continuous Capability Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "14.895"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.895"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "57.016"
                        },
                        "BudgetYearThree": {
                            "val": "55.151"
                        },
                        "BudgetYearFour": {
                            "val": "50.064"
                        },
                        "BudgetYearFive": {
                            "val": "50.965"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY20, PE 0901554F, DEAMS, changed from PE 0901538F, Financial Management Information Systems Development.\nIn FY20, Project 675178, DEAMS Continuous Capability Development, changed from Defense Enterprise Accounting Management System Increment 2 (DEAMS Inc. 2)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Defense Enterprise Accounting and Management System (DEAMS) is a commercial-off-the-shelf (COTS), Oracle-based software implementation effort that will provide an auditable, modern accounting and finance system. DEAMS is a Joint United States Air Force (USAF) and United States Transportation Command (USTRANSCOM) Enterprise Resource Planning (ERP) Program that will replace many existing accounting and finance legacy systems and will provide core funds execution management functions consistent with financial management laws, regulations and policy, general ledger, funds management, payments, receivables, cost and revenues, and fiduciary reporting. DEAMS is compliant with the Clinger-Cohen Act, Business Enterprise Architecture (BEA), and integrates into Global Combat Support System-Air Force (GCSS-AF). When fully deployed, DEAMS will be key to Air Force compliance with the Financial Improvement and Audit Readiness (FIAR) requirement in the 2010 NDAA.\n\nThe remaining DEAMS Increment 1 development activities will be completed using agile software development methodologies under a project called DEAMS Rapid Acquisition.  In FY19, DEAMS CCD was added to the FY18 NDAA, as a Section 873 Agile Pilot program, Rapid Acquisition will also be a stepping stone in the implementation of agile development methodologies for DEAMS Continuous Capability Development (CCD).  Under Rapid Acquisition, the program contracted with a new System Integrator (SI) to sustain the DEAMS R12 baseline, develop the remaining Inc. 1 requirements (disbursing, reporting, Governance\/Risk\/Compliance (GRC)), and provide continual enhancement and improvement to the deployed system, utilizing agile software development.\n\nDEAMS CCD capabilities will be implemented utilizing an agile software development methodology. Requirements for CCD include, but are not limited to, development of the core accounting and reporting functionality necessary to enable deployment of modernized personnel, contracting, and logistics systems. Additional capabilities under requirements definition include complex acquisition management, reimbursable cost accounting, military entitlement accounting, advanced accounting controls and audit sustainment, treasury cash accountability, and management accounting and billing for revolving funds. Included in these capabilities are selected requirements deferred from Increment 1. \n\nRequirements will be addressed through an iterative process of sprint development cycles, where usable capability is produced after every sprint. The PMO construct along with application of agile principles allows the program to properly plan system requirements, deliver early capability to the end users, achieve early return on investment of taxpayer dollars, division of risk, reduce waste, effectively respond to change, and continuously improve our processes.\n\nAdditional user deployments enabled by future increment capabilities include acquisition program executive offices; ranges, laboratories and test centers; and air logistics centers. CCD adds an additional 4,600 users to Inc 1 baseline for a total of 21,500 users.\n\nThis funding request will support development of the Business Capability Acquisition Cycle (BCAC) compliant information artifacts and plans necessary to support the program, Capability Process Maps (CPMs) for each business capability, and mapping of financial management processes the capability will require (Blueprinting). Additionally, the funding will support acquisition strategy planning by early identification\/definition of Information Technology Functional Requirements (ITFRs) and Information Assets (IA), Acquisition Strategy Determination, Solution Approach, and Request for Proposal (RFP) preparation.\n\nFunds may be used to develop, acquire, and integrate hardware and software solutions to provide improvements and enhancements in support of the development of the DEAMS capabilities.\n\nActivities also include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver financial management information systems capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DEAMS Continuous Capability Development (CCD) Product Development"
                                    },
                                    "Description": {
                                        "val": "DEAMS CCD system capabilities will be developed and enhanced through completion of development sprint cycles in accordance with an agile software development strategy. DEAMS expects to leverage lessons learned during the Increment I rapid acquisition to develop a T&E process that is more complimentary to the Agile software development process. Development activities include requirements analysis, design, build, test, data conversion, cut-over from legacy systems, and the resolution of deficiency reports and defects. Also includes the support services (product development support, solution architecture support, configuration control and management support, quality assurance support, acquisition strategy support, test planning support, and cybersecurity support) of various Advisory and Assistance Services (A&ASs), Program Management Administration (PMA) activities, and Federally Funded Research and Development Centers (FFRDCs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- Will begin Technical support services for requirements definition and analysis and System Integrator request for proposal (RFP) development\n- Will begin Acquisition planning and support for CCD system capabilities to include but not limited to:\n- Acquisition Contracting Interfaces\n- Foreign Military Sales (FMS)\n- Budget Distribution Interface\n- Conversion interface with System Integrator"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.895"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.895"
                                            },
                                            "Text": {
                                                "val": "- Continue Technical support services for requirements definition and analysis and System Integrator request for proposal (RFP) development\n- Continue Acquisition planning and support for first set of agile development epics supporting Continuous Capability Development (CCD) system capabilities to include but not limited to:\n - Ad Hoc Cost Analysis Reporting \n - Additional Business Intelligence (BI) functionality\n - Base Supply Expenditures General Funds only \n - Accounting for base supply purchases\n - Treasury Direct Phase 2 & 3 \n - Implements Treasury Direct collections\n - Civilian Pay Cost Accounting \n - Record Civilian Pay detail for accruals and expenditure accounting\n - Contract Data Standards \n - Implements Acquisition data standards for contract writing systems\n - Major Acquisition\/Reimbursable Program Systems \n - Interfaces\/Capabilities necessary for major acquisition programs reporting and Complex contract obligation and pre-validation\n - Job Order Cost Accounting \n - Interface enhancement of Job Order Cost Accounting System (JOCAS) II with Standard Financial Information Structure (SFIS) upgrade\n - Initiate test planning for Agile acquisition"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increases due to PE 0901554F, DEAMS, changing from PE 0901538F, Financial Management Information Systems Development."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 834470"
                                    },
                                    "Title": {
                                        "val": "Defense Enterprise Accounting & Mgt Sys"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.802"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.905"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.905"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.900"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.107"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.162"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.219"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DEAMS Continuous Capability Development (CCD) acquisition strategy will leverage experience gained from FY19 NDAA Section 869 Pilot Program activities and from agile software development efforts in Increment 1. CCD will be implemented using an agile methodology approach following the Business Capability Acquisition Cycle (BCAC). DEAMS will be in the Capability Sustainment Phase 5 (per DOD Instruction 5000.75) and will conduct continual enhancement\/process improvements for the life of the program. DEAMS will continue technical support services for requirements definition and analysis and System Integrator request for proposal (RFP) development, and continue acquisition planning and support for first set of agile development epics supporting CCD system capabilities.\n\nCCD will deliver functionality at earliest opportunity on a stable Increment 1 baseline. User experience and mission impact will be taken into account when establishing the release battle rhythm to the operational system. Factors for software releases include:\n- Budget formulation and justification cycles\n- End of year financial closeout\n- Interdependencies with enterprise business systems\n- Higher DOD requirements\n- On-going development efforts with LOG-IT, CON-IT, MRO, and AFIPPS\n- Interfaces\/data standards changes\n- Changes to hosting, deployment technologies, or strategies to optimize system security, performance, and cost savings"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DEAMS Continuous Capability Development (CCD) Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.941"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.941"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administrative (PMA) Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.954"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.954"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "DEAMS"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisition Planning"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Agile Software Development Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Continuous Capability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675179"
                    },
                    "ProjectTitle": {
                        "val": "Defense Enterprise Accounting Management System Increment 1 (DEAMS Inc 1)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "31.894"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.894"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.894"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY20, PE 0901554F, DEAMS, changed from PE 0901538F, Financial Management Information Systems Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "Defense Enterprise Accounting and Management System (DEAMS) is a commercial-off-the-shelf (COTS), Oracle-based software implementation effort that will provide an auditable, modern accounting and finance system. DEAMS is a Joint United States Air Force (USAF) and United States Transportation Command (USTRANSCOM) Enterprise Resource Planning (ERP) Program that will replace many existing accounting and finance legacy systems and will provide core funds execution management functions consistent with financial management laws, regulations and policy, general ledger, funds management, payments, receivables, cost and revenues, and fiduciary reporting. DEAMS is compliant with the Clinger-Cohen Act, Business Enterprise Architecture (BEA), and integrates into Global Combat Support System-Air Force (GCSS-AF). When fully deployed, DEAMS will be key to Air Force compliance with the Financial Improvement and Audit Readiness (FIAR) requirement in the 2010 NDAA.\n\nDEAMS user deployments include:\n- Air Mobility Command (AMC) without Transportation Working Capital Funds (TWCF)\n- AMC with TWCF, in conjunction with Defense Finance and Accounting Service (DFAS) Rome\n- Air Combat Command (ACC) and Air Force Global Strike Command (AFGSC)\n- Air Force Reserve Command (AFRC), and Air National Guard (ANG) and other Geographically Separated Units (GSUs) to include DFAS Limestone, Air Force District of Washington (AFDW), Air Force Special Operations Command (AFSOC), U.S. Air Force Academy (USAFA), Pacific Air Forces (PACAF), and DFAS Japan\n- U. S. Air Forces in Europe (USAFE), DFAS Europe, and Air Education and Training Command (AETC), Joint Base San Antonio\n- Air Force Material Command (AFMC) and Air Force Space Command (AFSPC) (Incremental Deployments)\n- Remaining DFAS locations and all other GSUs\n\nOn 23 January 2017, the senior official provided the Critical Change Report (CCR) with certifications to Congress. The report recommended a restructure of DEAMS from one increment to multiple increment. The Milestone Decision Authority (MDA) approved the restructured program for DEAMS Inc 1, to include deferring certain requirements to future increments, a limited deployment to an additional 700 users for Inc 1 to United States Air Force in Europe (USAFE), and the updated Full Deployment Authority to Proceed (FD ATP) criteria via an Acquisition Decision Memorandum (ADM) dated 2 June 2017. (FD ATP date is August 2020 and Capability Support Authority to Proceed (CS ATP) date is February 2021.)\n\nThe remaining DEAMS Inc 1 schedule includes the Oracle e-Business Suite R12 upgrade and development and deployment of the remaining Increment 1 capabilities (disbursing, reporting, and Governance\/Risk\/Compliance (GRC)), as well as enhancements and improvements to the existing baseline.  In accordance with the FY19 NDAA, DEAMS is an Agile Pilot program as defined in Sec 873 of the FY18 NDAA, and all remaining development will be accomplished using agile software development methodologies.\n\nDEAMS Inc 1 is developing capability which allows for deployment to the remaining user locations. However, DEAMS has also begun transitioning previously deployed locations to the Operation and Support (O&S) phase.\n\nFunds may be used to develop, acquire, and integrate hardware and software solutions to provide improvements and enhancements in support of the development of the DEAMS capabilities.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver financial management information systems capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "DEAMS Inc 1 capability development activities support multiple software releases and user deployments as described in the mission description. Development activities include design, build, test, data conversion, reporting, cutover from legacy systems, and the resolution of deficiency reports and defects.\nActivities also include hardware support (system administration and database security) and storage service by Defense Information Systems Agency (DISA); continued development of interface to Global Combat Support System - Air Force (GCSS-AF); Enterprise Resource Planning (ERP) Common Computing Environment (CCE); Independent Verification and Validation (IV&V); Developmental Release Field Support (DRFS) to include process execution and data scripts; help desk support; Engineering Integration Services (EIS) for oversight of development tools and processes; deployment training and change management activities. Provides acquisition, contract, finance, and cost management planning and Program Management Administration (PMA) utilizing an agile approach for reporting, disbursing, and auditing initiatives.\nDevelop, using an Agile software development approach, the Disbursing Initiative (includes modernizing disbursing and implementing daily reconciliation with the U.S. Treasury, which will manage the receipt and acceptance of agreements, orders, and invoices), the Reporting Initiative (establish a modernized Business Intelligence reporting solution), and the Segregation of Duties (SOD) Initiative (allow DEAMS to meet regulatory compliance requirements associated with Financial Information System Controls Audit Manual (FISCAM)).\n\nAccomplishments:\n- As of 9 Aug 2018, 155 of 170 Installations migrated to DEAMS Inc 1 and 14,700 of 16,900 end users migrated to Inc 1\n- Successfully deployed to US Air Forces in Europe Major Command\n- Successful FY18 end of year closeout"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- Continue development and deployment of E-Business Suite (EBS) R12 software\n- Continue development\/integration of DEAMS disbursing initiative, auditing and long term reporting using Agile Software Development\n- Continue to work DEAMS enhancements and improvements\n- Continue remaining development activities to develop capability in support of remaining deployments\n- Continue program office support activities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.304"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.304"
                                            },
                                            "Text": {
                                                "val": "- Will continue with agile development\/integration sprints of DEAMS disbursing initiative, auditing and long term reporting using Agile Software Development\n- Will continue to work DEAMS enhancements and improvements using Agile Software Development\n- Will continue remaining development activities to develop capability in support of remaining deployments using Agile Software Development\n- Will continue program office support activities"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increases due to PE 0901554F, DEAMS, changing from PE 0901538F, Financial Management Information Systems Development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation (T&E)"
                                    },
                                    "Description": {
                                        "val": "The T&E process will be a complete system operational test to determine DEAMS effectiveness, suitability, and mission capability using the R12 Upgrade. It begins with validation of requirements and end to end functional capabilities including compliance mandates. The T&E effort are conducted in developer sites, Air Force test sites, DISA production sites, and user locations. The DEAMS Test and Evaluation Master Plan (TEMP), Lead Developmental Test Organization (LDTO) Integrated Test Plan (ITP), System Integrators (SIs) Software Test Plans (STPs), and Operational Test Agency (OTA) operational test plans covers the details of Increment 1 T&E. Database Administrator (DBA) Test Support required to service test instances. Capabilities Integration Environment (CIE) Integration\/Development support for ancillary Test activities required. Hardware and software required for test activities.\nThe T&E effort for the Agile Pilot Program includes Sprint Testing where functionality developed code in the sprint is tested for conformance to functional and non-functional requirements. Sprint Testing shall address unit and integrated testing.  Additionally, there will be Regression Testing to validate that the work within the sprint has not introduced defects into areas of the product not directly impacted by the work of the sprint and has not introduced defects into cross-product dependencies such as interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- Continue validation of software and hardware releases and other system updates for DEAMS Inc1\n- Continue scheduled test events to add confidence to the revised schedule, and DEAMS critical change\n- Continue preparations for and begin Follow-on Operational Test and Evaluation (FOT&E)\n- Continue development\/integration of DEAMS disbursing initiative and other system capabilities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.590"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.590"
                                            },
                                            "Text": {
                                                "val": "- Complete Follow-on Operational Test and Evaluation (FOT&E)\n- Continue development\/integration of DEAMS disbursing initiative and other system capabilities\n- Will continue to validate planned software releases and coordinate the complete testing of the Oracle R12 technical software upgrade\n- Will continue to validate user deployments and coordinate testing\n- Will continue to plan for and start execution of FOT&E"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increases due to PE 0901554F, DEAMS, changing from PE 0901538F, Financial Management Information Systems Development."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 834470"
                                    },
                                    "Title": {
                                        "val": "Defense Enterprise Accounting & Mgt Sys"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.802"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.905"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.905"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.900"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.107"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.162"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.219"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "DEAMS Inc 1 is over 87% deployed as the baseline viable product for the AF operational finance community. The program relies on heavy customer involvement through the functional management office to govern system changes, requirements development, and day-to-day customer support. DEAMS will employ multiple contract actions as the various Development Activities and Releases are developed, tested, and deployed through FY20.\n\nDEAMS Inc 1 accelerated deployment to Air Combat Command (ACC), Air Education & Training Command (AETC), and AF Reserve Command (AFRC) tenant users from FY20 to FY19. This user base was orphaned from ACC, AETC, and AFRC only because they reside on bases owned by other Major Commands.\n\nAF Space Command and AF Materiel Command Incremental users at the base operations level will migrate to DEAMS Inc 1 capability in FY20 as planned.\n\nIn the FY19 NDAA, DEAMS was nominated to be an FY18 NDAA Sec 873 Agile Pilot program.  To facilitate the transition from traditional to agile software development, Increment 1 development items will be completed under a new rapid acquisition contract action using agile software development methods. This new effort will also inform and facilitate the agile program implementation for DEAMS Continuous Capability Development."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DEAMS: Rapid Acquisition"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI-ISS, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.201"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.201"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.201"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DEAMS: SME Support, General Ledger Reports and Analysis, Business Process Analysis, Master Data Conversion and Training Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Kearney and Company"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DEAMS: ERP Solutions Architecture services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lintech Global, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Farmington Hills, MI"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DEAMS: Oracle Software Solutions"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DEAMS: ETASS (Engineering)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Jacobs Technology"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.670"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.670"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.670"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DEAMS: FFRDC ERP Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.900"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.900"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DEAMS: Direct mission Support (Development\/ Integration Environments)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DEAMS: Computing and storage support, system administration, security, storage, etc."
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DISA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.033"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.033"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.033"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DEAMS: ERP DBA Development and Support Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DDC IT Services, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Albuquerque, NM"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DEAMS: Test services from AFOTEC, JITC, LDTO and other miscellaneous test resources"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.590"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.590"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.590"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DEAMS Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "WPAFB, OH"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.500"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "DEAMS Inc 1, Software Change Requests"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "DEAMS Inc 1, Software Change Requests"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DEAMS Inc 1, SuperCluster Hardware Go-Live"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DEAMS Inc 1, R12 Software Baseline Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DEAMS Inc 1, Reporting"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DEAMS Inc 1, Disbursing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DEAMS Inc 1, Auditing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deploy DEAMS Inc 1 Capability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DEAMS Inc 1, Follow-on Operational Test and Evaluation (FOT&E)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DEAMS Inc 1, Full Deployment Authority to Proceed (FD ATP)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}