{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-25",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602709A"
        },
        "ProgramElementTitle": {
            "val": "Night Vision Technology"
        },
        "R1LineNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "38.243"
            },
            "CurrentYear": {
                "val": "33.573"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "71.816"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort to the following PEs:\n* PE 0602143A Soldier Lethality Technology\n* PE 0602145A Next Generation Combat Vehicle Technology\n* PE 0602148A Future Vertical Lift Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE conducts applied research and investigates core night vision and electronic sensor components and software to improve the Army's capability to operate in all battlefield conditions. Technologies pursued in this PE have the potential to provide the Army with new, or enhanced, capabilities to detect and identify targets farther on the battlefield, operate in obscured conditions, maintain a higher degree of situational understanding (SU), and operate autonomously. Project H95 advances infrared (IR) sensor technologies, investigates sensor materials, designs advanced multi-function lasers for marking, targeting, designation, wind-sensing, and range finding, and develops models and simulations for validating advanced sensor technologies. Project K90 funds Congressional special interest items.\n\nWork in this PE is fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602705A (Electronics and Electronic Devices), PE 0602712A (Countermine Technology), PE 0603606A (Landmine Warfare and Barrier Advanced Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0708045A (End Item Industrial Preparedness Activities).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "34.723"
                },
                "CurrentYear": {
                    "val": "29.582"
                },
                "BudgetYearOne": {
                    "val": "36.267"
                },
                "BudgetYearOneBase": {
                    "val": "36.267"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "38.243"
                },
                "CurrentYear": {
                    "val": "33.573"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.52"
                },
                "CurrentYear": {
                    "val": "3.991"
                },
                "BudgetYearOne": {
                    "val": "-36.267"
                },
                "BudgetYearOneBase": {
                    "val": "-36.267"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.01"
                    },
                    "CurrentYear": {
                        "val": "-0.009"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "4"
                    },
                    "CurrentYear": {
                        "val": "4"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.47"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-36.267"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-36.267"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19 increase related to congressional add of $4 Million\nFY20 decrease related to Science and Technology financial restructuring"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H95"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision And Electro-Optic Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.243"
                        },
                        "CurrentYear": {
                            "val": "29.573"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "63.816"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0602143A Soldier Lethality Technology\n* Project BD1 Adv Soldier Sensors\/Displays Tech for Dismounts\nPE 0602145A Next Generation Combat Vehicle Technology\n* Project BF9 Sensors for Autonomous Operations and Surv Tech\n* Project BJ2 Tactical and Navigation Lasers Sensors Technology\n* Project BH2 C4ISR Modular Autonomy Technology\nPE 0602148A Future Vertical Lift Technology\n* Project AK2 Aviation Survivability Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research and develops component technologies that enable improved Reconnaissance, Surveillance, Target Acquisition (RSTA), and situational understanding (SU). Technologies include novel focal plane arrays (FPAs), lasers, and electronics. It also includes modeling and simulation to predict performance and to determine operational effectiveness of these technologies. Research focuses on infrared (IR) FPAs necessary to search, identify and track targets in all day\/night visibility and battlefield conditions and to improve standoff detection in all operational environments. This Project designs, fabricates, and validates large format IR FPAs for sensors to simultaneously provide wide area viewing and the high resolution imagery for situational understanding, persistent surveillance, and hostile fire detection. This Project investigates and designs novel sensor electronics such as Digital Read Out Integrated Circuits (DROICs) to enable multifunction sensing. This Project also investigates and matures new semiconductor materials formed by a combination of elements from the periodic table. In addition, this Project develops algorithms for enhanced IR functionality, which provides the ability to perform detection and identification at extended ranges, as well as the ability to detect deeply buried targets. The reduction of size, weight and power - Cost (SWaP-C) is a key research objective for all efforts.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Aided Target Recognition (AiTR) Evaluation Center of Excellence"
                                    },
                                    "Description": {
                                        "val": "This effort investigates a virtual, distributed capability to interactively process both real and simulated three- dimensional (3D) multispectral scenes for Defense-wide applications. Automatic target recognition (ATR) and ATR algorithms are evaluated against realistic operational scenarios, to include roadside threats\/explosively formed projectiles, in aided or fully autonomous RSTA missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.106"
                                            },
                                            "Text": {
                                                "val": "Investigated new algorithms for situational understanding and threat awareness in all environments through hostile fire detection and location and obstacle avoidance; validated framework for image processing techniques that ingest multiple types of data from networks to increase Pd\/FAR rates on multiple targets; assessed algorithm performance against realistic operational scenarios and validated correlation processing of multiple types of multispectral two-dimensional (2D) and three-dimensional (3D) data of multiple targets to increase Pd while reducing the FAR using a cognitive image processing frame work."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Modeling and Simulation Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, verifies, and validates sensor engineering models, measurement techniques, and simulations. The goal is to improve the fidelity and adaptability of modeling and simulation capabilities for Warfighter training, sensor system analysis, and identification and assessment of phenomenology associated with imaging technologies and the calibration of imaging technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.11"
                                            },
                                            "Text": {
                                                "val": "Researched, developed, and validated Electro-optic\/Infrared (EO\/IR) sensor performance models and simulations for computer-aided prototyping and augmented reality applications through field data collection, lab measurements, human signature exploitation, and algorithm development; researched and developed robust and comprehensive measures of target acquisition performance; validated with lab measurements; leverage commercial gaming simulation technologies and augmented reality as a means to increase situational understanding."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.769"
                                            },
                                            "Text": {
                                                "val": "Continue to research and validate methods to model and simulate Electro-optic\/Infrared (EO\/IR) system performance for computer-aided prototyping and augmented reality applications through field data collection, lab measurements, simulation, signature, and algorithm research; research methods to model emerging active and passive EO\/IR technologies, applications, and threats such as hostile fire and unattended aerial systems to contribute to sensor system design; investigate and validate target acquisition performance measures to address EO\/IR sensor signature countermeasures; will investigate the application of commercial gaming technologies and augmented reality for modeling and simulation tools to create a rapid ability to assess EO\/IR system designs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602143A (Soldier Lethality Technology) \/ Project BD1 (Adv Soldier Sensors\/Displays Tech for Dismounts) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Multifunction Laser Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies for a new class of multi-wavelength laser modules which will have the ability to replace multiple laser targeting systems and reduce the size, weight, and power (SWaP) of current devices. The goal is to achieve a single housing, electronics board, power supply, and telescope for all applications to provide a reduction in the SWaP of multi-function laser systems. The objective is to develop a laser with higher efficiency and lower volume than existing pulsed Mid- wave Infrared (MWIR) and Long-wave Infrared (LWIR) lasers, which will be used for threat sensor detection and active imaging in degraded visual environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.037"
                                            },
                                            "Text": {
                                                "val": "Conducted investigations of various MWIR laser configurations for threat sensor detection; validated and compared performance of different laser breadboards, including bulk solid state and fiber based pump lasers for frequency conversion, compared different frequency conversion techniques for efficient generation of MWIR; and performed trade studies of LWIR laser designs, and select best approach for implementation and further evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.128"
                                            },
                                            "Text": {
                                                "val": "Complete investigation and perform down select of a MWIR laser configuration for threat sensor detection based on performance by different selected laser breadboards; identify the highest performing frequency conversion techniques for electrical efficiency; design and develop a lightweight and low power brass-board laser with greater than five Watts of power."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BJ2 (Tactical and Navigation Lasers Sensors Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Three-Dimensional Micro-Electronics for Night Vision Sensors"
                                    },
                                    "Description": {
                                        "val": "The goal of this effort is to investigate new, microelectronics, reconfigurable optics, and display technologies to interface with emerging three-dimensional (3D) electronics processing. The ability to actively reconfigure optical elements will require investigation of new materials and lens designs to enable real time optical refocusing and extended fields of view. Micro-display technology will benefit from new integrated microelectronics by use of new and improved display materials which operate at lower powers and enable all weather, day\/night visualization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.076"
                                            },
                                            "Text": {
                                                "val": "Validated range performance of reconfigurable optical elements in sensor objectives and augmented reality display optics while maintaining optimized overlay of display and real scene; conducted investigation of suitability of novel optical element surface treatments for high optical throughput; matured high resolution displays for targeting and maneuver; validated optical components through bench top end-to-end testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Function Digital Readout Integrated Circuits for Cooled and Uncooled Focal Plane Arrays"
                                    },
                                    "Description": {
                                        "val": "The objective of this effort is the development of advanced two-Dimensional (2D) and 3D DROICs to replace legacy 2D analog ROICs. This effort will investigate and design a digital readout architecture optimized for large format, high resolution IR FPAs through the use of modeling, analysis, and simulations. This enabling technology will bring substantial advancements to IR imaging capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.334"
                                            },
                                            "Text": {
                                                "val": "Fabricated multi-layer Readout Integrated Circuits (ROIC) to significantly increase ability to storage of charge in a very small pixel area; validated new ROICs and arrays with increased dynamic range capability over legacy cooled imaging sensors; refined designs of digital ROIC circuitry for uncooled sensors; produced initial test structures for laboratory validation of designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.356"
                                            },
                                            "Text": {
                                                "val": "Will investigate and conduct experiments to validate real-time processing that will put multiple functions into a small package, while allowing for an on-the-move capability; will develop an on-chip non-uniformity correction (NUC) that demonstrates high frame rate dynamic motion compensation and on-chip stabilization IR imagery for improved dynamic range in a compact package."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BF9 (Sensors for Autonomous Operations and Surv Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computational Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort develops component technology designed to increase battle space awareness, threat detection, and target identification (ID) by using a methodology of computation algorithms and optics combined with display and vision processing. The objective is to provide extended range, multi-spectral imaging capability, with reductions to the size, weight and cost (SWaC), for the individual warfighter. This effort will leverage work accomplished under Multi-Function DROICs for Cooled and Uncooled FPAs to provide improved mounted and dismounted Soldier situational understanding in urban and complex terrain under low light and visibility conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.413"
                                            },
                                            "Text": {
                                                "val": "Investigated novel optics, sensors, and processing approaches for day\/night visualization; conducted experiments in 3D scene visualization with compact infrared sensors; validated predicted algorithm performance for threat detection and sensor localization; began development of new optic for performing real-time detection and localization operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.182"
                                            },
                                            "Text": {
                                                "val": "Will design novel optics, sensors, and processing approaches for day\/night visualization; will conduct experiments of computational algorithms and optics combined with display and vision processing to identify improvements in target discrimination and visualization; will validate new optics for performing real-time detection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort realigned to PE 0602145A Next Generation Combat Vehicle Technology\/Project BF9 Sensors for Autonomous Operations and Surv Tech in FY20 due to financial restructure in support of Army Modernization Priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Sensitivity High Speed Uncooled Longwave Infrared (UCIR) Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops a new class of uncooled high sensitivity\/high speed IR imaging sensors to enable applications such as Hostile Fire Indication (HFI), Improvised Explosive Device (IED) and disturbed earth detection, driving\/ pilotage guidance, and 360 situational awareness on all platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.167"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments on new materials and structure designs; produced initial test arrays based on the new materials; incorporated advances in Digital Read Out Integrated Circuits (DROICs) designs to enable sensitivity and dynamic range increases over currently available uncooled Long-wave Infrared (LWIR) technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.071"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct experiments and validate new class of highly sensitive uncooled infrared imaging arrays; will design high-dynamic range speed ROIC and leverage advancing commercial foundry processes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BF9 (Sensors for Autonomous Operations and Surv Tech) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Embedded Processing for Autonomous Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort develops signal and image processing algorithms at the sensor to provide actionable information in contextually relevant manner to the decision maker."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.712"
                                            },
                                            "Text": {
                                                "val": "Will conduct market research on signal and image processing algorithms for autonomous applications; will investigate novel techniques for improving signal and image processing algorithms to perform functions such as scene labeling, and data association to enable autonomous functions; will research innovative approaches for data management and fusion which reduce information processing time."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned to PE 0602145A (Next Generation Combat Vehicle Technology) \/ Project BH2 (C4ISR Modular Autonomy Technology) in FY20 as part of the financial restructuring."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.355"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K90"
                    },
                    "ProjectTitle": {
                        "val": "NIGHT VISION COMPONENT TECHNOLOGY (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4"
                        },
                        "CurrentYear": {
                            "val": "4"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Night Vision Component Technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Night Vision Component Technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Night Vision Component Technology"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "Night Vision Component Technology"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}