{
    "id": "2020-Army-PB-2040-JBOOK-637b9179439d133187084d0d58542f7e073fb0df2918c7dd6e5b31158e975014-30",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0205412A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology - Operational System Dev"
        },
        "R1LineNumber": {
            "val": "234"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.187"
            },
            "CurrentYear": {
                "val": "0.249"
            },
            "BudgetYearOne": {
                "val": "0.732"
            },
            "BudgetYearOneBase": {
                "val": "0.732"
            },
            "BudgetYearTwo": {
                "val": "0.259"
            },
            "BudgetYearThree": {
                "val": "0.265"
            },
            "BudgetYearFour": {
                "val": "0.776"
            },
            "BudgetYearFive": {
                "val": "0.283"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "2.751"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Environmental Information Technology Management (EITM) program includes support for the Defense Environment, Safety & Occupational Health Network Information Exchange (DENIX) defense business system, as well as its database and reporting application, the Knowledge Based Corporate Reporting System (KBCRS).  This request for research, development, test and evaluation (RDTE) is to implement necessary enhancements to facilitate DENIX's Platform-as-a-Service capabilities, with additional modernizations that will improve the DoD's ESOH system of record and reporting tool set.  This also includes upgrades to incorporate ongoing cybersecurity, cloud computing, and other information technology requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.195"
                },
                "CurrentYear": {
                    "val": "0.249"
                },
                "BudgetYearOne": {
                    "val": "0.732"
                },
                "BudgetYearOneBase": {
                    "val": "0.732"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.187"
                },
                "CurrentYear": {
                    "val": "0.249"
                },
                "BudgetYearOne": {
                    "val": "0.732"
                },
                "BudgetYearOneBase": {
                    "val": "0.732"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.008"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.008"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EE6"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Information Tech Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.187"
                        },
                        "CurrentYear": {
                            "val": "0.249"
                        },
                        "BudgetYearOne": {
                            "val": "0.732"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.732"
                        },
                        "BudgetYearTwo": {
                            "val": "0.259"
                        },
                        "BudgetYearThree": {
                            "val": "0.265"
                        },
                        "BudgetYearFour": {
                            "val": "0.776"
                        },
                        "BudgetYearFive": {
                            "val": "0.283"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.751"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Environmental Information Technology Management (EITM) program includes support for the Defense Environment, Safety & Occupational Health Network and Information Exchange (DENIX) defense business system, as well as its database and reporting application, the Knowledge Based Corporate Reporting System (KBCRS).  This request for research, development, test, and evaluation (RDTE) is to implement necessary enhancements to facilitate DENIX's Platform-as-a-Service (PaaS) capabilities, with additional modernizations that will improve the DoD's ESOH system of record and reporting tool set.  This also includes upgrades to incorporate ongoing cybersecurity, cloud computing, and other information technology requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Information Technology Modernization"
                                    },
                                    "Description": {
                                        "val": "Prototype, develop, and implement platform enhancements as required to meet data management requirements for the Defense Environment, Safety & Occupational Health Network and Information Exchange (DENIX) and its reporting application, the Knowledge Based Corporate Reporting System (KBCRS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.187"
                                            },
                                            "Text": {
                                                "val": "Upon successful completion of the Business Capabilities Acquisition Cycle (BCAC) process, the program expanded the current architecture of the DENIX platform from one Level 4 container (Controlled Unclassified Information) to add a separate Level 2 container (Non-Controlled Unclassified Information) within the cloud infrastructure-as-a-service (IaaS) model. EITM completed the first phase of the BCAC process, obtaining Chief Management Officer (CMO) approval of Part 1 of the DENIX Capabilities Requirements Document (CRD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.249"
                                            },
                                            "Text": {
                                                "val": "Upon completing the BCAC process via CMO approval of Part 2 of the DENIX CRD, the EITM program will accomplish the following with FY18 and FY19 RDTE funding: The current architecture of the DENIX platform will be expanded from one Level 4 container (Controlled Unclassified Information) to add a separate Level 2 container (Non-Controlled Unclassified Information) within the cloud Infrastructure-as-a-Service (IaaS) model.  These efforts will provide DENIX the architecture and bandwidth required to support large-scale web conferencing and implement necessary user experience updates to the platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.732"
                                            },
                                            "Text": {
                                                "val": "The DENIX platform will use machine learning algorithms to ?learn? the business processes and rules used by OSD for the environmental data calls (Defense Environmental Programs Annual Report to Congress and the Environmental Management Review).  ?Learning? this information will pave the way for the prototyping of a tool that will allow KBCRS to predict anomalies and trends in data input, improving data quality."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in RDTE funding for subsequent years will be allocated to comply with Cybersecurity Service Provider and Risk Management Framework requirements for the system."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Information Mgmt - Automation 43261200 - This is the associated OMA line that provides daily support for the DoD Environment, Safety & Occupational Health Network Information Exchange and associated applications. EITM is managed as a Defense Business System #3180."
                        },
                        "AcquisitionStrategy": {
                            "val": "The Deputy Assistant Secretary of the Army for Environment, Safety & Occupational Health is the designated Executive Agent for the Environmental Information Technology Management (EITM) program. Defined by the DoD Directive 4715.1E, the EITM mission is to ensure efficient use of enterprise environment, safety, and occupational health (ESOH) corporate information management processes by providing and sustaining requirement-driven ESOH corporate data management, Congressional-reporting, and public outreach tools to the DoD, and other DoD stakeholders. Funding provided for this program will allow EITM to continue to develop and modernize the platform to meet Army and DoD policy-driven cloud computing and cybersecurity requirements. Prior to funding being committed, DoD ESOH stakeholders and authoritative information technology organizations were consulted to determine necessary system interface upgrades to be incorporated. Expanding DENIX's architecture to create a Level 2 container separate from the current Level 4 container will not only provide a more secure, cybersecurity risk-adverse environment, but it will also optimize performance, capabilities, and mandatory reporting for ESOH stakeholders using a PaaS delivery model. This phased solution begins in FY 2018 by prototyping of system architecture optimization that improves user experience, enabling web conferencing in FY 2019 and applying machine learning concepts to improve data quality in FY 2020-2022."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System enhancements for required network interfaces to support EITM mission."
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Delta Resources"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.27"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.187"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.249"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.732"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.732"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.438"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443332_EE6.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Split architecture prototype"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "User experience and containerization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Webinars\/virtual conferencing prototype and development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Machine learning algorithms"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Machine learning protoype"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}