{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-8",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603000D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Munitions Advanced Technology"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "25.550"
            },
            "CurrentYear": {
                "val": "25.540"
            },
            "BudgetYearOne": {
                "val": "25.779"
            },
            "BudgetYearOneBase": {
                "val": "25.779"
            },
            "BudgetYearTwo": {
                "val": "26.156"
            },
            "BudgetYearThree": {
                "val": "26.610"
            },
            "BudgetYearFour": {
                "val": "27.109"
            },
            "BudgetYearFive": {
                "val": "27.685"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program addresses advanced technology development associated with improving the lethality, range, reliability, safety, and survivability of munitions and weapon systems. The mission seeks to build a more lethal force through technology advancements geared towards performance and readiness.  The goal is to develop and demonstrate joint enabling technologies that can be used by the Program Executive Offices (PEO) as they develop their specific weapon programs. The program invests in and demonstrates technologies from a Joint Service perspective, thus maximizing efficiencies, ensuring the development of technologies with the broadest applicability while avoiding duplication of efforts.  Increasing the lethality, range, and performance of munitions, while striving to increase the safety for our warfighters for munitions in procurement and under development guide program investments.  \n\nMunition Area Technology Groups (MATGs) and Fuze Area Technology Groups (FATGs) have been established for each munition and capability area and are tasked with: 1) coordinating, establishing, and maintaining 2018 and 2023 year technology development plans and roadmaps, 2) coordinating biannual meetings to review technical and programmatic details of each funded and proposed effort, 3) developing and submitting Technology Transition Agreements in coordination with appropriate PEO for insertion in their Insensitive Munition (IM) Strategic Plans \/ Fuze Technology Development Plan, and 4) interfacing with other MATGs \/ FATGs and IM \/ fuze science and technology projects as appropriate.  The Joint Insensitive Munitions Technical Program (JIMTP) and Joint Fuze Technical Program (JFTP) will utilize a Technical Advisory Board (TAB) and Technical Advisory Committee (TAC) (consisting of senior Department of Defense (DoD) and Department of Energy (DOE) technology experts and laboratory representatives plus senior Munitions PEO representatives) to provide program oversight, policy, direction, and priorities during its annual meeting."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.627"
                },
                "CurrentYear": {
                    "val": "25.598"
                },
                "BudgetYearOne": {
                    "val": "25.853"
                },
                "BudgetYearOneBase": {
                    "val": "25.853"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.550"
                },
                "CurrentYear": {
                    "val": "25.540"
                },
                "BudgetYearOne": {
                    "val": "25.779"
                },
                "BudgetYearOneBase": {
                    "val": "25.779"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.077"
                },
                "CurrentYear": {
                    "val": "-0.058"
                },
                "BudgetYearOne": {
                    "val": "-0.074"
                },
                "BudgetYearOneBase": {
                    "val": "-0.074"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.028"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.049"
                                },
                                "CurrentYear": {
                                    "val": "-0.058"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.074"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.074"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "Insensitive Munitions Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.977"
                        },
                        "CurrentYear": {
                            "val": "19.009"
                        },
                        "BudgetYearOne": {
                            "val": "19.205"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.205"
                        },
                        "BudgetYearTwo": {
                            "val": "19.480"
                        },
                        "BudgetYearThree": {
                            "val": "19.801"
                        },
                        "BudgetYearFour": {
                            "val": "20.208"
                        },
                        "BudgetYearFive": {
                            "val": "20.637"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Insensitive Munitions (IM) effort addresses advanced technology development associated with improving the lethality, reliability, safety, and survivability of munitions and weapon systems.  The goal is to develop and demonstrate joint enabling technologies that can be used by program managers as they develop their specific weapon programs.  The program invests in and demonstrates technologies from a Joint Service perspective, thus ensuring the development of technology with the broadest applicability while avoiding duplication of efforts – providing efficiencies and cost savings for the Department.\n\nThis effort will demonstrate enabling technologies needed to develop weapons in compliance with IM requirements established in United States Code, Title 10, Chapter 141, Section 2389 and DoD Instruction 5000.1 and 5000.02.  This effort will take promising technologies demonstrated at the laboratory scale and transition them into demonstration programs utilizing generic hardware based on priority munitions identified in the Program Executive Office (PEO) IM Strategic Plans.  Mature demonstrated IM technology can be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other non-compliant munitions within their portfolios.  Technologies demonstrated seek to improve the performance, lethality, and range of weapons to ensure the U.S. is not outgunned and outranged on the battlefield of the future.  \n\nThe Joint Insensitive Munitions Technology Program (JIMTP) investments focus on five Munition Areas: 1) High Performance Rocket Propulsion, 2) Minimum Signature Rocket Propulsion, 3) Blast and Fragmentation Warheads, 4) Anti-Armor Warheads, and 5) Gun Propulsion.  Munition Area Technology Groups (MATG), under tri-service leadership, have developed technology roadmaps for each Munition Area which is used to guide investments based on goals consistent with the DoD IM Strategic Plan.  These IM technologies, alone or in combination, will be incorporated in hardware, simulating real-world munitions, to demonstrate their utility and feasibility as part of Technology Transition Agreements with PEOs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Performance Rocket Propulsion (HPP)"
                                    },
                                    "Description": {
                                        "val": "HPP focus on the development and demonstration of technologies to improve the IM response of HPP systems, rocket motors with Ammonium Perchlorate and with or without a metal fuel, for rockets and missiles launched from air, ground, and sea platforms.  These technologies, when applied to rocket motors, improve IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, rocket propellant ingredients, including synthesis, characterization and scale-up; reduced smoke or smoky propellants, including formulation, characterization and scale-up; rocket motor case design; materials for active and passive thermal mitigation; shock mitigation materials and techniques; passive and active coatings; active and passive venting techniques for motor cases or containers; ignition systems; sensors; and thrust mitigation techniques.  Operating conditions may be controlled or widely varying in both temperature and vibration.  The 2023 and 2028 year goals of the HPP MATG are concentrated on solving the IM response of missile propulsions systems due to Fragment and Bullet Impacts and Slow Cook Off for the majority of High Performance Propulsion rocket motors, and solving the Fast Cook Off response of very large High Performance Propulsion motors.  Additional goal is to improve range to 2 times our current capabilities, with improvements in the IM responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.741"
                                            },
                                            "Text": {
                                                "val": "-  Solving the IM response of missile propulsions systems due to Fragment Impacts and Slow Cook Off (SCO) for the majority of High Performance Propulsion rocket motors.\n-  Solving the Fast Cook Off (FCO) response of very large High Performance Propulsion motors.\n-  Finalize design for 7” rocket motor thermal venting using novel rocket case design. \n-  Development of multiple candidate formulations for Divert and Attitude Control System (DACS) lethality requirements. \n-  Survivability testing of sub-scale DACS motor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.761"
                                            },
                                            "Text": {
                                                "val": "Design and ballistic testing of a HD 1.3 propellant in a new DACS for Missile Defense Agency.  \nDemonstrate venting solution for large rocket motor casing applicable to sidewinder and AMRAAM. \nDemonstrate SCO\/FCO improvement and firing of MK-135 Tomahawk boost motor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.792"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.792"
                                            },
                                            "Text": {
                                                "val": "Design and ballistic testing of a HD 1.3 propellant in a new DACS for Missile Defense Agency.\nDemonstrate BI\/FI improvement and firing of MK-135 Tomahawk boost motor."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minimum Signature Rocket Propulsion (MSP)"
                                    },
                                    "Description": {
                                        "val": "MSP focuses on the development and demonstration of technologies to improve the IM response of MSP systems.  The development and demonstration of minimum signature (MS) rocket technologies, when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, MS rocket propellant formulations; ingredients for MS propellant formulations, including synthesis, characterization and scale-up; case and packaging design; active and passive venting techniques; rocket motor case design; ignition systems; and thrust mitigation techniques.  Of particular interest are technologies toward higher burning rate MS propellants with state-of-the-art energy and reduced shock sensitivity.  The 2023 and 2028 year goals of the MSP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment Impact, Slow Cook Off, and Shaped Charge Jet (SCJ) threats, as well as improving range to 1.5 times our current capabilities in the near term and 2 times our current capabilities in the out years, with improvements in the IM responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.421"
                                            },
                                            "Text": {
                                                "val": "-  Solving the IM response of missile propulsion systems due to Fragment Impact, SCO, and Shaped Charge Jet (SCJ) threats.\n-  Design of extruded double base motor for close combat propulsion using novel processing equipment.\n-  Demonstration of low cost composite case with thermal venting for dual pulse motors.\n-  Demonstration of shock mitigating shipping containers for hellfire improvement to Fragment Impact."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.431"
                                            },
                                            "Text": {
                                                "val": "Manufacture components and propellant, for assembly and prep for testing an extruded propellant to improve Fragment Impact response of TOW flight motor.\nComplete hardware design and manufacture for small diameter rocket motor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.462"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.462"
                                            },
                                            "Text": {
                                                "val": "Conduct testing of extruded propellant to improve Fragment Impact response of TOW flight motor.\nConduct slow cookoff testing on small diameter rocket motor to demonstrate improved reaction response."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast and Fragmentation Warheads (BFW)"
                                    },
                                    "Description": {
                                        "val": "BFW focus on the development and demonstration of technologies to improve the IM response of BFW munitions.  The development and demonstration of explosive ingredients, explosives, and warhead and fuze technologies, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection \/ packaging materials and systems, shock mitigation liners, initiation devices, techniques, and technologies.  Applications vary but include high performance warhead fills, booster explosives, bulk demolition charges, and bulk fills for blast and\/or fragmentation charges.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability, and reliability may be critically important depending on the intended munition application.  The 2023 and 2028 year goals of the BFW MATG are concentrated on solving the IM response of blast fragment warheads to the Sympathetic Detonation, Fragment Impact, Slow Cookoff, and SCJ threats, seeking increased performance and lethality of warheads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.548"
                                            },
                                            "Text": {
                                                "val": "-  Solving the IM response of blast fragment warheads to the Sympathetic Detonation, FCO, and SCJ threats.\n-  Build and demonstration of shock barriers for current and future shoulder launch weapons.\n-  Demonstrate the thermal improvement to the BLU-109 penetrating weapon using outgassing and vent."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.452"
                                            },
                                            "Text": {
                                                "val": "Manufacture and assemble large diameter indirect fire munitions to prepare to demonstrate improved Fragment Impact, Slow Cookoff, and Sympathetic Reaction response with lethality enhancement using novel warhead design and venting technologies.\nDown-selection of explosive material and manufacture of warheads to conduct water pit testing on novel warhead design for direct fire ammunition warhead."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.502"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.502"
                                            },
                                            "Text": {
                                                "val": "Conduct IM testing on large diameter indirect fire munitions to demonstrate improved Fragment Impact, Slow Cookoff, and Sympathetic Reaction response.\nConduct water pit testing and conduct lethality assessment on novel warhead design for direct fire ammunition warhead."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Armor Warheads (AAW)"
                                    },
                                    "Description": {
                                        "val": "AAW focuses on the development and demonstration of explosive ingredients, explosives, and warhead and fuze technologies for improving Insensitive Munitions (IM) of AAW munitions.  The development of explosive ingredients, explosives, and warhead and fuze technologies, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection\/packaging materials and systems, shock mitigation liners, and initiation devices, techniques, and technologies.  Applications vary, but include high performance warhead fills, booster explosives, and all other technology to mitigate the violent response of AAW munitions to IM threats.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability, and reliability may be critically important depending on the intended munition application. The 2023 and 2028 year goals of the AAW MATGs are concentrated on solving the IM response of anti-armor warheads to the Fragment Impact and Slow Cook-off, threats for larger and Medium Caliber Munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.506"
                                            },
                                            "Text": {
                                                "val": "-  Solving the IM response of anti-armor warheads to the Fragment Impact, Sympathetic Reaction, and Shaped Charge Jet threats for larger munitions and the Fragment Impact, Slow Cook-off, and Sympathetic Reaction \/ Shaped Charge Jet threats for Medium Caliber Munitions.\n-  Firing demonstration of 155mm anti-access\/aerial denial (A2\/AD) cannon capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.604"
                                            },
                                            "Text": {
                                                "val": "Demonstrate full IM improvement to 40mm sub-munition for 155mm carrier rounds with DPICM capability. \nDemonstrate improved SCO response of medium caliber munitions using SMA technology. \nDemonstrate improved safety of underwater neutralizing charges using novel energetics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.644"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.644"
                                            },
                                            "Text": {
                                                "val": "Demonstrate full IM improvement to 40mm sub-munition for 155mm carrier rounds with DPICM capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding will be used to accelerate the Dual-Purpose Improved Conventional Munition (DPICM) replacement cannon round capability project to demonstrate a 99% reliability for an insensitive munitions compliant the system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gun Propulsion (GP)"
                                    },
                                    "Description": {
                                        "val": "GP focuses on the development and demonstration of technologies in the area of GP systems.  The development and demonstration of gun propulsion technologies, when applied to munition systems, will improve munition Insensitive Munitions (IM) response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, gun propellant formulations, ingredients for gun propellant formulations (including synthesis, characterization and scale-up), cartridge case and packaging design, active and passive venting techniques, reduced sensitivity primer propellant and primer systems, and robust primers for insensitive propellants.  Applications vary, but include both large and medium caliber munitions, as well as propelling charges for mortars and shoulder launched munitions.  Operating requirements vary, and other factors such as barrel life and operation over varying environmental conditions may be critically important depending on the intended munition application.  The 2023 and 2028 year goals of the GP MATG are concentrated on solving the IM response of gun propulsion munitions to Fragment Impact and Slow and Fast Cook threats, with a focus on high performance gun propulsion systems designed for extended range and increased lethality in 2028 and 2033."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.761"
                                            },
                                            "Text": {
                                                "val": "-  Solving the IM response of gun propulsion munitions to Fragment Impact and SCO threats.\n-  Demonstrate IM compliant propulsion system for current and future Fire from enclosure Military Operations in Urban Terrain (MOUT) weapons. \n-  Demonstration of propulsion system for extending range and accuracy of 120mm mortars."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.761"
                                            },
                                            "Text": {
                                                "val": "Demonstrate weight and cook off improvement for medium caliber propulsion systems.  \nDemonstrate improved FI and SCO venting and packaging for 120mm tank rounds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.805"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.805"
                                            },
                                            "Text": {
                                                "val": "Demonstrate weight and cook off improvement for medium caliber propulsion systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0602000D8Z P000"
                                    },
                                    "Title": {
                                        "val": "BA2 Insensitive Munitions"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.910"
                                        },
                                        "CurrentYear": {
                                            "val": "13.037"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.178"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.178"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.362"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.618"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.889"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "1)  Transition of technologies developed by the program are tracked and documented by technology maturity.\n2)  MATG Technology Roadmaps are prepared, evaluated, and analyzed by JIMTP management and technical staff.\n3)  Chairman's Annual Assessments for each MATG are critically reviewed by the Technical Advisory Committee (TAC) to determine progress, transition plans, and relevance of each project.\n4)  Project progress toward goals and milestones is assessed at each MATG meeting.\n5)  Annual technical reports and papers are tracked and documented for the Program.\n6)  External Peer Reviews of Projects are conducted as part of Joint Army\/Navy\/NASA\/Air Force meetings.\n7)  Technology Transition Agreements are in place with Munition programs."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "301"
                    },
                    "ProjectTitle": {
                        "val": "Enabling Fuze Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.573"
                        },
                        "CurrentYear": {
                            "val": "6.531"
                        },
                        "BudgetYearOne": {
                            "val": "6.574"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.574"
                        },
                        "BudgetYearTwo": {
                            "val": "6.676"
                        },
                        "BudgetYearThree": {
                            "val": "6.809"
                        },
                        "BudgetYearFour": {
                            "val": "6.901"
                        },
                        "BudgetYearFive": {
                            "val": "7.048"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This effort will demonstrate advanced fuze technologies needed to develop that weapons address Joint priority capability areas including ones highlighted by OSD R&E Technology-Focused Modernization and Service S&T priorities including Hypersonics, Long Range Precision Fires, Air Defense and Scalable Lethality. This effort will take promising technologies integrated and tested to technology maturity and demonstrate the technologies to technological maturity utilizing weapon hardware based on\npriority capabilities and technology needs identified and validated by the Program Executive Officers (PEOs) and the Heads of the Service Science and Technology (S&T) communities. Mature demonstrated fuze technology will be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other munitions within their portfolios. \n\nUnder the Joint Fuze Technology Program (JFTP), investments are focused on specific capability areas that have been identified by  department strategic guidance and current shortfalls in weapon systems and validated by the PEOs and Heads of the Service S&T communities. These four capability areas are: 1) Hard Target Survivable Fuzing, 2) Tailorable Effects (TE) Weapon Fuzing, 3) High Reliability Fuzing, and 4) Enabling Fuze Technologies and Common Architecture."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hard Target Fuzing"
                                    },
                                    "Description": {
                                        "val": "The Hard Target Fuzing challenges are grouped into three Technology Areas.  First, improved modeling and simulation capabilities provide the validated computational tools necessary for hard target applications.  Second, basic phenomenology and understanding of the Fuze Environment is the science-based endeavor of providing the test equipment, instrumentation, and analysis techniques for experimentation and data gathering necessary for next generation fuzing.  Third, hard target survivable fuze components are developed to increase the effectiveness of facility denial munitions by improving the prediction tools and testing methodologies to evaluate the survivability and functionality of legacy and future fuzes.  Development of these technologies will enable next generation boosted and hypersonic penetrators to execute missions against hardened and deeply buried targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.406"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate survivability and functionality of a High G shock harden fuze firing switch for use in extreme high G environments. \n-  Complete development of improve layer discrimination and void detection sensor and algorithms to more accurately and reliably detect and classify complex hardened targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.417"
                                            },
                                            "Text": {
                                                "val": "Develop fully programmable miniature data recorders for embedded fuzing that can survive extreme hard target fuzing environments.\nDevelop and demonstrate methods to accurately replicate high G loading on fuzing components and transition to the DoD and Industry fuze community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.424"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.424"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate methods to accurately replicate high G loading on fuzing components and transition to the DoD and Industry fuze community."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tailorable Effects Fuzing"
                                    },
                                    "Description": {
                                        "val": "Develop fuzing for tailorable effects weapons that encompasses the ability to selectively vary the output of the weapon (Dial-a-Yield) and\/or the ability to generate selectable effects (e.g., directed blast, fragmentation).  Develop initiation and multi-point technologies; electronic safe and arm based multi-point initiators for tunable output – scalable yield warheads; MicroElectro-Mechanical Systems (MEMS) based multi-point initiators for tunable output\/scalable yield warheads; and smart fuzing for tailorable effects weapons.  These technologies will enable weapons that can effectively defeat a variety of targets while minimizing unintentional collateral effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.671"
                                            },
                                            "Text": {
                                                "val": "-  Conduct testing of 10,000+ G survivable multipoint fuze prototype hardware that offer warhead tailorable effects capabilities.\n-  Demonstrate and transition to Industry, a reduced size integrated High Voltage switch technology to fit in commercially available Exploding Foil Initiators (EFI) in a variety of package sizes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.684"
                                            },
                                            "Text": {
                                                "val": "Develop technologies for efficient\/novel generation of firing energy for multi-point fuze systems.\nDevelop fuzing components precision timing between initiation of multi-points and of energetic reactions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.693"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.693"
                                            },
                                            "Text": {
                                                "val": "Develop technologies for efficient\/novel generation of firing energy for multi-point fuze systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Reliability Fuzing"
                                    },
                                    "Description": {
                                        "val": "Develop high reliability fuzing architectures, fuzing components, and unexploded ordnance (UXO) reduction features.  This program’s fuzing technologies are critical to enable the next generation of cluster munitions to achieve the required greater than 99 percent reliability.  Evolving DoD emphasis on increased weapon system reliability is driving the need to consider new and novel approaches for achieving increased fuze reliability while maintaining or enhancing fuze design safety.  DoD policy, higher weapon reliability expectations and harsher weapon system operational requirements are dictating the need for higher fuze reliability than available using current technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.802"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate miniature fuze device safety mechanisms for reduced UXO (unexploded ordnance) and increased reliability.\n-  Demonstrate a fuze electrical distribution system in an area effect munition that will transfer all necessary power and data signals while maintaining required mechanical ruggedness and minimizing disruption to the munition expulsion event."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.772"
                                            },
                                            "Text": {
                                                "val": "Develop integrated MEMS fuze sensor technology for applications in miniature UAV weapons such as Precision Acquisition Weapons System (PAWS) and BlackTip\n\nDemonstrate area-effects weapon fuzing subsystem and system-level prototypes and systems in both laboratory and field environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.781"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.781"
                                            },
                                            "Text": {
                                                "val": "Complete development MEMS fuze sensor technology for applications in miniature UAV weapons and transition into Precision Acquisition Weapons System (PAWS) Joint Capability Technology Demonstration (JCTD)"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of FY2019 funding will allow enabling technology development required for high reliability cluster munitions replacement applications."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Fuze Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop common\/modular fuze architectures; innovative fuze component technologies; sensors; next generation fuze setting capability, tools, and modeling; and fuzing power sources.  These fuzing technologies will provide smaller, more cost effective solutions while meeting or exceeding the performance of existing technologies.  Development of these technologies will enable future weapon applications to be more mission adaptive and smaller along with improve target detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.694"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a prototype wireless system to provide power and data transfer to aerial rockets and small guided munitions for use on US Army rotary aircraft.\n-  Demonstrate autonomously Height of Burst (HOB) and target classification sensing system for enhanced area effects munition lethality."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.658"
                                            },
                                            "Text": {
                                                "val": "Demonstrate miniaturized, low power, target detection device technologies in area-effect weapon simulated target environment testing.  \nDevelop miniature thermal battery technology to yield fast rise time and high power density required for small munitions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.676"
                                            },
                                            "Text": {
                                                "val": "Develop miniature thermal battery technology to yield fast rise time and high power density required for small munitions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0602000D8Z P204"
                                    },
                                    "Title": {
                                        "val": "BA2 Enabling Fuze Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.201"
                                        },
                                        "CurrentYear": {
                                            "val": "6.263"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.327"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.327"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.431"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.532"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.655"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1)  Transition of technologies developed by the Program are tracked and documented by technology maturity.\n2)  Fuze Area Technology Groups (FATG) Technology Roadmaps are prepared, evaluated, and analyzed by Joint Fuze Technology Program (JFTP) management and technical staff.\n3)  Chairman's Annual Assessments for each FATG are critically reviewed by the Technology Assessment Group and Technology Advisory Committee to ensure the JFTP is strategic focused and strong transitions into weapons and industry are taking place.\n4)  Project progress toward goals and milestones is assessed at each FATG meeting.\n5)  Annual technical reports and papers are tracked and documented for the Program.\n6)  Technology Transition Agreements are in place with Munition programs."
                        }
                    }
                }
            ]
        }
    }
}