{
    "id": "2020-Navy-PB-1319-JBOOK-70424d53d505ad36f58958e9097dbb4e960ff5c07915d7e5672a15384a45783b-8",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605804N"
        },
        "ProgramElementTitle": {
            "val": "Technical Information Services"
        },
        "R1LineNumber": {
            "val": "182"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "1.280"
            },
            "CurrentYear": {
                "val": "1.029"
            },
            "BudgetYearOne": {
                "val": "0.988"
            },
            "BudgetYearOneBase": {
                "val": "0.988"
            },
            "BudgetYearTwo": {
                "val": "0.930"
            },
            "BudgetYearThree": {
                "val": "0.944"
            },
            "BudgetYearFour": {
                "val": "0.963"
            },
            "BudgetYearFive": {
                "val": "0.983"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Technical Information Services program provides support to achieve affordability in the development of Navy systems by reducing life-cycle costs through the facilitation of advanced technology associations between U.S. industry and the Navy.  Warfighting effectiveness is enhanced through strategic relationships with industry to commercialize the science and technology developed by the Naval Research Enterprise and to gain strategic understanding of industry Research and Development Programs and plans; access concepts and technologies; and access to business practices within the civil sector."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.782"
                },
                "CurrentYear": {
                    "val": "1.029"
                },
                "BudgetYearOne": {
                    "val": "1.009"
                },
                "BudgetYearOneBase": {
                    "val": "1.009"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.280"
                },
                "CurrentYear": {
                    "val": "1.029"
                },
                "BudgetYearOne": {
                    "val": "0.988"
                },
                "BudgetYearOneBase": {
                    "val": "0.988"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.498"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.021"
                },
                "BudgetYearOneBase": {
                    "val": "-0.021"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.498"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.021"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.021"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0835"
                    },
                    "ProjectTitle": {
                        "val": "Tech Info System"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.766"
                        },
                        "CurrentYear": {
                            "val": "1.029"
                        },
                        "BudgetYearOne": {
                            "val": "0.988"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.988"
                        },
                        "BudgetYearTwo": {
                            "val": "0.930"
                        },
                        "BudgetYearThree": {
                            "val": "0.944"
                        },
                        "BudgetYearFour": {
                            "val": "0.963"
                        },
                        "BudgetYearFive": {
                            "val": "0.983"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The goal for this project is to enhance warfighter effectiveness by: leveraging industry independent Research and Development science and technology base; developing strategic partnerships with industry to transition private sector technology; and transferring appropriate Navy-developed innovative concepts and inventions to the private sector for purposes of commercialization. (Public Law 96-480, Federal Technology Transfer Act of 1986.)\n\nThis project also provides the Department of the Navy (DON) interface to the Office of the Assistant Secretary of Defense for Rapid Fielding, and to the Assistant Secretary of Commerce for Technology Policy for matters relating to policy and reporting requirements for technology transfer."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TECHNICAL INFORMATION SERVICES"
                                    },
                                    "Description": {
                                        "val": "Technical Information Services supports the spin-in and spin-out of research and development performed by Navy laboratories and industry. This program develops the tools and provides management oversight of the Department of Navy (DON) Domestic Technology Transfer (T2) Program.  The Navy plans on initiating two new pilot programs per year with the objective of increasing the visibility and transfer of the Navy developed technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.766"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the following efforts:\n- Two new pilot programs per year to support Technology Transfer (T2) efforts at Navy Office of Research and Technology\nApplication (ORTA) activities across laboratories.\n- Efforts to raise visibility of Navy technologies through publications and\/or videos.\n- Effort to improve Navy Defense Technology Transfer Information System (NDTTIS) database to continue additional value\/impact of Cooperative Research and Development Agreements (CRADAs).\n- Effort to continue the Navy wide T2 Innovation Discovery\/Intellectual Property Mining Program.\n- Effort to coordinate\/support a regional technology transfer industry day.\nInitiate the following effort:\n- Two new pilot programs per year to support Technology Transfer (T2) efforts at Navy Office of Research and Technology Application (ORTA) activities across laboratories. \n- Revise and update Technology Transfer mechanisms (e.g., CRADAs. Partnership Intermediary Agreement (PIAs), and Educational Partnership Agreement (EPAs) templates, NDTTIS database, online training) and Policy Guidance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.029"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct the following efforts in FY 2019: Revise and update Technology Transfer mechanisms (e.g., Cooperative Research and Development Agreements (CRADAs), PIAs templates, Navy Defense Technology Transfer Information System (NDTTIS) database, online training) and continue updates to the T2 Handbook and T2 Policy Guidance. Execute two new pilot programs to support Technology Transfer (T2) efforts at Navy Office of Research and Technology Application (ORTA) activities across Navy laboratories. T2 innovation efforts are selected during 1st quarter of the year of appropriation and executed during the same. These efforts lead to innovations to T2 process within the sponsored Navy laboratory and are shared across the Department of the Navy (DoN) and Defense Wide."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.988"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.988"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "To enhance transactional efficiency between the Navy laboratories and industry and academic collaborators, the Navy Technology Transfer (T2) Office will revise and update Technology Transfer mechanisms (e.g., Cooperative Research and Development Agreements (CRADAs), PIAs templates, Navy Defense Technology Transfer Information System (NDTTIS) database, online training), Technology Transfer Handbook, Licensing Handbook and Policy Guidance.  It will also execute at least two new pilot programs to embolden innovative T2 efforts at Navy Office of Research and Technology Application (ORTA) activities across laboratories and commercialize Navy laboratory-developed technologies.  Additionally, the T2 Program Office will raise the visibility of Navy technologies through publications, videos, website\/social media, marketing and outreach to capitalize on the Navy laboratory developed innovations and systematically drive economic growth in the industrial base, create new services and products and amplify an inclusive technology based economic development.\n\nIn order to deliver solutions and capabilities to the acquisition workforce in support of the warfighter, the Navy T2 Program Office will enhance the NDTTIS database to leverage the value\/impact of CRADAs.  The Navy-wide T2 Innovation Discovery\/Intellectual Property Mining Program will be expanded to identify, license and transition more patentable inventions that provide solutions to acquisition and commercial industry technological challenges that can benefit the warfighter and society.  The Program Office will also lead and participate in national and regional technology transfer industry and academia engagement events to optimize the marketing and outreach of Navy developed inventions and expand on collaboration opportunities with industry and engage with underserved communities and non-traditional partners to advance commercialization.\n\nThe Navy T2 Program Office will institute a customer relationship and transaction management system that harmonizes and streamlines the T2 mechanism collaboration process, consolidates the Navy's intellection capital into a single structure through a centrally managed portfolio that will include a marketing analysis component, provide for external and internal stakeholder engagement, licensing and ecosystem landscape analysis to discover and forge opportunities for mutually beneficial T2 commercialization collaborations with academia, economic development agencies and start-up businesses."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Demonstrate support for technological transitions from the Naval Research Enterprise into industrial and commercial enterprises supporting Navy programs of record and warfighter needs, by being responsive to Offices of Research and Technology Applications focal points for technology transfer in their development of Cooperative Research and Development Agreements (CRADA), and reducing transaction\/information exchange timeframes to enable\ninvention commercialization and utilization of government funded facilities, equipment and innovations."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2296"
                    },
                    "ProjectTitle": {
                        "val": "Federal Lab Consortium"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.514"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.514"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Federal Laboratory Consortium for Technology Transfer (FLC) was established by Congress under the Federal Technology Transfer Act of 1986 (P.L. 99-502, 20 October 1986, as amended). The FLC, in cooperation with federal laboratories and the private sector, provides services to enhance the transfer of federally-developed technology to include activities such as: developing and administering technology transfer training courses and materials; assisting Federal agencies and laboratories in their technology transfer programs; and providing a clearinghouse for technology transfer requests."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "FEDERAL LAB CONSORTIUM"
                                    },
                                    "Description": {
                                        "val": "The Federal Laboratory Consortium for Technology Transfer (FLC) was established by Congress under the Federal Technology Transfer Act of 1986 (P.L. 99-502, 20 October 1986, as amended). The FLC, in cooperation with federal laboratories and the private sector, provides services to enhance the transfer of federally-developed technology to\ninclude activities such as: developing and administering technology transfer training courses and materials; assisting Federal agencies and laboratories in their technology transfer programs; and providing a clearinghouse for technology transfer"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.514"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In accordance with the Federal Technology Transfer Act of 1986 (P.L. 99-502, 20 October 1986, as amended), disseminated funding judiciously."
                        }
                    }
                }
            ]
        }
    }
}