{
    "id": "2020-AirForce-PB-3600-MJBOOK-0-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-13",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602788F"
        },
        "ProgramElementTitle": {
            "val": "Dominant Information Sciences and Methods"
        },
        "R1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "191.724"
            },
            "CurrentYear": {
                "val": "185.276"
            },
            "BudgetYearOne": {
                "val": "181.562"
            },
            "BudgetYearOneBase": {
                "val": "181.562"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "184.766"
            },
            "BudgetYearThree": {
                "val": "191.106"
            },
            "BudgetYearFour": {
                "val": "177.037"
            },
            "BudgetYearFive": {
                "val": "180.741"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops enterprise-centric information technology for the Air Force. Advances in enterprise-centric information technologies are required to increase warfighter readiness and effectiveness by providing the right information, at the right time, in the right format, anytime, anywhere in the world. The Connectivity and Protection Tech project provides the technologies for multi-level, secure, seamless networks; advanced communications processors; anti-jam and low probability of intercept techniques, as well as technologies that deter any adversary from attacking computer systems while allowing access to, presence on, manipulation of, and operational effects on adversary computer systems. This project also develops the technology base for the next generation of ultra-wide-bandwidth, multi-channeled, air- and space-based communications networks. The Information Management and Computational Tech project provides advances in information management and dissemination technologies to ensure the delivery of high-quality, timely, secure information to the warfighter, and develop technologies to produce both advanced on demand computational processing and computer architectures with greater capacity and sophistication for addressing dynamic mission objectives under constraints imposed by Air Force systems. The Information Decision Making Tech project develops the technology to support the commander and staff's ability to command all viable options to achieve desired effects across the full spectrum of operations. The Operational Awareness Tech project develops technologies that improve their capability to generate, process, manage, fuse, exploit, interpret, and disseminate timely and accurate information. The Research Site Support project provides the Rome Research Site infrastructure at Rome, New York and provides for the continued operations of all Rome Research Site properties, buildings, and services necessary for the research mission. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nIn FY 2020, Project 625315 renamed from Connectivity and Protection Tech to C4I Dominance Technology.\n\nIn FY 2020, Project 625316, Info Mgt and Computational Tech efforts will be transferred to Project 625315, C4I Dominance Technology, in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept.\n\nIn FY 2020, Project 625317, Information Decision Making Tech efforts will be transferred to Project 625315, C4I Dominance Technology, in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept.\n\nIn FY 2020, Project 625318, Operational Awareness Tech efforts will be transferred to Project 625315, C4I Dominance Technology, in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0622041F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "167.818"
                },
                "CurrentYear": {
                    "val": "162.420"
                },
                "BudgetYearOne": {
                    "val": "173.761"
                },
                "BudgetYearOneBase": {
                    "val": "173.761"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "191.724"
                },
                "CurrentYear": {
                    "val": "185.276"
                },
                "BudgetYearOne": {
                    "val": "181.562"
                },
                "BudgetYearOneBase": {
                    "val": "181.562"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "23.906"
                },
                "CurrentYear": {
                    "val": "22.856"
                },
                "BudgetYearOne": {
                    "val": "7.801"
                },
                "BudgetYearOneBase": {
                    "val": "7.801"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.090"
                    },
                    "CurrentYear": {
                        "val": "-0.144"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "26.500"
                    },
                    "CurrentYear": {
                        "val": "23.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.198"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.702"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "7.801"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.801"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2020 due to civilian pay repricing adjustment and realignment and consolidation of Air Force Applied Research Science and Technology funding for Future Air Force Capabilities Applied Research efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "625315"
                    },
                    "ProjectTitle": {
                        "val": "C4I Dominance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.214"
                        },
                        "CurrentYear": {
                            "val": "32.338"
                        },
                        "BudgetYearOne": {
                            "val": "99.855"
                        },
                        "BudgetYearOneBase": {
                            "val": "99.855"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "100.696"
                        },
                        "BudgetYearThree": {
                            "val": "105.352"
                        },
                        "BudgetYearFour": {
                            "val": "88.899"
                        },
                        "BudgetYearFive": {
                            "val": "90.761"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires advanced technologies which support the Air Force five core missions and enable the Air Force to achieve Global Vigilance, Global Reach, and Global Power in support of national security objectives. The technologies developed under this project enable the National Defense Strategy and Air Force future operating concepts which require operational agility (the ability to rapidly generate—and shift among—multiple solutions for a given challenge), creating combinations of air, space, and cyberspace capabilities to achieve desired effects in the battlespace.\n\nThis project provides the technologies for secure, self-configuring, self-healing, seamless networks; advanced communications processors; anti-jam and low probability of intercept communications techniques; agile and dynamic policy-based network management capabilities; and modular, programmable, low-cost software radios. In addition, it develops both the technology base for ultra-wide bandwidth and multi-channeled communications networks (both air and space based) on and between platforms.\n\nThis project provides the technologies which enable the ability to globally share, discover, and access information across organizational, functional, and coalition boundaries and between and among domains, the timely delivery of information to tactical assets, the tailoring and prioritization of information based on mission needs and importance, and the scaling, robustness, and collaboration features required of the Air Force net-centric information management environment.\n\nThis project advances technologies enabling the effective execution of military objectives that will vastly improve the ability to support the commander and staff's ability to command all viable options to achieve desired effects across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict. This project provides technologies for anticipatory decision support; course of action development, planning, scheduling, and assessment; and the real-time effective portrayal of complex data sets.\n\nThis project improves and automates the capability to generate, process, manage, fuse, exploit, interpret, and disseminate timely and accurate information.  This project provides not only a network-centric, collaborative intelligence analysis capability that enables the fusion of multi-intelligence and sensor sources to provide timely situational awareness, understanding, and anticipation of the threats in the battlespace, but also the advanced, novel exploitation technologies needed to intercept, collect, locate, and process both covert and overt raw data from intelligence and sensor sources.\n\nIn FY 2020, Project 625315 renamed from Connectivity and Protection Tech to C4I Dominance Technology.\n\nIn FY 2020, Project 625316, Info Mgt and Computational Tech efforts will be transferred to Project 625315, C4I Dominance Technology, in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept.\n\nIn FY 2020, Project 625317, Information Decision Making Tech efforts will be transferred to Project 625315, C4I Dominance Technology, in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept.\n\nIn FY 2020, Project 625318, Operational Awareness Tech efforts will be transferred to Project 625315, C4I Dominance Technology, in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase Line 13B"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.819"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally directed efforts."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not applicable"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Connectivity Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop improved, survivable, higher bandwidth communications, networking, and signal processing technologies to provide secure, adaptive, covert, anti-jam, and assured global battlespace connectivity tailored to anti-access and area-denial environments and contested operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.395"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.338"
                                            },
                                            "Text": {
                                                "val": "Continue the research and development of Aerial Layer Network Components and prototype technologies for robust, adaptive, and mission aware airborne networks. Advance the research and investigation of high frequency pathways (e.g. the V and W band of the electromagnetic spectrum) to support aerial and space-based beyond line of sight communications. Expand the research and development of dynamic map-to-mission for secure message exchange operations continuity and agile info management. Develop a waveform testbed and flight test a new multi-waveform radio. Conduct research and development to measure propagation at millimeter wave frequencies to validate previously developed models and enable future definition of military satellite communications systems. Complete autonomic network model and simulation. Complete low overhead network monitoring and management protocol. Continue ionospheric research, propagation modeling and simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, this work is performed in the Assured Communications & Networks effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $32.338 million. Funding decreased due to realignment of advanced network and communication research under the Assured Communications & Networks effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured Communications & Networks"
                                    },
                                    "Description": {
                                        "val": "Develop communications, networking, and signal processing technologies with improved survivability and capacity to provide secure, adaptive, covert, anti-jam, and assured global battlespace connectivity tailored to anti-access and area-denial environments and contested operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under the Advanced Connectivity Technologies effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.680"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.680"
                                            },
                                            "Text": {
                                                "val": "Continue the research and development of technologies for robust, adaptive, and mission aware airborne networks. Continue the investigation of high frequency pathways (for example, the V and W band of the electromagnetic spectrum) to support aerial and space-based beyond line of sight communications. Continue the research and development of dynamic map-to-mission for secure message exchange operations continuity and agile info management. Continue development of a waveform testbed and flight test a new multi-waveform radio. Continue research and development to measure propagation at millimeter wave frequencies to validate previously developed models and enable future definition of military satellite communications systems. Continue ionospheric research, propagation modeling and simulation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $23.680 million. Funding increased due to realignment of advanced network, connectivity, and communications research from Advanced Connectivity Technologies effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data to Decisions"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop technologies for decision quality information dissemination services via publish, subscribe, and query across the Global Information Grid to enterprise and tactical assets and coalition partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under both Exploitation Technologies and Multi-Source Fusion Technologies efforts within Project 625318, Operational Awareness Tech."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.272"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.272"
                                            },
                                            "Text": {
                                                "val": "Continue the research and development of data analytics and strategic indications and warnings technologies (including large data alignment, indexing and search on textual data, large-scale and disparate data sources, both structured and unstructured data, and employment of various ontologies and machine learning techniques). Continue to advance research and development for cloud-based data and information sharing environment for optimized processing and automated association capability. Continue to focus signals intelligence characterization on audio and other electronic signals. Continue research and development in exploitation technologies using audio processing for language modeling and deep learning techniques. Continue research on enhanced emitter feature extraction capabilities and development of automated electronics intelligence analysis toolsets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $13.272 million. Funding increased due to realignment of advanced network-centric multi-source fusion, tracking and identification, situational awareness, analysis and understanding, threat anticipation, spectral detection and geolocation, signal recognition and analysis, and associated data tagging, tracking, and tracing research from Project 625318, Operational Awareness Tech."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Domain Command & Control (MDC2)"
                                    },
                                    "Description": {
                                        "val": "Develop advanced monitoring, planning, and assessment technologies enabling aerospace commanders to develop effects-based campaigns. Investigate, analyze, and develop technologies for planning, execution, and automatic rapid reconfiguration of distributed intelligent and integrated command and control information systems to achieve the commander's intent throughout varying crisis levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under Command and Control System Technologies effort within Project 625317, Information Decision Making Tech."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.954"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.954"
                                            },
                                            "Text": {
                                                "val": "Continue to leverage prior efforts in developing plan assessment services and conduct quantitative evaluations of cyber assets to cyber operators, enabling them to present viable cyber options to commanders for multi-domain (air, space, cyberspace, land, sea, undersea) integrated plans. Continue the development of command and control system technologies in the area of multi-domain command and control. Continue research for applying machine learning techniques to enhance and optimize space operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $17.954 million. Funding increased due to realignment of anticipatory decision support, course of action development, planning, scheduling, assessment, and real-time complex data-set portrayal research from Project 625317, Information Decision Making Tech."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Artificial Intelligence\/Autonomy\/Machine Learning"
                                    },
                                    "Description": {
                                        "val": "Perform research and development (R&D) to harness the speed and scale of computers and machines to address problems of complexity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under Campaign Planning Technologies effort within Project 625317, Information Decision Making Tech."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.808"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.808"
                                            },
                                            "Text": {
                                                "val": "Continue to research combat planning and tactical assessment software services. Continue research for identifying and implementing state-of-the-art learning models. Develop algorithms for data-efficient leaning and integrate with a machine learning framework."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $14.808 million. Funding increased due to realignment of anticipatory decision support, course of action development, planning, scheduling, assessment, and real-time complex data-set portrayal research from Project 625317, Information Decision Making Tech."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear C3 Modernization"
                                    },
                                    "Description": {
                                        "val": "Perform research and development (R&D) to advance existing nuclear capable forces to ensure command, control, and connectivity for the President without constraints."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under Advanced Connectivity Technologies effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.893"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.893"
                                            },
                                            "Text": {
                                                "val": "Continue high-frequency (HF) mesh networking algorithm development, further very low frequency (VLF) software-defined radio (SDR) development. Continue to enhance\/modernize propagation tools and the High Frequency Laboratory, and, will initiate trans-auroral and trans-equatorial long haul communication."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $3.893 million. Funding increased due to realignment of advanced nuclear network, connectivity, and communications research from the Advanced Connectivity Technologies effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantum Information Science"
                                    },
                                    "Description": {
                                        "val": "Perform research and development (R&D) that will utilize quantum physics for the storage, transmission, manipulation, computing, or measurement of information in ways that offer advantages to classical capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and prior years, this work is performed under Advanced Connectivity Technologies effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.581"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.581"
                                            },
                                            "Text": {
                                                "val": "Continue research and development in the area of supreme and quantum computing information sciences to establish the memory-based network nodes, to further evolve and adapt the photon-based interconnects, and to develop an integration scheme to interface a quantum network. Continue testing the ability to teleport quantum information between network nodes, and to establish two-way quantum communication between two memory nodes. Conduct an analysis of conventional\/quantum channel interface for long-distance communication."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $6.581 million. Funding increased due to realignment of all quantum network, connectivity, and communications research from Advanced Connectivity Technologies effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future AF Capabilities Applied Research"
                                    },
                                    "Description": {
                                        "val": "Investigate, design, and develop science and technologies supporting future Air Force capabilities to provide compelling advantage to the warfighter.  To the greatest extent practical, research efforts will utilize modeling and simulation and cross-discipline systems integration (For example:  air and space vehicles, avionics, propulsion, materials, human performance, cybersecurity, command, control, communications, computer and intelligence, sensors, electronic warfare, and conventional\/unconventional weapons). \n\nThe National Defense Strategy and Air Force Science and Technology 2030 Strategy will inform investments over the FYDP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, this work is performed under multiple projects and efforts within the following Air Force Science and Technology Programs: 0602102F, Materials; 0602201F, Aerospace Vehicle Technologies; 0602202F, Human Effectiveness Applied Research; 0602203F, Aerospace Propulsion; 0602204F, Aerospace Sensors; 1206601F, Space Technology; 0602602F, Conventional Munitions; 0602605F, Directed Energy Technology; and 0602788F, Dominant Information Science and Methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.667"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.667"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate and mature science and technology that enables future warfighting concepts to provide leap-ahead capabilities.  The National Defense Strategy and Air Force Science and Technology 2030 Strategy focus this science and technology toward, but not limited to, the following capabilities: 1) global persistent awareness; 2) resilient information sharing; 3) rapid, effective decision-making; 4) complexity, unpredictability, and mass; and 5) speed and reach of disruption and lethality."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $19.667 million. Funding increased due to the realignment and consolidation of Air Force Applied Research Science and Technology funding for Future Air Force Capabilities Applied Research efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625316"
                    },
                    "ProjectTitle": {
                        "val": "Info Mgt and Computational Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.220"
                        },
                        "CurrentYear": {
                            "val": "19.589"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "29.809"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires the capability to maximize the value, sharing, management, and use of its information and information assets in achieving its mission objectives as the importance of information grows in the current net-centric environment.  Technology development in this project must be capable of taking advantage of future net-centric environments including new structured and ad hoc processes in response to rapidly changing warfare challenges.  Advances in robust information management focus on quality of service and flow of information within the enterprise, information transformation and brokering, secure information sharing across and among domains, and collaboration of workflow within the enterprise.  Technologies addressed in this project include the ability to globally share, discover, and access information across organizational, functional, and coalition boundaries and between and among domains, the timely delivery of information to tactical assets, the tailoring and prioritization of  information based on mission needs and importance, and the scaling, robustness, and collaboration features required of the Air Force net-centric information management environment.\n\nThe National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on the capability to maximize the value, sharing, management, and use of information and information assets in support of multi-domain command and control.\n\nIn FY 2020, Project 625316, Info Mgt and Computational Tech efforts will be transferred to Project 625315, C4I Dominance Technology, in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase - Quantum Computing CoE"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not Applicable"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.500"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally directed efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dissemination Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop technologies for decision quality information dissemination services via publish, subscribe, and query across the Global Information Grid to enterprise and tactical assets and coalition partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.220"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.089"
                                            },
                                            "Text": {
                                                "val": "Continue research that will enable multiple echelons of a battlefield command to adapt operations to changing situations and dynamically select from the best set of mission options. Advance the research of highly scalable mission oriented middleware that semantically characterizes and contextualizes information to automatically identify and deliver mission relevant information to consumers in federated environments. Focus research in the area of Multi-Domain Command and Control. Continue development of integrated and field tested tactical-to-enterprise information management services."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, the work is performed under the Assured Communications & Networks effort within Project 625315, C4I Dominance Technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $12.089 million. Funding decrease due to realignment of advanced network, information management, and communications research under Project 625315, C4I Dominance Technology."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625317"
                    },
                    "ProjectTitle": {
                        "val": "Information Decision Making Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "35.024"
                        },
                        "CurrentYear": {
                            "val": "16.719"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "51.743"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires advances in technologies enabling the effective execution of military objectives that will vastly improve the ability to support the commander and staff's ability to command all viable options to achieve desired effects across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict.  Technology development in this project includes anticipatory decision support; course of action development, planning, scheduling, and assessment; and the real-time effective portrayal of complex data sets.\n\nThe National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on the capability to maximize the value, sharing, management, and use of information and information assets in support of multi-domain command and control.\n\nIn FY 2020, Project 625317, Information Decision Making Tech efforts will be transferred to Project 625315, C4I Dominance Technology, in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program increase Line 13A"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.930"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally directed efforts."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not Applicable"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase Line 13B"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.465"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally directed efforts."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not Applicable"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Campaign Planning Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced monitoring, planning, and assessment technologies enabling aerospace commanders to develop effects-based campaigns."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.268"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.888"
                                            },
                                            "Text": {
                                                "val": "Continue to research combat planning and tactical assessment software services and increase applied research in the area of multi-domain command and control for campaign planning and battlefield management. Continue research for identifying and implementing state-of-the-art learning models. Develop algorithms for data-efficient learning and integrate with a machine learning framework. Develop algorithms that will dynamically adapt to varying situations based on situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, the work is performed under the Artificial Intelligence\/Autonomy\/Machine Learning effort, Project 625315 C4I Dominance Technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $9.888 million. Funding decreased due to realignment of advanced monitoring, planning, and assessment research under Project 625315, C4I Dominance Technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control System Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate, analyze, and develop technologies for planning, execution, and automatic rapid reconfiguration of distributed intelligent and integrated command and control information systems to achieve the commander's intent throughout varying crisis levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.361"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.831"
                                            },
                                            "Text": {
                                                "val": "Leverage prior efforts in developing plan assessment services and conduct quantitative evaluations of cyber assets to cyber operators, enabling them to present viable cyber options to commanders for multi-domain (air, space, cyberspace, land, sea, undersea) integrated plans. Initiate research and development of command and control system technologies in the area of multi-domain command and control. Initiate research for applying machine learning techniques to enhance and optimize space operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, the work is performed under the Multi-Domain Command and Control effort Project 625315, C4I Dominance Technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $6.831 million. Funding decreased due to realignment of all distributed, intelligent, and integrated command and control information system research under Project 625315, C4I Dominance Technology."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625318"
                    },
                    "ProjectTitle": {
                        "val": "Operational Awareness Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.214"
                        },
                        "CurrentYear": {
                            "val": "22.338"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "49.552"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that improve and automate the capability to generate, process, manage, fuse, exploit, interpret, and disseminate timely and accurate information.  This project provides not only a network-centric, collaborative intelligence analysis capability that enables the fusion of multi-intelligence and sensor sources to provide timely situational awareness, understanding, and anticipation of the threats in the battlespace, but also the advanced, novel exploitation technologies needed to intercept, collect, locate, and process both covert and overt raw data from intelligence and sensor sources.  It leads the research, discovery, and development of technology that enables the fusion of multi-intelligence sources to provide accurate object tracking and identification, situational awareness, understanding, and anticipation of the threats in the battlespace (air, ground, space, and cyber).  It also leads in the development of advanced exploitation technologies to maximize the intelligence gained from our adversaries in the areas of spectral detection and geolocation, signal recognition and analysis, and the data tagging, tracking, and tracing via the insertion of secure, imperceptible signal embedding for future fusion and understanding of the information.\n\nThe National Defense Strategy and Air Force Future Operating Concept established science and technology challenges to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action. In order to enable multi-domain operations, the Air Force requires dynamic and elastic intelligence, surveillance, and reconnaissance forces and capabilities to provide actionable intelligence to commanders and to increase understanding of the environment and an adversary's capabilities and intentions.\n\nIn FY 2020, Project 625318, Operational Awareness Tech efforts will be transferred to Project 625315, C4I Dominance Technology, in order to realign technology areas that better support the National Defense Strategy and Air Force Future Operating Concept."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program increase - quantum computing"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.917"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally directed efforts."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not Applicable"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Source Fusion Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop higher-level fusion and the enabling text information\/knowledge base technologies to achieve situational awareness and understanding at all command levels for dynamic planning, assessment, and execution processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.782"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.117"
                                            },
                                            "Text": {
                                                "val": "Continue the research and development of data analytics and strategic indications and warnings technologies (including large data alignment, indexing and search on textual data, large-scale and disparate data sources, both structured and unstructured data, and employment of various ontologies and machine learning techniques). Advance research and development for cloud-based data and information sharing environment for optimized processing and automated association capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, the work is performed under the Data to Decisions effort Project 625315, C4I Dominance Technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $10.117 million. Funding decreased due to realignment of advanced network-centric multi-source fusion, tracking and identification, situational awareness, analysis and understanding, threat anticipation, spectral detection and geolocation, signal recognition and analysis, and associated data tagging, tracking, and tracing research under Project 625315, C4I Dominance Technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop digital information exploitation technologies for electronic communications and special signals intelligence, imagery, and measurement signatures to increase accuracy, correlation, and timeliness of the information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.269"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.970"
                                            },
                                            "Text": {
                                                "val": "Focus signals intelligence characterization on audio and other electronic signals. Initiate research and development in exploitation technologies using audio processing for language modeling and deep learning techniques. Continue research on enhanced emitter feature extraction capabilities and development of automated electronics intelligence analysis toolsets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, the work is performed under the Data to Decisions effort Project 625315, C4I Dominance Technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $10.970 million. Funding decreased due to realignment of advanced network-centric multi-source fusion, tracking and identification, situational awareness, analysis and understanding, threat anticipation, spectral detection and geolocation, signal recognition and analysis, and associated data tagging, tracking, and tracing research under Project 625315, C4I Dominance Technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Command Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop modeling and simulation technologies for the next generation of planning, assessment, and execution environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.246"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.251"
                                            },
                                            "Text": {
                                                "val": "Continue research and development of capabilities to support situational awareness. Conduct extended user evaluations at designated operational sites to advance applied research for full spectrum targeting semantic capabilities and provide a cross-organization workflow."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2020, the work will be performed under the Multi-Domain Command & Control effort Project 625315, C4I Dominance Technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $1.251 million. Funding decreased due to realignment of advanced network-centric tracking and identification, situational awareness, analysis and understanding, and threat anticipation research under Project 625315, C4I Dominance Technology."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625319"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Dominance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "55.011"
                        },
                        "CurrentYear": {
                            "val": "73.242"
                        },
                        "BudgetYearOne": {
                            "val": "60.281"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.281"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "62.084"
                        },
                        "BudgetYearThree": {
                            "val": "63.351"
                        },
                        "BudgetYearFour": {
                            "val": "65.603"
                        },
                        "BudgetYearFive": {
                            "val": "66.969"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies to deliver a full range of options in cyberspace on par with air and space dominance in each of the areas of cyber-attack, cyber defense, and cyber support to achieve the strategic capability of cyber dominance. The Air Force requires the development of superior, intelligent, on-demand computing to enable information superiority to include advances in secure information sharing across domains and boundaries as well as technologies that successfully deter any adversary from attacking computer systems anytime, anywhere by ensuring the Air Force's ability to: access, maintain presence on, and deliver effects to adversary systems; detect, defend, and respond to attacks on friendly computer systems and provide forensic analysis concerning those attack attempts; and provide cyber situational awareness to Air Force Commanders. In addition, the Air Force requires technology development that produces computing architectures with greater capacity and sophistication for addressing constrained, dynamic mission objectives; \"game-changing” computing power to the warfighter, disruptive computing power at the tactical edge and for federated grid services; and interactive and real-time computing improving the usability of high-performance computing to the Air Force. It includes technologies in computational sciences and engineering, computer architectures and software intensive systems."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase - Cyber Testbed for Unidentified C-UAS"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not Applicable"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.500"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally directed efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase Line 13A"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "Not Applicable"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally directed efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Defense Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop cyber defense and supporting technologies to detect, defend, and respond to attacks on computer systems as well as provide forensic concerning attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.060"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.768"
                                            },
                                            "Text": {
                                                "val": "Continue research in the area of autonomous integrated cyber operations. Initiate applied research in the area of biologically resilient cyber technologies, mission-specific blockchain capabilities, and the alignment of cyber resilient services and dynamic management tailored towards unmanned aerial systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.531"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.531"
                                            },
                                            "Text": {
                                                "val": "Continue research in the area of autonomous integrated cyber operations. Continue applied research in the area of biologically resilient cyber technologies. Continue research into mission-specific block-chain capabilities, and the alignment of cyber resilient services and dynamic management tailored towards unmanned aerial systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $1.763 million. Funding increased due to added emphasis on blockchain research as a method to secure cyber transactions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Offense Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop offensive cyber operations technologies to access, maintain presence on, and deliver effects to adversary systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.079"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.751"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct research and development of new, leading-edge technologies that are game changing and employ dominant power for cyber offensive operations. Increase activity in capabilities for multi-function, non-kinetic cyber effects against adversarial systems. Demonstrate ground-based and airborne delivery of disrupt, deny, degrade, destroy, or deceive effects that are both cyber and physical\/kinetic."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.037"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.037"
                                            },
                                            "Text": {
                                                "val": "Advance research and development of new, leading-edge technologies that are game changing and employ dominant power for cyber offensive operations. Continue increased activity in capabilities for multi-function, non-kinetic cyber effects against adversarial systems. Continue to demonstrate ground-based and airborne delivery of disrupt, deny, degrade, destroy, or deceive effects that are both cyber and physical\/kinetic."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $6.286 million. Funding increased due to an emphasis on disruption, denial, degradation, destruction, and deception through airborne cyber effects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Architectural Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop the architectural mechanisms that form the basis for predictable software and high assurance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.165"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.105"
                                            },
                                            "Text": {
                                                "val": "Continue research and validation of a cyber hardened (robust, secure) processor for embedded weapon systems. Continue applied research to create trusted and resilient embedded systems that are capable of identifying, localizing, and automatically repairing previously unknown and\/or unintended vulnerabilities. Continue research and development of the neuromorphic processor and validate capabilities for dynamic learning on mobile and power-constrained platforms. Initiate development of software using evolutionary approaches to make embedded systems tolerant to unexpected and unforeseen situations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.689"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.689"
                                            },
                                            "Text": {
                                                "val": "Sustain research and validation of a cyber hardened (robust, secure) processor for embedded weapon systems. Maintain applied research to create trusted and resilient embedded systems that are capable of identifying, localizing, and automatically repairing previously unknown and\/or unintended vulnerabilities. Continue development of software using evolutionary approaches to make embedded systems tolerant to unexpected and unforeseen situations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $2.416 million. Funding decreased due to realignment of all neuromorphic processing research under this Project within effort, Processing Technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Processing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop automatic and dynamically reconfigurable, scalable, affordable distributed peta-flop processing technologies for real-time global information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.938"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.938"
                                            },
                                            "Text": {
                                                "val": "Continue to research the application of novel neuromorphic systems for robust machine learning. Continue research and development in the area of supreme and quantum computing information sciences to establish the memory-based network nodes, to further evolve and adapt the photon-based interconnects, and to develop an integration scheme to interface a quantum network. Test the ability to teleport quantum information between network nodes, and to establish two-way quantum communication between two memory nodes. Conduct an analysis of conventional\/quantum channel interface for long-distance communication."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.715"
                                            },
                                            "Text": {
                                                "val": "Extend research the application of novel neuromorphic systems for robust machine learning. Advance research and development of the neuromorphic processor and validate capabilities for dynamic learning on mobile and power-constrained platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $4.223 million. Funding decreased due to realignment of all quantum information science research under Project 625315, C4I Dominance Technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop methods and technologies for controlled operation of information systems during attacks and fault conditions, minimizing vulnerabilities of cyber attacks, and guaranteeing the accuracy and correctness of data and codes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.599"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.072"
                                            },
                                            "Text": {
                                                "val": "Continue to research concepts and capabilities for cyber survivability techniques and algorithms for counter-unmanned aerial systems. Design and develop a counter-unmanned aerial systems open architecture to enable interoperability. Continue to evolve autonomous machine learning functions. Validate and demonstrate automated workflows into defensive cyber operations systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.011"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.011"
                                            },
                                            "Text": {
                                                "val": "Maintain research concepts and capabilities for cyber survivability techniques and algorithms for counter-unmanned aerial systems. Sustain development of a counter-unmanned aerial systems open architecture to enable interoperability. Extend evolution of autonomous machine learning functions. Pursue validation and demonstration of automated workflows into defensive cyber operations systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.939 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross-Domain Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop secure cross-domain discovery services for access to services outside the existing domain. Develop the tools to allow collaboration of workflows required by the Air Force net-centric information management system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.663"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.462"
                                            },
                                            "Text": {
                                                "val": "Continue research and development in cross-domain solution technologies by developing content filtering, with an emphasis on improving support for rapid inclusion of new data types with minimal requirements for lengthy data type threat assessments and minimal custom coding.  Continue research and development for machine to machine interfaces.  Develop cross-domain solution command and control capabilities to manage cross-domain solution risk based upon changes in mission and threat."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.944"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.944"
                                            },
                                            "Text": {
                                                "val": "Advance research and development in for cross-domain solution technologies by developing content filtering, with an emphasis on improving support for rapid inclusion of new data types with minimal requirements for lengthy data type threat assessments and minimal custom coding.  Sustain research and development for machine to machine interfaces.  Extend development of cross-domain solution command and control capabilities to manage cross-domain solution risks based upon changes in mission and threat for diversified platforms via hardware abstraction, containerization\/separation of the operation system (mobile, desktop, server)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.518 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Technologies for Spectrum Warfare"
                                    },
                                    "Description": {
                                        "val": "Develop technologies combining electronic warfare, signals intelligence, communications, and cyber technologies that provide synergistic access, exploitation and effects across air and cyber domains in congested and contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.507"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.646"
                                            },
                                            "Text": {
                                                "val": "Continue development of active and passive methods to locate, acquire, and process data and signals of interest. Advance research in systems to perform blind data discovery associated with the Internet of Things. Identify items of interest associated with the Internet of Things."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.354"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.354"
                                            },
                                            "Text": {
                                                "val": "Continue to advance research in systems to perform blind data discovery associated with the Internet of Things. Pursue identification of items of interest associated with the Internet of Things. Initiate research for specific items of interest within the Internet of Things."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.708 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62OMMS"
                    },
                    "ProjectTitle": {
                        "val": "Research Site Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.041"
                        },
                        "CurrentYear": {
                            "val": "21.050"
                        },
                        "BudgetYearOne": {
                            "val": "21.426"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.426"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.986"
                        },
                        "BudgetYearThree": {
                            "val": "22.403"
                        },
                        "BudgetYearFour": {
                            "val": "22.535"
                        },
                        "BudgetYearFive": {
                            "val": "23.011"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force Research Laboratory Information Directorate leads the discovery, development and implementation of information science and technology to drive transformation within the Air Force and across the Department of Defense. The focus of the work is to provide the warfighter with the required technology-based capabilities to defend the Nation by unleashing the power of innovative information science and technology to anticipate, find, fix, track, target, engage, and assess anything, anytime, anywhere. Since the site is a single-purpose location which is not located on a military installation, the Information Directorate has unique requirements for supporting its science and technology mission.  As the host unit, the directorate is responsible to provide the Rome Research Site infrastructure at Rome, New York and provide for the continued operations of all Rome Research Site properties, buildings, and services necessary for the research mission.  Operations include: logistics and communication services, utilities, maintenance of facilities and structures, safety and security of the workforce and visiting researchers, and ensures compliance with the laws, regulations, and directives that pertain to site operations.  These services are host unit responsibilities and are necessary to provide a safe and effective environment for the Research Site's workforce and mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rome Research Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Provide the necessary services and support including, but not limited to: fire inspections, refuse collection, water, electricity, steam, heat, custodial, and grounds maintenance services to the Research Site. Provide the necessary support for the maintenance and repair of Research Site facilities (buildings and other structures), vehicle and equipment lease and security\/safety inspections and services as necessary for compliance and safety\/security of personnel and research assets.  Provide the Research Site with long haul communications (using the Government Services Administration set of Networx contracts for Continental United States), trunk connectivity and wireless communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.041"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.050"
                                            },
                                            "Text": {
                                                "val": "Continue to provide civilian payroll and non-pay costs for installation operations in support of the Rome Research Site property and all onsite personnel. Continue to provide facilities, facility operations, facility sustainment, support equipment, contracts, and associated costs to plan, manage and execute the following functions: fire prevention, disaster preparedness, plant operation and purchase of commodity, refuse collection, pavement clearance of snow and ice, grounds maintenance including landscaping, real property special inspections, pest control, and custodial services. Continue to provide Real Property Management and Engineering Services, including: (1) Facility Management and Administration and (2) Installation Engineering Services. Facility Management includes public works management costs, contract management, material procurement, facility data management, furnishings management costs, and real estate management. Installation Engineering Services includes annual inspection of facilities, master planning, overhead of planning and design, overhead of construction management, and non Site Recovery Management service calls. Continue to provide basic installation communication services, including long haul trunk and telecommunications services. Continue to provide site vehicle lease under the Government Services Administration for logistics, security, and mission support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.426"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.426"
                                            },
                                            "Text": {
                                                "val": "Continue to provide civilian payroll and non-pay costs for installation operations in support of the Rome Research Site property and all onsite personnel. Continue to provide facilities, facility operations, facility sustainment, support equipment, contracts, and associated costs to plan, manage and execute the following functions: fire prevention, disaster preparedness, plant operation and purchase of commodity, refuse collection, pavement clearance of snow and ice, grounds maintenance including landscaping, real property special inspections, pest control, and custodial services. Continue to provide Real Property Management and Engineering Services, including: (1) Facility Management and Administration and (2) Installation Engineering Services. Facility Management includes public works management costs, contract management, material procurement, facility data management, furnishings management costs, and real estate management. Installation Engineering Services includes annual inspection of facilities, master planning, overhead of planning and design, overhead of construction management, and non Site Recovery Management service calls. Continue to provide basic installation communication services, including long haul trunk and telecommunications services. Continue to provide site vehicle lease for logistics, security, and mission support under the Government Services Administration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.376 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}