{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-67",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605104D8Z"
        },
        "ProgramElementTitle": {
            "val": "Technical Studies Support and Analysis"
        },
        "R1LineNumber": {
            "val": "149"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "153.308"
            },
            "PriorYear": {
                "val": "21.575"
            },
            "CurrentYear": {
                "val": "22.525"
            },
            "BudgetYearOne": {
                "val": "18.079"
            },
            "BudgetYearOneBase": {
                "val": "18.079"
            },
            "BudgetYearTwo": {
                "val": "18.255"
            },
            "BudgetYearThree": {
                "val": "18.666"
            },
            "BudgetYearFour": {
                "val": "19.002"
            },
            "BudgetYearFive": {
                "val": "19.003"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program is a key source of funding for the Office of the Secretary of Defense and the Joint Staff to manage studies, analyses, strategic planning, and technical support efforts to improve and support policy development, decision making, management and administration of DoD programs and activities. Studies and analyses are predominantly performed by independent sources outside of the government such as universities, Federally Funded Research and Development Centers, and other private not-for-profit sources.  Research requirements will examine current and alternative policies, plans, operations, strategies and budgets, providing essential means for managing and responding to the shifting and complex international, political, technological, economic, military, and acquisition environments in which national security planning decisions are made.  Independent analyses from subject matter experts are instrumental for senior defense planners in making informed choices regarding requirements for force planning and strategic deployment of assets taking into account technological challenges and resource constraints, and there is a strong need to incorporate the findings of operational analysis in force planning requirements and projections. With the complexities of emerging advanced security threats in the current geopolitical environment, the need for objective analysis and forward looking planning to inform senior leadership for the mid and long-term is vital to remaining strategically competitive."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.386"
                },
                "CurrentYear": {
                    "val": "22.576"
                },
                "BudgetYearOne": {
                    "val": "18.757"
                },
                "BudgetYearOneBase": {
                    "val": "18.757"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.575"
                },
                "CurrentYear": {
                    "val": "22.525"
                },
                "BudgetYearOne": {
                    "val": "18.079"
                },
                "BudgetYearOneBase": {
                    "val": "18.079"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.811"
                },
                "CurrentYear": {
                    "val": "-0.051"
                },
                "BudgetYearOne": {
                    "val": "-0.678"
                },
                "BudgetYearOneBase": {
                    "val": "-0.678"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.768"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.043"
                                },
                                "CurrentYear": {
                                    "val": "-0.051"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Budget Realignment to Chemical Biological Defense Program"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.678"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.678"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Reductions are reflected for general program reductions and realignments.  \nAs part of the Department of Defense reform agenda, the budget estimate reflects a stable trend in the number and cost of reports and studies in the near-term."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "421"
                    },
                    "ProjectTitle": {
                        "val": "Technical Studies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "153.308"
                        },
                        "PriorYear": {
                            "val": "21.575"
                        },
                        "CurrentYear": {
                            "val": "22.525"
                        },
                        "BudgetYearOne": {
                            "val": "18.079"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.079"
                        },
                        "BudgetYearTwo": {
                            "val": "18.255"
                        },
                        "BudgetYearThree": {
                            "val": "18.666"
                        },
                        "BudgetYearFour": {
                            "val": "19.002"
                        },
                        "BudgetYearFive": {
                            "val": "19.003"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program is a key source of funding for the Office of the Secretary of Defense (OSD) and the Joint Staff to manage studies, analyses, strategic planning, and technical support efforts to improve and support policy development, decision making, management and administration of DoD programs and activities. Studies and analyses are predominantly performed by independent sources outside of the government such as universities, Federally Funded Research and Development Centers, and other private not-for-profit sources.  Research requirements will examine current and alternative policies, plans, operations, strategies and budgets, providing essential means for managing and responding to the shifting and complex international, political, technological, economic, military, and acquisition environments in which national security planning decisions are made.  Independent analyses from subject matter experts are instrumental for senior defense planners in making informed choices regarding requirements for force planning and strategic deployment of assets taking into account technological challenges and resource constraints, and there is a strong need to incorporate the findings of operational analysis in force planning requirements and projections. With the complexities of advanced emerging security threats in the current geopolitical environment, the need for objective analysis and forward looking planning to inform senior leadership for the mid and long-term is vital to remaining strategically competitive."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technical Studies and Analyses Support for the Office of the Secretary of Defense (OSD)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.575"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition, Technology & Logistics) and USD(Acquisition and Sustainment):\nStudies and analyses of:\n\nTechnical areas regarding joint warfighting capability and technology planning, strategic and conventional system requirements, semiconductor supply chain assurance, operational mission integration management capabilities, critical munitions requirements, networked sensor architecture planning, counter WMD defense capabilities, strategic defense architectures, industrial base capabilities assessments, cyber capabilities, defense manufacturing technology, effects of defense industry consolidation, methods to facilitate innovative emerging commercial technological solutions, acquisition policy effectiveness, technologies for evolving mission requirements, allied defense capabilities, strategic basing requirements, DoD installations planning, logistics supply chain and energy requirements, NATO policy planning, identifying acquisition program risk, support to Defense Science Board task forces on various evolving technological and warfare issues, and advanced electronic warfare countermeasures. \n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nRequirements regarding investment and resource planning such as emerging strategic and tactical systems requirements, strategic mobility, maintaining force readiness, personnel force models, assessments in support of scenario analyses, special operations and force support requirements, technical studies and analyses to support independent cost estimates and economic research, comparative analyses of alternative strategic and conventional weapons systems configurations and force levels, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program and supporting development of the Future Years Defense Program. \n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRequirements regarding national security geopolitical posture and policies such as regional and strategic defense strategy, international defense policy planning, strategic force requirements, homeland defense and humanitarian response capabilities, deterrence and counterproliferation requirements, international defense trade and industrial relationships, NATO requirements planning, technological and other external effects on strategic requirements, space and cyber strategic guidance planning, contingency and stability operations, countering emerging terrorist and transnational criminal threats, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers.\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nRequirements regarding sustainment and planning for the force of the future such as active and reserve recruiting and retention issues, medical force infrastructure, compensation analyses, identifying critical personnel requirements, reserve component readiness and sustainability, military family and educational issues, gender and equal opportunity, and strategies for managing the Total Force portfolio.\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nJoint Studies and analyses with OSD based upon contingency planning, cyber force planning, command and control, mobility and supply chain requirements, joint training requirements, force programming planning, and basing requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.525"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition and Sustainment):\nStudies and analyses of:\n\nElectromagnetic spectrum battle management, technological capabilities requirements planning, nuclear forensics capabilities, countering short-range missile threats, munitions portfolio requirements, strategic communications capabilities, strategic materials industrial infrastructure, space systems requirements, macroeconomic impacts on the defense industrial base, defense manufacturing requirements, cyber assurance, supply chain risk management, global defense industry developments, international armaments cooperation, strategic basing requirements, acquisition data management capabilities, DoD installations planning, and improving integration of the acquisition process with operational needs.\n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nVarious analytic requirements for promoting an effective force with increased lethality such as developing plans for force modernization, sustainment of the nuclear stockpile and strategic forces, modernization of nuclear infrastructure, force projection capabilities, strategic cyber defense, maintaining full spectrum conventional and unconventional capabilities, capability planning resulting from scenario analyses, technical studies and analyses to support independent cost estimates and economic research, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program and supporting development of the Future Years Defense Program. \n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRequirements regarding national security geopolitical posture and policies such as regional defense strategies, defense against biological warfare and pandemics, strengthening regional defense partnerships and alliances, strategic defense policy, detection and defense against weapons of mass destruction, counter proliferation policy, global health security capabilities, eliminating terrorist safe havens and transnational terrorist organizations, space and cyber strategic guidance planning, strategic implications of global energy trends, homeland defense capabilities, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers.\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nStrengthening close combat capabilities, sustainment and planning for the force of the future such as active and reserve recruiting and retention issues, training requirements, maintaining strategic readiness, compensation and quality of life matters and retention, identifying critical personnel requirements, reserve component readiness and sustainability, health and medical issues, crisis and contingency readiness, diversity management and equal opportunity, and strategies for managing the Total Force portfolio.\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nJoint Studies and analyses with OSD based upon operations research, intelligence capabilities, command and control requirements, mobility capabilities, supply chain and support requirements, joint testing and training requirements, civil support capabilities, force programming planning, and basing requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.079"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition and Sustainment):\nStudies and analyses of:\n\nReadiness of major weapons systems, industrial base assurance for critical munitions, strategic platform capabilities, software development and sustainment capabilities, countering weapons of mass destruction, autonomous systems, space systems requirements, advanced manufacturing requirements, electronic warfare capabilities, global defense industry developments, strategic basing requirements, strengthening allied defense capabilities, DoD installations planning, supply chain and energy resiliency, and small business technology investment and acquisition strategy.\n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nVarious analytic requirements for maintaining a balanced portfolio of defense capabilities through investment and resource planning such as emerging strategic and tactical systems requirements, developing innovative operational concepts, joint lethality in contested environments, mobility and logistical support capabilities, maintaining force readiness and personnel planning requirements, capability planning resulting from scenario analyses, contingency and conventional force requirements, technical studies and analyses to support independent cost estimates and economic research, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program and supporting development of the Future Years Defense Program. \n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRequirements regarding national security geopolitical posture and policies such as regional and strategic defense strategy, countering weapons of mass destruction, global strategic affairs, defense capabilities continuity, countering coercion and subversion, homeland defense support of civil authorities, planning, technological and other external effects on strategic requirements, space and cyber strategic guidance planning, protection of defense critical infrastructure, contingency and stability operations, nuclear planning, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers.\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nRebuilding readiness, sustainment and planning for the force of the future such as active and reserve recruiting and retention issues, training requirements, maintaining strategic force depth, compensation and quality of life matters and retention, identifying critical personnel requirements, reserve component readiness and sustainability, health and medical issues, crisis and contingency readiness, diversity management and equal opportunity, and strategies for managing the Total Force portfolio.\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nJoint Studies and analyses with OSD based upon operations research, cyber capabilities, command and control requirements, dynamic force employment, logistical resilience, joint testing and training requirements, homeland defense, force programming planning, and adaptive basing capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease reflects general program changes and changes in requirements due to OSD reorganization.   FY 2019 plans reflect the transition of certain functions from the USD(Acquisition, Technology and Logistics) to the USD(Acquisition and Sustainment) and transfer of support for the Defense Science Board to the Under Secretary of Defense (Research and Engineering)."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "FY 2020 BA: $18.079 FY 2020 BA Assoc w\/Metrics: $18.079 Percent FY 2020 BA Assoc w\/Metrics: 100%\n\nThis program supports approximately seventy-five studies per fiscal year performed by a variety of commercial, non-profit, and government research sources.   Research supports a wide variety of national security goals of the Department and is designed to encourage a collaborative research approach among the components of OSD and the Joint Staff.  The research and study projects supported by this program are closely integrated with the strategic goals of the Department of Defense.  The focus of studies varies across a wide spectrum including weapons systems cost analysis, strengthening and leveraging alliances, human resource and military personnel management, examination of innovative technologies, application of technology to operational doctrine, and many other issues of emerging importance.  Most of the actions are long to intermediate-range in outlook, and the program allows organizational leaders to plan and guide their research toward meeting their highest-priority goals and other high-level guidance such as executive branch performance management objectives and the National Defense Strategy of the United States of America.\n\nIn following the program efficiencies guidance of the Secretary of Defense, the scope of studies and analyses has been limited as necessary in order to focus upon issues of the highest strategic importance and needs to the Department of Defense while sustaining efforts to support requirements for the Office of the Secretary of Defense developing from legislative direction."
                        }
                    }
                }
            ]
        }
    }
}