{
    "id": "2020-Army-PB-2040-JBOOK-c3dfc4efbfac46da70170659364c6c2d720e705db77d6ab495afa846698c0b96-28",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA5C-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605766A"
        },
        "ProgramElementTitle": {
            "val": "National Capabilities Integration (MIP)"
        },
        "R1LineNumber": {
            "val": "168"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.382"
            },
            "CurrentYear": {
                "val": "12.34"
            },
            "BudgetYearOne": {
                "val": "7.835"
            },
            "BudgetYearOneBase": {
                "val": "7.835"
            },
            "BudgetYearTwo": {
                "val": "7.677"
            },
            "BudgetYearThree": {
                "val": "11.682"
            },
            "BudgetYearFour": {
                "val": "11.054"
            },
            "BudgetYearFive": {
                "val": "11.299"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "71.269"
            }
        },
        "ProgramElementNote": {
            "val": "PE 0605766A 'National Capabilities Integration (MIP)' funds two separate efforts in two separate Projects:\n(1) Project DX9 'National Integration To Tactical Systems (MIP)' provides system development research and development funds for integration of multiple projects development by Army TENCAP into enduring Programs of Record \n(2) Project EX7 'Air Vigilance System Development' provides system development research and development funds to the Army's 'Air Vigilance' ACAT III Automated Information System (AIS) Program of Record (POR)\n\nAll funding is in support of the ACTIVE COMPONENT"
        },
        "ProgramElementMissionDescription": {
            "val": "National Integration to Tactical Systems provides centralized monitoring and synchronization by the Army's Tactical Exploitation of National Capabilities (TENCAP) office, for the transition and integration of proven advanced technologies, prototypes and standards developed by the National Intelligence Community (IC) into Army systems and Programs of Record. This Program Element includes System Development and Integration funds for the Air Vigilance Program of Record (POR).  It also enables efficient use and oversight of system development funds for final stage integration, development, and testing of successful technologies and prototypes to advance, or make compliant, Army systems and Programs of Record that have or use National capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.882"
                },
                "CurrentYear": {
                    "val": "12.34"
                },
                "BudgetYearOne": {
                    "val": "11.435"
                },
                "BudgetYearOneBase": {
                    "val": "11.435"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.382"
                },
                "CurrentYear": {
                    "val": "12.34"
                },
                "BudgetYearOne": {
                    "val": "7.835"
                },
                "BudgetYearOneBase": {
                    "val": "7.835"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.5"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-3.6"
                },
                "BudgetYearOneBase": {
                    "val": "-3.6"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "2.5"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.6"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.6"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020 funding adjustment is in support of the Army's modernization priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DX9"
                    },
                    "ProjectTitle": {
                        "val": "National Integration To Tactical Systems(MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.32"
                        },
                        "CurrentYear": {
                            "val": "9.06"
                        },
                        "BudgetYearOne": {
                            "val": "4.49"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.49"
                        },
                        "BudgetYearTwo": {
                            "val": "4.223"
                        },
                        "BudgetYearThree": {
                            "val": "5.183"
                        },
                        "BudgetYearFour": {
                            "val": "4.425"
                        },
                        "BudgetYearFive": {
                            "val": "4.537"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "37.238"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "All funding is in support of the ACTIVE COMPONENT\nProject DX9 'National Capabilities Integration (MIP)' was previously funded"
                        },
                        "ProjectMissionDescription": {
                            "val": "National Integration to Tactical Systems provides for centralized monitoring and synchronization by the Army's Tactical Exploitation of National Capabilities (TENCAP) office for the transition and integration of new, updated, and emerging National Intelligence Community (IC) technologies, capabilities, and standards into Programs of Record across the Army to: (1) maintain operational relevance of Army programs and address changes in technology and the threat, (2) ensure Army programs maintain interoperability with and access to the National community architecture and systems, and (3) advance Army ability to conduct analysis and tasking, collection, processing, exploitation, dissemination and feedback (TCPEDF) of intelligence data.\n\nFY 2020 Base funding in the amount of $4.490 million provides integration funds for two (2) validated National Intel Community (IC) efforts:  (1) Army TNG Integration, $3.088 million funds the continued efforts to ensure Army Programs of Record are in compliance to the National standard for Airborne Overhead Cooperative Operations\/Theater Net-Centric Geolocation (AOCO\/TNG), per the Joint Requirement (JROCM 101-10); (2) TENCAP Radio Frequency Exploitation (TRFE), $1.402 million funds the system development and integration efforts on the prototype kit."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army TNG Integration - Airborne Overhead Cooperative Operations (AOCO) \/ Theater Net-Centric Geolocation (TNG)"
                                    },
                                    "Description": {
                                        "val": "National Intelligence Community (IC) standard for interoperability and use of specific intelligence networked capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.82"
                                            },
                                            "Text": {
                                                "val": "Provided funds to specified Army Programs of Record (PORs) for final-stage software development and integration efforts, ensuring their compliance to the National requirement and standards that enables these PORs to be interoperable within this National Intelligence Community (IC) \"Theater Net-Centric Geolocation (TNG)\" network for joint tactical use and improved Army battlefield awareness. (ref. CJCSI 32450.61, AOCO 13Jan2012)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.024"
                                            },
                                            "Text": {
                                                "val": "Provide funds to specified Army Programs of Record (PORs) for final-stage software development and integration efforts, ensuring their compliance to the National requirement and standards that enables these PORs to be interoperable within this National Intelligence Community (IC) \"Theater Net-Centric Geolocation (TNG)\" network for joint tactical use and improved Army battlefield awareness. (ref. CJCSI 32450.61, AOCO 13Jan2012)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.088"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.088"
                                            },
                                            "Text": {
                                                "val": "Continue to provide funds to specified Army Programs of Record (PORs) for final-stage software development and integration efforts, ensuring their compliance to the National requirement and standards that enables these PORs to be interoperable within this National Intelligence Community (IC) \"Theater Net-Centric Geolocation (TNG)\" network for joint tactical use and improved Army battlefield awareness. (ref. CJCSI 32450.61, AOCO 13Jan2012)"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase to support additional quantity of Army sensors to be made compliant to TNG standards and interoperable."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AMDAS-Next"
                                    },
                                    "Description": {
                                        "val": "System development and integration of the prototype Advanced Miniaturized Data Acquisition System 'AMDAS - Next', the subsystem that provides national data to the tactical warfighter via intelligence community partners classified national systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.5"
                                            },
                                            "Text": {
                                                "val": "Provide for the initial system integration and interoperability testing of the prototype subsystem AMDAS - Next as part of the Army's common intel architecture and operations, and as sensor-data ingest for Army Distributed Common Ground System (DCGS-A) program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Fiscal Year (FY) 2020 funding adjustment to support the Army's modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TENCAP Radio Frequency Exploitation (TRFE)"
                                    },
                                    "Description": {
                                        "val": "New prototype capability kit that targets modern digital communications systems employed by near-peer nation states armies and assist with Battlespace RF Characterization for modern communication environments with the intent to synchronize SIGINT, Cyber and Electronic Warfare operations. Utilizes commercial industry components and architectures to minimize hardware costs, risk and maximizes scalability\/modularity."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.536"
                                            },
                                            "Text": {
                                                "val": "Initial integration of TRFE cognitive software based Electronic Warfare and Cyber Attack prototype capability focused on countering Peer State and modern communication targets and threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.402"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.402"
                                            },
                                            "Text": {
                                                "val": "Continue integration of TRFE cognitive, software-based, SIGINT-Enabled, Electronic-Warfare-and-Cyber-Attack prototype capability focused on countering Peer-State and modern communication targets and threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Aligns funds for system development and integration of TENCAP Radio Frequency Exploitation (TRFE) efforts ready for transition."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Remote Ground Terminal (RGT)"
                                    },
                                    "Description": {
                                        "val": "Remote Ground Terminal (RGT) is a tactical ground station that downlinks commercial satellite imagery and processes it into NSG standard formats utilizing a common processor Direct Downlink. RGT is scalable, additional sensors can be added without increasing the tactical footprint."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.5"
                                            },
                                            "Text": {
                                                "val": "FY 2018 funds provided as an unfunded requirement for further development and integration of the Remote Ground Terminal (RGT)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603766A"
                                    },
                                    "Title": {
                                        "val": "Tactical Electronic Surveillance System - Adv Dev"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.733"
                                        },
                                        "CurrentYear": {
                                            "val": "35.667"
                                        },
                                        "BudgetYearOne": {
                                            "val": "34.89"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "34.89"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "26.257"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.299"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.285"
                                        },
                                        "BudgetYearFive": {
                                            "val": "33.987"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "219.118"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The 'National Integration To Tactical Systems (Military Intelligence Program - MIP)' funds provide for transition and integration of National Intelligence Community (IC) advanced technologies and prototypes leveraged by the Army's Tactical Exploitation of National Capabilities (TENCAP) program office. The Army TENCAP acquisition strategy is driven by an annual TENCAP General Officer Steering Group (TGOSG), co-chaired by the Army G2; Army G8; and the Military Deputy to the Assistant Secretary of the Army for Acquisition, Logistics, and Technology [ASA(ALT)]; and includes representatives from the Army G3; Army G6; Army Training and Doctrine Command (TRADOC); and the Program Executive Office for Intelligence, Electronic Warfare and Sensors (PEO IEW&S).  The TGOSG reviews, validates, prioritizes, and guides Army TENCAP efforts, according to Army and Defense strategy. Based on this TGOSG guidance, Army TENCAP invests BA 6.4 RDTE in Intelligence Community (IC) developments during the more cost-effective advanced development phase to ensure Army requirements are met with minimal redundancy with Army investments. Army TENCAP then uses BA 6.5 RDTE to manage the transition of these advanced development efforts through system development and integration into Army Programs of Record (POR).  This strategy ensures these leveraged investments remain viable through multiple budget cycles, significantly increasing successful transition to recipient Army POR.  Army TENCAP facilitates the continued access to National Intel Community (IC) 'joint' efforts and compatibility with those National standards and software baseline for those Army PORs that benefit from these leveraged National IC technologies, resulting in cost-savings through cost-sharing, and Army participation in collaborative Intelligence. Funds will be used for final-stage integration efforts identified and vetted through the Army TENCAP annual TGOSG, such as: advanced Air Vigilance software enhancements; POR sensor integration into the Theater Net-Centric Geolocation network; integration of the future Advanced Miniaturized Data Acquisition System (AMDAS - Next) capability into PM DCGS-A family of systems and operational concepts;  transition and integration of Army TENCAP technologies discovered and leveraged by the annual Military Exploitation of Reconnaissance and Intelligent Technology (MERIT) project selection process, as well as other transitioning technologies discovered and\/or leverage through other joint TENCAP outreach efforts."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Activities for AV POR realign to Project EX7 in FY 2018."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TNG Engineers"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.42"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.913"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.115"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.115"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.448"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TNG for Multiple Army PORs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "26.973"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.905"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.782"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.25"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.25"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "35.910"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TRFE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Classified"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Classified"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.336"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.436"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RGT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Geospatial Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Belvoir"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.500"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TNG Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO IEW&S\/PM SAI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Grounds, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.24"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.554"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.55"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.55"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.344"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TNG Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.255"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.805"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TRFE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Classified"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Classified"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.400"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444561_DX9.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Theater Net-centric Geolocation (TNG) Interoperability Standards"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AMDAS Next Capabilities Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TRFE Prototype Integration Effort"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EX7"
                    },
                    "ProjectTitle": {
                        "val": "Air Vigilance System Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.062"
                        },
                        "CurrentYear": {
                            "val": "3.28"
                        },
                        "BudgetYearOne": {
                            "val": "3.345"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.345"
                        },
                        "BudgetYearTwo": {
                            "val": "3.454"
                        },
                        "BudgetYearThree": {
                            "val": "6.499"
                        },
                        "BudgetYearFour": {
                            "val": "6.629"
                        },
                        "BudgetYearFive": {
                            "val": "6.762"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "34.031"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "All funding is in support of the ACTIVE COMPONENT\nProject EX7 'Air Vigilance System Development' was previously funded"
                        },
                        "ProjectMissionDescription": {
                            "val": "Air Vigilance systems are a software based solution that collect critical intelligence data on emerging threat aerial systems. The intelligence data provides early warning of operations in restricted airspace to ensure force protection. An Air Vigilance system is comprised of a server unit configured and fielded with a single or multiple sub-component sensors. System Quantities are based upon server units. Operational details are classified.\n\nFY 2020 Base funding in the amount of $3.345 million provides for system development and integration of latest software developments and hardware configurations in accordance with Capability Drop (CD) 3 requirements"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Vigilance System Development and Integration"
                                    },
                                    "Description": {
                                        "val": "Software and hardware engineering, development and integration efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.062"
                                            },
                                            "Text": {
                                                "val": "Provided for software development and integration to ingest latest collected sensor data into the common baseline and enhance system capabilities to meet newly identified threats and latest Capability Drop requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.28"
                                            },
                                            "Text": {
                                                "val": "Provide for software development and integration to ingest latest collected sensor data into the common baseline and enhance system capabilities to meet newly identified threats and latest Capability Drop requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.345"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.345"
                                            },
                                            "Text": {
                                                "val": "Will provide for software development and integration to ingest latest collected sensor data into the common baseline and enhance system capabilities to meet newly identified threats and latest Capability Drop requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "System development driven by and in response to collected sensor data."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603766A"
                                    },
                                    "Title": {
                                        "val": "Tactical Electronic Surveillance System - Adv Dev"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.733"
                                        },
                                        "CurrentYear": {
                                            "val": "35.667"
                                        },
                                        "BudgetYearOne": {
                                            "val": "34.89"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "34.89"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "26.257"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.299"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.285"
                                        },
                                        "BudgetYearFive": {
                                            "val": "33.987"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "219.118"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "W60001"
                                    },
                                    "Title": {
                                        "val": "Air Vigilance (AV) (MIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.348"
                                        },
                                        "CurrentYear": {
                                            "val": "8.497"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.953"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.953"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.169"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.53"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.701"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.875"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Air Vigilance (AV) is an ACAT III Automated Information System (AIS) program of record (POR) that originated from a Quick Reaction Capability (QRC) developed and fielded cooperatively with the Intelligence Community (IC) through the efforts and mission of the Army's Tactical Exploitation of National Capabilities (TENCAP) office.  The QRC was transitioned into an Army AIS POR by the AAE in May 2013 and assigned to Army Program Executive Office - Intelligence Electronic Warfare and Sensors (PEO IEWS), the chartered acquisition authority for management and execution of the Army's TENCAP mission and Milestone Decision Authority (MDA) for the AV POR.  The Army TENCAP continues to leverage the IC common software development and support contract to field the AV systems, and ensure this primarily software based system can continue to access and leverage the common software, and input or ingest the latest sensor collects into the common IC data library.  As an AIS POR, the AV POR is currently fielding systems per its Basis of Issue Plan (BOIP) and with software and system capabilities that meet its latest validated Capability Drop (CD) requirements. The AV POR is currently scheduled to meet Full Deployment (FD) by 2021, and will continue to evolve to meet future validated Capability Drop requirements and maintain its effectiveness against emerging threats."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Engineers and Technical Assistance (SETA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Perspecta"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.48"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.51"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.53"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.53"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.520"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Air Vigilance software updates and integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Classified"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Classified"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.588"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.825"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.865"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.865"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.278"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DA Gov Salaries, Travel, Office Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO IEWS\/Air Vigilance POR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.744"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.83"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.85"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.85"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.424"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Air Vigilance system Testing and Exercises"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Classified"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Classified"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.25"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.115"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.465"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444561_EX7.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "(Cont.) (1) AV system development and integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AV system development, integration and fielding contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "(2) Contract - Opt 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "(2) Contract - Opt 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Air Vigilance CD #3 National Assessment Group Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment - Current RDP s\/w  Baseline"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TRFE GSA Contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "E3I GSA Contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "E3I GSA Contract 1yr Base, w\/4 Options"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AV s\/w, h\/w dev, integration and fielding - Follow-on capabilities"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2026"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}