{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-17",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603375D8Z"
        },
        "ProgramElementTitle": {
            "val": "Technology Innovation"
        },
        "R1LineNumber": {
            "val": "41"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "59.895"
            },
            "PriorYear": {
                "val": "24.825"
            },
            "CurrentYear": {
                "val": "33.068"
            },
            "BudgetYearOne": {
                "val": "60.000"
            },
            "BudgetYearOneBase": {
                "val": "60.000"
            },
            "BudgetYearTwo": {
                "val": "68.000"
            },
            "BudgetYearThree": {
                "val": "76.000"
            },
            "BudgetYearFour": {
                "val": "84.000"
            },
            "BudgetYearFive": {
                "val": "92.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense (DoD) has a long history of technological breakthroughs and innovations originating from within the Department. In order to sustain technological superiority, the Department must take advantage of the rapid evolution of emerging commercial technologies that will be a source of battlefield advantage, when integrated with military systems and novel concepts of operation.\n\nLeveraging innovative technologies from commercial startup companies has the potential to rapidly address warfighter problem sets in areas where commercial innovation outstrips government investment in the same technology areas. Through a unique partnership with other government agencies, we gain access to In-Q-Tel's vetting of innovative technologies from commercial startup companies where much of the research and development (R&D) funds are provided by the venture capital community. Small DoD investments in these companies, often in partnership with other U.S. Government agencies, further leveraging their dollars spent, provides short work programs to adapt the commercial technologies for warfighter applications. The deliverables from the work program allow the warfighters to rapidly pilot technology and concepts, with the ability to fail early and cheaply, and provide the avenue to refine warfighter requirements and transition technology from successful pilots to traditional DoD activities for integration into broader R&D efforts or acquisition programs of record."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "64.863"
                },
                "CurrentYear": {
                    "val": "83.143"
                },
                "BudgetYearOne": {
                    "val": "95.982"
                },
                "BudgetYearOneBase": {
                    "val": "95.982"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.825"
                },
                "CurrentYear": {
                    "val": "33.068"
                },
                "BudgetYearOne": {
                    "val": "60.000"
                },
                "BudgetYearOneBase": {
                    "val": "60.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-40.038"
                },
                "CurrentYear": {
                    "val": "-50.075"
                },
                "BudgetYearOne": {
                    "val": "-35.982"
                },
                "BudgetYearOneBase": {
                    "val": "-35.982"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reductions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.038"
                                },
                                "CurrentYear": {
                                    "val": "-0.075"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-40.000"
                                },
                                "CurrentYear": {
                                    "val": "-50.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Realignment for Higher Priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-35.982"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-35.982"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2018 and FY 2019, there were Congressional reductions to the overall line.  As a result, the OUSD(R&E) adjusted the line for FY 2020- FY 2024 and realigned the funds to other priority areas in the OUSD(R&E) portfolio."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "375"
                    },
                    "ProjectTitle": {
                        "val": "Technology Innovation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "59.895"
                        },
                        "PriorYear": {
                            "val": "24.825"
                        },
                        "CurrentYear": {
                            "val": "33.068"
                        },
                        "BudgetYearOne": {
                            "val": "60.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.000"
                        },
                        "BudgetYearTwo": {
                            "val": "68.000"
                        },
                        "BudgetYearThree": {
                            "val": "76.000"
                        },
                        "BudgetYearFour": {
                            "val": "84.000"
                        },
                        "BudgetYearFive": {
                            "val": "92.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program focuses on three main areas: 1) Rapid innovation and experimentation in commercial start-up technology via In-Q-Tel to address priority warfighter problem sets, 2) Project Datahub to pilot innovative AI\/ML automation for data fusion of commercial and government data to address a high-priority Combatant Command challenge; and 3) Expansion of Project Datahub to address high priority areas.\n\nRapid Innovation and experimentation with commercial startup technology: Through the unique partnership with the Intelligence Community (IC) in place for this effort, a wide variety of emerging commercial technologies are rapidly assessed for applicability to a wide spectrum of priority DoD problem sets. Enabling the warfighter to execute short duration pilots with these evolving technologies provides a cost effective way to leverage commercial investment for DoD purposes, sharing costs with IC partners, informing warfighter requirements for follow-on acquisition through traditional DoD channels, and allowing other DoD R&D organizations to focus their resources on both the integration of commercial technologies showing promise in these warfighter pilots as well as on traditional R&D in technologies not well served by commercial start-up companies.\n\nProject Datahub: This effort focuses on maturing and demonstrating the automated processing of space-based Intelligence, Surveillance, and Reconnaissance (ISR), Artificial Intelligence-driven Geospatial Intelligence (GEOINT), and Fix-Find-Finish-Exploit-Assess (F3EA) into an integrated capability to aid Combatant Commander and Component forces by providing more robust long-lead Indications and Warnings (I&W) against high priority threats. The approach is composed of three innovative building blocks: 1) Machine learning techniques applied to commercial data sources and algorithms together with high-side government data sources for automated country-wide anomaly and change detection – a crucial element for enhancing indications and warnings required for deliberate action; 2) Machine-Human collaboration architecture to accelerate the F3EA joint forces targeting and decision-making cycle; and 3) Autonomous weaponeering demonstration for timely precision strikes to hold mobile missile systems at risk.  Project Datahub is being implemented in the IC’s secure cloud environment (C2S).\n\nExpansion of Project Datahub. Following a successful demonstration of Project Datahub in 2017, the team was directed to expand Project Datahub to address high priority areas. Some of these problem sets may leverage similar technologies to the pilot program, with data coverage for different parts of the world and algorithms tuned for different targets of interest, while other problem sets may require completely different data, algorithms, and\/or technologies. Funding in FY 2020 will allow the team to expand its efforts into additional high priority areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technology Innovation"
                                    },
                                    "Description": {
                                        "val": "The Program focuses rapid innovation and experimentation in commercial start-up technology via In-Q-Tel to address priority warfighter problem sets, and piloting innovative AI\/ML automation for data fusion of commercial and government data to address high-priority Combatant Command operational challenges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.825"
                                            },
                                            "Text": {
                                                "val": "- Finalize unclassified user-based training\n- Test\/Validate ML algorithms in Secure C2S Cloud\n- Transition initial prototype (UNCLAS\/CLAS) to user\n- Test\/Validate SAR ML algorithms for Airborne Assets\n- Demonstrate integration and validation of SAR data from airborne assets within Secure (C2C) Cloud\n- Development of SAR ML for space-based imagery\n- Test\/Validate micro-SAR space assets"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.068"
                                            },
                                            "Text": {
                                                "val": "-  Continue rapid innovation and experimentation with commercial startup technology to address priority warfighter problem sets.\n-  Integrate additional commercial data sources into core Datahub and Datahub expansion, and begin initial expansion efforts to address high priority areass."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "60.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "60.000"
                                            },
                                            "Text": {
                                                "val": "-  Expand rapid innovation and experimentation with commercial startup technology to address additional warfighter organizations and problem sets.\n-  Continue Datahub expansion into additional address high priority areas."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "-Due to FY 2019 and prior year funding decreases, the program line is being reset for FY 2020 to provide better stability of efforts under this program."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}