{
    "id": "2020-TheJointStaff-PB-0400-MJBOOK-0-0-d1987b0fd370b5a1aa30691c25a4364a88cdaac49ace6ad89bc88e2bfcf9f939-1",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-TJS-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603829J"
        },
        "ProgramElementTitle": {
            "val": "Joint Capability Experimentation"
        },
        "R1LineNumber": {
            "val": "142"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "13.000"
            },
            "BudgetYearOneBase": {
                "val": "13.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "NDAA 19 amends the Chairman’s responsibilities to address experimentation on future concepts and the 2018 National Defense Strategy Implementation Guidance directs that rigorous experimentation take place on concepts to ensure Department investments adequately address future requirements as well as those of today. As such, the Joint Staff will establish an experimentation capability to analyze and validate priority joint concept required capabilities. \n\nConcept analysis and validation will have a multi-faceted nature to meet the Chairmen’s Title 10 responsibility of, “identifying new joint military capabilities based on advances in technology and concepts of operation, and recommending investments and experiments in such capabilities.” Wargames will assess baseline mission and campaign level outcomes of the concepts as well as identify a tradespace of potential new capabilities. This tradespace of capabilities is further explored with quantitative models and software that identify the most efficient cost and capability tradeoffs to help meet the Title 10 responsibility of “advising the Secretary on new and alternative joint military capabilities, and alternative program recommendations and budget proposals, within projected resource levels.” \n\nThe National Defense Strategy directs “early design tradeoffs in the requirements process to increase the speed of delivery.” The Joint Staff approach to tradespace exploration follows that guidance by providing a cost conscious and operationally relevant prioritization tradeoff technique early in the portfolio design process. Using this rigorous prioritization approach, the capability development cycle can efficiently focus resources on more detailed experimentation of specific capabilities to inform the requirements process. The analysis from the experimentation program will be used to provide foundational evidence to directly inform the Joint Military Net Assessment (JMNA), the Chairman’s Program Recommendation (CPR), and ultimately the Defense Planning Guidance for Joint Force development and design."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.000"
                },
                "BudgetYearOneBase": {
                    "val": "13.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.000"
                },
                "BudgetYearOneBase": {
                    "val": "13.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "New program start"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "13.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020 increase is due to a new program element start in FY 2020 to expand joint experimentation activities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Joint Capability Experimentation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "13.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The FY19 NDAA amends the Chairman’s responsibilities to address experimentation on future concepts and the 2018 National Defense Strategy Implementation Guidance directs vigorous experimentation take place on concepts to ensure department investments are adequately addressing future requirements as well as those today.  As such, the Joint Staff will establish an experimentation capability to analyze and prioritize joint concept required capabilities. The specific and rigorous analysis from the this experimentation program will be used to provide foundational evidence to directly inform portion of the Joint Military Net Assessment (JMNA), the Chairman’s Program Recommendation (CPR), and ultimately the Defense Planning Guidance.  The project will deliver analytically rigorous, resource conscious and operationally validated portfolio investment strategies for the CJCS to ensure an enduring competitive advantage."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Capability Experimentation"
                                    },
                                    "Description": {
                                        "val": "The FY19 NDAA amends the Chairman’s responsibilities to address experimentation on future concepts and the 2018 National Defense Strategy Implementation Guidance directs vigorous experimentation take place on concepts to ensure department investments are adequately addressing future requirements as well as those today.  The project will deliver analytically rigorous, resource conscious and operationally validated portfolio investment strategies for the CJCS to ensure an enduring competitive advantage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable. This is a new program element starting in FY 2020."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "Integrate, synthesize, and prioritize concept required capabilities for Joint Force development and design efforts out to 2030 that are aligned with the Capstone Concept for Joint Operations: Joint Force 2030 and based on Joint Operating Concepts for Russia and North Korea.\n\nIdentify priority concept required capabilities using a set criteria of criticality, strategic guidance, and Combatant Command and Service priorities.\n\nEvaluate and validate priority concept required capabilities through an integrated and federated experimentation, exercises, wargames, and studies approach.\n\nConduct tradespace exploration studies to help prioritize the most efficient options based on cost and capability tradeoffs.\n\nIn FY 2020, the top 5 to 10 priority CRC’s will be evaluated and validated in two joint and\/or service exercises; at least one technology demonstration; at least one Globally Integrated Operations (GIO) wargame; leveraging already planned Service and Combatant Command events with extensive use of modeling and simulation. Experimentation via research and development, science and technology, and Defense Advanced Research Projects Agency (DARPA) will be leveraged."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increase is due to a new program element start to expand joint experimentation activities."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are measured through internal management controls and external assessments. Performance metrics include, but are not limited to time, money, realism, and fidelity defined as follows:\nTime – Will the effort enable the warfighter faster access to future capabilities at the speed of relevance than current capabilities\/processes allow?\nMoney – Will the effort enable the DOD to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities allow?\nRealism – Will the effort enable the warfighter to create an environment that is closer to what he\/she will operate in during real world operations than current capabilities allow?\nFidelity – Will the effort ensure unity of effort throughout the Force Development and Design Community?"
                        }
                    }
                }
            ]
        }
    }
}