{
    "id": "2020-Navy-PB-1319-JBOOK-9da760a8280e5c477a40ce5d303141285b83ab4a577b7d5903632d5298d41e17-18",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603640M"
        },
        "ProgramElementTitle": {
            "val": "MC Advanced Technology Demo"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "164.992"
            },
            "CurrentYear": {
                "val": "174.809"
            },
            "BudgetYearOne": {
                "val": "172.847"
            },
            "BudgetYearOneBase": {
                "val": "172.847"
            },
            "BudgetYearTwo": {
                "val": "168.520"
            },
            "BudgetYearThree": {
                "val": "171.906"
            },
            "BudgetYearFour": {
                "val": "175.319"
            },
            "BudgetYearFive": {
                "val": "178.826"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) addresses demand signals emphasized by the Commandant of the Marine Corps, the Chief of Naval Operations, and the Chief of Naval Research, as well as those pulled from dynamic engagement with stakeholders. Research efforts are carefully selected to ensure they have the potential to expand warfighting capabilities, inform operational concepts and requirements development, and advance state of the art technology and scientific knowledge.  Current guidance also highlights the need to accelerate our pace of development and guide the approach to rapid experimentation, prototyping, and learning.\n\nAs reflected in the Marine Corps Operating Concept, the current strategic guidance from the Commandant, expeditionary forces will conduct maneuver warfare in environments characterized by complex terrain, technology proliferation, information used as a weapon, a battle of signatures, and an increasingly contested maritime domain. Additionally, an emergent operation stressor is the contested urban environment which exemplifies the characterizations listed above. The urban environment is one of the most complex terrains with physical compartmentalization and canalization, additional physical dimensions (subterranean and multi-story structures), crowded conditions and associated threat obscuration, communications challenges, informational and human aspects, and proliferation of observation and fires technologies. This environment requires capabilities addressing all the activities within this PE and while it provides many challenges, unique opportunities are also presented and can further shape technology approaches. \n\nThese future challenges and portents demand robust technologies for the Marine Corps, but the technology options are constrained. They must have a lightweight deployable character, and the ability to operate in austere conditions with little fixed infrastructure or support while retaining the agility and lethality of an integrated maneuver force. Technology must provide full spectrum capability against robust and complex peer and near-peer adversaries while meeting Size, Weight, Power, Cost limitations, and information availability within Distributed, Intermittent and Limited environments. \n\nThe approach within this PE encompasses ideas that support both revolutionary and evolutionary capabilities, and in this way considers and balances both \"push\" and \"pull\" aspects of technology projects.  This PE matures technologies emerging from PE 0602131M-Marine Corps Landing Force Technology to develop concept prototypes and initial experimentation to confirm feasibility in an environment relavent to operations. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "154.407"
                },
                "CurrentYear": {
                    "val": "150.245"
                },
                "BudgetYearOne": {
                    "val": "142.377"
                },
                "BudgetYearOneBase": {
                    "val": "142.377"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "164.992"
                },
                "CurrentYear": {
                    "val": "174.809"
                },
                "BudgetYearOne": {
                    "val": "172.847"
                },
                "BudgetYearOneBase": {
                    "val": "172.847"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "10.585"
                },
                "CurrentYear": {
                    "val": "24.564"
                },
                "BudgetYearOne": {
                    "val": "30.470"
                },
                "BudgetYearOneBase": {
                    "val": "30.470"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.436"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-2.000"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "27.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.073"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.792"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "30.470"
                                },
                                "BudgetYearOneBase": {
                                    "val": "30.470"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.296"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.900"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "12.500"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Major program adjustment is associated with a one-time $15M increase in FY20 in order to enhance Intelligence, Surveillance, and Reconnaissance (ISR) capabilities. Will initiate efforts to receive, transmit, and fuse joint asset specialized sensor information to communications nodes afloat and ashore via an aerial gateway. Additional $10M in FY20 and subsequent across the FYDP to fund Marine Corps Science and Technology in-line with Office of the Secretary of Defense (OSD) steady-state guidance. Efforts are justified in Project 2297."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2223"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps ATD"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "94.567"
                        },
                        "CurrentYear": {
                            "val": "100.979"
                        },
                        "BudgetYearOne": {
                            "val": "95.327"
                        },
                        "BudgetYearOneBase": {
                            "val": "95.327"
                        },
                        "BudgetYearTwo": {
                            "val": "98.263"
                        },
                        "BudgetYearThree": {
                            "val": "100.313"
                        },
                        "BudgetYearFour": {
                            "val": "102.326"
                        },
                        "BudgetYearFive": {
                            "val": "104.373"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds technology demonstration, experimentation, and prototyping; and more technologically mature projects within the Future Naval Capability (FNC) process as means to inform, enhance, enable, and invent future concepts and capabilities with new S&T. This project is organized into ten activities, the core of which is represented by the eight Expeditionary Warfighting Capability Areas.\n\nEmphasized within this project are increased efforts to actively demonstrate advanced technologies and system concepts. These demonstrations and experiments focus on the specific technologies, not necessarily their operational application, and vary based on the technical maturity of the project. This early technology exposure gives Marines a view into the future and enables them to use their imagination and innovation to envision novel employment of the technology and inform the acquisition process."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMMAND, CONTROL, COMMUNICATIONS, COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity investigates robust, resilient, and secure networked communications pathways and capability that support an expeditionary force's distributed and disaggregated operations. Research supports both networked and local computation for communications that exploits the expeditionary forces close physical proximity to threats while mitigating shortfalls commiserate within Distributed, Intermittent, and Limited environments. Expeditionary forces must operate in the cyber domain and in addition to defending communications networks, vehicles, and weapons systems, are reliant on electronic controllers for basic operations and as such are susceptible to cyberattacks.\n\nTechnologies addressed within this activity include secure, robust, self-forming, mobile communications networks; distributed computing to support information dissemination to all echelons; improved capabilities in over-the-horizon, beyond line-of-sight, and restricted environment communications and sensors; and software and data processing to support formation of an appropriate common picture. Other efforts include power management, low detectability, conforming to Size, Weight, Power, Cost constraints, and interoperability within the joint environment.\n\nFurther, this activity integrates and demonstrates enhanced communications and situational awareness capabilities in experimental and warfighting environments reflecting USMC operations. Advanced technology resources will be developed and applied to complement commercial, other service, and defense agency investments to produce a technology base addressing identified Marine Corps technology gaps.  Focus will be on developing component level prototypes and experimentation in relevant environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.420"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue urban navigation with limited Global Positioning System availability demonstrations.\n- Continue demonstrations of improved urban communications capabilities.\n- Continue Advanced HF Antenna effort.\n- Initiate Advanced Cryptography Technology.\n- Initiate Adaptive Distributed Messaging.\n- Transfer all Tactical Cyber Warfare efforts to the Expeditionary Cyber Activity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Command, Control, Communications and Computers (C4) research effort focuses heavily on the continued development and integration of multiple underlying technologies into subsystems and system with the purpose of demonstrating the tactical exploitation of information and the electromagnetic spectrum. To address resiliency requirements,C4 is coordinating closely with Expeditionary Cyber to address resiliency requirements by efficiently exploiting multifunction capabilities in portable and reduced Size, Weight, Power, and Cost systems. Other efforts include power management, low detectability, and interoperability within the joint environment This integrated rapid co-design, prototyping, and experimentation approach will reduce time needed to provide new capabilities to the US Marine Corps. Developed and demonstrated technologies will include signature management, interoperability, spectrum maneuver, damage assessment monitoring, and information dominance for tactical edge systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The C4 and Electronic Warfare research effort focuses heavily on the continued development and integration of multiple underlying technologies into subsystems and system with the purpose of demonstrating the tactical exploitation of information and the electromagnetic spectrum. To address resiliency requirements of C4 this effort is closely coordinated with the Intelligence, Surveillance, and Reconnaissance and Expeditionary Cyber research portfolio also described herein so as to most efficiently exploit multifunction capabilities in portable reduced Size, Weight, Power, Cost systems. This integrated rapid co-design, prototyping, and experimentation approach will reduce time needed to provide new capabilities to the US Marine Corps. Developed and demonstrated technologies will include advanced signature management, interoperability, machine learning, spectrum maneuver, damage assessment monitoring, and information dominance for tactical edge systems. Additional emphasis of operating in the challenging warfighter electromagnetic spectrum environment is addressed in the multifunction electronic warfare domains."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 is associated with greater emphasis on deception and signature management."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIREPOWER"
                                    },
                                    "Description": {
                                        "val": "The activity investigates a large variety of weapons to provide the warfighter with a decisive, yet surgical, tactical advantage to collectively address 21st-century combined-arms warfare against peer and near-peer states. Research efforts increase the reach, lethality and capacity, while retaining mobility and tempo beneficial to expeditionary maneuver warfare. Maintaining focus on Size, Weight, Power, Cost and Distributed, Intermittent and Limited  environments stresses the technical solutions available.\n\nThis activity furthers the maturity of researched technology solutions by also developing the integration required to effectively demonstrate and test emergent capabilities. Achieving a true combined arms state involves a full systems approach for both kinetic and non-kinetic capabilities all driven by a holistic targeting capability.\n\nThis activity develops technology for application on current and future expeditionary weapons and elements of the kill chain. It includes, but is not limited to, the following technologies: fuze, fire control, targeting, launch\/propulsion, lethality, and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.734"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of targeting and engagement technologies for distributed operations collaborative fires integration and demonstrations.\n- Continue design, development, prototyping and testing of lightweight technologies that provide individual Marines enhanced capabilities to detect and identify man-size targets out to at least the maximum effective range of their personal weapons during all conditions (daylight, limited visibility, & darkness) by integrating multiple capabilities into a single system.\n- Continue Engineering and Development portion of Awareness for Lightweight Engagements and Remote Targeting (ALERT) to develop large aperture, lightweight lens with enhanced fields of view.\n- Continue the Engineering and Development portion of Semi-Autonomous Fires Technology (SAFT) to develop semi- autonomous fire control systems for use in next generation remote weapons systems, to enhance performance and minimize gunner\/operator burden.\n- Continue investigation of the scalability of variable effects conventional munitions, gun, and propulsion technologies for improving firepower effectiveness while increasing affordability and decreasing logistics burden in support of expeditionary warfare.\n- Continue development of precision fires engagement technologies, to include trajectory shaped 81mm mortars, 83mm missiles, and smaller precision munitions.\n- Initiate High Reliability Dual Purpose Improved Conventional Munitions (DPICM) Replacement (HRDR) to include projectile integration, lethality enhancement, fuze setting integration and aerodynamic and aerospace technologies.\n- Initiate the advanced technology portion of Caseless, Lightweight, Low-volume Round (CLLVR) to develop lightweight, small caliber ammunition for individual, crew served, and remotely mounted weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.955"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This activity will finalize development of direct electrical ignition for caseless small caliber ammunition for integration and testing.  Development of fuzing and sensor technologies for cannon-delivered area effects munitions will continue.  Systems engineering of supervised-autonomous weapon system control will continue, implementing engagement logic, to develop and demonstrate the key enabling technologies and command and control methods for weaponized unmanned ground vehicles. Efforts will include prototype weapon systems for technical evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalize development of caseless small caliber ammunition: development of fuzing and sensor technologies for cannon-delivered area effects munitions, and development of supervised-autonomous weapon system control technologies for weaponized unmanned ground vehicles. Munitions developments will focus on low cost, extended range, precision munitions with improved lethality warhead payloads for use against stationary and moving targets on land and water, in satellite and network denied environments."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is associated with one time increase in FY19 for the HR DPICM Replacement in the amount $8.6M."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity investigates new ways and means to protect forces and materiel across all operational settings, from contested sea-land surface interfaces to complex urban environments. The portfolio protects against adversaries' challenges such as guided-rockets and missiles, mobile coastal artillery, threat Electronic Warfare and counter Intelligence, Surveillance and Reconnaissance. Mines and obstacles both in the water and ashore also complicate amphibious landings. The activity invests in vehicle survivability aspects that are exacerbated due to Size, Weight, Power Cost constraints inherent to Marine Corps operation and the harsh nature of the amphibious environment. \n\nTechnologies addressed include lightweight armor for ballistic and underbody blast protection, advanced sensors for counter tactical surveillance, active protection, and signature management. This activity also considers technology for payloads, packages and sensors that are needed by amphibious vehicles (both manned and unmanned) including mine counter measures; explosive hazard defeat systems; and obstacle and threat detection systems as well as technologies for improved protection for individuals against blast, ballistic and blunt impact threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.422"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of technologies to defeat side\/top attack and advanced fuze mines through signature reduction and advanced signature duplication.\n- Continue development of technologies to locate and defeat IEDs.\n- Continue development of technologies to defeat advanced mine fuzes (seismic, acoustic, and infrared).\n- Continue demonstration of laser technology readiness for battlefield employment.\n- Continue physics-based characterization of signatures of proud\/buried targets\/explosive hazard indicators across the spectrum of applicable detection modalities using knowledge\/investigation of target physics.\n- Continue a program to demonstrate the fusion of multiple modes of detection of explosive hazards into a single system.\n- Continue development of materials and helmet systems that absorb\/dissipate blast shock waves.\n- Continue an advanced technology demonstration for modular mission packages for the detection, neutralization, marking and reporting of explosive hazards using multiple, existing vehicles in movement to contact and amphibious raid scenarios.\n- Continue an advanced technology demonstration for autonomous vehicles in the detection, neutralization, marking and reporting of explosive hazards using multiple, existing vehicles in movement to contact and amphibious raid scenarios.\n- Continue a project to develop organic technology solutions for the detection and clearance of explosive hazards and obstacles encountered by Marine Corps forces during amphibious operations.\n- Continue a project to investigate the detection and neutralization of explosive hazards in multiple, diverse, environments.\n- Continue a program to fuse multiple technologies that will detect and classify tactical surveillance and targeting threats before engagement from a moving platform.\n- Continue an advanced technology demonstration that uses Warfighter modeling and simulation efforts and advanced materials to create, test, and evaluate modular and scalable personal protective equipment.\n- Complete Warfighter modeling and simulation efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.\n- Complete an advanced technology demonstration that detect and classify tactical surveillance and targeting threats before engagement from a moving platform.\n- Complete an integrated technology demonstration to develop a system of systems that addresses route reconnaissance and clearance for a MEU.\n- Complete development of advance modular and scalable personal protective equipment utilizing advances in mobility\/survivability modeling and simulation, materials, and bio-fidelic surrogates.\n- Complete projects to develop Personnel Protection Equipment (PPE) through novel Modular, Tailorable and scalable design concepts which increase survivability and operational suitability to the warfighter.\n- Complete broad based material (ceramics, fiber and Fiber Re-Enforced Plastics) to demonstrate the possibility of significant weight reductions (greater than 50%) can be achieved."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Plans are focused on efforts to integrate and fuse sensor modalities while experimenting with the effectiveness of automated target recognition algorithms in high clutter environments at high speed over off-road terrains. Work will emphasize signature management of vehicle systems and integrating the knowledge of our own susceptibility, intelligence estimates of threat capabilities, and in situ data to enhance situational awareness.  Focus is also on lightweight protection systems in the area of active protection that provide hemispherical coverage while reducing the threat to dismounted forces. Complete efforts associated with development of Passive Armor capabilities. Last, research is being conducted on modular, scalable, integrated stand-off Radio Frequency based explosive hazard (Improvised Explosive Devices & Mines) detection system that can be operated as a remote or autonomous system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Plans emphasize development of miniaturized hardware systems for the detection of threats across a variety of sensing modalities to take advantage of unique susceptibilities of threat systems at significant ranges. Leveraging these sensor systems, there will be development of computer vision and machine learning approaches for automated target recognition within these innovative sensing modalities. There will be development of feature extraction of threats leveraging RF based 3D buried object detection. Signature reduction materials and sensor hardware for pre-shot detection of ambush threats and surveillance will be demonstrated on platforms to evaluate enhanced survivability.  Efforts will also include tactical decision aids that provide vehicle susceptibility assessment and route planning recommendations. Additionally, technologies and systems supporting the neutralization of threat systems via kinetic and non-kinetic means, to include unmanned aerial vehicles, will be developed."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 is associated with greater emphasis on mine countermeasures and counter-unmanned aerial systems activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN PERFORMANCE, TRAINING & EDUCATION"
                                    },
                                    "Description": {
                                        "val": "This activity investigates two technology investment areas, warrior resilience, and decision-making and expertise development. Warrior resilience is focused on advanced training technologies and methodologies that enhance neural, cognitive, and physical readiness. Decision making and expertise development accelerates the development and improves the retention of skills in decision making, situation awareness, and individual and team adaptability and coordination on decentralized, dynamic and dispersed battlefields.  Focus will be on developing component level prototypes for Marines to evaluate and experiment with."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.618"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the development of small-unit training for adaptability and resiliency in decision making (SUDM), to enhance the Marine Air Ground Task Force's capabilities by training and equipping small-unit leaders to handle the demanding complexities and possess the adaptive mindset necessary to operate across the spectrum of conflict; empowering our strategic corporals as well as all of our junior leaders to fight, operate, and win in this challenging security environment.\n- Continue design and development of a Marine augmented classroom environment (ACE) that will enhance instructors' teaching performance and student learning outcomes.\n- Continue design and development of a test-bed and conduct The Basic School evaluation to test the efficacy of simulation based training in that curriculum.\n- Continue development and demonstrate an agent-based surrogate instructor development environment (ASIDE) to allow USMC to field small-team focused intelligent training solutions.\n- Continue the development of measures of training effectiveness that connect training tasks with measures of performance under various stressors.\n- Continue a holistic model solution that leverages previous efforts in warrior resilience and fitness to enhance performance and mitigate injuries at the infantry small unit level.\n- Complete development of an individualized fatigue countermeasure training tool for Marines that will provide increased fatigue resilience training effectiveness, improved fatigue management and reduced fatigue-related operational errors.\n- Complete development of a master instructor development system (MIND) which will provide measurement framework to support the development of master instructors by creating a developmental model of instructor mastery.\n- Initiate adaptive training techniques to support training efficacy and efficiency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.107"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Rapid advances in wearable and human performance related technologies have provided the opportunity to demonstrate the utility of these technologies with Marine Corps populations to increase physical readiness and reduce injuries.  The increased use of simulation-based training capabilities such as augmented reality offer the possibilities to demonstrate new capabilities, such as 3-Dimensional (3D) visualization, that will accelerate and increase decision making. Efforts will support hardware, software, data collection and demonstrations to support increase decision making and expertise development and warrior resilience."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research in wearable physiological monitoring, predictive algorithms, health tracking capability, and related technologies will provide the opportunity to integrate with Marine Corps' 'Force Fitness Division' programs in support of close combat formations and populations, in order to increase physical readiness and reduce potential injuries. The use of these 'Warrior Resilience' programs may be demonstrated as integral elements of larger, multipurpose exercises focused on all aspects of military tasks, or as stand-alone events where the primary purpose is to illustrate the capability to achieve improved awareness of the physical and physiological readiness of the individual. \nThe advance of augmented reality devices and the content available for collection and display, and each of their contribution to simulation-based training (and the increased decision-making ability that this training can afford) will provide the opportunity to demonstrate 3D terrain visualization, battlefield control measures and effects, and target identification and classification. This robust and ever increasing capability will be incorporated into demonstration opportunities at ever-increasing levels of complexity and scale to demonstrate the increased decision making efficiency - in both speed and accuracy of information processing across the plan, execute, and debrief spectrum of operations.  Demonstrations will include advances in hardware, software, collection and display capabilities that will support increased decision making and expertise development and warrior resilience."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is associated with de-emphasis on custom wearable components in force fitness."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity investigates enhanced situational awareness, persistent surveillance, and tactical decision making through automated analysis of data and rapid integration of information and acquired knowledge.  Specific technologies in this activity effectively present actionable information to decision-makers, especially those at the lower command levels.  This includes biometric monitoring for expeditionary operations, operational Course of Action development, and autonomous surveillance in support of distributed operations.\n\nFurther, this activity supports the demonstration of technologies to enhance situational awareness and tactical decision making through automated analysis, fusion of data, rapid integration of information, and acquired knowledge resulting in actionable intelligence at the lower command levels. The activity includes the demonstration of ISR efforts involving enhanced reconnaissance and persistent surveillance, and sensors for unmanned ground and aerial vehicles. Advanced technology demonstrations also include the collection of information [monitoring, sensing, and locating] in the 3-Dimensional urban battlespace as well as exploiting information [identifying and classifying data] as part of the intelligence preparation of the battlespace in order to facilitate operational maneuver and distributed operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.868"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue research on the development of automated data tagging algorithms that enable connected graphs of structured and unstructured data.\n- Continue technology development required to enable tactical UAS on-board processing of terabytes of data in real time.\n- Continue research on technologies needed to tailor information delivery to warfighters based on mission context and user preferences.\n- Continue project to demonstrate the feasibility of analytic populated big data architectures to populate and maintain a global knowledge environment relevant to rapid turn amphibious mission planning.\n- Continue project to develop a set of video analytic classifiers (entity, behavior, and scene) that can run in a power efficient manner in embedded hardware.\n- Continue project to enable the synchronized planning and management and ISR assets given a set of disparate mission information requirements.\n- Continued project to enhance the extraction of target quality information from unregistered unstructured images and imagery.\n- Continue effort to automate the design and conduct of use cases relevant to tactical information requirements.\n- Continue research to develop a capacity to run tracklet fusion, track analysis and data to track or track to track correlation as a distributed service run as a map-reduce job, both forensically and in real time.\n- Continue research to develop a prototype system capable of maintaining the entity models needed for entity co referencing during real time natural language processing workflows.\n- Continue project to optimize the collection planning process through automation by automatically generating sensor plans, automating the production of information products, and delivering the most relevant information to the warfighters to enable rapid response in an evolving intelligence environment.\n- Continue project to develop a capability to automatically deliver mission relevant information to an agile tactical unit based on mission ontologies, user preferences and high level descriptions of information needs.\n- Continue project to develop a capability that will track and enhance mission readiness enabled by a dynamic machine understanding of mission information needs, a matured sensor optimization ability and operations research applied to course of action analysis.\n- Continue the development of level 1 and level 2 fusion capabilities applied to complex graphs.\n- Continue the development of cost functions for predictions made from data embedding spaces.\n-- Continue the development of a knowledge informed workflow manager capable of generating workflows automatically in response to alert conditions.\n- Continue the development of power efficient neuro inspired algorithms for machine understanding.\n- Initiate research to derive node and network signatures from node attributes, interactions and published communications, and causality between topics and sentiments to enable prediction of future behavior and events.\n- Initiate research on applying recommendation theory to assist the effectiveness of intelligence and operations staffs.\n- Complete project to improve expeditionary force capabilities to discover and process data across integrated cross domain systems.\n- Complete development of a user composable search and display capability enabled by map reduce technology.\n- Complete project to improve the enterprise recognition of critical tactical information relevant to real-time mission execution. \n- Complete research on the development of a capability to automate the extraction of video events relevant to mission information needs in real time on power efficient hardware.\n- Complete research on implementing orchestrated advanced analytics running across cloud and non-cloud based architectures.\n- Complete the development of complex event detection that is informed by entity pedigree."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.460"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This activity will begin to divest investments in approximate computing for power efficiency. Research and develop prototype systems for  machine question answering capabilities and in automating machine generation of complex standard military information based products.  Investments are also continuing in experimentation and demonstration in artificial intelligence relevant to decision support and sensor autonomy.  Increased focus will be put on investments in technology to enable all sensors, weapons, platforms to be smarter and more capable of knowing why, when and how to collaborate."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct assessment of the operational utility of natural language processing and computer vision.  Show operational relevance of computer vision as an autonomy enabler.  Increase emphasis on the production of synthetic data useful to train decision aids.  Accelerate deep learning enabled data fusion.  Mature algorithms capable of analyzing signatures and signature changes from graph data.  Initiate development of deep learning architecture enablers including dynamic graph stores and workflow managers for models."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "USMC FUTURE NAVAL CAPABILITIES"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity addresses the advanced technology development associated with the Marine Corps' participation in the Department of the Navy's (DoN) Future Naval Capabilities (FNC) Program.  The objective of the work in this PE is to develop promising technologies emerging from the FNC technology candidates funded in PE 0602131M that have been matured to higher Technology Readiness Levels (TRLs). Investments in this activity are coordinated with similar and non-duplicative efforts in PE 0603673N.  The FNC Program was restructured for FY19 to accelerate transition to the Fleet and Force.  This restructuring involved a zero based review of all ongoing FNC projects, where each effort was assessed for its technology maturity and transition commitment.  Ongoing efforts were categorized as FNCs or Technology Candidates.  Some efforts were terminated and others were accelerated to achieve the goals of the restructured program.  Funding for FNCs, which have higher Technology Readiness Levels (TRLs of 4\/5 to 6) and transition funding commitments, is being resourced in this PE.  Funding for FNC technology candidates at lower TRLs (3 to 4) is being resourced in PE 0602131M.  ONR is working closely with the Resource Sponsors and acquisition stakeholders to develop high priority technological capabilities needed by the operational forces. \n\nPrior to FY19, FNC Program investments were selected almost two years in advance of execution.  It was determined by Navy and Marine Corps leadership that this approach limits DON's ability to exploit technology advances and respond quickly to naval needs.  As a result, future BA 3 investments supporting the FNC Program are now made less than one year before commencing execution. Because FNCs are now starting at higher TRLs, the typical duration of an FNC has been shortened to 3-years.  The FNC Program has been fully restructured in favor of a more direct and higher level of collaboration.  Individual R-2 Activities have been discontinued and investments are organized to enhance collaboration with the acquisition stakeholders and their resource sponsors. A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of wide area surgical and persistent surveillance technologies (WASPS).\n- Continue Automated Processing for Spectral Exploitation and Dissemination (APSED) - Integrate and conduct laboratory tests of air-to-ground embedded processing capabilities.\n- Continue Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS) - Finalize the design of the multi-access hardware architecture to accommodate Electro-Optic\/Infra-Red (EO\/IR) and hyperspectral sensors.\n- Continue development of spectral and reconnaissance imagery for tactical exploitation (SPRITE).\n- Continue Target Processing Center (TCP) Radar\/Context Fusion by developing and testing algorithms to amplify or dampen threat surfaces based on Rules of Engagement (ROE).\n- Continue Target Processing Center (TCP) Radar Fusion and False Track Mitigation - Test and improve radar fusion and false track mitigation technologies within a relevant environment.\n- Continue development of the Ground Based Air Defense On-the-move high energy laser demonstrator (GBAD).\n- Continue Data Conditioning - Develop pattern recognition algorithms that can work against large Ground Moving Target Indicator (GMTI) data sets.\n- Continue Network Adaptive Communication Services - Develop gateway-mediated exchange mechanisms for existing or new gateways, and information sources using network awareness and multi-mode protocol adaptations.\n- Continue development of Advanced Topcoat System - Ground Vehicle Enabling Capability (EPE-FY16-01); specifically the formulation development of a high performance, zero-isocyanate Chemical Agent Resistant Coating (CARC) system that provides enhanced corrosion resistance and improved operational functionality on ground vehicle platforms.\n- Continue the development of a high reliability distributed fuzing system for the 155mm DPICM projectile.\n- Complete Densified Propellant Fire From Enclosure - Confined Space (FFE\/CS) Propulsion Technologies - Test and demonstrate the final system configuration from the Shoulder-Launched Multipurpose Assault Weapon (SMAW) and prepare a Level 2 drawing package."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.885"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include, but are not limited to, those that focus on developing promising technologies emerging from the FNC Applied Research program that have been matured to a Technology Readiness Level (TRL) of 4 to 5 in the areas of asymmetric and irregular warfare, distributed operations, information dominance, maneuverability, survivability, self-defense and expeditionary warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity focus on developing promising technologies emerging from the FNC Applied Research program that have been matured to a Technology Readiness Level of 4 to 5.  Technologies being developed include, but are not limited to, those that increase target prosecution speed and accuracy against enemy firing positions by compressing the kill chain timeline through sensor fusion, Command and Control integration, and automated collaboration of warfighting functions, those that will enhance mobility, propulsion, autonomy, weapons, materials, logistics, vehicle architectures, and Electronic Warfare protection for a light armored vehicle fleet, technologies associated with the development of an affordable, longer range mortar projectile, with precision delivery against stationary and moving targets during periods of full Global Positioning Satellite denial, technologies that optimize the balance between hardening and flexible software development for future dynamic engagements in contested environments with adversaries, and new repair techniques to include the use of solid-state technologies such as cold-spray and additive friction stir welding for structural repairs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LOGISTICS"
                                    },
                                    "Description": {
                                        "val": "This activity investigates the practical discipline and real world application of the deployment, sustainment, reconstitution, and re-deployment of forces engaged in expeditionary operations.  Logistics replaces mass with assured knowledge and speed, is equally capable ashore or afloat in austere environments, and is fully scalable to meet uncertain requirements.  This includes efficient and responsive force sustainment, planning and directing logistics operations, logistics demand reduction, fleet maintenance, and expeditionary energy.  Expeditionary Energy enhances combat capability of expeditionary warfighters by increasing the efficiency and effectiveness of energy production, storage, distribution and use. Beyond traditional energy efforts, this portfolio also looks at other issues, including energy-efficient behaviors and hybridization of energy sources. These pillars are thoroughly integrated and perpetually related in execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.942"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue analysis of material alternatives for automated vehicle health monitoring and reporting.\n- Continue demonstration of advanced concepts for mobile infrastructure.\n- Continue efforts to improve advanced electrical power generation from fuel cells and renewable sources as well as to improve the efficiency of conventional generation via hybridization and smart-grid technologies.\n- Continue integration and demonstration of advanced materials to reduce maintenance into selected vehicle and machinery components.\n- Continue the development of robotic systems to facilitate the packaging and handling of logistic supplies.\n- Continue a field demonstration of renewable energy devices and deployable equipment showing fewer liabilities when delivering expensive fuel, thereby lowering Marine Corps operational costs.\n- Continue operations research and analysis efforts to enhance seabased expeditionary supply chain concepts and technologies.\n- Continue development of alternative (non-electrochemical) energy storage technologies for hybrid power system load management.\n- Continue development of low energy desalination technologies to allow for efficient salt-water purification at the small\/ individual scale.\n- Continue the development of anti-fouling and non-fouling water purification components to enable enduring performance of small water purification systems.\n- Continue the development of real-time water quality monitoring systems for use with small scale water purification systems.\n- Continue the development of efficient water packaging and distribution technologies.\n- Initiate development of infrastructureless In-Transit Visibility (ITV) technologies to enable asset tagging, tracking, locating, and monitoring anywhere in the expeditionary supply chain.\n- Initiate the development of modular thermoacoustic systems capable of acting as power generation or heat-pump devices.\n- Initiate the development of alpha-particle semiconductors to harness energy from alpha-emitting materials and create ultra-high energy density nuclear batteries.\n- Initiated the development of intelligent microgrid systems for the expeditionary unit.\n- Complete the development of ultra-high efficiency piezoelectric devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This activity has development and demonstration of advanced technologies to anticipate and reduce maintenance demands while increasing reliability.  This includes advanced technology demonstrations of advanced  manufacturing methods including metal Additive Manufacturing, friction stir welding and additive friction stir welding, and cold spray for structural repair of Marine Corps equipment, creation of near net shaped parts, and advanced part demonstrations.  This also includes research into the digital thread of information and cyber security required, from cradle to grave, for digital manufacturing methods, from raw materials through design, production, and qualification of parts for Marine Corps applications.  This research area also includes advanced technology demonstrations that predict vehicle health and prognostics of remaining useful life for military ground vehicles and equipment in support of Condition Based Maintenance (CBM) goals, while seeking to automate CBM practices through automatic data retrieval and algorithm development.    \n\nThe activity also will demonstrate the military utility of enhancing combat capability by increasing energy production, storage, distribution, and curbing energy consumption of the individual Marine and other tactical assets. This includes advanced system research into the scaled use of high specific power solar cell for Marine Corps applications ranging from the individual warfighter to augmenting the power and combat endurance unmanned robotic vehicles. Additionally investigated, system level research and demonstration of enhanced power and energy technologies to support the Marine warfighter as a system, to include enhanced power and energy storage technology, more energy efficient equipment, and enhanced power networks that enhance mission duration, decrease combat load, and enhance combat performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.837"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.837"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Logistics development will focus on the broad range of technologies to demonstrate the military utility of enhancing combat capability by increasing energy production, storage, distribution, and curbing energy consumption of the individual Marine and other tactical assets. This includes advanced system research into the scaled use of high specific power solar cell for Marine Corps applications ranging from the individual warfighter to augmenting the power and combat endurance unmanned robotic vehicles. Additionally investigate, system level research and demonstration of enhanced power and energy technologies to support the Marine warfighter as a system, to include enhanced power and energy storage technology, more energy efficient equipment, and enhanced power networks that enhance mission duration, decrease combat load, and enhance combat performance.  Research into friction stir welding and additive friction stir welding, and cold spray for structural repair of Marine Corps equipment will be completed."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is associated with completion of research into friction stir welding, additive friction stir welding, and cold spray for structural repair of Marine Corps equipment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANEUVER"
                                    },
                                    "Description": {
                                        "val": "This activity investigates new ways and means to land forces and material through contested sea-land surface interfaces and then conduct maneuver warfare. In order to enable future Amphibious Operations, research efforts will support autonomous operations across the sea-surf-ground environment, improved fuel efficiency and speed of amphibious vehicles, amphibious vehicle technologies, water performance, and amphibious payloads to change the dynamics of a surface amphibious assault. This includes the emergence manned-unmanned teaming and autonomous vehicle collaboration. \n\nThe technologies included in this work address areas of mobility, materials, propulsion, signature reduction, modularity, and unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.896"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of fuel efficiency and battlefield power systems for improved performance.\n- Continue survivability improvements and technologies to mitigate acceleration and traumatic brain injuries to occupants to enhance tactical mobility and survivability.\n- Continue advanced suspension systems development with ride height adjustment, ride quality adjustment, rollover prevention, and load equalizing systems for USMC tactical wheeled platforms to enhance tactical mobility in support of Distributed Operations.\n- Continue a survivability\/active protection systems improvement effort to increase effectiveness of defeat (Pdefeat) of shoulder launched RPG type threats and ATGM threats on light platforms utilizing non-kinetic kill technologies.\n- Continue efforts evaluating the current ground fleet platforms for their mobility and control capabilities as they relate to inclusion of an autonomous vehicle capability that will provide support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continue efforts to demonstrate integrated armor solutions that provide lighter weight armor materials with\n- Continue the development of autonomy technologies and system concepts that will enable unmanned ground vehicles (UGVs) to be used as autonomous logistic connector vehicles.\n- Continue the development of fuel saving vehicle technologies, including advanced transmission, power train, and electrical power system technologies.\n- Continue mobility technologies that enable improved vehicle\/warfighter agility and stability.\n- Continue lightweight armor, material, and structural technologies that enable maneuver and survivability of small, light expeditionary platforms.\n- Continue survivability technologies that enable defeat of all unitary and tandem RPG and select ATGM threats, and the demonstration of survivable vehicles.\n- Continue the development of technologies that enable vehicle component modularity and reduce life cycle costs.\n- Continue development of a Combat S&T Vehicle demonstrator to enhance crew survivability and vehicle fuel efficiency.\n- Continue new mobility efforts for On-Board Vehicle Power to increase mobile exportable power for Diesel Electric Propulsion Concepts and a Fuels effort to investigate future fuel alternatives for internal combustion engines to include Fischer-Tropsch and coal gasification processes for use in military tactical wheeled vehicles.\n- Continue Maneuver Enabling Technologies such as Vehicle Stabilization to improve vehicle suspension and control technologies to stabilize the platforms themselves to improve ride quality, shoot on the move capability and human systems integration.\n- Continue the development of autonomous perception technologies to enable operations under adverse atmospheric conditions.\n- Continue programs to address and enhance maneuver capability gaps in mobility such as efforts, transitioned from 6.2, aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Complete development of a vehicle demonstrator that focuses on enhanced crew survivability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Plans include development and evaluation of mobility technologies and future concepts for the ground and amphibious fleet to improve maneuverability across a range of challenging terrain environments.  Work will emphasize experimentation with autonomy approaches through both simulation and live events for amphibious vehicles from small low cost craft, traditional amphibious combat and assault vehicles, and landing craft. Additional focus will be on integrating real time precepts with learned information, a priori knowledge, and contextual understanding to facilitate informed autonomous decision making.  There will be demonstration and experimentation with systems that enable intelligent planning, reasoning, learning, and control to affect tactically appropriate autonomous behaviors in littoral and urban environments.  In addition efforts will be pursued in component technology and prototypes for future advanced manned expeditionary ground vehicles and amphibians."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.526"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.526"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Plans include research and evaluation of advanced technologies for full combat systems.  Demonstrator platforms will be developed that integrate novel propulsion, mobility, and autonomous technologies to enable enhanced land operations and seamless transition between land and water environments.  The automation and autonomy systems developed will concentrate on the surf-zone and beach operations and include work to include development of unmanned swarming amphibious assault craft."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 is associated with development of new maneuver technologies to enhance the mobility, agility, signature, and warfighting capabilities of advanced combat vehicles, including unmanned swarming amphibious assault craft."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPEDITIONARY CYBER"
                                    },
                                    "Description": {
                                        "val": "This activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.180"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiate a USMC Expeditionary Cyber Advanced Technology Activity addressing Cyber at the Tactical edge.\n- Initiate RF-enabled cyber payloads.\n- Initiate low SWAP distributed precision time transfer.\n- Initiate cognitive authentication."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.475"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Expeditionary Cyber portfolio focuses heavily on the development and integration of multiple underlying technologies into subsystems and system demonstrations supporting experimentation. The Expeditionary Cyber portfolio is also closely coordinated with the Command, Control, Communications and Computers research portfolio also described herein to efficiently exploit co-design opportunities and shorten development times needed to keep pace in an environment rapidly driven by Moore's Law.  Battle damage assessment technologies are integrated into system sensor technologies to prove efficacy in an increased Technology Readiness Levels application in cyber experimentation.  Cyber experimentation will be performed on an autonomous system operating in a test range. Novel resilient cyber components and architectures integrated into a multi-function cyber Electronic Warfare system will be demonstrated in a realistic Electro-Magnetic environment measuring performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The plans and associated programs contained in this activity and Project 2958 are realigned from the Marine Corps ATD Project 2223 in PE 0603640M Marine Corps Advanced Technology Demonstrations beginning in FY 2020. The FY 2020 increase will initiate a concerted research effort to develop a rapid testing tool of major C2 and weapon systems addressed in NDAA 1647. Adversaries are finding vulnerabilities in our systems faster than our acquisition cycle can patch them. This effort is to provide acquisition sponsors and operational planners a method to identify and project vulnerabilities and impacts within computing systems and networks as well as an operational assessment measure to determine how to proactively address these issues and maximize projection power."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this PE is the development of technologies to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2297"
                    },
                    "ProjectTitle": {
                        "val": "Futures Directorate"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "58.354"
                        },
                        "CurrentYear": {
                            "val": "46.830"
                        },
                        "BudgetYearOne": {
                            "val": "73.046"
                        },
                        "BudgetYearOneBase": {
                            "val": "73.046"
                        },
                        "BudgetYearTwo": {
                            "val": "65.781"
                        },
                        "BudgetYearThree": {
                            "val": "67.116"
                        },
                        "BudgetYearFour": {
                            "val": "68.427"
                        },
                        "BudgetYearFive": {
                            "val": "69.796"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "As a subordinate organization under the Deputy Commandant, Combat Development and Integration (DC, CD&I), the mission of the Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) is to identify future challenges and opportunities, develop warfighting concepts, and comprehensively explore options in order to inform the combat development process to meet the challenges of the future operating environment.  DC, CD&I is designated as the United States Marine Corps (USMC) Advocate for Science and Technology (S&T).  MCWL's Commanding General (CG) is the DC, CD&I designated Proponent of USMC S&T and serves as the USMC Executive Agent for Marine Corps S&T.  The MCWL\/FD also serves as the Marine Corps' liaison to the Joint Staff for Joint Concept Development and Experimentation; thereby facilitating service-specific experiments as well as participation in joint service experimentation.  \n\nThe current MCWL\/FD Campaign Plan addresses how the Naval Services must reshape their capabilities in order to meet the concepts and Concepts of Operations (CONOPS) called for in the Secretary of the Navy's \"Cooperative Strategy 21\" and the Marine Corps' capstone Marine Operating Concept (MOC), according to the objectives of the Commandant of the Marine Corps' guidance to develop the future Marine Corps Force 2025.  Execution of the MCWL\/FD Campaign Plan results in recommendations to Marine Corps advocates and proponents so that they may more cohesively and logically structure the future Navy and Marine Corps team.  In support of the Marine Corps' role to provide an ever-ready quick strike force to protect US interests, MCWL\/FD pursues concepts and new capabilities focused on the Marine Air-Ground Task Force (MAGTF).  The MAGTF is the Marine Corps' doctrinal, task organized, force deployment package.  It consists of four elements: the Command Element that provides overarching Command and Control  of the entire force; the Ground Combat Element normally built around a core infantry unit with supporting armor, artillery, and other ground units; the Aviation Combat Element which provides aircraft, air defense, and other aviation functions; and the Logistics Combat Element which consists of Combat Service Support  elements including medical, supply, and transportation.  Marine Corps Force 2025 also seeks to maximize the employment of electronic, information, and cyber warfare, as well as manned\/unmanned teaming, within each element of the MAGTF.  MCWL\/FD also examines future enhancements in training, organization, and equipment.  MCWL\/FD accomplishes its mission through five subordinate Divisions:  \n\nFutures Assessment Division's mission is to:  research, examine, and describe plausible future security environments 15 to 30 years into the future.  Knowledge of these future security environments will provide an estimate of possible future threats, challenges, and opportunities, to include:  the rise of possible partners and adversaries, emerging disruptive technologies, and likely sources of conflict.  This work is largely accomplished through research, seminar participation, and coordination with various experts in academia, the intelligence community, and think tanks. \n\nThe mission of Concepts and Plans Division is to:  examine select future security environments, emerging warfighting opportunities and challenges, and Naval warfare and joint\/coalition integration and capabilities, in order to develop Marine Corps Service concepts and CONOPS to promote development of the emergent Marine Corps force.  CAP is responsible for the production of formally published concepts, CONOPS, and options for future force organization and posture that describe how the Marine Corps will operate and fight.\n\nWargaming Division conducts formal wargames to frame emerging warfighting concepts, establish the Joint context for the Marine Corps Force Development System, and identify opportunities for development of experimental and non-experimental capabilities. \n\nExperiment Division conducts live force concept-based experimentation to facilitate exploration of prototype and surrogate technologies, as well as Tactics, Techniques, and Procedures (TTPs), in order to better refine equipment requirements and to identify Doctrine, Organization, Training, Materiel, Leadership, Personnel, and Facilities (DOTMLPF) initiatives needed to produce future capabilities.  \n\nScience and Technology (S&T) Division conducts investigations and assessments to identify, modify where appropriate, and evaluate technological capabilities that support advanced warfighting concepts, and to explore the military utility of promising new commercial or government technologies in support of urgent and compelling needs.  MCWL\/FD investigates the relevance to MOC-prescribed capabilities and gaps of advanced technologies according to the following Thrust Areas:  Command, Control, Communications, and Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR); Autonomy and Robotics; MAGTF Fires; Maneuver; Expeditionary Logistics (to include Expeditionary Energy); Expeditionary Medicine; Cyber and Electronic Warfare (EW); and Force Protection. \n\nThis project is organized into 6 activities, the core of which are represented by the Warfighting Capability Areas of the MAGTF.  The project emphasizes development and demonstration of advanced technology capability concepts, and the examination of their operational application and military utility in the context of live-force field experimentation with Marines.  This operational experimentation directly supports Marine Corps combat development to inform future capability requirements and optimize the acquisition process."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMBAT SERVICE SUPPORT (CSS) AND FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity includes Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) Combat Service Support and force protection experimentation efforts including assessment of equipment, new Tactics, Techniques, and Procedures, training programs, and proposed organizational changes associated with enhanced capabilities.  This area provides seabasing, expeditionary logistics, urban combat, and expeditionary medicine experimentation support.  Although this category covers a few small (less than $500K per FY) efforts being pursued by MCWL\/FD, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact.  Investments in this activity may be conducted under the Thrust Areas of Expeditionary Logistics, Expeditionary Medicine, Force Protection, or Autonomy and Robotics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.206"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue assessment of unmanned ground logistics delivery technologies that support infantry small unit operations. \n- Continue testing and assessment of logistics enablers in support of EF21 experimentation.\n- Continue assessment and experimentation with technologies that provide enhanced medical care over a distributed battlefield, to include \"virtual\" care and the use of autonomous systems in support of medical evacuation over ground, surface (water), or air. \n- Continue evaluation and assessment of emerging technologies that support energy demand reduction. \n- Continue investigation and assessment of logistics related emerging autonomous air delivery technologies and capabilities that further enhance current Programs of Record (PORs) and influence future planning and decision making. \n- Continue evaluation and experimentation with technologies that can identify, neutralize, or destroy unmanned systems (aerial, ground, or surface).\n- Continue assessment and experimentation to understand the relevance of autonomy to ship to shore surface connectors. \n- Continue assessments and experimentation with advanced technologies to enable standoff detection of IEDs.\n- Continue development and assessment of enhanced seabased medical capabilities in support of the MAGTF.\n- Continue all efforts of FY 2017, less those noted as complete above. \n- Complete evaluation and assessment of emerging technologies that support energy demand reduction. \n- Complete research and assessment of advanced manufacturing techniques to determine military utility in expeditionary environments. \n- Initiate assessments and experimentation in order to provide logistics common operational picture for commanders and logistics planners across the area of operations.  \n- Initiate assessments and experimentation on technologies which will either mask signatures generated by MAGTF elements across the signature spectrum (seismic, aural, electronic, visual) or will enable the MAGTF to deceive adversaries as to the true friendly locations.\n- Initiate integration and USMC experimentation of DARPA-developed technology for a full scale, modular, VTOL multi-mission UAS platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.142"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop prototypes and experiment with logistics enablers in support of dismounted operations and the Expeditionary Force-21 concept.  This includes completing assessment and experimentation to understand the relevance of autonomy to ship to shore surface connectors to focus on development and experimentation with afloat and forward-deployed metal adaptive manufacturing.  Continue to explore technologies and methodologies that reduce resource consumption and enhance sustainability of the distributed units.  Pursue investigations and experimentation with independent, conditioned, reliable power sources to dismounted and\/or distributed forces operating in austere conditions.  Wrap-up assessments and experimentation in order to provide logistics common operational picture for commanders and logistics planners across the area of operations.  Continue to develop and study technologies that enhance unit survivability; to include various aspects of critical care and medical related protocols and processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.447"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.447"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop prototypes and experiment with logistics enablers and air defense enhancements in support of Expeditionary Advanced Base Operations (EABO) and Littoral Operations in a Contested Environment (LOCE) as prescribed by the Marine Operating Concept (MOC). This includes development and experimentation with autonomous sea-based surface connectors for over-the-horizon missions during ship-to-shore maneuvers. Experiment with efficient and redundant hybrid energy platforms providing reliable electrical power using multiple fuel input sources. Develop a highly mobile and efficient hybrid power generation and storage capability that provides the flexibility to operate with a variety of energy sources in support of EABO. Effort includes developing a modular design combining JP-8 fuel cell, solar, battery and energy scavenging technologies. Integrate hybrid\/electric capabilities within the MAGTF to experiment with alternative vehicle power, extended mobility, and logistics demand reduction functions; building Concepts of Operations (CONOPS) and TTPs for tactical mobility utilizing electric\/hybrid power as a fuel source. Improve ground maneuver force and critical installation defense against small unmanned aerial systems (UASs). Effort includes development of new counter UAS architectures, integration of new sensors for detection and tracking, and development of new counter-UAS defeat mechanisms. Develop, test, and evaluate autonomous\/automated aerial platforms for logistics resupply. Develop and experiment with highly autonomous and synchronous logistics capabilities in support of expeditionary MAGTF operations, offering increased flexibility and speed to Marines by means of seamless, end to-end logistics chain management and execution. Effort includes air, sea, and ground based systems, providing tactical commanders with an organic, responsive, and flexible option(s) to support disbursed and semi-independent maneuver operations. Develop an autonomous explosive detection and defeat capability. Continue to develop and experiment with medical technologies that enhance survivability; includes power management and energy scavenging capabilities which will enable more effective casualty warming and blood storage\/distribution. Integrate and experiment with systems to provide battlefield medical command and control and information management."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY19 to FY20 is directly attributable to the development and enhancement of capabilities to provide a hybrid logistics design to a more distributed technologically advanced force and increase range and effectiveness of the Marine Corps Air-Ground Task Force (MAGTF) against airborne threats. Funding supports the Commandant of the Marine Corps' (CMC's) priorities of Logistics Transformation and Air Defense."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE AIR-GROUND TASK FORCE (MAGTF) COMMAND, CONTROL, COMMUNICATIONS, AND COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity encompasses all Marine Corps Warfighting Laboratory\/Futures Directorate (MCWL\/FD) Command, Control, Communications, and Computers (C4) experimentation efforts including assessment of equipment, new Tactics, Techniques, and Procedures (TTPs), training programs, and proposed organizational changes associated with enhanced C4 capabilities. The area provides cutting edge\/enhanced Over-The-Horizon (OTH), Beyond Line of Sight (BLOS), satellite and non-satellite based C4 capabilities to support experimentation.  Although this category covers a few small (less than $500K per FY) efforts being pursued by MCWL\/FD, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact.  Investments in this activity will be conducted under the Thrust Areas of Command, Control, Communications, and Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Cyber\/Electronic Warfare (Cyber\/EW)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development and assessment of systems that permit unmanned aerial system (UAS) operations in a global positioning system (GPS) denied environment. \n- Continue development and assessment of a configurable C2 suite that enhances operations from aviation platforms in support of EF21 experimentation. \n- Continue investigations and assessment of technologies that support C2 enablers for shore deployed MAGTF elements that is platform agnostic and capable of deployment from the sea, air, or ground. \n- Continue evaluation and experimentation with emerging technologies that support future maritime C2 capabilities\/EF21. \n- Continue assessment and experimentation with integration and interoperability of software applications to increase the situational awareness, lethality, and survivability of distributed tactical ground formations.\n- Complete development and assessment of a MAGTF network management system. \n- Continue exploration, development, and experimentation of cyber\/EW capabilities at the tactical level, to enable tactical operators to sense, visualize, and exploit the cyber\/EW environment.\n- Continue development and experimentation that enable seamless operations in a technology denied environment.\n- Complete development and assessment of a configurable C2 suite that enhances operations from aviation platforms in support of Expeditionary Force 21 (EF21) experimentation. \n- Initiate development and experimentation with new technologies for radio frequency (RF) signature reduction.  \n- Initiate development and experimentation with enhanced\/consolidated, MAGTF insert-able, and seamless over-the-horizon (OTH), on-the-move (OTM), and at-the-halt (ATH) communications capabilities which will support missions without pre-planned coverage areas.  \n- Initiate development and experimentation with mission management capabilities (to be used by mounted and dismounted ground forces) that include sensor processing and exploitation, multi-sensor integration and control, multi-platform coordination, and situational awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.614"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to identify and assess a collaborative solution that provides tailorable Over-the-Horizon (OTH), On-the-Move (OTM) communications, situational awareness, and fires for the forward deployed Marine Air-Ground Task Force (MAGTF) to include Digital Integration (DI).  Experiment with a BLOS, OTH, OTM voice, data, and position location information network in an Expeditionary Force 21 (EF-21) environment.  Continue to research an organic and persistent capability to receive, process, and disseminate digital information wirelessly to dismounted users and dismounted operations (operations conducted on foot).  Conclude development and assessment of systems that permit Unmanned Aerial System (UAS) operations in a Global Positioning System (GPS) denied environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research to identify and assess a collaborative solution that provides tailorable Over-the-Horizon (OTH), On-the-Move (OTM),  and Beyond Line of Sight (BLOS) communications, situational awareness, and fires for units across a wide spectrum of air, ground, and sea operations. Experiment with an organic and persistent capability to wirelessly receive, process, and disseminate digital information from organic sensors (to dismounted users), with relevant and\/or immediately actionable information.  This is done while simultaneously enabling BLOS digital connectivity to both higher and adjacent units (supporting dismounted operations). Effort will enable BLOS digital connectivity to higher and adjacent units. Initiate efforts to automate the identification of targets and expedite the sharing of information between sensors, shooters, and approval authority. Integrate electronic warfare technologies (ground and airborne sensors) and cyber space warfare technologies into demonstrations and live-force experiments to inform requirements and develop Tactics, Techniques, and Procedures (TTPs) for use by operational forces. Experiment with a cyber mission execution framework enabling military commanders, planners, and operators to collaborate, understand, plan, and manage cyber operations in real-time against large-scale and dynamic network environments. Initiate cyber and communications infrastructure common operational picture tactics and procedures for situational awareness and coordination of battlefield effects. Experiment with worldwide social media mapping. This technology will enable real-time situational awareness of the information environment (IO), including content and location of social media users. Open IO technology will provide Marines at the tactical edge with alerts using civilian and adversary open source communications. Provide units at the tactical edge IO situational awareness, planning, and command and control tools to include measures of effectiveness."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY19 to FY20 is directly attributable to the development and enhancement of capabilities to communicate, shoot, and move in a degraded environment; increasing situational awareness and influencing decision making. Funding supports the Commandant of the Marine Corps' (CMC's) priorities of Command and Control and Information Warfare."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIRES, TARGETING, AND MANEUVER"
                                    },
                                    "Description": {
                                        "val": "This activity includes Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) experimentation efforts in the areas of fires, targeting, and maneuver including assessment of equipment, new  Tactics, Techniques, and Procedures (TTPs), training programs, and proposed organizational changes associated with enhanced capabilities.  This area increases fires, targeting, and maneuver related troop environmental awareness, lethality, and mobility using fused sensors as well as unmanned weaponized and reconnaissance air and ground vehicle platforms to support experimentation. Although this category covers a few small (less than $500K per FY) efforts being pursued by MCWL\/FD, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. Investments in this activity will be conducted under the Thrust Areas of Marine Air-Ground Task Force (MAGTF) Fires, Maneuver, and Autonomy and Robotics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development and assessment of weaponized unmanned ground robotic systems. \n- Continue development of technologies that enhance the utility of autonomous systems. \n- Continue research, development, and experimentation with weapons and other ground combat systems that enhance the combat effectiveness of small units operating in the urban littorals.   \n- Continue investigation of innovative technologies to enhance squad-level capabilities. \n- Continue assessment and experimentation into the utility of robotic systems as platforms to support target acquisition and designation. \n- Continue assessment of the expeditionary utility of autonomous swarming technologies for unmanned air and ground systems. \n- Initiate assessment and experimentation with a suite of robust, responsive, and accurate munitions that will provide the small tactical unit with a capability to engage threat targets beyond engagement of current line-of-sight or indirect fire weapons in complex environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.029"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies, demonstrate, and experiment with robotic systems organic to an infantry company for intelligence collection, indirect fires, direct fires and breaching capabilities.  Complete assessment of the expeditionary utility of autonomous swarming technologies for unmanned air and ground systems.  Pursue company level precision guided munitions.  Initiate efforts to provide a missile system with a real-time wireless data link to provide lethal beyond line of sight fires (sea-land and land-land) against static and moving targets in the urban littoral environment.  Automate robotic control systems\/software to reduce the burden of control and increase manned and unmanned teaming.  Initiate and complete investigations into battery configuration and ruggedization as well as associated battery-driven gearbox of an amphibious electric all-terrain vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.174"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.174"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide a multi-purposed Unmanned Ground Vehicle (UGV) which hosts a government-owned modular payload architecture and provides the ability to rapidly modify payloads for a variety of missions across the MAGTF. In concert, evaluate various payloads that enhance dismounted unit abilities across the warfighting functions. Continue to pursue company level precision guided munitions to increase responsiveness, survivability, and lethality to the ground combat element. Specifics include development of: a multi-tubed launcher integrated with a UGV and the ability to remotely launch Unmanned Aerial Systems (UASs) from distributed positions. Experiment with a multi-purpose, electro-optical missile system with a real-time wireless data link for ranges up to 25km; operated in either direct attack or mid-course navigation based on target coordinates. The system has the ability to carry a heat, fragmentation, or anti-armor payload and can be integrated with a variety of sea, air, and land platforms. Initiate pursuit into a recoverable, long-range reconnaissance and precision strike asset with lethal capability against armored targets. Facilitate the integration of a small UAS with the identification, engagement, assessment, and adjustment of indirect fires for an individual Marine operating with an indirect fire weapon. Increase lethality of ground forces through rapid design iteration and testing of small UASs (sUASs), including advanced sensors and warheads. Experimentation efforts will include integration of critical payloads for immediate use and will enable earlier force training. Assess potential solutions to identified marksmanship capability gaps. Ensure the availability of Utility Task Vehicles (UTVs) for integration, testing, assessment throughout the experimentation cycle. Pursue technologies to dramatically increase the range and lethality of the MAGTF using a Low-Cost Unmanned Aerial Vehicle (UAV) with integrated swarming technology to create a Lethal Miniature Aerial Munition (LMAM). Experiment with loitering munitions launched from a variety of platforms (air, ground, and sea). Conduct swarming follow-on efforts to develop distributed, cognitive, collaborative, and cooperative swarming behaviors for maximum effect and complexity on target. Investigate Naval Surface Missile (NSM) simulators for experimentation of weapons system and integration with naval system queuing. NSM simulator systems will be used to exercise the NSM coastal defense system in coordination with Naval target sensing and tasking, allowing Naval vessels to queue and task NSM launch."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY19 to FY20 is directly attributable to the development and enhancement of capabilities to increase range and precision of indirect fires and enhance maneuver at sea with sustained mobility ashore. Funding supports the Commandant of the Marine Corps' (CMC's) priorities of long range precision fires and protected mobility."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE AIR-GROUND TASK FORCE (MAGTF)  INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity includes Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) Intelligence, Surveillance and Reconnaissance (ISR) related experimentation efforts including assessment of equipment, new tactics, techniques, and procedures (TTPs), training programs, and proposed organizational changes associated with enhanced ISR capabilities. Using a variety of fused sensors to mesh data, video, and images and incorporating a common tactical controller to operate multiple air and ground ISR platforms, this area enhances small unit situational awareness as well as exploitation and forward engagement ability via experimentation.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL\/FD, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. Investments in this activity will be conducted under the Thrust Areas of Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Autonomy and Robotics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.414"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development and assessment of seabased and landing force ISR capabilities that enable EF21 experimentation. \n- Continue development, integration, and assessment of technologies to fuse multiple sensor payloads into a single user interface to enable utility for tactical operators.\n- Continue examination and assessment of technologies that support future employment of UAS operations from seabased platforms.\n- Continue assessment and experimentation with integration and interoperability of software applications to increase the situational awareness, lethality, and survivability of distributed tactical ground formations.\n- Initiate development and assessment of technologies that reduce tactical surprise by providing a self\/air deployable UAS capable of dashing ahead of MV-22 aircraft to conduct final reconnaissance of objective area to update threat situation in route to objective area.\n- Initiate development and assessment of an expeditionary drone deployment system (in order to automate UAS ground handling, control, launch, and recovery) to enable mission-level tasking and untrained operations of a fleet of small UAS.\n- Initiate investigations on employment concepts for information operations at the tactical level, including an assessment of technological developmental requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.376"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to increase situational awareness of battlespace in order to defend against and repel enemy attacks in those domains at the company and lower echelons.  Assess systems to combine sensor and telemetry data from multiple unmanned platforms (ground, surface (water), and air) in order to provide a more relevant and usable tactical picture.  Initiate efforts to provide a small, lightweight, semi-autonomous system that can self-navigate structure interiors while simultaneously visibly inspecting and creating real-time three-dimensional (3D) maps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Expand development of government-owned Unmanned Aerial Systems (UAS) architecture to allow for rapid design iterations in support of experimentation. Effort will continue to provide situational awareness of the battlespace, incorporating payloads that improve navigation and allow for multi-mode sensors. Experiment with enabling technologies to combine sensor and telemetry data from multiple unmanned platforms (ground, surface (water), and air); minimizing operator intervention over current systems, with the ability to react in a wide range of operational tasks, environmental conditions, and landscapes. Continue to develop a capability to display and control a myriad of unmanned platforms and sensor inputs in a fused network on a common controller for Intelligence, Surveillance and Reconnaissance (ISR) as well as target identification and prosecution. Initiate experimentation with an autonomous reconnaissance system, improving threat situational awareness and reducing tactical surprise to assault forces on long range missions. Initiate an effort to receive, transmit, and fuse joint asset specialized sensor information to communications nodes afloat and ashore via an aerial gateway. Expand investigations to add a Mission-Configurable Software Defined Radio with an Electronically Steerable Array (ESA) to the currently developed communication pod. Missions will include, but not be limited to, Early Warning radar, Cueing radar and\/or Electro-magnetic Spectrum Operations. Effort will utilize Artificial Intelligence (AI) software to fuse sensor information in order to generate track information on-board the pod and then push it to both terrestrial communications nodes and directly to aircraft. Seek to provide a multi-role, long reach, expeditionary, next generation network of ISR capabilities. This includes the enhancement of capabilities for multi-sensor collection, fusion and real-time transmission; multi-electro-magnetic spectrum operations; C4 network bridge and relay; escort and protection for assault forces; persistent and precision fires and targeting; integration of an early warning air defense network; and informing assault support."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY19 to FY20 funding increase is directly attributable to the development and enhancement of capabilities to increase situational awareness and influence decision making. Funding supports the Commandant of the Marine Corps' (CMC's) priority of Command and Control. Notably, this increase includes $15M to pursue Phase II of efforts initiated to receive, transmit, and fuse joint asset specialized sensor information to communications nodes afloat and ashore via an aerial gateway."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE CORPS WARFIGHTING LABORATORY \/ FUTURES DIRECTORATE (MCWL\/FD) OPERATIONS (SUPPORT)"
                                    },
                                    "Description": {
                                        "val": "Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) Operations (Support) efforts include overall MCWL\/FD experimentation doctrine, planning, analysis, data collection, as well as technology transition tracking efforts.  This area provides overarching experimentation doctrine, planning, management, technical\/engineering support, analysis, data collection, and reporting.  Programs listed below are considered major (valued at $500K or more) or have near real-time operational impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.029"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to synthesize results and lessons learned into proposed DOTMLPF recommendations for the Marine Corps. \n- Continue to provide technical, strategic, and managerial support to Marine Corps experimentation. \n- Continue to provide overall analysis and reporting of experimentation efforts, analytical assistance during experiment design, and maintenance of an ad-hoc analysis capability.\n- Continue deliberate broad-based commercial technology forecasting in support of experimentation long-range planning and combat development. \n- Continue technical, strategic, and managerial support for operations with advanced technology utilizing autonomy, robotics, and cyber capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.420"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide encompassing experimentation doctrine, planning, analysis, and data collection in order to conduct relevant enactments and report on experimentation results.  Look to the future and identify up and coming (cutting edge) technology areas of interest.  Provide generalized as well as specific program engineering, technical, and management support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.087"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.087"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "MCWL\/FD will elicit a broad range of unique analytical expertise to evaluate experiments in various warfighting areas. Design experimentation plans, collect data during experiments, perform reconstruction and analysis of experiments, and prepare experiment analysis reports. Identify global commercial technology trends\/innovations and disruptive technologies which may impact future Marine Corps capabilities. Expand upon generalized as well as specific program level engineering, technical, and management support. In addition, technical program area management capability increased. Initiate investigations into development of a narrow Artificial Intelligence (AI) capability which is capable of automating data collection to assist in tracking and decision making regarding technology based programs of interest."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY19 to FY20 is due to initiating an automated data collection effort to assist in tracking technology-based programs of interest in support of portfolio decision-making."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WARFIGHTING EXCELLENCE"
                                    },
                                    "Description": {
                                        "val": "This activity includes Marine Corps Warfighting Laboratory \/ Futures Directorate (MCWL\/FD) efforts in the development and assessment of joint and service warfighting concepts, joint and service missions, analysis of emerging threats and opportunities, and joint capability experimentation.  It also includes MCWL\/FD service experimentation in areas that impact multiple warfighting functions.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL\/FD, most programs listed below are considered major (valued at $500K or more) or have near-real-time operational impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.066"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued executive agent responsibilities for the Marine Corps Title Ten (X) Wargame, Expeditionary Warrior, as well as the Joint and other service Title X programs, such as the United States Army's Unified Quest, the Air Force's Unified Engagement and Futures wargame, and the Navy Global wargame.  Title X war games address future capabilities in the context of Title X readiness responsibilities. \n- Continued management and oversight of non-Title X Wargaming, including the highly visible Office of the Secretary of Defense Net Assessment Transformation War Game series and the Special Operations Command wargaming series. \n- Continued to support the core Center for Emerging Threats and Opportunities (CETO) mission to:  provide broad-based technical and analytical support for Marine Corps combat development and experimentation programs at the component, Service, and Joint levels.  This support includes the full spectrum of combat development-related missions and tasks to include the assessment of plausible future security environments and the identification of future threats, adversaries, opportunities, technologies, strategic settings, and associated geographic, environmental, economic, and demographic conditions in order to inform the development of innovative warfighting concepts, CONOPS, and capabilities across the DOTMLPF spectrum.  Serve as a catalyst to stimulate thought and debate on issues of importance to the Marine Corps. \n- Continued funding contributions to Joint Concept Technology Demonstrations (JCTDs) and Emerging Capability Technology Demonstrations (ECTDs) (formerly known as Advanced Concept Technology Demonstrations (ACTDs)).  Both JCTDs and ECTDs are intended to rapidly field needed capabilities by using emergent mature technologies matched with innovative operational concepts.\n- Complete development and assessment of modeling and simulation hardware, software, and training capabilities that support planning\/experimentation processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support the combat development process by helping to develop and refine emerging concepts, conceptualize force design, and identify future capabilities and deficiencies within future operating environments. This is accomplished by means of enhancing current functional capabilities by investigations into Next Generation Wargaming tools as well as conducting extensive wargaming as an augmentation to live force experimentation. Efforts include 11 planned wargames (4 large, 5 medium, and 2 small) with areas of interest covering Expeditionary Force-21 (EF21) related concepts.  Focusing 15 to 30 years in the future, continue to offer top level identification and analysis of emerging asymmetric threats and opportunities.  This is accomplished by capitalizing on a myriad of foresight assessments of future operating environments.  Continue to develop, assess, and provide insight into joint efforts and warfighting concepts. Specific areas of investment include: 1) Demonstrating the military utility of a resilient, low-cost, effective, high-altitude balloon-borne communications platform that can be rapidly deployed to enhance warfighter communication capabilities and 2) Informing the development of distributed mobile amphibious (and ground) assault fuel logistics capabilities as well as demonstrating the feasibility of executing the concept in support of a \"fight tonight\" scenario using current fleet assets, by adapting current naval practices. Initiate investigations into candidate technologies that support urban operations, in an effort to identify\/eliminate capability gaps and develop TTPs to include subterranean maneuver. This is an attempt to: 1) Develop a 5th generation force capable of ship to shore movement against a peer adversary, enabling distributed maneuver at varied distances and 2) Develop a 6th generation force capable of dominating the urban environment. The concepts: 1) Explore innovative delivery systems to augment current ability to maneuver troops, effects, and materiel from ship to shore in contested environments and 2) Involve integration by engineers and scientists with planners and operators to identify key capability concept  areas for development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Aid the combat development process by conducting 11 core wargames. Focus areas include Marine Operating Concept (MOC) supported Expeditionary Advanced Base Operations (EABO) and Littoral Operations in a Contested Environment (LOCE). Create an effective collaborative wargaming environment that will increase the use of automated and analytical tools, and will provide the necessary quantitative and qualitative output for Marine Corps capability\/concept development. Coordinate with the Marine Corps Systems Command's (MCSC's) Wargaming Center of Excellence to provide an encompassing wargaming ability throughout the Marine Corps. Focusing 15 to 30 years in the future, continue to offer top level identification and analysis of emerging asymmetric threats and opportunities. This is accomplished by capitalizing on a myriad of foresight assessments of future operating environments. Maintain insight and continue making contributions to support approved Joint Concept Technology Demonstrations (JCTDs) and Emerging Capability Technology Demonstrations (ECTDs) efforts and warfighting concepts; intended to provide rapidly fieldable capabilities by using emergent mature technologies matched with innovative operational concepts. This includes furthering demonstrations with a high-altitude balloon-borne communications platform and continuing development efforts of distributed mobile amphibious (and ground) assault fuel logistics capabilities. The communications platform effort involves demonstrating and experimenting with the military utility of a resilient, low cost, effective, high-altitude balloon-borne communications platform that can be rapidly deployed to enhance warfighter communications capabilities. The fuel logistics efforts include demonstration and experimentation to build the concept of employment as well as tactics, techniques, and procedures (TTPs) for inflatable, scalable, double-walled fuel storage, transport, and transfer systems for bulk fuel logistics.  Continue in the conduct of a multi-year effort to enhance situational awareness; Command and Control (C2); and fires and maneuver in the dense urban environment. Conduct experimentation events to identify changes in training, organizing, and equipping future forces and provide venues for live-force evaluation and assessment. Bring concept developers, operational Subject Matter Experts (SMEs), and technologists together in order to discover, purchase, and assess new and advanced technologies that can aid in the implementation and refinement of the Expeditionary Advanced Base (EAB) concept. Additionally, by exposing technology and acquisition professionals to the concept, future development can be guided. Explore the use of modeling and simulation tools and techniques to gather, process, analysis, and utilize operational data in support of experiment development, execution, and assessment. Capitalizing on an OSD 2 year investment, provide organic, experimental opposition force capability (Red Team, Red Cell and Live Adversary Force). This will assist in providing a more realistic, adaptive, and cohesive enemy force\/civil infrastructure for wargames, command post exercises, simulations, and experimentation events in order to support free-play, friendly force adaptation and decision-making skills."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY19 to FY20 increase is due to expanded investments into: coordinated efforts to enhance wargaming capabilities, participation in joint rapidly fieldable efforts, and testing\/experimentation with new technologies identified to enhance the Expeditionary Advanced Base Operation (EAB) concept. In addition, the increase in funding is due to the initiation of providing an organic, experimental opposition force capability to augment live-force experimentation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this Project is the development, demonstration, and assessment of technologies that represent capabilities to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare in the future.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2958"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Activities"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "4.474"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.474"
                        },
                        "BudgetYearTwo": {
                            "val": "4.476"
                        },
                        "BudgetYearThree": {
                            "val": "4.477"
                        },
                        "BudgetYearFour": {
                            "val": "4.566"
                        },
                        "BudgetYearFive": {
                            "val": "4.657"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The plans and associated programs contained in this Project are realigned from the Expeditionary CYBER Project 2223 in PE 0603640M MC ADVANCED TECHNOLOGY DEMO beginning in FY 2020."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Cyber"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.474"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.474"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cyber related demonstrations and experimentations will be conducted to verify the secure transfer of information across mobile tactical user platforms. Controlled demonstrations will be conducted to assess battle damage on a class of systems from the use of cyber effects. Demonstrations of cyber hardened operational systems will be conducted to showcase improved resiliency. Software redesign of modular Cyber\/Electronic Warfare systems will be demonstrated as a proof of concept prototype. Initiate research to develop a rapid testing tool of major C2 and weapon systems to provide acquisition sponsors and operational planners a method to identify and project vulnerabilities and impacts within computing systems and networks as well as an operational assessment measures to determine how to proactively address these issues and maximize projection power."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY20 increase will initiate a concerted research effort to develop a rapid testing tool of major C2 and weapon systems addressed in NDAA 1647. Adversaries are finding vulnerabilities in our systems faster than our acquisition cycle can patch them. This effort is to provide acquisition sponsors and operational planners a method to identify and project vulnerabilities and impacts within computing systems and networks as well as an operational assessment measures to determine how to proactively address these issues and maximize projection power.  The plans and associated programs contained in this activity and Project 2958 are realigned from the Marine Corps ATD Project 2223 in PE 0603640M Marine Corps Advanced Technology Demonstrations beginning in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this Project is the development, demonstration, and assessment of technologies that represent capabilities to meet unique Marine Corps needs in conducting Expeditionary Cyber Warfare in the future.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.071"
                        },
                        "CurrentYear": {
                            "val": "27.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "39.071"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.071"
                                        },
                                        "Text": {
                                            "val": "Research conducted under this Project includes advanced technology programs sponsored and managed from both the Office of Naval Research (ONR) and the Marine Corps Warfighting Laboratory\/Futures Directorate (MCWL\/FD).\n\nONR is funding the development and demonstration of a variant of the 81mm Advanced Capability Extended Range Mortar (ACERM) with improved size, weight, power and cost (SWAP-C) through the insertion of an optimized actuator.  The ACERM technology enhances the mission effectiveness of USMC infantry forces through a significant increase in maximum range, while providing a first round on target capability against both stationary and moving targets while minimizing the relative increase in unit cost.  In addition, the development of a Cannon Delivered Area Effects Munition (CDAEM) payload will be developed for the 155mm Moving Target Artillery Round (MTAR).  The capability will greatly enhance the USMC's ability to effectively engage area targets to destroy, neutralize, and\/or suppress threat platforms and facilities, and deny threat forces full operational freedom within the targeted area when there is a lack of precise target location, as is often the case with moving forces, counter fire missions, or when threat forces employ battlefield obscurants.\n\nMCWL\/FD is sponsoring experiments to determine the military utility of small tactical autonomous unmanned ground vehicle systems to support logistics, fires and maneuver.  Funds support the development and demonstration of tactical ground robotic vehicle systems as well as autonomy and perception algorithms utilizing a common ground control system.  The capability will greatly enhance the tactical effectiveness, survivability, and lethality of tactical infantry formations in close combat operating environments."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Common Unmanned Aerial Vehicle Simulation System"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Develop technology for mission simulation to help reduce the development cycle time of UAVs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Motion Simulator and Testing of UAVs"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "6.000"
                                        },
                                        "Text": {
                                            "val": "Conduct research using computer simulation sensor modeling and actuator modeling in real-time with UAV hardware and software."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Advanced Armed Robotic System 2.0"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "MCWL\/FD continues to explore the military utility of small tactical autonomous unmanned ground vehicle systems to support logistics, fires and maneuver. FY19 funds include investment to develop fully autonomous operation, utilizing a common controller and Command and Control (C2) data links."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UAS Air-Delivered Extended Range Munitions Demo"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.000"
                                        },
                                        "Text": {
                                            "val": "Conduct research for technology maturation and testing of a full cartridge level solution prototype extended range guided projectile for an airborne platform. This proposed effort will develop and integrate enabling technologies with  81mm and 120mm extended mortar cartridges for launch from an airborne platform rather than ground launch from a mortar tube."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}