{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-66",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605100D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Mission Environment Test Capability (JMETC)"
        },
        "R1LineNumber": {
            "val": "148"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "190.108"
            },
            "PriorYear": {
                "val": "90.326"
            },
            "CurrentYear": {
                "val": "88.184"
            },
            "BudgetYearOne": {
                "val": "83.091"
            },
            "BudgetYearOneBase": {
                "val": "83.091"
            },
            "BudgetYearTwo": {
                "val": "79.125"
            },
            "BudgetYearThree": {
                "val": "80.181"
            },
            "BudgetYearFour": {
                "val": "84.532"
            },
            "BudgetYearFive": {
                "val": "85.762"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Mission Environment Test Capability (JMETC) program provides a Department of Defense (DoD) enterprise-wide test capability to support system-to-system interoperability testing, mission-level environment testing, and cyber event operations, including cyber testing, cyber training, cyber experimentation, and cyber mission rehearsal.  The JMETC program implements the infrastructure capabilities defined in the DoD “Testing in a Joint Environment Roadmap” to provide acquisition program managers a robust nation-wide capability to “test like we fight.”  The JMETC program provides a persistent, distributed test and evaluation (T&E) capability that supports system development to measure and improve interoperability performance and cyber resiliency, which otherwise would not be readily available to Service\/Component acquisition programs.  The JMETC program is funded within the Research, Development, Test and Evaluation (RDT&E) Management Support Budget Activity because it provides test capability in support of RDT&E programs.  By linking distributed facilities, as well as providing the necessary tools, services and subject matter expertise, the JMETC program allows acquisition programs to efficiently evaluate their warfighting capability in a realistic joint mission environment.  The JMETC Program has been aligned to advance the National Defense Strategy (NDS), to test the development of resilient, survivable, federated networks and information ecosystems from the tactical level up to strategic planning, as well as test and assess cyber defenses, building a more lethal force."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "91.057"
                },
                "CurrentYear": {
                    "val": "84.184"
                },
                "BudgetYearOne": {
                    "val": "83.091"
                },
                "BudgetYearOneBase": {
                    "val": "83.091"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "90.326"
                },
                "CurrentYear": {
                    "val": "88.184"
                },
                "BudgetYearOne": {
                    "val": "83.091"
                },
                "BudgetYearOneBase": {
                    "val": "83.091"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.731"
                },
                "CurrentYear": {
                    "val": "4.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "4.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.731"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY2019: Congressional add of +$4M provided in Department of Defense Appropriation Bill (P.L. 115-245) accommodates a program increase, to include funding for cyber range capability and development. All additional funds included in Project 088 Joint Mission Environment Test Capability National Cyber Range (NCR) Complex."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "087"
                    },
                    "ProjectTitle": {
                        "val": "JMETC Distributed Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "120.306"
                        },
                        "PriorYear": {
                            "val": "58.154"
                        },
                        "CurrentYear": {
                            "val": "16.558"
                        },
                        "BudgetYearOne": {
                            "val": "15.157"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.157"
                        },
                        "BudgetYearTwo": {
                            "val": "14.819"
                        },
                        "BudgetYearThree": {
                            "val": "15.279"
                        },
                        "BudgetYearFour": {
                            "val": "15.950"
                        },
                        "BudgetYearFive": {
                            "val": "16.402"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The JMETC distributed test mission is to provide the persistent and reusable enterprise T&E infrastructure necessary for effectively conducting Joint, interoperability, and system integration RDT&E on DoD warfighting capabilities.  Building the required agile, multi-organizational test infrastructure to assess system-to-system interoperability, effectiveness, and resiliency is cost prohibitive for any single acquisition program.  The JMETC Distributed Test capability reduces the cost to plan, setup, and execute these complex tests by delivering an enterprise-wide capability that incorporates persistent connectivity, common integration software for linking sites and live-virtual-constructive (LVC) test resources, accredited test tools, cybersecurity support, and distributed T&E expertise into a robust, operationally representative T&E mission environment.  The JMETC Distributed Test project also provides its customers a support team to assist with JMETC capabilities and the execution of distributed test events.  The JMETC Distributed Test project has also begun the task of modernizing DoD T&E knowledge management by introducing big data analytics tools and techniques as part of its enterprise capabilities.  The JMETC Distributed Test project builds, maintains, and operates the JMETC infrastructure and pays for persistent availability of national connectivity for testing; data communications middleware; development of interface standards; common software tools and components; and a reuse repository.  The JMETC Distributed Test project also provides program management, facilities, equipment, operating costs, and special studies and analysis related to distributed test capabilities and infrastructure.  Ultimately, the JMETC Distributed Test project supports and advances experimentation, system engineering, acquisition, testing, training, and mission planning, aligned to the National Defense Strategy to build a more lethal force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JMETC Distributed Test"
                                    },
                                    "Description": {
                                        "val": "- The JMETC Distributed Test project expanded the JMETC Secret Network (JSN) infrastructure to 82 functional sites.\n\n- The JMETC Distributed Test project supported DoD distributed test and training events to include: system interoperability certification; system interoperability assessments; command and control systems; air and missile defense; 5th Generation Aircraft; unmanned aircraft; precision-guided bombs; munitions; missile tracking and guidance; infrared countermeasures; Joint Fires; Joint Close Air Support; and coalition exercises.\n\n- The JMETC Distributed Test project provided test planning support to users and organizations to conduct interoperability testing on numerous DoD systems including: command and control systems; information warfare; air and missile defense; intelligence, surveillance, and sensor systems; surface ships; anti-surface warfare; anti-submarine warfare; tactical radar systems; precision-guided bombs; unmanned aircraft; autonomous aircraft; manned fixed wing aircraft; helicopters; and business systems.\n\n- The JMETC Distributed Test project provided strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter.\n\n- The JMETC Distributed Test project assisted customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures.  In addition, the JMETC team provided on-site support for the execution of large-scale, complex distributed events.\n\n- The JMETC Distributed Test project created a Data Architecture Reference Document (ARD) and investment roadmap that codifies needs and resource requirements for adopting an enterprise approach to T&E Knowledge Management and Big Data Analytics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "58.154"
                                            },
                                            "Text": {
                                                "val": "- Increase cyber test and training capacity. Acquire additional storage capacity for existing RSDPs and implement a central library for reusable Red, Blue and Gray environments.  Initiate development of a NSA approved Type-1 encryption capability to secure data at rest in a Multiple Independent Levels of Security (MILS) architecture. Complete full automated sanitization capability to allow for unconstrained cyber activities to be conducted on the RSDPs.\n\n- Continue to provide distributed interoperability and cyber test and training support for major customer events such as the F-35 Joint Strike Fighter, Small Diameter Bomb II tests, MQ-4C Triton testing, JIAMDO project testing, MDA cybersecurity tests, Joint Interoperability Test Command JITS, Air Force AGILE Fire, NAVAIR Integrated Warfare Capability (IWC) test events, NAVSEA DIIAC, Marine Corps Virtual Rapid Prototyping Laboratory (VRPL) experiments, PM IW Development and Operations (DevOps), Air Force AFSIT, DIIAC certification tests, Cyber Flag, Cyber Guard, Red Flag, and numerous other test and training activities.\n\n- Continue planning support to new and on-going acquisition programs including: F-35, SDB II, JUPITER, Advanced Anti-Radiation Guided Missile (AARGM), MQ-4C Triton, P-8A Poseidon, UCLASS, CAC2S, TacMobile, IPPS-A, CRH, CH-47, LCS, G\/ATOR, AH-64, DCGS and several others.\n\n- Continue strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cyber security as part of their Survivability KPP requirements.\n\n- Continue to assist customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures. Continue providing remote and on-site support for the planning and execution of distributed events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.558"
                                            },
                                            "Text": {
                                                "val": "- The JMETC Distributed Test project will continue to optimize the JMETC Secret Network (JSN) infrastructure to meet requirements, adding an additional 8 sites.\n\n- The JMETC Distributed Test project will continue supporting DoD distributed test and training events to include: system interoperability certification; system interoperability assessments; command and control systems; air and missile defense; 5th Generation Aircraft; unmanned aircraft; precision-guided bombs; munitions; missile tracking and guidance; infrared countermeasures; Joint Fires; Joint Close Air Support; and coalition exercises.\n\n- The JMETC Distributed Test project will continue providing test planning support to users and organizations to conduct interoperability testing on numerous DoD systems including: command and control systems; information warfare; air and missile defense; intelligence, surveillance, and sensor systems; surface ships; anti-surface warfare; anti-submarine warfare; tactical radar systems; precision-guided bombs; unmanned aircraft; autonomous aircraft; manned fixed wing aircraft; helicopters; and business systems.\n\n- The JMETC Distributed Test project will continue to assist customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures.  In addition, the JMETC team will provide on-site support for the execution of large-scale, complex distributed events.\n\n- The JMETC Distributed Test project will expand post-test enterprise service capabilities, to include as Knowledge Management and Big Data Analytics tools and technologies, in support of JMETC customer needs and requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.157"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.157"
                                            },
                                            "Text": {
                                                "val": "- The JMETC Distributed Test project will continue to optimize the JMETC Secret Network (JSN) infrastructure to meet requirements, adding or removing sites as necessary. \n\n- The JMETC Distributed Test project will continue supporting DoD distributed test and training events to include: system interoperability certification; system interoperability assessments; command and control systems; air and missile defense; 5th Generation Aircraft; unmanned aircraft; precision-guided bombs; munitions; missile tracking and guidance; infrared countermeasures; Joint Fires; Joint Close Air Support; and coalition exercises.\n\n- The JMETC Distributed Test project will continue providing test planning support to users and organizations to conduct interoperability testing on numerous DoD systems including: command and control systems; information warfare; air and missile defense; intelligence, surveillance, and sensor systems; surface ships; anti-surface warfare; anti-submarine warfare; tactical radar systems; precision-guided bombs; unmanned aircraft; autonomous aircraft; manned fixed wing aircraft; helicopters; and business systems.\n\n- The JMETC Distributed Test project will continue to assist customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures.  In addition, the JMETC team will provide on-site support for the execution of large-scale, complex distributed events.\n\n- The JMETC Distributed Test project will expand post-test enterprise service capabilities, to include as Knowledge Management and Big Data Analytics tools and technologies, in support of JMETC customer needs and requirements.\n\n- The JMETC Distributed Test project will support to new and emerging acquisition programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Number of distributed test sites\n- Number of events conducted\n- Number of acquisition programs supported\n- Number of downloads from JMETC Repository"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "088"
                    },
                    "ProjectTitle": {
                        "val": "JMETC National Cyber Range (NCR) Complex"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "69.802"
                        },
                        "PriorYear": {
                            "val": "10.000"
                        },
                        "CurrentYear": {
                            "val": "71.626"
                        },
                        "BudgetYearOne": {
                            "val": "67.934"
                        },
                        "BudgetYearOneBase": {
                            "val": "67.934"
                        },
                        "BudgetYearTwo": {
                            "val": "64.306"
                        },
                        "BudgetYearThree": {
                            "val": "64.902"
                        },
                        "BudgetYearFour": {
                            "val": "68.582"
                        },
                        "BudgetYearFive": {
                            "val": "69.360"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The National Cyber Range Complex (NCRC) is comprised of cyber ranges and a secure distributed network infrastructure to service the cyber range user community.  The NCRC currently consists of five functional cyber ranges, including the National Cyber Range in Florida as well as four Regional Service Delivery Points (RSDP) located in Hawaii, Alabama, Maryland, and Massachusetts.  To enhance DoD cyber range test and training capability and capacity, the NCRC is being expanded with additional cyber ranges co-located with key Service organizations to support an increase of cyber testing of DoD systems as well as training of cyber warfighters.  The JMETC Multiple Independent Level of Security (MILS) Network (JMN) currently links 58 sites across the DoD, industry, and academia, providing secure access between cyber ranges, laboratories, and facilities.  Both the cyber ranges and the network infrastructure are accredited to support multiple levels of security classifications, specifically configured to meet particular cyber event requirements.  The NCRC investments have been aligned to support the National Defense Strategy in improving cyber defense, cyber resilience, and the continued integration of cyber capabilities into the full spectrum of military operations.\n\nThe NCRC conducts cyberspace test and training events for the full spectrum of DoD customers including research, development, acquisition, testing, training and operational Cyber Mission Forces (CMF).  The NCRC executes wide variety of event types including science and technology (S&T) demonstrations, developmental test and evaluation (DT&E), operational test and evaluation (OT&E), security controls assessments, cyberspace operations training, refinement of cyberspace tactics, techniques, and procedures (TTP) Development, forensics\/malware analysis) and cyberspace operations mission rehearsal.  The NCRC enables acquisition programs to conduct cybersecurity test and evaluation in an operationally representative cyberspace environment enabling identification, validation and mitigation of vulnerabilities.  The NCRC also supports training, mission rehearsal and certification of the CMF in support of US Cyber Command by enabling operational forces to efficiently evaluate cyber warfighting capability in a realistic joint mission environment.\n\nThe NCRC provides secure facilities, technology, processes, and workforce to rapidly create hi-fidelity, mission-representative friendly, neutral, and adversarial cyberspace environments.  \nThe NCRC also facilitates integration of distributed organizations with different missions and workforce relevant to cyber operations (e.g., cyber operators, penetrations testers, cyber assessors, cyber observers, cyber analysts, etc.).  The NCRC supports cyber activities across of a full spectrum of DoD systems, including weapon platforms, C4I systems, business systems, network devices, and other systems vulnerable to a cyber-attack.  The NCRC extensively utilizes automation to minimize human error, to reduce the time required to set-up for a cyber event, and to ensure repeatable results.  In addition, the NCRC employs post-event sanitization techniques on all assets after exposure to malicious code to restore back to a known, clean state, which allows for reuse in future events.  \n\nThe NCRC has a multidisciplinary workforce with software, systems, network, virtualization, automation, system administration, and cybersecurity subject matter expertise.  In support of successful planning and execution of hosted events, the NCRC workforce helps users define and refine their event objectives, assists with identifying and prioritizing potential vulnerabilities, designs virtualized cyber environments, develops customized traffic generation and instrumentation solutions, integrates 3rd party hardware and software, executes cyber events on behalf of the user, provides cooperative vulnerability and penetration assessments, performs detailed cyber analysis, and delivers detailed reports on the results.  In addition, the NCRC workforce supports both the Executive Agent for Cyber Test Ranges and the Executive Agent for Cyber Training Ranges, to identify and address relevant needs, define and promulgate standards, and seek efficiencies through focused investments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JMETC National Cyber Range (NCR) Complex"
                                    },
                                    "Description": {
                                        "val": "- The NCRC supported hundreds to cyber events, providing cybersecurity T&E support to Major Defense Acquisition Programs (MDAP), Major Automated Information Systems (MAIS) Acquisition Programs, and smaller acquisition programs.\n\n- The NCRC supported cyber testing of systems and subsystems relevant to manned and unmanned aircraft, surface ships, command and control systems, data management platforms, weapons platforms, satellites, radars, and missile defense systems.\n\n- The NCRC supported Service Cyber Mission Forces (CMF) with training, certification, mission rehearsal and TTP development focused events.\n\n- The NCRC supported numerous DoD organizations in cyber activities, including US Cyber Command; Joint Staff J-7; Director, Operational Test & Evaluation (DOT&E); Director, Developmental Test & Evaluation (DT&E); Army PEO Command Control Communications Tactical (PEO C3T); Naval Air Systems Command (NAVAIR); Space and Naval Warfare Systems Command (SPAWAR); Naval Sea Systems Command (NAVSEA); PEO Ships; Air Force Space and Missile Command; Army Intelligence and Information Warfare Directorate; Office of Naval Intelligence; Marine Corps Tactical Systems Support Activity; the Army Communications and Electronics Research, Development and Engineering Command (CERDEC); and several partner nations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "- Increased funding will be used to execute events at a steadily increasing OPTEMPO to support 8 concurrent events.  The NCR will conduct engineering activities to plan for technical refresh of emerging end of life and end of service computing assets.  The NCR will modify the NCR Test Specification Tool Suite to streamline operations and make them interoperable with other cyber ranges\n\n- NCR will begin to build out additional dedicated Persistent Testing and Training Environments to support testing and training customers.\n\n- The NCR will continue to provide support for USCC Training and Certification Events by developing blue, red and gray environments for including Cyber Flag and multiple Cyber Knight and Cyber Guard Events. NCR will support to the JS-J6\/DOT&E sponsored Enterprise Cyber Range Environment events as appropriate.\n\n- The NCR expansion will develop detailed plans for NCR expansion, including at Aberdeen Proving Ground, MD; Patuxent River Naval Air Station, MD; Space and Naval Warfare Systems, Charleston, SC; Eglin Air Force Base (AFB), FL; and Program Executive Officer for Simulation, Training, and Instrumentation (PEO-STRI), Orlando, FL.\n\n- NCR will continue to support Contingency Operations as requested by US Cyber Command."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "71.626"
                                            },
                                            "Text": {
                                                "val": "- The NCRC will continue to implement improvements needed to increase capacity and support increased demand at the current cyber ranges. \n\n- The NCRC will continue to build out additional dedicated Persistent Testing and Training Environments to support testing and training customers.\n\n- The NCRC will continue to operate in support of the growing acquisition program cybersecurity T&E requirements.  \n\n- The NCRC will continue to provide Cyber Table Top support for acquisition programs to help assess and address cyber security as early as possible in development.\n\n- The NCRC will continue to provide support to US Cyber Command, Joint Staff, and other training and certification events by developing representative blue, red and gray environments.\n\n- The NCRC will continue to support DOT&E cyber assessments.\n\n- The NCRC will continue to support US Cyber Command cyber activities.\n\n- The NCRC will continue to expand testing of Industrial Control Systems and Avionics Systems test beds.\n\n- The NCRC will increase capacity by establishing additional cyber ranges in support of both cyber T&E and training requirements.\n\n- The NCRC will conduct engineering activities to plan for technical refresh of emerging end of life and end of service computing assets.\n\n- The NCRC will continue to assess cyber range requirements in close cooperation with the Executive Agents for Cyber Test Ranges and Cyber Training Ranges to build priority cyber range capability and capacity to meet identified RDT&E community and CMF needs.\n\n- The NCRC will continue analyses of capability to determine requirements and standards needed to join these cyber test facilities with existing acquisition system hardware-in-the-loop, software-in-the-loop, and systems integration laboratories to test systems in a realistic cyber contested environment.\n\n- The NCRC will continue to expand the JMN connectivity as needed to provide access to cyber range resources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "67.934"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "67.934"
                                            },
                                            "Text": {
                                                "val": "- The NCRC will continue to implement improvements needed to increase capacity and support increased demand at the current cyber ranges. \n\n- The NCRC will continue to build out additional dedicated Persistent Testing and Training Environments to support testing and training customers.\n\n- The NCRC will continue to operate in support of the growing acquisition program cybersecurity T&E requirements.  \n\n- The NCRC will continue to provide Cyber Table Top support for acquisition programs to help assess and address cyber security as early as possible in development.\n\n- The NCRC will continue to provide support to US Cyber Command, Joint Staff, and other training and certification events by developing representative blue, red and gray environments.\n\n- The NCRC will continue to support DOT&E cyber assessments.   \n\n- The NCRC will continue to support US Cyber Command cyber activities.\n\n- The NCRC will increase capacity by establishing additional cyber ranges in support of both cyber T&E and training requirements.\n\n- The NCRC will conduct engineering activities to plan for technical refresh of emerging end of life and end of service computing assets.\n\n- The NCRC will continue to assess cyber range requirements in close cooperation with the Executive Agents for Cyber Test Ranges and Cyber Training Ranges to build priority cyber range capability and capacity to meet identified RDT&E community and CMF needs.\n\n- The NCRC will continue analyses of capability to determine requirements and standards needed to join these cyber test facilities with existing acquisition system hardware-in-the-loop, software-in-the-loop, and systems integration laboratories to test systems in a realistic cyber contested environment.\n\n- The NCRC will continue to expand the JMN connectivity as needed to provide access to cyber range resources."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Amount of increase in computing power\n- Number of events capable of supporting\n- Number of cyber ranges available"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "100"
                    },
                    "ProjectTitle": {
                        "val": "JMETC"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.172"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Mission Environment Test Capability (JMETC) program provides a Department of Defense (DoD) enterprise-wide test capability to support system-to-system\ninteroperability testing, mission-level environment testing, and cyber event operations, including cyber testing, cyber training, cyber experimentation, and cyber mission\nrehearsal. The JMETC program implements the infrastructure capabilities defined in the DoD “Testing in a Joint Environment Roadmap” to provide acquisition program\nmanagers a robust nation-wide capability to “test like we fight.” The JMETC program provides a persistent, distributed test and evaluation (T&E) capability that supports\nsystem development to measure and improve interoperability performance and cyber resiliency, which otherwise would not be readily available to Service\/Component\nacquisition programs. The JMETC program is funded within the Research, Development, Test and Evaluation (RDT&E) Management Support Budget Activity because\nit provides test capability in support of RDT&E programs. By linking distributed facilities, as well as providing the necessary tools, services and subject matter expertise,\nthe JMETC program allows acquisition programs to efficiently evaluate their warfighting capability in a realistic joint mission environment. The JMETC Program has\nbeen aligned to advance the National Defense Strategy (NDS), to test the development of resilient, survivable, federated networks and information ecosystems from the\ntactical level up to strategic planning, as well as test and assess cyber defenses, building a more lethal force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JMETC"
                                    },
                                    "Description": {
                                        "val": "Due to the ever increasing cyber test requirements, the JMETC Program developed a strategy to expand cyber test range capabilities. The cyber test range expansion is being implemented in Project 88 in FY 2019. To ease the ability to track and monitor cyber test infrastructure investments, the JMETC projects were realigned and consolidated under Project 88: JMETC National Cyber Range (NCR) Complex."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.172"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Activities realigned under Project 88: JMETC National Cyber Range (NCR) Complex. All cyber activites within the JMETC Program being executed under Project 88 in FY 2019."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Activities realigned under Project 88: JMETC National Cyber Range (NCR) Complex."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Activities realigned under Project 88: JMETC National Cyber Range (NCR) Complex."
                        },
                        "PerformanceMetrics": {
                            "val": "Activities realigned under Project 88: JMETC National Cyber Range (NCR) Complex."
                        }
                    }
                }
            ]
        }
    }
}