{
    "id": "2020-TheJointStaff-PB-0400-MJBOOK-0-10-20c9efcf6d605b32d3d5f083f831185effe1f78c53559fcdc9809c2a22add379-5",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0804767J"
        },
        "ProgramElementTitle": {
            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA"
        },
        "R1LineNumber": {
            "val": "190"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "44.500"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "For FY 2019 and beyond data, please see PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
        },
        "ProgramElementMissionDescription": {
            "val": "These programs support readiness of the joint force by creating a joint training environment to replicate the complex and changing operational environment.  These investments directly support defense strategic guidance and enhance joint warfighting readiness by building training capabilities that support the operational readiness of the force.  The elements associated with this coordinated effort consist of:\n\n- Joint National Training Capability (JNTC)\n\n- Joint Simulation System (JSS)\n\n- Joint Knowledge Development & Distribution Capability (JKDDC)\n\n- Air Force JNTC\n\n- Navy JNTC\n\nJNTC:  The mission of the Joint National Training Capability program is to advance joint capabilities and interoperability by concentrating on emerging joint training requirements through training experiences using a managed set of globally distributed capabilities and activities. The program resources Service and Special Operations Forces joint training that improves interoperability and realism of tactical and operational joint training between the Services and USSOCOM. JNTC enables joint training for Combatant Commands and Services by developing relevant joint training content and ensuring global distributed access. JNTC enabling capabilities support the Services and USSOCOM in their requirement to provide trained and ready forces in support of Combatant Command operational requirements. This program focuses efforts on improving, rather than consuming readiness and creating a ready surge force consistent with Chairman’s guidance.\n\nJSS:  The Joint Simulation System, consisting of the Joint Theater Level Simulation and the Joint Conflict and Tactical Simulation, provides a low cost, distributed or deployable, web-based joint training capability with a small technical and operator footprint.  JSS funding provides warfighters with joint simulations and tools that enhance and enable joint training across Services, Combatant Commands, Combat Support Agencies, NATO, and multinational partners. The joint simulations and tools provided by JSS funding are critical enablers that support the delivery of trained, capable, and interoperable joint forces.  JSS intent is to maintain a capability to share simulation environments with coalition partners by continuing limited investments ensuring Joint Theater Level Simulation and Joint Conflict and Tactical Simulation remain relevant providing reliable, low-cost, small footprint, distributed, and deployable joint training solutions. \n \nJKDDC:  Joint Knowledge Development & Distribution Capability (JKDDC) Joint Knowledge Online (JKO) is the program of record for online joint training that implements and operationalizes the OSD training transformation JKDDC.  JKO directly supports the CE2T2 program by developing, delivering, tracking, reporting, and supporting online training for Combatant Command exercises; Combatant Command required training; doctrinally based joint operations core curriculum; multinational, coalition, interagency training; OSD required training (externally funded); and administration of the Senior Enlisted Joint Professional Military Education program.  JKO expends RDT&E funding for leading edge technology review, market research, and integration to directly enhance various aspects of the training capability required to support Combatant Commanders, CE2T2 program goals and objectives, and the Chairman's training guidance. JKO satisfies all requirements necessary to provide CE2T2 stakeholders with a distributed learning capability and access to web-based training content, learning resources, and distributed online training tools.\n\nAir Force JNTC:  Air Force JNTC funding provides a focused upgrade to develop models for space-based and cyber capabilities for integration into the Joint Live, Virtual, and Constructive (JLVC) environment. Air Force supports development of cross-domain solutions that enable the integration of systems with disparate security requirements which significantly increases the training audience to additional joint and coalition participants.  Additionally, the Air Force supports the integration of tactical models into the virtual environment.  \n\nNavy JNTC:  These funds enable Navy to develop unique maritime capabilities that integrate JLVC elements into a seamless joint training environment. Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems.  Additionally, the program develops cross-domain architectures for U.S. and coalition forces and ensures sister service modeling\/simulation and instrumentation efforts follow a unified standard."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "44.500"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "44.500"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "SummaryExplanation": {
                "val": "COCOM Exercise Engagement and Training Transformation (CE2T2) transferred to The Joint Staff in FY 2018 in PE 0804767J from 0804767D8Z.  Prior year FY 2017 data will be reported by OSD P&R.\n\nFunding transferred from PE 0804767J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA to PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - Non MHA beginning FY 2019 and out to properly align CE2T2 RDT&E funding to a Non-MHA PE similar to the O&M appropriation.  For FY 2019 and beyond data, please see R-2 for PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "758"
                    },
                    "ProjectTitle": {
                        "val": "Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "32.550"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2) transferred to the Joint Staff in FY 2018 in PE 0804767J from 0804767D8Z.\n\nFor FY 2019 and beyond data, please see PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                        },
                        "ProjectMissionDescription": {
                            "val": "Investment in the Joint National Training Capability (JNTC) program enables Service and Combatant Commands to train as they operate. The funding requested continues to modernize joint training capabilities into a single integrating architecture aligned to DoD Chief Information Officer IT mandates. Funding supports the development of cloud-enabled modular training application services. Program intent is to reduce dependence on touch labor, and mitigate the impact of reductions in operation and sustainment funding. Momentum must be maintained to deliver operationally relevant training environments and respond to changes in global security landscape and the warfighters' operational environment. JNTC enables the Department of Defense to be responsive to the warfighters’ changing operational concepts, threat environments, and best practices. In FY 2018, this investment continues expanding capabilities and access for Service and Combatant Command trainers to plan and execute joint training. Funds support improved relevance and realism of training by providing capabilities that replicate the contemporary and future operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "JNTC provides the technical standards, architecture (blueprint), and development processes required to integrate joint training programs.  The Joint Training Environment (JTE) is envisioned as an integrated network of training sites and nodes with accessible joint training and force development services.  By leveraging existing training programs and initiating programmatic actions, JNTC develops credible opposing force capabilities and expanded access to assets typically unavailable to the training audience. These capabilities enhance the integration of joint training objectives into Service training events.  RDT&E funding supports the technical integration of Joint and Service modeling and simulation training capabilities.  The resulting capabilities enable selective aggregation of training audiences at the Combatant Command, Joint Task Force, and Component Command headquarter levels.  The funding increases warfighter access to semi-automated training enablers within the Joint Training Synthetic Environment through web-based, modular cloud capabilities. \n\nThe Adaptive Training Capability Program (ATCP) is a subordinate component of JNTC that enables the joint force to be responsive to the warfighters’ changing operational concepts, threat environments, and best practices.  ATCP funding advances joint capabilities and interoperability by addressing emerging joint training requirements through a managed set of globally distributed joint live, virtual, and constructive enablers.  ATCP funding promotes joint context to Service training programs and joint enablers supporting Combatant Command training requirements and high interest training issues identified in the Chairman’s annual training guidance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.550"
                                            },
                                            "Text": {
                                                "val": "1. Integrate role player access capability into the Joint Training Tool environment.\n\n2. Continue to mature Joint Training Tool modular services to reach tier 1 and 2 joint training Initial Operating Capability (IOC) in FY 2019.  This includes smart graphics that allow planners to describe an operation with graphics which auto-initiates the Joint Training Tool service modules to replicate the movement of forces, adjudicate interaction with opposing forces, and return results of the operation that can drive a training scenario and stimulate the appropriate decision points.\n \n3. Continue Joint Training Tool scenario development to support a broader range of joint training options.\n\n4. Continue to mature Joint Training Tool cloud capabilities and explore cloud hosting options for the long-term."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from PE 0804767J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA to PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - Non MHA beginning FY 2019 and out to properly align CE2T2 RDT&E funding to a Non-MHA PE similar to the O&M appropriation.  For FY 2019 and beyond data, please see R-2 for PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on the performance metrics. This ensures the joint force trainer capability development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to: access, cost, realism, relevance, and technology and are defined below.\n\nAccess – Develop design standards that enable participation across DoD and, as applicable, with coalition partners. Make the environment available to meet user demands.\n\nCost – Enable the Joint Force Trainer to prepare and execute training more efficiently than current capabilities allow.\n \nRealism – Enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow.\n\nRelevance – Maintain operational relevance through adaptation to the changing operational environment.\n\nTechnology – Sustain the training environment network through developments for distributed home station training that include modular cloud-enabled training services.\n\nMeasures:\n\nCost - Vendors provide ordered hours and projected costs remain within 10 percent of government estimates.\n\nSchedule - Task completions (software enhancements, bug fixes, and cyber security requirements) delivered within six months of government estimate.\n\nPerformance - Product results, outcomes or milestones meet specified requirements and successfully pass more than 80 percent of operational assessment test cases.\n\nDoD Demand - Number of Commands, Services, and Agencies using Joint Staff developed training products.\n\nPartner Nation Demand - Number of partner nations using Joint Staff developed training products."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "761"
                    },
                    "ProjectTitle": {
                        "val": "Joint Simulations Systems (JSS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.103"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2) transferred to the Joint Staff in FY2018 in PE 0804767J from 0804767D8Z.\n\nIn FY 2019, this project is merged with 758: Joint National Training Capability (JNTC)\n\nFor FY 2019 and beyond data, please see PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Simulation System (JSS) will decompose, harvest, and reuse DoD investment in joint simulations to develop cloud-enabled modular services (CEMS), reaching Initial Operating Capability in FY 2016.  JSS will further develop the existing Joint Conflict and Tactical Simulation (JCATS) and Joint Theater Level Simulation (JTLS) to remain relevant and responsive to Combatant Command training requirements as the Joint Training Environment is implemented.  JSS will provide design and development of web-based applications used as services in the cloud-enabled modular environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Simulation System (JSS)"
                                    },
                                    "Description": {
                                        "val": "This effort provides warfighters with joint simulations and tools that enhance and enable joint training across Services, Combatant Commands, agencies and coalition partners.  These joint simulations and tools are part of an overall joint live, virtual, and constructive baseline of training capabilities.  They represent a set of training enablers, and “certified systems” that are interoperable and acceptable for use within the joint training environment.  The joint simulations and tools provided by JSS are critical enablers that support the delivery of trained, capable, and interoperable Joint Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.103"
                                            },
                                            "Text": {
                                                "val": "1. Modernize Joint Theater Level Simulation graphical user interface to take advantage of established open source and commercial enhancements.\n\n2. Modernize Joint Theater Level Simulation after action review capability for more efficient and faster queries and data retrieval.\n\n3. Develop the Joint Theater Level Simulation combat systems prototype into a web-based modular capability in support of the Joint Training Synthetic Environment.\n\n4. Virtualize and eliminate the Joint Theater Level Simulation and Joint Conflict and Tactical Simulation client server architecture in pursuit of a fully web-based service."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from PE 0804767J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA to PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - Non MHA beginning FY 2019 and out to properly align CE2T2 RDT&E funding to a Non-MHA PE similar to the O&M appropriation.  For FY 2019 and beyond data, please see R-2 for PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of joint force trainer capabilities synchronize with warfighter requirements.  Performance metrics include, but are not limited to: time, cost, realism, and fidelity and are defined below.\n\nTime – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more timely than current capabilities allow?\n\nCost – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more efficiently than current capabilities allow?\n\nRealism – Will the effort enable the Joint Force Trainer (subject matter expert) to create a training environment that is closer to the real world environment than current capabilities allow?\n\nFidelity – Will the effort enable the Joint Force Trainer (subject matter expert) to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\nCost - Vendors provide ordered hours and projected costs remain within ten percent of government estimates.\n\nSchedule - Task completions (software enhancements, bug fixes, and cyber security requirements) delivered within six months of government estimate.\n\nPerformance - Product results, outcomes or milestones meet specified requirements and successfully pass more than 80 percent of operational assessment test cases. Joint Theater Level Simulation (JTLS) and Joint Conflict and Tactical Simulation (JCATS) availability of use in support of all training activities remains above 95 percent.\n\nDoD Demand - Number of exercises\/events supported by JTLS and JCATS.\n\nPartner Nation Demand - Number of partner nations using Joint Staff developed training products (active foreign military sales cases)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "769"
                    },
                    "ProjectTitle": {
                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.168"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2) transferred to the Joint Staff in FY2018 in PE 0804767J from 0804767D8Z.\n\nFor FY 2019 and beyond data, please see PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                        },
                        "ProjectMissionDescription": {
                            "val": "Joint Knowledge Online (JKO) is DoD's authoritative source for online joint training.  JKO is a DoD enterprise-wide, Joint individual training toolkit of web-enabled individual and small group training products, services, and enabling training technology.  Products and services are developed in response to OSD program goals, CJCS high interest training issues, Joint Staff training priorities, and JKO stakeholders (Combatant Commands, Services, and Combat Support Agencies, interagency, and multinational) prioritized training requirements.  JKO supports a career-long joint learning continuum, joint professional military education, and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  JKO research and development will improve all components of the joint content management architecture including:  \n\n1. JKO Learning Content Management System (LCMS): Development and enhancement is required to integrate advanced individual and staff training technologies and methodologies with larger scale, collective training exercises, and modernize military training capability with a DoD enterprise-wide online training toolkit. JKO LCMS is necessary to develop, host and deliver JKO courses, track and report students’ progress, completions and survey results more effectively and efficiently. JKO LCMS extends web-based, distributed access to mission-critical joint training requirements. There are currently over 2.7 million registered users of the JKO LCMS.\n\n2. Small Group Scenario Trainer (SGST) desktop modeling and simulation based training: This JKO capability trains and prepares thousands of military and civilian personnel deploying to Combatant Command theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, C\/JTF \"battle staffs\" will be adequately trained, as individuals and as collective staffs, based on SGST development and implementation throughout the joint training enterprise. JKO integration of SGST simulation exercise scenarios and prerequisite JKO courses enable blended learning training support to large-scale, collective training exercises that augment the joint event learning cycle and support  meeting Combatant Commander exercise objectives.\n\n3. JKO mobile application training device development:  Development and enhancements facilitate the global distribution of web-based joint training content on portable, hand-held platforms (cell phones and tablets).  JKO mobile application extends access to training courses and learning resources to personal use of mobile phones and tablets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                                    },
                                    "Description": {
                                        "val": "Joint Knowledge Online (JKO) advance technology initiatives primarily include the JKO Learning Content Management System (LCMS) application, Small Group Scenario Trainer (SGST) desktop modeling, simulation-based training capability, and mobile courseware training applications.  These capabilities increase access to, and facilitate the training and preparation of, hundreds of thousands of military and civilian personnel deploying to Combatant Command (CCMD) theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets.  JKO LCMS development and enhancements are required to develop, host, deliver, track, report and support students’ completions, progress and survey results more effectively and efficiently.  C\/JTF “battle staffs” will be better trained, as individuals and as staffs, based on SGST development and implementation throughout the joint training enterprise.  JKO mobile courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for DoD personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.168"
                                            },
                                            "Text": {
                                                "val": "1. Develop, test and deliver two JKO Learning Content Management System (LCMS) releases resulting in improved cybersecurity, and a more effective and efficient online training management application that is interoperable with DoD personnel management systems.  Requirements will be derived from CCMD user feedback and DoD training priorities directed by the Deputy Assistant Secretary of Defense for Readiness and the Chairman’s training guidance. The objectives are to provide a DoD enterprise-wide online training toolkit, and develop content for pre-exercise training and support (as required by the Services) and support individual and unit training for Special Purpose - Marine Air Ground Task Force missions.  JKO anticipates these enhancements will improve access and the ease of use for the projected ~50,000 daily log-ins and ~550,000 monthly course completions by DoD personnel.  Improvements to the JKO LCMS will directly benefit thousands of individuals by providing them global 24\/7 access to mandatory joint training as they prepare to participate in CCMD exercises and real world missions. JKO will also focus on enhancements to improve the management of individuals’ training records and readiness reporting by extending information sharing and web services with DoD personnel management systems.  \n\n2. Develop, test, and deliver four JKO Small Group Scenario Trainer (SGST) desktop modeling and simulation application releases resulting in a more effective and efficient training capability integrated within the JKO Learning Content Management System (LCMS).  JKO anticipates these enhancements will improve the quality of the training experience for CCMD exercise participants resulting in heightened preparedness for real world operations.  The SGST will be used as part of the OSD-endorsed blended learning training component in approximately eight CCMD collective training exercises to prepare individuals serving on CCMD required small functional teams and C\/JTF \"battle staffs.\"  \n\n3. JKO will assess, refine, and continue executing its comprehensive plan to enhance the JKO mobile application and mobile training products. JKO’s planned components include courseware and video conversions to portable hand-held devices while leveraging other DoD agencies, interagency, and multinational training courseware ported to the JKO mobile application. JKO anticipates the development and conversion of ~200 training courses, eBooks, podcasts, job aids, and videos resulting in reduced cost for classroom training and thousands of hours delivered on demand to DoD personnel mobile platforms worldwide."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from PE 0804767J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA to PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - Non MHA beginning FY 2019 and out to properly align CE2T2 RDT&E funding to a Non-MHA PE similar to the O&M appropriation. For FY 2019 and beyond data, please see R-2 for PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Staff prescribed performance metrics include, but are not limited to: time, cost, realism, and fidelity and are defined below:\n\nTime – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more timely than current capabilities allow?\n\nCost – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more efficiently than current capabilities allow?\n\nRealism – Will the effort enable the Joint Force Trainer (subject matter expert) to create a training environment that is closer to the real world environment than current capabilities allow? \n\nFidelity – Will the effort enable the Joint Force Trainer (subject matter expert) to create more detailed capabilities in the training environment than current capabilities allow? \n\nMeasures:\n\nIdentify, develop, test and implement 15 or more cyber-security, operational, and functional JKO LCMS requirements.  \n\nIdentify, develop, test and implement 12 or more cyber-security, operational, and functional JKO SGST requirements.\n\nIdentify, develop, test and implement six or more cyber-security, operational, and functional JKO mobile App requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "701"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.964"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2) transferred to the Joint Staff in FY2018 in PE 0804767J from 0804767D8Z.\n\nFor FY 2019 and beyond data, please see PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force JNTC funding provides a focused upgrade to develop models of space-based capabilities for integration into the joint live, virtual, and constructive environment.  The Air Force supports development of cross-domain solutions that enable the integration of systems with disparate security requirements which significantly increases the training audience to joint and coalition participants."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Force Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Air Force continues to develop joint enablers that drive realistic\/effective training by producing a deployable Electronic Warfare training capability for Europe which replicates highly advanced surface-to-air missiles and advanced anti-aircraft artillery threats for U.S. and coalition forces.  Additionally, Air Force assists in the engineering, development, and deployment of joint cross-domain information sharing enterprise network architecture which enables joint and coalition participants to train while protecting classified information.  Furthermore, the Air Force is creating cyber-contested environments in the distributed mission operations setting to challenge the joint exercise\/training audience.  Finally, comprehensive space effects are being integrated into the JLVC federation of models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.964"
                                            },
                                            "Text": {
                                                "val": "1. Live, virtual, and constructive - operational training solution supporting collaborative planning, cost, after-action, and return on investment metrics.\n\n2. Cyber simulator environment generator and \"blue\" cyber effects simulation.\n\n3. Space simulation improvements to model both space effects and opposition force capabilities affecting the space environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from PE 0804767J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA to PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - Non MHA beginning FY 2019 and out to properly align CE2T2 RDT&E funding to a Non-MHA PE similar to the O&M appropriation.  For FY 2019 and beyond data, please see R-2 for PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of Joint Force Trainer (subject matter expert) capabilities synchronized with warfighter requirements.  Performance metrics include, but are not limited to: time, cost, realism, and fidelity and are defined below.\n\nTime – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more timely than current capabilities allow?\n\nCost – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more efficiently than current capabilities allow?\n\nRealism – Will the effort enable the Joint Force Trainer (subject matter expert) to create a training environment that is closer to the real world environment than current capabilities allow?\n\nFidelity – Will the effort enable the Joint Force Trainer (subject matter expert) to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures : \n\nCyber: Establish a persistent simulation environment that can be configured rapidly and accurately to reflect the desired operating environment of the training audience.  Also, create an ability to reflect cyber activities against a live integrated air defense system.\n\nSpace: A fully operational GPS environment which allows space operators to actively participate in distributed mission operations-Space, live, virtual and constructive missile warning, GPS disruption and infrared special events. Also develop models that model Space as a contested environment to accurately portray impacts of adversary actions in the Space domain.\n\nOPFOR: A prototype for a next generation tactical surface to air threat simulator emulating modern threats fielded with potential adversary maneuver elements. A plan for integrating Army ground instrumentation within the Air Force run Polygon Range complex."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "772"
                    },
                    "ProjectTitle": {
                        "val": "Navy Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.715"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2) transferred to the Joint Staff in FY2018 in PE 0804767J from 0804767D8Z.\n\nFor FY 2019 and beyond data, please see PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                        },
                        "ProjectMissionDescription": {
                            "val": "These funds enable the Navy to develop unique maritime capabilities that integrate joint live, virtual and constructive elements into a seamless joint training environment. The Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems.  Additionally, the program develops cross-domain architectures for U.S. and coalition forces and ensures sister service modeling\/simulation and instrumentation efforts follow a unified standard."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Develops unique maritime capabilities that integrate joint live, virtual, and constructive (JLVC) elements into a seamless joint training environment.  Using a scientific and phased approach that focuses on modeling ground, air, space, and maritime capabilities, this program researches new technologies and methods that provide a crucial technology-based foundation to all JNTC Training Transformation (T2), JLVC Federation, and Combatant Commanders exercise and engagement operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.715"
                                            },
                                            "Text": {
                                                "val": "1. Continue alignment of Navy LVC training standards with JLVC training standards to include integrated standards with USMC’s aviation distributed virtual training environment.\n\n2. Develop integrated capabilities between Navy tactical training ranges and synthetic training capabilities in support of Navy LVC efforts.\n\n3. Accelerate research and development of combat identification training simulation as an enabler for spectrum operations in support of the information warfare commander.\n\n4. Accelerate exploration of technologies to enable integrated air and missile defense and other combined warfare area and joint training with coalition partners in the Pacific Fleet area of responsibility including Japan, Korea, and Australia. \n \n5. Continue collaborative development with Service and agency partners to improve training realism and relevancy for tactical to operational levels of war."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Transition to PE 0804768J"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding transferred from PE 0804767J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA to PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - Non MHA beginning FY 2019 and out to properly align CE2T2 RDT&E funding to a Non-MHA PE similar to the O&M appropriation. For FY 2019 and beyond data, please see R-2 for PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) – Non MHA."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer (subject matter expert) capabilities developed synchronizes with warfighter requirements.  Performance metrics include, but are not limited to: time, money, realism, and fidelity and are defined below.\n\nTime – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more timely than current capabilities allow?\n\nCost – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n\nRealism – Will the effort enable the Joint Force Trainer (subject matter expert) to create a training environment that is closer to the real world environment than current capabilities allow?\n\nFidelity – Will the effort enable the Joint Force Trainer (subject matter expert) to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n\nProduce one Navy Training Baseline (NTB) software release to include documentation.\n\nDesign and implement upgrades to Joint Semi-Automated Forces (JSAF) consistent with approved requirements and contractual requirements.\n\nDocument the effects of JSAF capabilities (robustness) and stability.\n\nDesign, implement, test, and integrate NTB enhancements in accordance with requirements.\n\nContinuously update the common operational picture during large scale JLVC exercises."
                        }
                    }
                }
            ]
        }
    }
}