{
    "id": "2020-Navy-PB-1319-MJBOOK-0-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-8",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602271N"
        },
        "ProgramElementTitle": {
            "val": "Electromagnetic Systems Applied Research"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "83.640"
            },
            "CurrentYear": {
                "val": "76.497"
            },
            "BudgetYearOne": {
                "val": "83.497"
            },
            "BudgetYearOneBase": {
                "val": "83.497"
            },
            "BudgetYearTwo": {
                "val": "83.259"
            },
            "BudgetYearThree": {
                "val": "86.875"
            },
            "BudgetYearFour": {
                "val": "91.575"
            },
            "BudgetYearFive": {
                "val": "93.272"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The activities described in this Program Element (PE) address future Navy and Marine Corps capabilities needed to maintain maritime superiority and ensure national security.  They are based on input from Naval Research Enterprise stakeholders (including the Naval enterprises, the combatant commands, OPNAV and Headquarters Marine Corps) and are designed to exploit breakthroughs in science and technology in order to deliver maximum warfighting benefit to our sailors and marines.  These efforts are aligned with shared priorities throughout the whole of RDT&E in order to quickly advance new capabilities from discovery to deployment across the warfighting domains.\n\nThe Electromagnetic Systems Applied Research Program addresses technology needs associated with Naval platforms for new capabilities in Electro-Optic and Infrared (EO\/IR) Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics. The program supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution. This program directly supports the Department of Defense Joint Warfighter Plan and the Defense Technology Area Plans. Activities and efforts within this Program have attributes that focus on enhancing the affordability of warfighting systems. The program also provides for technology efforts to maintain proactive connectivity and collaboration between Department Of the Navy (DON) Science and Technology (S&T) and Joint, Navy, and Marine Corps commands worldwide.  \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "79.598"
                },
                "CurrentYear": {
                    "val": "83.800"
                },
                "BudgetYearOne": {
                    "val": "81.815"
                },
                "BudgetYearOneBase": {
                    "val": "81.815"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "83.640"
                },
                "CurrentYear": {
                    "val": "76.497"
                },
                "BudgetYearOne": {
                    "val": "83.497"
                },
                "BudgetYearOneBase": {
                    "val": "83.497"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.042"
                },
                "CurrentYear": {
                    "val": "-7.303"
                },
                "BudgetYearOne": {
                    "val": "1.682"
                },
                "BudgetYearOneBase": {
                    "val": "1.682"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.126"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-7.177"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.856"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.682"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.682"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.101"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "6.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The program increase supports increased investment in specialized signal processing engines to leverage machine learning algorithms for improved electronic support (ES) and electronic attack (EA) capabilities.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Electromagnetic Systems Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "77.846"
                        },
                        "CurrentYear": {
                            "val": "76.497"
                        },
                        "BudgetYearOne": {
                            "val": "83.497"
                        },
                        "BudgetYearOneBase": {
                            "val": "83.497"
                        },
                        "BudgetYearTwo": {
                            "val": "83.259"
                        },
                        "BudgetYearThree": {
                            "val": "86.875"
                        },
                        "BudgetYearFour": {
                            "val": "91.575"
                        },
                        "BudgetYearFive": {
                            "val": "93.272"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses technology opportunities associated with Naval platforms for new capabilities in EO\/IR Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics.  The project supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution.  This project directly supports the Department of Defense Joint Warfighter Plan and the Defense Technology Area Plans.  Activities and efforts within this program have attributes that focus on enhancing the affordability of warfighting systems.  The program also provides for technology efforts to maintain proactive connectivity and collaboration between Department Of the Navy (DON) Science and Technology (S&T) and Joint, Navy, and Marine Corps commands worldwide.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ELECTRONIC WARFARE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Electronic Warfare (EW) systems across the entire Electromagnetic Spectrum (EMS) that will increase the operational effectiveness and survivability of U.S. Naval units.  Emphasis is placed on passive sensors and active and passive Countermeasure (CM) systems that exploit and counter a broad range of electromagnetic threats. The focus is on maintaining near perfect, real-time knowledge of the enemy; countering the threat of missiles against deployed Naval forces; precision identification and location of threat emitters; and development of technologies that have broad application across multiple disciplines within the EW mission area. This activity also includes developments to protect these technologies from external interference, and modeling and simulation required to support the development of these technologies. Also included is technology development in support of the Integrated Distributed Electronic Warfare System (IDEWS) concept. The current objectives are: \n\n- EW Radio Frequency (RF) Technology: Develop and demonstrate technologies in the RF spectrum (covering frequencies from kilohertz to terahertz) that include developments in detection, signal processing and passive\/active techniques for wideband Electronic Attack (EA), Electronic Protection (EP) and the Electronic Support (ES) mission areas. \n\n- EW Electro-Optic\/Infrared (EO\/IR) Technology: Develop and demonstrate technologies in the EO\/IR spectral domain (extending from the ultraviolet to the far infrared spectral bands) that include advances in multispectral sensors, multiband sources, beam forming\/steering, and signal processing and transmission. \n\n- EW Integrated and Networked Technology: Develop and demonstrate technologies that will enable an increased situational awareness and response across the electromagnetic spectrum (EMS) with broad spatial coverage using all available EW assets to provide coordinated, adaptive and networked EW sensing, protection and attack. \n\n- Advanced EW Enabling Technologies: Develop classified advanced electronic warfare technology in support of current and predicted capability requirements. \n\n- Electromagnetic Maneuver Warfare Command & Control (EMC2) (FY16-FY20): Enable a battle group to work cooperatively in the EM Spectrum (EMS) to optimize Electronic Warfare (EW), Information Operations (IO), Communications (Comms) and Radar performance. EMC2 will build upon the Resource Allocation Manager (RAM) that was previously developed for single multifunction systems under the InTop program to optimize spectrum and functional use across a platform and an entire battle group."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "42.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Electromagnetic Warfare applied research being conducted includes efforts in both Radio Frequency (RF) countermeasures and Electro-Optic and Infrared (EO\/IR) Countermeasure including both detection and defeat.  Technology developments to provide capabilities indigenous to small UASs are a significant focus.  Technology developments being addressed include laser based Infrared (IR) countermeasures, non-mechanical holographic means for optical beam steering for EO\/IR countermeasures, the development of new optical lens technologies based on Gradient Indexed (GRIN) optics. This latter technology when coupled with another ongoing effort in multidimensional optics show significant promise for greatly reducing the weight of highly capable optical systems.  Additionally, there is a focus on developing the high payoff technology of chip scaled integration of optical photonic components with microwave components.   Technology is being investigated to determine the potential for being able to conduct specific emitter identification and classification relative to gun blasts using IR imagers.   \n\nRF efforts include work in developing engineered high transmit to receiver materials for significant improvements in isolation.  Work is ongoing to expand Electronic Warfare (EW) jamming capabilities at high power levels covering previously unaddressed frequency bands with significant operational impact.  The technologies to permit operations of EW attack in friendly communications bands without attendant fratricide is being researched using alternative technology approaches over current approaches.  Cognitive electronic attack approaches in both the communications bands and radar bands are ongoing to address the need to address and defeat unidentified RF pop-up threats.  Results have been obtained in ongoing research in metamaterials in the RF domain.\n\nCompleted development of Infrared GRIN optics and associated SWaP advantages for multispectral imagers in a prototype system.\n\nStarting in FY 2018, all INP and LA-Tech investments in EMC2 Warfare will be shown in the new INP Program Element (PE) 0602792N INP Applied Research to better convey exactly what the Office of Naval Research (ONR) is working on in this area."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.906"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare: \nThe research being conducted is very diverse and includes efforts in both Radio Frequency (RF) countermeasures and Electro-Optic and Infrared (EO\/IR) Countermeasure including both detection and defeat.  Technology developments to provide capabilities indigenous to small UASs are a significant focus.  Technology developments being addressed include the development of new optical lens technologies based on Gradient Indexed (GRIN) optics. This latter technology when coupled with another ongoing effort in multidimensional optics show significant promise for greatly reducing the weight of highly capable optical systems.\nRF efforts include work in developing engineered high transmit to receiver materials for significant improvements in isolation.  Efforts in devising means to degrade, disable or defeat operational communications networks is yielding promising results.  Work is ongoing to expand Electronic Warfare (EW) jamming capabilities at high power levels covering previously unaddressed frequency bands with significant operational impact.  Cognitive electronic attack approaches in both the communications bands and radar bands are ongoing to address the need to address and defeat unidentified RF pop-up threats.  Interesting results have been obtained in ongoing research in metamaterials in the RF domain.  There is a renewed focus on devising techniques to discover new methods of detecting, identifying, and cataloging threat emissions and also schemes to apply countermeasures using micro jamming constellations\n\n\nContinue research in the areas of improved threat warning systems; Electronic Warfare Support (ES); decoys and countermeasures against weapon tracking and guidance systems; Electronic Attack (EA) against adversary Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR); and Electronic Protection (EP) of our own weapons and C4ISR from intentional and unintentional interference to control the Electromagnetic Spectrum (EMS) by exploiting, deceiving, or denying enemy use of the spectrum while ensuring its use by friendly forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "43.534"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "43.534"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Reinvigorate investments in fundamental component technologies that drive performance of electronic warfare system across the range of functions from sensor, signal processing, decision and collaboration software and response.    Develop advanced antenna solutions to enable Simultaneous Transmit And Receive (STAR) with high directivity.  Innovate new Radio-Frequency (RF) amplifier technology to deliver high power, broadband devices that extend into the millimeter-Wave in small form factors.  Leverage emerging compute architectures and advanced algorithms to provide signal processing solutions for operating coherent, distributed arrays in complex electromagnetic environments.  Develop deep learning methods for improved electronic warfare functions in the signal processing chain.  Apply machine learning techniques to surface self-defense systems.  Develop counter-measure solutions to optical sensors including non-mechanical beam steering and laser technologies to increase the effectiveness of Electro-Optic\/Infrared (EO\/IR) countermeasures in addition to passive obscurant technology.  Improve modeling of sensor systems to provide integrated capability across optical and RF domain.  Develop test technology for affordable fielding of cognitive, collaborative Electronic warfare (EW) effector systems.\n\nElectromagnetic Warfare: The RF domain research includes discovery of communications networks and mechanisms for their disruption and defeat.  Selected examples of research include discovery of parameters to identify functional characteristics of emerging radar system, advanced algorithms to specifically identify modern radar sources, using micro-jammers in a phased array configuration, exploiting optical emission characteristics, and development of a novel deep reinforcement learning and Q-network software framework to develop and refine control policies for participating offensive and defensive agents."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 reflects increased investment in specialized signal processing engines to leverage machine learning algorithms for improved electronic support (ES) and electronic attack (EA) capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EO\/IR SENSOR TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The overarching objective is to develop technologies that enable the development of affordable, wide area, persistent surveillance optical architectures, day\/night\/adverse weather, adaptable, multi-mission sensor technology comprised of optical sources, detectors, and signal processing components for search, detect, track, classify, Identify (ID), intent determination, and targeting applications and includes developments to protect these technologies from external interference. Also included are modeling and simulation required to support the development of these technologies. Efforts will also include the development of optical Radio-Frequency (RF) components, infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors. The current specific objectives are: \n\n- Optically Based Terahertz (THz) and Millimeter Wave (MMW) Distributed Aperture Systems: Develop optically based terahertz (THz) and millimeter wave distributed aperture systems for imaging through clouds, fog, haze and dust on air platforms. \n\n- Wide Area Optical Architectures: Develop wide area optical architectures for persistent surveillance for severely size constrained airborne applications. \n\n- Hyperspectral sensors and processing: Develop visible, shortwave Infrared (IR), mid-wave IR, and long-wave IR hyperspectral sensors, along with processing algorithms to detect anomalies and targets. \n\n- Coherent Laser Radar (LADAR): Develop and improve components for LADAR applications including fiber lasers, coherent focal planes, and advanced processing. \n\n- Autonomous and Networked sensing: Develop algorithms and processing that supports autonomous sensing for Unmanned Autonomous Vehicles (UAV) platforms and that supports networked sensing over multiple sensors and\/or sensor platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.078"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare work is ongoing to address the critical deficiency with respect to operations in brownout conditions.  Infrared (IR) and terahertz technologies are being modified and integrated with the expectations that combining these two technologies an effective solution can be obtained.  Bistatic radar and imaging technology is being developed to extend surveillance capabilities and passively engage targets.  A unique approach permitting rapid active scanning of a battlefield in the IR domain using a non-mechanically scanned mechanism is under development.  This technology if successful will eliminate the multiple laser ball systems currently required to accomplish this same requirement at lower SWAP.  Active work is also being focused on developing capabilities for high resolution, wide field of view sensors on modest sized UAS platforms.\n\nResearched advanced materials and chemistry fabrication methods to develop micro-retro-reflectors operating in short wavelength IR systems.  This study is directed to develop unique spectral bar codes. Major accomplishments include development of high refractive index glass composition.\n\nCreated and explored new electronics concepts, components, techniques, and subsystems for the generation, and transmission of UV, visible, and infrared radiation to support current and future Navy and DoD needs.\n\nContinued research in optical components and infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors for the purpose of imaging through clouds, fog, haze and dust; persistent surveillance for severely size constrained airborne applications; detecting anomalies and targets; and autonomous sensing for UAV platforms and networked sensing over multiple sensors and\/or sensor platforms.  Completed effort to develop components, study and demonstrate optical links that allow Quantum Key Distribution (QKD) through free space using Modulating Retro-Reflectors (MRRs).  Completed effort to develop a novel IR focal plane bolometric sensor based upon graphene electronic materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.102"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare:  \nA unique approach permitting rapid active scanning of a battlefield in the IR domain using a non-mechanically scanned mechanism is under development.  This technology if successful will eliminate the multiple laser ball systems currently required to accomplish this same requirement at lower SWAP.  Active work is also being focused on developing capabilities for high resolution, wide field of view sensors for modest sized UAS platforms.  A promising development using holographic-based optical phase conjugation to provide a wide field of view Electro-Optic and Infrared (EO\/IR) countermeasures to detect, track and\/or jam imaging sensors.  An effort is expanding the state of the art in a Short-Wave Infrared (SWIR) multispectral LIDAR system capable of simultaneous 4D (x,y,z,?) spatial-spectral information for imaging and spectral discrimination through obscurations to provide improved battlespace awareness through a revolutionary multi-functional electro-optical system for intelligence, surveillance, reconnaissance, target detection and classification.\n\nContinue electronics research efforts and thrusts on new concepts, components, techniques, and subsystems for the generation, and transmission of UV, visible, and infrared radiation to support current and future Navy and DoD needs.\n\nContinue Materials and Chemistry focused research and thrusts on advanced fabrication methods to develop micro-retro-reflectors operating in short wavelength Infrared (IR) systems.  This study is directed to develop unique spectral bar codes. Major accomplishments include development of high refractive index glass composition\n\nConduct ongoing research in optical components and infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors for the purpose of imaging through clouds, fog, haze and dust; persistent surveillance for severely size constrained airborne applications; detecting anomalies and targets; and autonomous sensing for UAV platforms and networked sensing over multiple sensors and\/or sensor platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research in optical components, infrared technologies and signal processing for the purpose of affordable, wide area, persistent surveillance and targeting applications in all weather conditions.  Specific areas of research include: novel optical architectures for affordable persistent surveillance to support search, detection, classification, identification and targeting functions; development of laser and passive mmW detectors for imaging through degraded visual environments (e.g., clouds, fog, haze and dust); low size, weight, and power hyper-spectral sensors for severely size and power constrained airborne applications; development of automatic algorithms for autonomously detecting and recognizing anomalies and targets using networked sensors and\/or sensor platforms; novel techniques for Electro-Optic\/Infrared (EO\/IR) countermeasures to detect, track and\/or jam sensors.\n\nElectronics:  Create and explore new concepts, components, techniques, and subsystems for the generation, and transmission of Ultra-Violet (UV), visible, and infrared radiation to support current and future Navy and DoD needs.\n\nElectromagnetic Warfare: Work is ongoing to address the critical deficiency with respect to operations in brownout conditions.  IR and terahertz technologies are being modified and integrated with the expectations that combining these two technologies an effective solution can be obtained.  Bistatic radar and imaging technology is being developed to extend surveillance capabilities and passively engage targets.  A unique approach permitting rapid active scanning of a battlefield in the IR domain using a non-mechanically scanned mechanism is under development.  This technology if successful will eliminate the multiple laser ball systems currently required to accomplish this same requirement at lower Size, Weight and Power (SWAP).  Active work is also being focused on developing capabilities for high resolution, wide field of view sensors on modest sized Unmanned Autonomous Systems (UAS) platforms. \n\nMaterials and Chemistry: Advanced fabrication methods to develop micro-retro-reflectors operating in short wavelength IR systems.  This study is directed to develop unique spectral bar codes. Major accomplishments include development of high refractive index glass composition."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVIGATION TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop technologies that enable the development of affordable, effective and robust Position, Navigation and Timing (PNT) capabilities using the Global Positioning System (GPS), non-GPS navigation devices, and atomic clocks.  This project will increase the operational effectiveness of U.S. Naval units.  Emphasis is placed on GPS Anti-Jam (AJ) Technology; Precision Time and Time Transfer Technology; and Non-GPS Navigation Technology (Inertial aviation system, bathymetry, gravity and magnetic navigation). The focus is on the mitigation of GPS electronic threats, the development of atomic clocks that possess unique long-term stability and precision, and the development of compact, low-cost Inertial Navigation Systems (INS). \n\nThe following are non-inclusive examples of plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.120"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted applied research in position, navigation and timing.  This research aims to develop techniques and technology to provide assured, cost-effective, and mission relevant Position, Navigation and Timing (PNT) to the warfighter.  Areas of investment included robust GPS, non-GPS navigation aids, and assured timekeeping.  Specifically, GPS Anti-Jam (AJ) Antennas and Receivers for Navy platforms for the purpose of providing precision navigation capabilities in the presence of electronic threats and anti-spoofer\/AJ processors for the purpose of providing precision navigation capabilities in the presence of emergent threats; Tactical grade atomic clocks that possess unique long-term stability and precision for the purpose of providing GPS-independent precision time and transferring GPS-derived time via radio frequency links for the purpose of providing GPS-independent precision time; and Inertial navigation systems for the purpose of providing an alternative means of providing precision navigation, a correlation navigation technique using earth maps of high precision, for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.110"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue applied research in position, navigation and timing. This research aims to develop techniques and technology to provide assured, cost-effective, and mission relevant PNT to the warfighter. Areas of investment included robust GPS, non-GPS navigation aids, and assured timekeeping. Specifically, GPS Anti-Jam (AJ) Antennas and Receivers for Navy platforms for the purpose of providing precision navigation capabilities in the presence of electronic threats and anti-spoofer\/AJ processors for the purpose of providing precision navigation capabilities in the presence of emergent threats; Tactical grade atomic clocks that possess unique long-term stability and precision for the purpose of providing GPS-independent precision time and transferring GPS-derived time via radio frequency links for the purpose of providing GPS-independent precision time; and Inertial navigation systems for the purpose of providing an alternative means of providing precision navigation, a correlation navigation technique using earth maps of high precision, for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research in position, navigation and timing.  This research aims to develop techniques and technology to provide assured, cost-effective, and mission relevant PNT to the warfighter.  Areas of investment included robust GPS, non-GPS navigation aids, and assured timekeeping.  Specifically, GPS Anti-Jam Antennas and Receivers for Navy platforms for the purpose of providing precision navigation capabilities in the presence of electronic threats and anti-spoofer\/anti-jam processors for the purpose of providing precision navigation capabilities in the presence of emergent threats; Tactical grade atomic clocks that possess unique long-term stability and precision for the purpose of providing GPS-independent precision time and transferring Coordinated Universal Time (UTC) as maintained at the United States Naval Observatory (USNO) time via alternative electromagnetic links for the purpose of providing GPS-independent precision time; and Inertial navigation systems for the purpose of providing an alternative means of providing precision navigation, a correlation navigation technique using earth maps of high precision, for those Naval platforms which may not have GPS navigation capabilities and\/or loss of GPS signals."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The Increase from FY 2019 to FY 2020 in the Navigation Technology thrust is due to the requirement for expanded investment in quantum based Position, Navigation and Timing (PNT) sensors."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SOLID STATE ELECTRONICS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop higher performance components and subsystems for all classes of military Radio-Frequency (RF) systems that are based on solid state physics phenomena and are enabled by improved understanding of these phenomena, new circuit design concepts and devices, and improvements in the properties of electronic materials. An important subclass are the Very High Frequency (VHF), Ultra-High Frequency (UHF), Microwave (MW), and Millimeter Wave (MMW) power amplifiers for Navy all-weather radar, surveillance, reconnaissance, electronic attack, communications, and smart weapon systems. Another subclass are the analog and high speed, mixed signal components that connect the electromagnetic signal environment into and out of digitally realized, specific function systems. These improved components are based on both silicon (Si) and compound semiconductors (especially the wide bandgap materials and narrow bandgap materials), low and high temperature superconductors, novel nanometer scale structures and materials. Components addressed by this activity emphasize the MMW and Submillimeter Wave (SMMW) regions with an increasing emphasis on devices capable of operating in the range from 50 Gigahertz (GHz) to 10 terahertz (THz). The functionality of the technology developed cannot be obtained through Commercial-Off-The-Shelf (COTS) as a result of the simultaneous requirements placed on power, frequency, linearity, operational and instantaneous bandwidth, weight, and size. Effort will involve understanding the properties of engineered semiconductors as they apply to quantum information science and technology. This activity also includes Anti-Tamper development of innovative techniques and technologies to deter the reverse engineering and exploitation of our military's critical technology and critical program information in order to impede technology transfer and alteration of system capability and prevent the development of countermeasures to U.S. systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted research in the areas of  solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, many simultaneous signal functionality over a wide range of frequencies, in increasingly field-ready packaging and demonstrate the ability of these components to deliver superior functionality in conventional system contexts, including, but not limited to, Satellite Communication (SATCOM), Surveillance Electronic Warfare (EW), Signal Intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals; and Anti-Tamper: develop a undetectable, robust, low\/no power, low cost set of technologies that can be deployed in many different systems from many different vendors for the purpose of protecting critical technology and critical program information contained in U.S. military systems from tampering and reverse engineering.\n\nConducted exploratory research to develop electronic materials, devices, components, and circuits in the frequency range of ~ 1 MHz to ~ 10 THz that provide system performance edge compared to Commercial-Off-the-Shelf (COTS)-based solid state electronics to ensure supremacy of future radar, EW, communications, sensor, and intelligence systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.920"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics:  \nExplore and develop electronic materials, devices, components, and circuits in the frequency range of ~ 1 MHz to ~ 10 THz that provide system performance edge compared to COTS-based solid state electronics to ensure supremacy of future radar, EW, communications, sensor, and intelligence systems. \n\nContinue ongoing research efforts in the areas of solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, many simultaneous signal functionality over a wide range of frequencies, in increasingly field-ready packaging and demonstrate the ability of these components to deliver superior functionality in conventional system contexts, including, but not limited to, SATCOM, Surveillance EW, Signal Intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals; and Anti-Tamper: develop a undetectable, robust, low\/no power, low cost set of technologies that can be deployed in many different systems from many different vendors for the purpose of protecting critical technology and critical program information contained in U.S. military systems from tampering and reverse engineering."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.520"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.520"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics: Ongoing development of electronic materials, devices, components, and circuits in the frequency range of ~ 1 Megahertz to ~ 10 Terahertz that provide system performance edge compared to current state of the art solid state electronics to ensure supremacy of future radar, Electronic Warfare (EW), communications, sensor, and intelligence systems.   Continue ongoing research efforts in the areas of solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, many simultaneous signal functionality over a wide range of frequencies, in increasingly field-ready packaging and demonstrate the ability of these components to deliver superior functionality in conventional system contexts, including, but not limited to, Satellite Communications (SATCOM), Surveillance Electronic Warfare (EW), signal intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals. Explore and develop new materials, devices, components, and circuits that apply quantum phenomena of entanglement, superposition and\/or wave function correlation for performance not achievable by classical methods."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURVEILLANCE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop advanced sensor and sensor processing systems for continuous, high volume, theater-wide air and surface surveillance, battle group surveillance, real time reconnaissance and ship defense. Major technology goals include long-range target detection and discrimination, target Identification (ID) and fire control quality target tracking in adverse weather, background clutter and electronic countermeasure environments and includes modeling and simulation required to support the development of these technologies. The current specific objectives are: \n\n- Radar Architectures, Sensors, and Software which Address Ballistic Missile and Littoral Requirement Shortfalls: Develop radar architectures, sensors, and software which address Ballistic Missile and Littoral requirement shortfalls including: sensitivity; clutter rejection; and flexible energy management. \n\n- Algorithms, Sensor Hardware, and Signal Processing Techniques for Automated Radar Based Contact Mensuration and Feature Extraction: Develop algorithms, sensor hardware, and signal processing techniques for automated radar based contact mensuration and feature extraction in support of asymmetric threat classification and persistent surveillance and to address naval radar performance shortfalls caused by: man-made jamming and Electronic Counter Measures (ECM), unfavorable maritime conditions, and atmospheric and ionosphere propagation effects. \n\n- Software and Hardware for a Multi-Platform, Multi-Sensor Surveillance System: Develop software, and hardware for a multi-platform, multi-sensor surveillance system for extended situational awareness of the battlespace. \n\n- Small Unmanned autonomous Vehicles (UAV) Collision Avoidance\/Autonomy Technology: Develop small UAV collision avoidance\/autonomy technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.998"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued applied research in sensors, networking and communication connectivity for the purpose of developing an affordable and fully automated network of time-coordinated mono-static, bi-static and passive surveillance sensors providing real-time tracking, identification, and engagement information with persistent wide area awareness. \n\nSpecifics Surveillance Technology research objectives include: \n\nRadar - research into antenna apertures, electronics, and signal processing continue to provide enhanced capability to detect, track, and automatically identify targets and threats; \n\nSignal Intelligence - the use of interferometric and sophisticated signal processing algorithms enables the detection, geolocation, tracking, and identification of targets; \n\nNetwork Sensing - research areas include sensor data fusion, multi-hypothesis decision making, multi-target tracking, and methods for handling and fusing disparate and intermittent data sources; and \n\nElectronic Protection - develop methods to mitigate Electronic Attack (EA) and Electromagnetic Interference (EMI) to RF sensors and networks.\n\nElectromagnetic Warfare - Efforts in this area are expanding the surveillance of adversary platforms by developing advanced signal processing techniques to bi-statically detect surface vessels by sensing reflected satellite transmissions and for the detection and discrimination of small UAS in a clutter filled environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.093"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare: \nEfforts in this area are expanding the surveillance of adversary platforms by developing advanced signal processing techniques to bi-statically detect surface vessels by sensing reflected ubiquitous transmissions and for the detection and discrimination of small UAS in a clutter filled environment.  Additionally, technology development to enable full spectrum battlespace awareness through an ultra-wideband aperture for simultaneously 360-degree beamforming and low-profile ultra-low cross-polarization ultra-wide-band apertures to provide resilient electronic protection for Naval platforms. \n\nContinue applied research in sensors, networking and communication connectivity for the purpose of developing an affordable and fully automated network of time-coordinated mono-static, bi-static and passive surveillance sensors providing real-time tracking, identification, and engagement information with persistent wide area awareness. Specifics Surveillance Technology research objectives include: Radar - research into antenna apertures, electronics, and signal processing continue to provide enhanced capability to detect, track, and automatically identify targets and threats; Signal Intelligence - the use of interferometric and sophisticated signal processing algorithms enable the detection, geolocation, tracking, and identification of targets; Network Sensing - research areas include sensor data fusion, multi-hypothesis decision making, multi-target tracking, and methods for handling and fusing disparate and intermittent data sources; and Electronic Protection - develop methods to mitigate Electronic Attack (EA) and Electromagnetic Interference (EMI) to Radio Frequency (RF) sensors and networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.085"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.085"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare: Efforts in this area are expanding the surveillance of adversary platforms by developing advanced signal processing techniques to bistatically detect surface vessels by sensing reflected ubiquitous transmissions and for the detection and discrimination of small Unmanned Autonomous Systems (UAS) in a clutter filled environment. Additionally, technology development to enable full spectrum battlespace awareness through an ultra-wideband aperture for simultaneously 360 degree beamforming and low-profile ultra-low cross-polarization ultra-wide-band apertures to provide resilient electronic protection for Naval platforms. Conduct applied research in sensors, networking and communication connectivity for the purpose of developing an affordable and fully automated network of time-coordinated mono-static, bi-static and passive surveillance sensors providing real-time tracking, identification, and engagement information with persistent wide area awareness. Specifics Surveillance Technology research objectives include: Radar - research into antenna apertures, electronics, and signal processing continue to provide enhanced capability to detect, track, and automatically identify targets and threats; Signal Intelligence - the use of interferometric and sophisticated signal processing algorithms enable the detection, geolocation, tracking, and identification of targets; Network Sensing - research areas include sensor data fusion, multi-hypothesis decision making, multi-target tracking, and methods for handling and fusing disparate and intermittent data sources; and Electronic Protection - develop methods to mitigate Electronic Attack (EA) and Electromagnetic Interference (EMI) to RF sensors and networks."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "VACUUM ELECTRONICS POWER AMPLIFIERS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop Millimeter Wave (MMW) and sub-MMW power amplifiers for use in Naval all-weather radar, surveillance, reconnaissance, electronic attack, and communications systems.  The technology developed cannot, for the most part, be obtained through Commercial Off The Shelf (COTS) as a result of the simultaneous requirements placed on power, frequency, bandwidth, weight, and size.  Responding to strong interests from the various user communities, efforts are focused on the development of technologies for high-data-rate communications, electronic warfare and high-power radar applications at MMW and upper-MMW regime.  The emphasis is placed on achieving high power at high frequency in a compact form factor.  Technologies include utilization of spatially distributed electron beams in amplifiers, such as sheet electron beams and multiple-beams, and creation of simulation based design methodologies based on physics-based and geometry driven design codes.\n\nThe current specific objectives are:\n\n- High Power Millimeter and Upper Millimeter Wave Amplifiers: Develop science and technology for high power millimeter and upper millimeter wave amplifiers including high current density diamond cathodes, sheet and multiple electron beam formation and mode suppression techniques in overmoded structures.\n\n- Lithographic Fabrication Techniques: Develop lithographic fabrication techniques for upper-millimeter wave amplifiers.\n\n- Accurate and Computationally Effective Device-Specific Multi-Dimensional Models for Electron Beams: Develop accurate and computationally effective device-specific multi-dimensional models for electron beam generation, large-signal and stability analysis to simulate device performance and improve the device characteristics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.354"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct ongoing Vacuum Electronic applied research for:\n\nHigh Power Millimeter and upper Millimeter Wave Amplifiers - Complete effort to develop and experimentally demonstrate a new class of miniature, broad-band-width Millimeter Wave (MMW) amplifiers having five times the power-to-weight ratio of existing state-of-the-art broadband MMW amplifiers. \n\nLithographic Fabrication Techniques - Complete effort to develop new 3-D microfabrication techniques for upper millimeter-wave to terahertz Electromagnetic (EM) circuits in complex geometries not possible by conventional methods, enabling unprecedented design freedom for high power active and passive devices\n\nElectronics - Explore and develop electron beam physics, beam-wave interaction structures, microfabrication techniques, Radio Frequency (RF) materials, and physics-based modeling to produce designs and prototypes of compact, efficient, broadband, linear, high power devices operating at MMW & sub-MMW frequencies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.366"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics  \n\nExplore and develop electron beam physics, beam-wave interaction structures, microfabrication techniques, Radio Frequency (RF) materials, and physics-based modeling to produce designs and prototypes of compact, efficient, broadband, linear, high power devices operating at mmW & sub-mmW frequencies.\n\nContinue ongoing vacuum electronics efforts and increase investment in research associated with the exploration and development of electron beam physics, beam-wave interaction structures, microfabrication techniques, RF materials, and physics-based modeling to produce designs and prototypes of compact, efficient, broadband, linear, high power devices operating at Millimeter Wave (MMW) & sub-MMW frequencies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.390"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.390"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics:  Exploratory and develop electron beam physics, beam-wave interaction structures, microfabrication techniques, RF materials, and physics-based modeling to produce designs and prototypes of compact, efficient, broadband, linear, high power devices operating at mmW & sub-mmW frequencies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies that address technology needs associated with Naval platforms for new capabilities in EO\/IR Sensors, Surveillance, Electronic Warfare, Navigation, Solid State Electronics, Vacuum Electronics Power Amplifiers, and Nanoelectronics. The program supports development of technologies to enable capabilities in Missile Defense, Directed Energy, Platform Protection, Time Critical Strike, and Information Distribution. Each PE Activity has unique goals and metrics, some of which include classified quantitative measurements.  Overall metric goals are focused on achieving sufficient improvement in component or system capability such that the 6.2 applied research projects meet the need of, or produce a demand for, inclusion in advanced technology that may lead to incorporation into acquisition programs or industry products available to acquisition programs.\n\nSpecific examples of metrics under this PE include:\n\n- Provide a secure, over the horizon, on-the- move capability to communicate with higher headquarters at a data rate of 256-512 Kbps at a cost of $75,000.\n- Provide an array configuration suitable for installation on aircraft that will support Tactical Common Data Link (TCDL) data rates of 10.7 and 45 Mbps at greater than 150 nautical mile range.\n- Develop prototype Ku band phased array apertures in a form factor suitable for installation on the CVN-78."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.794"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.794"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Provides improved ground-based space situational awareness."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.794"
                                        },
                                        "Text": {
                                            "val": "Congressional add supports extension of space situational awareness capabilities by extending the collection period into the daytime hours by demonstrating advanced infrared sensing technologies."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}