{
    "id": "2020-AirForce-PB-3600-MJBOOK-3-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-79",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1203940F"
        },
        "ProgramElementTitle": {
            "val": "Space Situation Awareness Operations"
        },
        "R1LineNumber": {
            "val": "309"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "86.173"
            },
            "CurrentYear": {
                "val": "19.572"
            },
            "BudgetYearOne": {
                "val": "17.834"
            },
            "BudgetYearOneBase": {
                "val": "17.834"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "30.401"
            },
            "BudgetYearThree": {
                "val": "22.950"
            },
            "BudgetYearFour": {
                "val": "20.110"
            },
            "BudgetYearFive": {
                "val": "20.472"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY 2019, National Space Defense Center (NSDC) funding in PE 1203940F is transferred to PE 1203620F, National Space Defense Center."
        },
        "ProgramElementMissionDescription": {
            "val": "Space Situational Awareness (SSA) is knowledge of all aspects of space related to operations. As the foundation for space control, SSA encompasses surveillance of  all space objects and activities; detailed reconnaissance of specific space assets; monitoring space environmental conditions; monitoring cooperative space assets; gathering intelligence on adversary space operations; and conducting integrated command, control, communications, processing, analysis, dissemination, and archiving activities. SSA also encompasses the integration, exploitation and delivery of data sources to facilitate the battle management and command and control of space forces.  This program element fields, upgrades, modifies, modernizes, operationalizes, operates and maintains Air Force sensors and information integration capabilities within the SSA Space Surveillance Network (SSN) while companion program element 1206425F, Space Situational Awareness Systems, develops new network sensors and improved information integration capabilities across the network. Activities funded in this program element (1203940F) focus on surveillance of objects in earth orbit to aid tasks including satellite tracking; space object identification; tracking and cataloging; satellite attack warning; notification of satellite flyovers to U.S. forces; space treaty monitoring; and technical intelligence gathering.\n\nService Life Extension Programs (SLEPs) (Project 67A017) are efforts to upgrade, operationalize and extend the life of operational SSA sensors, as needed. These SLEPs extend the serviceable life of assets and maintain critical capability by replacing aging and increasingly unsustainable components with modern and sustainable equipment. In addition, the SLEPs themselves may be designed to increase capabilities not currently realized. As the need arises in the execution year, funds in this project may be used to begin SLEPs on additional efforts.  These efforts may include prototyping and technology demonstrations. \n\nGlobal Sensor Watch Program provides an integrated SSA Tip and Cue capability that implements a survivable architecture that provides overlapping, assured, and viable surveillance options for executing event response, multiple level security processing of SSA data and automated cross-sensor tipping and cueing around the globe.  Other efforts to support Battle Management Command & Control (BMC2) in space include developing & deploying advanced software algorithms to identify, acquire, characterize, and maintain custody of deep space Super High Interest Objects (SHIO); optimizing intelligence community & Missile Defense Agency sensors to better support BMC2; developing & executing Joint Functional Component Command (JFCC) for Space exercises such as Combined Space Operations Center (CSpOC) Experimentation, Test and Training Initiative (JETTI) to test & optimize Space Control capabilities, concepts of operations (CONOPS) development to increase probability of survival for blue assets, and refining requirements across the space enterprise; enhancing sensor performance to close the solar exclusion gap by leveraging technologies such as optical daylight tracking; and improving legacy communication paths to support bi-directional machine-to-machine sensor communications enabling a more complete BMC2 capability.\n\nGround Based Radar Upgrades improves the sensitivity, search capabilities and CONOPS of existing ground-based SSA sensors to better support custody and fire control timelines.\n\nThe FY 2020 funding request was reduced by $8.000 million to account for the availability of prior year execution balances.\n\nSpace acquisition must respond with speed and agility to emerging adversary threats.  Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture.  Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 1206392F and 1206398F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "99.984"
                },
                "CurrentYear": {
                    "val": "19.572"
                },
                "BudgetYearOne": {
                    "val": "20.314"
                },
                "BudgetYearOneBase": {
                    "val": "20.314"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "86.173"
                },
                "CurrentYear": {
                    "val": "19.572"
                },
                "BudgetYearOne": {
                    "val": "17.834"
                },
                "BudgetYearOneBase": {
                    "val": "17.834"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-13.811"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.480"
                },
                "BudgetYearOneBase": {
                    "val": "-2.480"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.406"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-4.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-8.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.405"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.480"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.480"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018: -$4.000M Congressional reduction - excess to need; -$8.000M reprogramming for higher Air Force priorities\n\nFY 2020: +$5.520M increase for completion of Space Surveillance Telescope (SST) testing; -$8.000M reduction to account for availability of prior year execution balances"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "670004"
                    },
                    "ProjectTitle": {
                        "val": "Other STRATCOM Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "57.934"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The National Space Defense Center (NSDC), formerly the Joint Interagency Combined Space Operations Center (JICSpOC), seeks to improve unity of effort and information sharing across the national security space community to effectively respond to potential future space threat events. The NSDC requires effective battle management, command and control (BMC2) to integrate and synchronize space and cyber forces and the intelligence community with efforts across all domains and to execute unity of effort through the core command and control functions of:  situation monitoring, planning, decision making, space force management and space force direction.  The NSDC will have the capability to develop, test, and integrate new space system tactics, techniques and procedures (TTPs) in support of both DoD and Intelligence Community (IC) operations. Lessons learned from NSDC experimentation will inform requirements development for future BMC2 architectures.\n\nBeginning in FY 2019, National Space Defense Center (NSDC) funding in PE 1203940F is transferred to PE 1203620F, National Space Defense Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NSDC Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Develop and field space battle management, command and control (BMC2) infrastructure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.934"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SpODC Development"
                                    },
                                    "Description": {
                                        "val": "Development of the Space Operations Development Center (SpODC) modeling and simulation infrastructure"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Accelerated Space BMC2 JEON (ST-0006) is led by AFRL and will utilize existing contracts (e.g. Space Security and Defense Program (SSDP)) and provide funds to other AF\/DoD organizations to execute on their contracts. Additionally, AFRL will initiate and utilize commercial consortiums to deliver capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "FY17 includes $58.8M Request for Additional Appropriations for emergency warfighting readiness requirements."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SYSTEM ENGINEERING AND INTEGRATION"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.425"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPACE OPERATIONAL DEVELOPMENT CENTER DESIGN AND EXPERIMENTATION"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "28.590"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "COMMUNICATIONS ARCHITECTURE DESIGN AND DEVELOPMENT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.575"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "APPLICATION DEVELOPMENT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "15.344"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FFRDC"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "NSDC"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "NSDC Infrastructure Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "NSDC Experimentation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "NSDC Capabiity Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SpODC Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "NSDC efforts transferred to USSPACECOM."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67A017"
                    },
                    "ProjectTitle": {
                        "val": "Sensor Service Life Extension Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.239"
                        },
                        "CurrentYear": {
                            "val": "19.572"
                        },
                        "BudgetYearOne": {
                            "val": "17.834"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.834"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "30.401"
                        },
                        "BudgetYearThree": {
                            "val": "22.950"
                        },
                        "BudgetYearFour": {
                            "val": "20.110"
                        },
                        "BudgetYearFive": {
                            "val": "20.472"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Space Situational Awareness (SSA) is knowledge of all aspects of space related to operations. As the foundation for space control, SSA encompasses surveillance of  all space objects and activities; detailed reconnaissance of specific space assets; monitoring space environmental conditions; monitoring cooperative space assets; gathering intelligence on adversary space operations; and conducting integrated command, control, communications, processing, analysis, dissemination, and archiving activities. SSA also encompasses the integration, exploitation and delivery of data sources to facilitate the battle management and command and control of space forces.  This program element fields, upgrades, modifies, modernizes, operationalizes, operates and maintains Air Force sensors and information integration capabilities within the SSA Space Surveillance Network (SSN) while companion program element 1206425F, Space Situational Awareness Systems, develops new network sensors and improved information integration capabilities across the network. Activities funded in this program element (1203940F) focus on surveillance of objects in earth orbit to aid tasks including satellite tracking; space object identification; tracking and cataloging; satellite attack warning; notification of satellite flyovers to U.S. forces; space treaty monitoring; and technical intelligence gathering.\n\nService Life Extension Programs (SLEPs) are efforts to upgrade, operationalize and extend the life of operational SSA sensors. These SLEPs extend the serviceable life of assets and maintain critical capability by replacing aging and increasingly unsustainable components with modern and sustainable equipment. In addition, the SLEPs themselves may be designed to increase capabilities not currently realized. As the need arises in the execution year, funds in this project may be used to begin SLEPs on additional efforts. These efforts may include prototyping and technology demonstrations.\n\nGlobal Sensor Watch Program provides an integrated SSA Tip and Cue capability that implements a survivable architecture that provides overlapping, assured, and viable surveillance options for executing event response, multiple level security processing of SSA data and automated cross-sensor tipping and cueing around the globe.  Other efforts to support Battle Management Command & Control (BMC2) in space include developing & deploying advanced software algorithms to identify, acquire, characterize, and maintain custody of deep space Super High Interest Objects (SHIO); optimizing intelligence community & Missile Defense Agency sensors to better support BMC2; developing & executing Joint Functional Component Command (JFCC) for Space exercises such as Combined Space Operations Center (CSpOC) Experimentation, Test and Training Initiative (JETTI) to test & optimize Space Control capabilities, concepts of operations (CONOPS) development to increase probability of survival for blue assets, and refining requirements across the space enterprise; enhancing sensor performance to close the solar exclusion gap by leveraging technologies such as optical daylight tracking; and improving legacy communication paths to support bi-directional machine-to-machine sensor communications enabling a more complete BMC2 capability.\n\nGround Based Radar Upgrades improves the sensitivity, search capabilities and CONOPS of existing ground-based SSA sensors to better support custody and fire control timelines.\n\nPrograms and projects in the space warfighting enterprise are evaluating ways to maximize innovation, resiliency, and our ability to rapidly respond to known and emerging threats.  Space enterprise efforts aim to execute technology risk reduction efforts, integration of new or repurposed capabilities, enterprise decision-making tools, experimentation, and rapid prototyping and fielding via all appropriate acquisition authorities and contract mechanisms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Global Sensor Watch Program"
                                    },
                                    "Description": {
                                        "val": "Global Sensor Watch (GSW) Program provides an integrated SSA Tip and Cue capability that implements a survivable architecture that provides overlapping, assured, and viable surveillance options for executing event response, multiple level security processing of SSA data and automated cross-sensor tipping and cueing around the globe. Other efforts to support Battle Management Command & Control (BMC2) in space include developing & deploying advanced software algorithms to identify, acquire, characterize, and maintain custody of deep space SHIOs; optimizing intelligence community & MDA sensors to better support BMC2; developing & executing JFCC Space exercises such as JETTI to test & optimize Space Control capabilities, CONOPS development to increase probability of survival for blue assets, and refining requirements across space enterprise; enhancing sensor performance to close the solar exclusion gap leveraging technologies and improving legacy communication paths to support bi-directional machine-to-machine sensor communications enabling a more complete BMC2 capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.211"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.572"
                                            },
                                            "Text": {
                                                "val": "Continue GSW operationalization effort for more situational sensors.  Continue program office support and other related support activities that may include, but are not limited to, studies, technical analysis, prototyping, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.314"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.314"
                                            },
                                            "Text": {
                                                "val": "GSW Inclusion of Non-Traditional SSA Sensors will have multiple milestones (scrubbed for classification): Concept-C GSW Operationalization (FY 2020), Concept-T GSW Operationalization (FY 2020), Red Dawn GSW Operationalization (FY 2021), Commercial GSW Interface Operationalization (FY 2021), Mission Partner GSW Interface Operationalization (FY 2023).  Rapidly respond to and implement system resiliency and situational awareness necessary to operate in the contested space domain.  Activities may include, but are not limited to, program office support, studies, technical analysis, experimentation, prototyping, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $7.258M.  Justification for this decrease is described above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Surveillance Telescope DT&E\/OT&E"
                                    },
                                    "Description": {
                                        "val": "Space Surveillance Telescope (SST) provides rapid un-cued search, detection and tracking of dim objects in deep space and offers enhanced capabilities addressing critical space situational awareness gaps.  SST is being relocated from White Sands Missile Range, NM to Western Australia in FY 2017 with expected IOC in FY 2021.  Efforts include executing SST sensor reassembly, subsystem integration and testing subsequent to Australian facility delays.  This includes completion of SST integration into a new facility, SST subsystem and system testing & Developmental Test\/Operational Test and Evaluation (DT\/OT&E)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.520"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.520"
                                            },
                                            "Text": {
                                                "val": "Funds US portion of bill for interruption of SST reassembly, subsystem integration, and testing as a result of Australian facility delays; includes facility integration, SST subsystem and system testing, and DT\/OT&E."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $5.520M.  Justification for this increase is described above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Radar Upgrades"
                                    },
                                    "Description": {
                                        "val": "This effort improves the sensitivity, search capability and CONOPS of existing SSA sensors to better support fire control timelines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.028"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Continue prototyping L-Band solid-state transmitter, operationalize Ultra High Frequency transmitter\/receiver upgrade and field a commercial off the shelf (COTS)-based L-band high voltage power supply.  Continue program office support and other related support activities that may include, but are not limited to, studies, technical analysis, prototyping, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategies for Global Sensor Watch program and Ground Radar Upgrades include a mix of modifications to existing Air Force contracts and directing funds to other AF or DoD organizations for contract support."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GSW Operationalization"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.639"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.262"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.624"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.624"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GSW SW Development 1"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GSW SW Development 2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT\/LL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GSW SW Development 3"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sandia National Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Albuquerque, NM"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Ground Radar Upgrades"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.990"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.990"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Space Surveillance Telescope"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Exmuth Australia"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.520"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.520"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.690"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.290"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.290"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.788"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Muliple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.160"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "16.626"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Sensor SLEP"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Global Sensor Watch (GSW) Program"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GSW Legacy Tasking Upgrades"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GSW Operationalization"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GSW SW Development 1 (Operationalized)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GSW SW Development 2 (Legacy)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GSW SW Development 3 (Non-traditional)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ground Radar Upgrades"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SST OT&E"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}