{
    "id": "2020-Navy-PB-1319-JBOOK-9da760a8280e5c477a40ce5d303141285b83ab4a577b7d5903632d5298d41e17-21",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680N"
        },
        "ProgramElementTitle": {
            "val": "(U)Manufacturing Technology Program"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "66.173"
            },
            "CurrentYear": {
                "val": "58.657"
            },
            "BudgetYearOne": {
                "val": "60.138"
            },
            "BudgetYearOneBase": {
                "val": "60.138"
            },
            "BudgetYearTwo": {
                "val": "60.122"
            },
            "BudgetYearThree": {
                "val": "61.318"
            },
            "BudgetYearFour": {
                "val": "62.582"
            },
            "BudgetYearFive": {
                "val": "63.840"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Manufacturing Technology (ManTech) Program is intended to improve the productivity and responsiveness of the U.S. defense industrial base by funding the development, optimization, and transition of enabling manufacturing technologies to key naval suppliers.  In general, investments transition emerging Science and Technology (S&T) results to acquisition programs; improve industrial capabilities in production, maintenance, repair and industrial base responsiveness; and advance manufacturing technology to reduce cost, improve performance, and responsiveness. Currently, the ManTech Program is focused on affordability improvements for specific key acquisition platforms as defined in the Navy ManTech Investment Strategy.  Key platforms currently targeted include: VIRGINIA Class Submarine (VCS)\/OHIO Replacement Program (ORP); DDG 51 Class Destroyer; CVN 78 Class Carrier; Joint Strike Fighter (JSF); and CH-53K Heavy Lift Helicopter.  Office of Naval Research (ONR) ManTech helps these Navy programs achieve their respective affordability goals by transitioning developed manufacturing technology which, when implemented, results in needed cost reduction or cost avoidance.\n\nDue to the number of efforts in this Program Element (PE), the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "57.797"
                },
                "CurrentYear": {
                    "val": "58.657"
                },
                "BudgetYearOne": {
                    "val": "60.500"
                },
                "BudgetYearOneBase": {
                    "val": "60.500"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "66.173"
                },
                "CurrentYear": {
                    "val": "58.657"
                },
                "BudgetYearOne": {
                    "val": "60.138"
                },
                "BudgetYearOneBase": {
                    "val": "60.138"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "8.376"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.362"
                },
                "BudgetYearOneBase": {
                    "val": "-0.362"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.625"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.362"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.362"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "10.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase from FY 2019 to FY 2020 is to perform additional technology development efforts to support the submarine industrial base ramp up and workload increase for VIRGINIA Payload Module and COLUMBIA Class Submarine production in addition to the continuing VIRGINIA Class Submarine 2 per year production."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1050"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Tech"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "56.516"
                        },
                        "CurrentYear": {
                            "val": "58.657"
                        },
                        "BudgetYearOne": {
                            "val": "60.138"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.138"
                        },
                        "BudgetYearTwo": {
                            "val": "60.122"
                        },
                        "BudgetYearThree": {
                            "val": "61.318"
                        },
                        "BudgetYearFour": {
                            "val": "62.582"
                        },
                        "BudgetYearFive": {
                            "val": "63.840"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Manufacturing Technology (ManTech) Program is intended to improve the productivity and responsiveness of the U.S. defense industrial base by funding the development, optimization, and transition of enabling manufacturing technologies to key naval suppliers. In general, investments transition emerging Science and Technology (S&T) results to acquisition programs; improve industrial capabilities in production, maintenance, repair and industrial base responsiveness; and advance manufacturing technology to reduce cost, improve performance, and responsiveness.  Currently, the ManTech Program is focused on affordability improvements for specific key acquisition platforms as defined in the Navy ManTech Investment Strategy.  Key platforms currently targeted include: VIRGINIA Class Submarine (VCS)\/COLUMBIA Class Submarine (CLB); DDG 51 Class Destroyer; CVN 78 Class Carrier; Joint Strike Fighter (JSF); and CH-53K Heavy Lift Helicopter. Office of Naval Research (ONR) ManTech helps these Navy programs achieve their respective affordability goals by transitioning developed manufacturing technology which, when implemented, results in needed cost reduction or cost avoidance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Composites Processing and Fabrication"
                                    },
                                    "Description": {
                                        "val": "The primary technical goal of the Composites Processing and Fabrication activity is improving weapon systems affordability, enhancing weapon system effectiveness and improving reliability\/war-fighter readiness through the increased utilization of composite materials and structures.  This is being achieved through the development, maturation, and transition of affordable and robust manufacturing, assembly, and repair processes that fully exploit the benefits of composite materials.  Concentration is on affordability for the following platforms: VIRGINIA Class Submarine (VCS)\/COLUMBIA Class Submarine (CLB), DDG 51 Class Destroyer, CVN 78 Class Carrier, Joint Strike Fighter (JSF), and CH-53K Heavy Lift Helicopter.  Composites processing and fabrication technology areas include but are not limited to fiber-reinforced polymeric (organic) resin composites; ceramic-matrix, metal-matrix, and carbon-carbon composites; composite internal stiffening core materials such as foam, ceramic, balsa wood, polymeric or metallic honeycomb, or other materials; composite external stiffening concepts such as hat and blade stiffeners and methodologies to manufacture them; materials for radomes and other electrical applications; composite manufacturing and similar processes and related equipment technology; and adhesives, adhesive bonding, and related technologies (i.e., surface preparation techniques), as well as mechanical fastening, and other methodologies for joining composites to other composites or metals, and similar assembly technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Composite Materials and Process Improvement Thrust for VCS\/ORP Affordability Initiative. Included efforts to develop\/optimize composite materials fabrication technology for reduced cost VCS and ORP construction.\n- Continued Composite Materials and Process Improvement Thrust for CVN 78 Affordability Initiative. Included efforts to develop\/optimize composite materials fabrication technology for reduced cost CVN 78 construction.\n- Continued Composite Materials and Process Improvement Thrust for DDG 51 Affordability Initiative. Included efforts to develop\/optimize composite materials fabrication technology for reduced cost DDG 51 construction.\n- Continued Composite Materials and Process Improvement Thrust for Joint Strike Fighter (JSF) Affordability Initiative. Included efforts to develop\/optimize composite materials fabrication technology for reduced cost JSF construction.\n- Continued Composite Materials and Process Improvement Thrust for CH-53K Affordability Initiative. Included efforts to develop\/optimize composite materials fabrication technology for reduced cost CH-53K construction.\n- Continued Composite Materials and Process Improvement Thrust for other high interest NAVSEA, NAVAIR, and Marine Corps platforms and components. \nIncluded support of affordability initiatives for the six acquisition platforms in the Navy ManTech investment strategy"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Composite Materials and Process Improvement Thrust and fabrication efforts for VCS\/ORP, CVN 78, DDG51, JSF, CH-53K.  Continue Composite Materials and Process Improvement Thrust for other high interest NAVSEA, NAVAIR, and Marine Corps platforms and components.  Includes support of affordability initiatives for the six acquisition platforms in the Navy ManTech investment strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technical activities include (1) the design of a flexible robotic composites manufacturing cell for CH-53K fabrication for improved process repeatability, increased part quality, and reduced risk as production rates increase; (2) development of an improved and more affordable false deck panel concept for use in equipment spaces on DDG 51 Class destroyers constructed at both Bath Iron Works and HII-Ingalls and CVN 78 Class carriers constructed at HII-Newport News Shipbuilding; (3) development and proof of manufacturing technology for composite exhaust uptakes for the DDG 51 Class destroyers (for both Bath Iron Works and HII-Ingalls ships) for cost neutral or better acquisition cost, 60% reduction in maintenance costs, and 30% weight reduction; and (4) development of the equipment, processes, and methods needed to implement a system capable of fully automated optical inspection of MOD's (minor optical defects) on F-35 production transparencies and eliminate subjective, variable visual analysis currently done by individual operators."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no change in the requested budget from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronics Processing and Fabrication"
                                    },
                                    "Description": {
                                        "val": "The primary technical goal of the Electronics Processing and Fabrication activity is improving electronic weapon systems affordability by developing and transitioning affordable, robust manufacturing processes and capabilities for electronics critical to defense applications over their full life-cycle.  Efforts create new and improved electronics\/electro-optics manufacturing processes for transition to the production floor.  Emphasis is on affordability for the following platforms: VIRGINIA Class Submarine (VCS)\/COLUMBIA Class Submarine (CLB), DDG 51 Class Destroyer, CVN 78 Class Carrier, Joint Strike Fighter (JSF), and CH-53K Heavy Lift Helicopter.  Electronics processing and fabrication technology areas include but are not limited to Electronics manufacturing technology (materials, devices, circuits, modules, subsystems); Semiconductor devices\/vacuum electronics\/passive components; compound semiconductors\/wide bandgap semiconductors; low-cost, high-throughput manufacturing and assembly techniques; nanoelectronics; electronics packaging technologies (including tamper proof and non-hermetic approaches); optics manufacturing technology (materials devices, circuits, modules, subsystems); optical interconnects; fiber optics and photonics; technologies for electronics and electro-optics testing and evaluation; optical imaging for manufacturing operations; and directed energy weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Electronics\/Electro-Optics Thrust for Joint Strike Fighter (JSF) Affordability Initiative. Included efforts to improve electronics\/ electro-optics affordability for JSF construction.\n- Continued Electronics\/Electro-Optics Thrust for CH-53K Affordability Initiative. Included efforts to improve electronics\/ electro-optics affordability for CH-53K construction.\n- Continued Electronics\/Electro-Optics Thrust for other high interest NAVSEA, NAVAIR, and Marine Corps platforms and components.\n- Continued Electronics\/Electro-Optics Thrust for VCS\/ORP Affordability Initiative. Included efforts to improve electronics\/electro-optics affordability for VCS and ORP construction.\n- Continued Electronics\/Electro-Optics Thrust for DDG 51 Affordability Initiative. Included efforts to improve electronics\/ electro-optics affordability for DDG 51 construction.\n- Continued Electronics\/Electro-Optics Thrust for CVN 78 Affordability Initiative. Included efforts to improve electronics\/electro-optics affordability for CVN 78 construction.\nIncludes support of affordability initiatives for the six acquisition platforms in the Navy ManTech investment strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Electronics\/Electro-Optics Thrust and fabrication efforts for JSF, CH-53K, VCS\/ORP, DDG51, CVN 78.  Continue Electronics\/Electro-Optics Thrust for other high interest NAVSEA, NAVAIR, and Marine Corps platforms and components.  Includes support of affordability initiatives for the six acquisition platforms in the Navy ManTech investment strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technical activities include (1) development of the technology to repurpose digital electronics currently used in the F-35 Joint Strike Fighter Active Electronically Scanned Array (AESA) radar system to accommodate Joint Strike Fighter (JSF) global positioning system (GPS) system functions with significantly improved anti-jamming capabilities; (2) development of a reduced cost manufacturing process for two of the most costly of seven elements in the optical train of the F-35 Helmet Mounted Display (HMD) Relay Optical Assembly (ROA) for the F-35 Joint Strike Fighter; (3) development of drone technology for the inspection of CVN 78 Class carrier tanks to replace currently used manual inspection techniques which are labor intensive, inefficient, and risky from a safety perspective; and (4) prototype a modern radar system architecture with open and common Radio Frequency (RF) components that demonstrate the capability to implement requirements for two significantly different radar systems to support the baseline for the Next Generation Surface Search Radar (NGSSR) for both CVN 79 Class carrier and DDG 51 Class destroyer."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no change in the requested budget from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metals Processing and Fabrication"
                                    },
                                    "Description": {
                                        "val": "The primary technical goal of the Metals Processing and Fabrication activity is to develop affordable, robust manufacturing and repair processes\/capabilities for metals and special materials critical to Navy weapon system applications.  Emphasis is on affordability for the following platforms: VIRGINIA Class Submarine (VCS)\/COLUMBIA Class Submarine (CLB), DDG 51 Class Destroyer, CVN 78 Class Carrier, Joint Strike Fighter (JSF), and CH-53K Heavy Lift Helicopter.  This activity also includes the development, optimization, and transition of repair technology for the repair, overhaul, and sustainment of key navy systems.  Metals processing and fabrication technology areas include but are not limited to: processing methods; metals additive manufacturing; metallic materials-based systems; casting; joining techniques; machining; surface and heat treatments; coating\/cladding; assembly; metal\/non-metals interfaces issues; and inspection and compliance verification."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Metals Processing Thrust for DDG 51 Affordability Initiative. Included efforts to improve affordability for DDG 51 construction.\n- Continued Metals Processing Thrust for CVN 78 Affordability Initiative. Included efforts to improve affordability for CVN 78 construction.\n- Continued Metals Processing Thrust for JSF Affordability Initiative. Included efforts to improve affordability for JSF construction.\n- Continued Metals Processing Thrust for CH-53K Affordability Initiative. Included efforts to improve affordability for CH-53K construction.\n- Continued Metals Processing Thrust for other high interest NAVSEA, NAVAIR, and Marine Corps platforms and components.\n- Continued Repair Technology (RepTech) Thrust to develop, optimize, and transition repair technology for key naval platforms at depots and logistics centers.\n- Continued Metals Processing Thrust for VCS\/OR Affordability Initiative. Includes efforts to improve affordability.\nIncluded support of affordability initiatives for the six acquisition platforms in the Navy ManTech investment strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Metals Processing Thrust and fabrication efforts for DDG51, CVN 78, CH-53K, VCS\/OR and JSF.  Continue Metals Processing Thrust for other high interest NAVSEA, NAVAIR, and Marine Corps platforms and components. Continue Repair Technology (RepTech) Thrust to develop, optimize, and transition repair technology for key naval platforms at depots and logistics centers.\nIncludes support of affordability initiatives for the six acquisition platforms in the Navy ManTech investment strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technical activities include (1) developing a manufacturing cell concept for the automated welding of submarine appendages (for both VIRGINIA and COLUMBIA construction) to replace the currently used manual approaches that are both labor-and time-intensive; (2) improvement of hull frame fabrication for the VIRGINIA and COLUMBIA Class submarines by developing and implementing a robotic solution that increases weld quality, decreases out-of-circularity fit up issues, and reduces the amount of welding and inspection man hours; and (3) improvement of foundry castings at HII-Newport News for CVN 78 Class carriers and VIRGINIA Class submarines by validating the use of shrouds to minimize air exposure of the molten metal and developing devices, procedures, and processes needed to implement the process with NNS legacy equipment and processes."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no change in the requested budget from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturing Enterprise\/Other"
                                    },
                                    "Description": {
                                        "val": "The Manufacturing Enterprise\/Other activity includes: (1) efforts targeted towards improving, in general, the manufacturing enterprise for the production of key naval platforms (both shipbuilding and aircraft); (2) energetic efforts; (3) naval research enterprise and laboratory support for key projects; and (4) technical program support. Manufacturing Enterprise addresses the development, optimization, and transition of manufacturing enterprise technology to key naval platform suppliers.  Emphasis is on affordability for the following shipbuilding platforms: VIRGINIA Class Submarine (VCS)\/COLUMBIA Class Submarine (CLB), DDG 51 Class Destroyer, CVN 78 Class Carrier, Joint Strike Fighter (JSF), and CH-53K Heavy Lift Helicopter.  Manufacturing enterprise technology areas include, but are not limited to design for easier production\/design for manufacturability; development of build\/assembly strategies; modeling and simulation technologies; model-based tools and approaches to optimize ease of production; intelligent manufacturing planning and factory execution; elimination of inefficiencies in design optimization, material usage, labor utilization, work flow, etc.; supply chain procedures and improvements (such as network centric manufacturing capabilities to facilitate resilient and adaptable supply chains); development of more efficient structural fabrication product lines; streamlining of outfitting operations; prediction and reduction of welding distortion; advanced automation and robotics for manufacturing; advanced data analytics, artificial intelligence and machine learning for production environments; and inspection technologies such as digital radiography and ultrasonic technologies.  Energetics efforts concentrate on developing energetics solutions to ensure the availability of safe, affordable, and quality energetics products largely in support of Program Executive Office (PEO) Integrated Warfare Systems (IWS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.516"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Manufacturing Enterprise Thrust for DDG 51 Affordability Initiative. Included efforts to improve affordability for DDG 51 construction.\n- Continued Manufacturing Enterprise Thrust for CVN 78 Affordability Initiative. Included efforts to improve affordability for CVN 78 construction.\n- Continued Manufacturing Enterprise Thrust for JSF Affordability Initiative. Included efforts to improve affordability for JSF construction.\n- Continued Manufacturing Enterprise Thrust for CH-53K Affordability Initiative. Included efforts to improve affordability for CH-53K construction.\n- Continued Manufacturing Enterprise Thrust for other high interest NAVSEA, NAVAIR, and Marine Corps platforms and components.\n- Continued Energetics Thrust for PEO IWS and Other Acquisition Programs. Included energetics efforts to support PEO IWS and other acquisition programs.\n- Continued efforts to provide naval research enterprise and laboratory support for key projects.\n- Continued efforts to provide technical engineering support for the ManTech Program.\n Included support of affordability initiatives for the six acquisition platforms in the Navy ManTech investment strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.657"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Manufacturing Enterprise Thrust and fabrication efforts for DDG, CVN 78, JSF and CH-53K.  Continue Energetics Thrust for PEO IWS and Other Acquisition Programs. Included energetics efforts to support PEO IWS and other acquisition programs.  Continue efforts to provide naval research enterprise and laboratory support for key projects.  Continue efforts to provide technical engineering support for the ManTech Program.  Includes support of affordability initiatives for the six acquisition platforms in the Navy ManTech investment strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.138"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.138"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technical activities include (1) applying augmented reality (AR) and virtual reality (VR) by exploiting product model data to improve shipbuilding affordability for VIRGINIA Class and COLUMBIA Class (VCS and CLB) submarines, CVN 78 Class carrier, and DDG 51 Class destroyer; (2) creating a digital build sequence from the legacy VCS model to include the operations, material, joints, and views a worker needs to accomplish a particular unit of work to streamline both development time and rework required; and (3) develop Rapid Automated Technology Evaluation (RATE) capabilities for high rate automated F-35 aircraft assembly line automation processes to identify and predict any corrective actions necessary to not impact production schedules and product quality."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The Manufacturing Enterprise\/Other activity is increasing from FY19 to FY20 in order to perform additional technology development efforts to support the submarine industrial base ramp up and workload increase for VIRGINIA Payload Module and COLUMBIA Class Submarine production in addition to the continuing VIRGINIA Class Submarine 2 per year production."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Efforts are focused on affordability improvements (both acquisition and life-cycle) for specific key acquisition platforms as defined in the Navy ManTech Investment Strategy.  Currently, the majority of Navy ManTech efforts are focused on affordability improvements for: VIRGINIA Class Submarine (VCS)\/COLUMBIA Class Submarine (CLB), DDG 51 Class Destroyer, CVN 78 Class Carrier, Joint Strike Fighter (JSF), and CH-53K Heavy Lift Helicopter."
                        },
                        "PerformanceMetrics": {
                            "val": "The ManTech Program's overall goal is to transition production technology to reduce the cost of Navy weapon systems. Metrics are currently collected on the cost savings per hull or per aircraft for each of the primary affordability platforms: VIRGINIA Class Submarine\/COLUMBIA Class Submarine (VCS\/CLB), DDG 51 Class Destroyer, CVN 78 Class Carrier, Joint Strike Fighter (JSF), and CH-53K Heavy Lift Helicopter."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "9.657"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.657"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.657"
                                        },
                                        "Text": {
                                            "val": "This effort addressed shipbuilding affordability for the ships in the Navy ManTech investment strategy VIRGINIA Class Submarine (VCS)\/COLUMBIA Class (CLB), DDG 51 Class Destroyer, and CVN 78 Class Carrier.  The work focused on automation and robotics technology development, application and connection to product model data."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}