{
    "id": "2020-AirForce-PB-3600-MJBOOK-1-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-24",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0305251F"
        },
        "ProgramElementTitle": {
            "val": "Cyberspace Operations Forces and Force Support"
        },
        "R1LineNumber": {
            "val": "55"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "35.000"
            },
            "BudgetYearOneBase": {
                "val": "35.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "43.000"
            },
            "BudgetYearThree": {
                "val": "44.000"
            },
            "BudgetYearFour": {
                "val": "45.000"
            },
            "BudgetYearFive": {
                "val": "45.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "35.000"
                },
                "BudgetYearOneBase": {
                    "val": "35.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "35.000"
                },
                "BudgetYearOneBase": {
                    "val": "35.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "35.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "35.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 increase for new start of Air Force CMF Foundational Tool program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "646008"
                    },
                    "ProjectTitle": {
                        "val": "US Cyber Command Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "35.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "43.000"
                        },
                        "BudgetYearThree": {
                            "val": "44.000"
                        },
                        "BudgetYearFour": {
                            "val": "45.000"
                        },
                        "BudgetYearFive": {
                            "val": "45.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This program, BA 4, PE 0305251F, project 646008, CMF Foundational Tools, is a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "Foundational Tools provide advanced cyber warfare capabilities to the Air Force Cyber Mission Forces in direct support of US Cyber Command (USCYBERCOM), AF Major Commands (MAJCOMs), unified commands, and national agency cyber warfighting requirements. Activities within the program deliver operations-ready cyberspace superiority capabilities through the research, development, testing, evaluation, accelerated prototyping, demonstration, and fielding of cyber technologies and capabilities. This program enables Combatant Commanders the ability to operate in and through cyberspace to manipulate, disrupt, deny, degrade, or destroy targeted computers, information systems, and networks. \n\nCapabilities prototyped and developed in this program are incorporated into the Air Force Distributed Cyber Warfare Operations (DCWO) portfolio. The DCWO portfolio enables delivery of cyber effects to Combatant Commanders to include cyber operational preparation of the environment, offensive counter-cyber, cyber-attack, electronic warfare operations, mission planning, intelligence, cybersecurity products and services and Command and Control\/Situational Awareness (C2SA) tools needed to attack enemy networks, telephony, Integrated Air Defense Systems (IADS), command and control systems, and create cyber effects through the Electromagnetic Spectrum (EMS).\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver CMF Foundational Tool capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis effort is in Budget Activity 4, Advanced Component Development and Prototypes (ACD&P), because efforts are necessary to evaluate integrated technologies, representative modes or prototype systems in a high fidelity and realistic operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CMF Foundational Tools"
                                    },
                                    "Description": {
                                        "val": "The CMF Foundational Tools program develops a family of foundational cyber tool prototypes at scale ready for integration and operational test in the Distributed Cyber Warfare Operations (DCWO) portfolio. This effort equips the Air Force portion of the Cyber Mission Force support strategy, and significantly leverages joint partnerships with US Cyber Command, other service development offices, and other government agencies. Details of specific tool development efforts are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.000"
                                            },
                                            "Text": {
                                                "val": "- Will expand FY18-FY19 USCYBERCOM-funded efforts to produce prioritized family of foundational tools\n\n- Will develop additional tool development software factories\n\n- Will transition and integrate available prototype tool kits to DCWO portfolio\n\n- Will deliver prototype tools into USCYBERCOM architecture to ensure interoperability\n\n- Will develop automated testing and information assurance support tools"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This program leverages previous USCYBERCOM and Air Force foundational tool development efforts. These efforts were funded in other programs and the FY20 funds in this program will address the expanded Air Force requirement to deliver diverse Cyber Mission Force foundational tools."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The CMF foundational tools program is aligned within the Distributed Cyber Warfare Operations (DCWO) program office. This program serves to create foundational tool prototypes at scale to enable the DCWO program office to quickly integrate and transition those tools into available operational capability. The foundational tools program office will utilize Concept, Development, Risk Management, Production, or Deployment Plans as part of a streamlined approach to acquisition planning. All plans will contain sufficient information for the Milestone Decision Authority (MDA) to determine readiness to enter into the applicable phase of the acquisition process. Foundational Tools prototyping efforts will be used in conjunction with the DCWO program to buy-down acquisitions risk and identify both new large-scale foundational efforts as well as short projects to leverage government and commercial solutions. The program will utilize both new and existing contractual vehicles, such as Government-Wide Acquisition Contract (GWAC) vehicles (Alliant, Encore II, Solutions for Enterprise-Wide Procurement IV (SEWP IV)), and General Services Administration (GSA) Federal Supply Schedules and a Cyber Indefinite Delivery Indefinite Quantity (IDIQ) contract. The use of multiple-award contractual vehicles will provide a wide range of commercially-available products and services that should be able to meet many requirements related to Offensive Cyberspace Operations. These multiple-award contractual vehicles have already met the statutory requirements of the Competition in Contracting Act (CICA), which requires a fair opportunity to all contract holders, in accordance with Federal Acquisition Regulation (FAR) 16.505, unless an exception to fair opportunity applies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CMF Foundational Tool Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Interoperability Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Automated Test Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CMF Foundational Tool Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "47 CTS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.900"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CMF Foundational Tool PSC (A&AS, FFRDC)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "CMF Foundational Tools"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "CMF Foundational Tool Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Interoperability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Automated Test Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}