{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-63",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604875D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Architecture Development"
        },
        "R1LineNumber": {
            "val": "144"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "19.102"
            },
            "PriorYear": {
                "val": "4.695"
            },
            "CurrentYear": {
                "val": "4.079"
            },
            "BudgetYearOne": {
                "val": "9.593"
            },
            "BudgetYearOneBase": {
                "val": "9.593"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "9.778"
            },
            "BudgetYearThree": {
                "val": "9.675"
            },
            "BudgetYearFour": {
                "val": "9.368"
            },
            "BudgetYearFive": {
                "val": "9.614"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY2019 funding request was reduced by $0.006 million to account for the availability of prior year execution balances. In FY2020, the increase (approximately $4M) in JSAD funds is due to  new and expanded mission areas and requirements in the Assistant Secretary of Defense for Acquisition  (ASD(A) portfolio  as a result of the USD A&S reorganization.  These funds will support the Electronic Warfare Executive Committee recommended projects on Electronic Battle Management (EMBM), and the development of a comprehensive electronic warfare strategy to identify gaps and requirements across the Department. The funds will include support to the mission engineering analyses and integration to incorporate soft kill and Electronic Warfare effects, and weapon systems in critical mission thread areas in order to meet evolving threats."
        },
        "ProgramElementMissionDescription": {
            "val": "Department and acquisition reform initiatives call for top down, national security strategy-driven capabilities-based planning. Department of Defense (DoD) Instruction 5000.02 and Chairman of the Joint Chiefs of Staff Instruction 3170.01 promulgate capabilities-based requirements and acquisition processes. The JSAD program enables collaborative efforts to achieve these goals with a focus on Major Defense Acquisition Programs (MDAPs). These efforts include warfighting capability-based analyses; assessments of joint capability areas and joint integrating concepts; development of system-related data; integrated roadmaps to support acquisition investment decisions; and assessments of MDAPs in a capability area context.  Activities in the JSAD project are divided into three areas:  (1) capability-based analysis; (2) roadmaps; and (3) support tools and guidance. Capability-based analysis provides analysis of the different technology, functionality, and integration impacts of systems on warfighting capability.  Acquisition roadmaps guide systems development and associated investment plans.  JSAD support tools and guidance initiatives develop systems data, and tools, exploit modeling and simulation and architecture efforts to improve DoD’s overall assessment capability.  These efforts guide the development and improve the testing and fielding of integrated systems of systems in order to achieve Joint mission capabilities.  The Department has also undergone an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches. This means:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning, programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  To accomplish this direction, there needs to be a focused goal and concerted emphasis on shifting from systems acquisition to capabilities-based portfolio management (or portfolio systems acquisition).  This program enables collaborative efforts to implement the QDR direction outlined above in order to achieve portfolio systems acquisition goals.  The program is broken up into two focus areas (Portfolio Management and Reform Initiatives)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.851"
                },
                "CurrentYear": {
                    "val": "4.088"
                },
                "BudgetYearOne": {
                    "val": "9.953"
                },
                "BudgetYearOneBase": {
                    "val": "9.953"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.695"
                },
                "CurrentYear": {
                    "val": "4.079"
                },
                "BudgetYearOne": {
                    "val": "9.593"
                },
                "BudgetYearOneBase": {
                    "val": "9.593"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.156"
                },
                "CurrentYear": {
                    "val": "-0.009"
                },
                "BudgetYearOne": {
                    "val": "-0.360"
                },
                "BudgetYearOneBase": {
                    "val": "-0.360"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.147"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.009"
                                },
                                "CurrentYear": {
                                    "val": "-0.009"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "INV-D-032 CBDP - Biological and Chemical Threats Preparedness"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.360"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.360"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Nominal increase in FY19 program will result in an increased focus on increased level of effort for  land warfare and munitions and electronic warfare studies. In FY2020, the increase (approximately $4M) in JSAD funds is due to  new and expanded mission areas and requirements in the Assistant Secretary of Defense for Acquisition  (ASD(A) portfolio  as a result of the USD A&S reorganization.  These funds will support the Electronic Warfare Executive Committee recommended projects on Electronic Battle Management (EMBM), and the development of a comprehensive electronic warfare strategy to identify gaps and requirements across the Department. The funds will include support to the mission engineering analyses and integration to incorporate soft kill and Electronic Warfare effects, and weapon systems in critical mission thread areas in order to meet evolving threats."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "875"
                    },
                    "ProjectTitle": {
                        "val": "Portfolio Systems Acquisition (PSA)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "PriorYearsDelta": {
                        "val": "0.004"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.808"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.679"
                        },
                        "BudgetYearOne": {
                            "val": "4.092"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.092"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.413"
                        },
                        "BudgetYearThree": {
                            "val": "4.672"
                        },
                        "BudgetYearFour": {
                            "val": "4.257"
                        },
                        "BudgetYearFive": {
                            "val": "4.398"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY19 decrease represents realigning funds from the 875: Portfolio Systems Acquisition (PSA) project to the 220: Electronic Warfare Executive Committee (EW EXCOM) subproject within the Joint Systems Architecture Development (JSAD) mission. Funding enables a base program for  EW EXCOM to support the Warfighter by strengthening portfolio management and reform initiatives within the growing area of electronic warfare.In FY2020, the increase (approximately $4M) in JSAD funds is due to  new and expanded mission areas and requirements in the Assistant Secretary of Defense for Acquisition  (ASD(A) portfolio  as a result of the USD A&S reorganization.  These funds will support the Electronic Warfare Executive Committee recommended projects on Electronic Battle Management (EMBM), and the development of a comprehensive electronic warfare strategy to identify gaps and requirements across the Department. The funds will include support to the mission engineering analyses and integration to incorporate soft kill and Electronic Warfare effects, and weapon systems in critical mission thread areas in order to meet evolving threats.."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Departments 2005 Quadrennial Defense Review (QDR) laid out the need for an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches.  This meant:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning, programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  The Department’s 2010 QDR report further addressed reforming how we buy, noting that the conventional acquisition process is too long and too cumbersome to fit the needs of the many systems that require continuous changes and upgrades - a challenge that will become only more pressing over time. Better Buying Power (BBP) is the implementation of best practices to strengthen the Defense Department's buying power, improve industry productivity, and provide an affordable, value-added military capability to the Warfighter.  Launched in 2010, BBP encompasses a set of fundamental acquisition principles to achieve greater efficiencies through affordability, cost control, elimination of unproductive processes and bureaucracy, and promotion of competition. BBP initiatives also incentivize productivity and innovation in industry and Government, and improve tradecraft in the acquisition of services. The Department will improve how it matches requirements with mature technologies, maintains disciplined systems engineering approaches.  To accomplish this direction, there needed to be a focused goal and concerted emphasis on shifting from acquisition of individual systems to portfolio management (or portfolio systems acquisition).  This program enables collaborative efforts to implement the QDR direction outlined above and advance BBP initiatives to achieve portfolio systems acquisition goals and to develop and implement acquisition reform initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Portfolio Systems Acquisition (PSA)"
                                    },
                                    "Description": {
                                        "val": "The program is broken up into two focus areas (Portfolio Management and Reform Initiatives) and consolidates work previously performed under various other Program Elements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "-Continue and expand support Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conduct additional analyses and support implementation of updated Better Buying Power (BBP) initiatives.\n-Provide technical expertise in support of warfare area portfolios.\n-Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n-Continue \"reliability by design\", capability, capacity, and lethality analyses and support to programs.\n-Update roadmaps and where appropriate generate new roadmaps to guide investments in critical areas (e.g., future vertical lift, unmanned systems, ground vehicles, weapons\/munitions and Integrated Air and Missile Defense (IAMD)).\n-Continue analytical support for the IAMD portfolio.\n-Provide analytical support for the munitions process, from requirements generation to demilitarization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.679"
                                            },
                                            "Text": {
                                                "val": "-Continue and expand support Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conduct additional analyses and support implementation of updated Better Buying Power (BBP) initiatives.\n-Provide technical expertise in support of warfare area portfolios.\n-Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n-Continue \"reliability by design\", capability, capacity, and lethality analyses and support to programs.\n-Update roadmaps and where appropriate generate new roadmaps to guide investments in critical areas (e.g., future vertical lift, unmanned systems, ground vehicles, weapons\/munitions and Integrated Air and Missile Defense (IAMD)).\n-Continue analytical support for the IAMD portfolio.\n-Continue analytical support for the munitions process, from requirements generation to demilitarization.\n- Continue A&S staff re-organization efforts resulting from the dissolution of OUSD(AT&L).\n- Pilot and establish Mission Engineering practice within A&S to evaluate warfighter priority mission areas with a rigorous, data-driven analytic process to determine how systems work together in an operationally relevant environment and identify ways to integrate technology and systems to provide affordable capability solutions for our warfighters"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.092"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.092"
                                            },
                                            "Text": {
                                                "val": "-Continue to expand support Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conduct additional analyses and support implementation of updated Better Buying Power (BBP) initiatives.\n-Provide technical expertise in support of warfare area portfolios.\n-Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n-Continue \"reliability by design\", capability, capacity, and lethality analyses and support to programs.\n-Update roadmaps and where appropriate generate new roadmaps to guide investments in critical areas (e.g., future vertical lift, unmanned systems, ground vehicles, weapons\/munitions and Integrated Air and Missile Defense (IAMD)).\n-Continue analytical support for the IAMD portfolio.\n-Continue analytical support for the munitions process, from requirements generation to demilitarization.\n- Continue A&S staff re-organization efforts resulting from the dissolution of OUSD(AT&L).\n- Pilot and establish Mission Engineering practice within A&S to evaluate warfighter priority mission areas with a rigorous, data-driven analytic process to determine how systems work together in an operationally relevant environment and identify ways to integrate technology and systems to provide affordable capability solutions for our warfighters"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "-N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2020 increase will result in greater focus on maritime interdiction\/mission engineering and ground interdiction personnel. Specifically personnel will develop outcomes based evaluation metrics and experimental designs to provide evaluation of mission effects\/kill chains. Ground interdiction personnel provide precision strike analysis to exploit projection of power via munitions intended to precisely hit specific surface targets, create area effects, or provide area denial, while minimizing collateral damage with increased lethality."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Not Applicable"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "220"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Warfare Executive Committee"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.294"
                        },
                        "PriorYear": {
                            "val": "4.695"
                        },
                        "CurrentYear": {
                            "val": "1.400"
                        },
                        "BudgetYearOne": {
                            "val": "5.501"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.501"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.365"
                        },
                        "BudgetYearThree": {
                            "val": "5.003"
                        },
                        "BudgetYearFour": {
                            "val": "5.111"
                        },
                        "BudgetYearFive": {
                            "val": "5.216"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Electronic Warfare (EW) Executive Committee (EXCOM) - co-chaired by the Under Secretary of Defense for Acquisition, Technology and Logistics and the Vice Chairman of the Joint Chiefs of Staff - is tasked to provide senior oversight, coordination, budget\/capability harmonization, and advice on EW matters to the Secretary of Defense, Deputy Secretary of Defense, and the Deputy's Management Action Group. This program develops, maintains, and implements the overarching DoD EW Strategy and Implementation Plan to achieve Electromagnetic Spectrum (EMS) superiority. This program provides technical analyses, technology assessments, capability and capability gap identification, intelligence and threat evaluations to inform DoD EW requirements, acquisition programs, and investment decisions. This program also advances EW needs in modeling, simulation, test, exercises, experimentation, and training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Executive Committee"
                                    },
                                    "Description": {
                                        "val": "Funds are to conduct analytic assessments of fielded and planned U.S. EW capabilities, threat analysis, and physics-based modeling and simulation of electronic warfare capabilities to support the Deputy Secretary of Defense-directed Electronic Warfare (EW) Executive Committee (EXCOM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.695"
                                            },
                                            "Text": {
                                                "val": "- Perform analytic underpinning for EW Strategy implementation, for synchronization of Services’ EW investments, and for advancing DoD EW capabilities, training, exercises, modeling and simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "- Develop plans and conduct Doctrine, Organization, Training, Material, Leadership and Education, Personnel, Facilities and Policy (DOTMLPF-P) initiatives to implement the Department's EW strategy.\n- Continue to perform the necessary analytic underpinning to develop and field advanced EW capabilities, including EW manning, training, exercises, modeling and simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.501"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.501"
                                            },
                                            "Text": {
                                                "val": "-Development  a comprehensive electronic warfare strategy to identify EW gaps and requirements across the Department.\n- Develop a mission engineering analyses and integration to incorporate soft kill and Electronic Warfare effects, and weapon systems in critical mission thread areas in order to meet evolving threats.\n-Develop plans and conduct Doctrine, Organization, Training, Material, Leadership and Education, Personnel, Facilities and Policy (DOTMLPF-P initiatives to implement the Department's EW strategy.\n- Continue to perform the necessary analytic underpinning to develop and field advanced EW capabilities, including EW manning, training, exercises, modeling and simulation.\n- Adds support Electromagnetic Battle Management (EMBM) activities to include: \nSpectrum consumption modeling,Force composability, data sharing policy standardization, Distributed kill-chains using heterogeneous (joint \/ partner \/ different industry partners) capabilities, and Joint airborne electronic attack mission optimization (simulation analysis)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2020 Increase due to an increasing emphasis on 3 electronic warfare initiatives:\n- Dedicated Red Team support \n- Electronic Battle Management (EMBM) activities\n- Training initativies and virtual tool development"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Not Applicable"
                        }
                    }
                }
            ]
        }
    }
}