{
    "id": "2020-Navy-PB-1319-JBOOK-70424d53d505ad36f58958e9097dbb4e960ff5c07915d7e5672a15384a45783b-9",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605853N"
        },
        "ProgramElementTitle": {
            "val": "Management, Technical & Intl Supt"
        },
        "R1LineNumber": {
            "val": "183"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "135.102"
            },
            "CurrentYear": {
                "val": "86.932"
            },
            "BudgetYearOne": {
                "val": "102.401"
            },
            "BudgetYearOneBase": {
                "val": "102.401"
            },
            "BudgetYearTwo": {
                "val": "100.981"
            },
            "BudgetYearThree": {
                "val": "101.029"
            },
            "BudgetYearFour": {
                "val": "101.346"
            },
            "BudgetYearFive": {
                "val": "103.306"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "International Cooperative RDT&E: provide program management, execution, and support to implement a broad range of cooperative Naval Research and Development, Test and Evaluation initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations, and identify cooperative international opportunities, and improve coalition interoperability.  In addition, it develops coherent approaches, coordinating with partner nations, to sea-based missile defense, command, control, communications, computers and intelligence (C4I), and cooperative acquisition programs while also identifying technology to support the Global Maritime Partnership initiative.\n\nNaval War College Strategic Studies Support:  \n\nProvides research, analysis and gaming activities which serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, joint and interagency communities.  These efforts generate strategic and operational alternatives, quantitative analysis, war gaming and political military assessments, and provide recommendations regarding the formulation and execution of maritime options .  The War Gaming Department plans, designs, executes, analyzes and reports on the Navy's Title 10 war games.  These war games provide analytical input to the Navy's Strategic Plan, assessments of future concepts, and recommendations to the Navy's Quadrennial Defense Review, force design, and strategy process.  The War Gaming Department also designs, executes and analyzes war games for theater security cooperation plans and operational war fighting issues.  \n\nAssessment Program: \n\nThe Navy Assessment Program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect war fighting capability trades and enterprise resources, identifies needs, gaps, and overlaps, and assesses alternative solutions to Joint needs.  The program supports both the development and use of modeling, simulation and analytically-based warfare and provides business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations (CONOPS), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Systems (Information Dominance); warfare systems (Sea Strike, Sea Shield, and Sea Basing) and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports \"A Cooperative Strategy for 21st Century Seapower 21\" as modified by the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring or reacting quickly should one occur to avoid negative impact to the United States.  It serves as an independent assessor providing a broad-view perspective across the Navy staff apart from resource sponsors, with an integrated look at both war fighting and war fighting support programs.  The program supports the world class modeling efforts to attain a level of Modeling and Simulation (M&S) capability that is world class and establishes the Navy as a leader in the Department of Defense (DoD) M&S community.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.  It develops tools and analytical methodologies that assist in evaluating Navy programs and provides technical leadership for the analysis functional area of Naval Modeling and Simulation.\n\n\nOperations Integration Group:  Classified\n\nNaval Research Laboratory (NRL)Facilities Modernization: This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old.\n\nThe Joint Information Environment (JIE) initiative provides the supporting IT capability framework comprised of shared information technology infrastructure, enterprise services, interoperability with coalition partners and a single security architecture that enables mission commanders to execute mission partnered operations.  JIE provides the U.S. configuration controls necessary for enterprise capabilities.  By utilizing a U.S enterprise-wide secure Identity and Access Management system, JIE ensures that authorized users at the right classification level gain access to only the data and services they are entitled.  The continued development and refinement of a Joint Information Environment will provide for a significant improvement in data sharing within, and between, coalition maritime elements.\n\nMTMD - Maritime Theater Missile Defense Forum:\n\nThis project funds participation in Maritime Integrated Air and Missile Defense projects with other nations through the Maritime Missile Defense Projects Framework Memorandum of Understanding of 2004 (as amended 2009, 2015, and 2016).Known as the Maritime Theater Missile Defense (MTMD)Forum, it promotes interoperability with the Navies of eleven participating nations (Australia, Canada, Denmark, France, Germany, Italy, Netherlands, Norway, Spain, United Kingdom and the United States).  This project funds participation in multiple Projects and includes a maritime contribution to\nthe NATO Active Layered Theater Ballistic Missile Defense (ALTBMD) project, now known as NATO Ballistic Missile Defense (BMD). Engineering analysis and recommendations from MTMD activities are provided to European, Pacific and\nCentral Combatant Commands to influence present day operations. Specifically, the MTMD Forum is addressing challenges with \"Maritime Allied Air Defense in Support of Ballistic Missile Defense Operations\" that face the Combatant Commanders during present day operations.  The MTMD Forum is leveraging At-Sea Demonstration (ASD) test events and operational Fleet Exercises  to integrate technology with concepts of operations developed within MTMD Forum working groups.\n\nThe MTMD Forum develops systems and techniques that enhance protection and defense against the proliferation of short, medium and long-range Ballistic Missile (BM) and Advanced Anti-Ship Cruise Missile (ASCM) threats through the development of interoperable sea-based Integrated Air and Missile Defense (IAMD) capability among coalition nations.  This includes protection across the full spectrum of these threats through the enhanced utilization of existing sea-based systems to protect against current threats while progressively improving and developing systems and system-of- systems to effectively counter evolving threats. \n\nThis project supports USN participation in several Maritime IAMD related Project Arrangements and Working Groups including:\n\n(1)  Battle Management Command, Control, Communications, Computers, and Intelligence (BMC4I) to define and develop architectures as well as to perform engineering to address coalition capability gaps. \n(2)  Modeling & Simulation (M&S) to establish and maintain a maritime coalition M&S testbed and to perform legacy and future systems simulation testing.\n(3)  Coalition Distributed Engineering Plant (CDEP) to establish and maintain a maritime coalition Hardware-in-the-Loop Testbed and to conduct CDEP testing.\n(4)  Open Architecture (OA) to develop Interface Standards and Data Models.\n(5)  Test Planning and Execution (TPEX) to develop Test Plans, oversee exercise participation and conduct post event data analysis and reporting.\n(6)  Operational Requirements (OR) to develop a Coalition Maritime Missile Defense Operational Concept Document and to identify operational constraints and tactical constructs surrounding coalition maritime missile defense activities.\n(7)  Reciprocal Use of Test Facilities agreements with other nations to support Maritime IAMD and MTMD related demonstrations.\n(8) Tactical Advancement for Next Generation (TANG) to work with our Allies and International Partners using human-centered design methodologies to identify solutions to technology and sailor performance issues that have been cited during previously conducted experiments, exercises, and demonstrations.  This process will seek to leverage R&D investments and risk reduction research commercial companies are making today that can provide potential \"dual use\" technology and process solutions to complex problems.\n\n\nAnti-Tamper (AT): The AT program performs as the Navy Technical Process Owner for the Anti-Tamper systems engineering activity that is intended to prevent and\/or delay the exploitation of critical technologies in U.S. systems; manages the research, design, development, implementation, and testing of AT measures and coordinates with Department of Defense AT Executive Agent.  Starting in FY19, funding for AT is realigned to PE 0605024N Anti-Tamper Technology Support.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "94.562"
                },
                "CurrentYear": {
                    "val": "87.565"
                },
                "BudgetYearOne": {
                    "val": "97.717"
                },
                "BudgetYearOneBase": {
                    "val": "97.717"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "135.102"
                },
                "CurrentYear": {
                    "val": "86.932"
                },
                "BudgetYearOne": {
                    "val": "102.401"
                },
                "BudgetYearOneBase": {
                    "val": "102.401"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "40.540"
                },
                "CurrentYear": {
                    "val": "-0.633"
                },
                "BudgetYearOne": {
                    "val": "4.684"
                },
                "BudgetYearOneBase": {
                    "val": "4.684"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.633"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.718"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "5.203"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.203"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.519"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.519"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.743"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "45.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "PRJ 0149 International Coop RDT&E:\n- The increase FY2019 to FY2020 is to support requests for additional ESEP Participation from Partner and Allied Nations.  In addition, this increase continues to support the establishment of the Maritime Theater Anti-Submarine Warfare (M-TASW) effort, providing focus on TASW efforts in the Indo-Pacific region with Japan and Australia.\nPRJ 1767 Naval War Col Strategic Studies Supt:\n- Naval War Gaming Support - Increased funding from FY 2019 to FY 2020 continues resourcing of the Naval War College's expansion to execute high security war gaming and research.\nPRJ 2098 - Navy Postgraduate School (NPS) Studies Support:\n- Faculty and Student Studies, Analysis and Research - The decrease from FY 2019 to FY 2020 reflects fewer studies being conducted in FY 2020.\nPRJ 2221 JT Mission Assessment Studies:\n- Navy Studies & Analysis - FY 2019 to FY 2020 increase reflects inflation and need for concept studies to inform Fleet architecture and future force structure, continued development of a new model to improve the Navy's capabilities in Anti-Submarine Warfare (ASW) mission-level analysis and increased need for modeling and simulation support for Campaign analysis and ongoing OPNAV missile defense analysis requirements.\nPRJ 3017 Enterprise Information Systems:\n- Increase in FY 2020 reflects transfer of NGEN corporate funding from 0605861N RDT&E Science and Technology Management.\nPRJ 3027 Defense Critical Infrastructure Program:\n- Mission Assurance Assessments Support - The funding increase from FY 2019 to FY 2020 supports assessments concerned with strategic missions that will require follow on mitigation analysis and solution refinement, with potential for persistent cyber network evaluation at multiple sites. Funding addresses the planned assessment support of 32 sites or installations with 10 being OCONUS. Additionally, this tasking covers unplanned events like hurricanes, tornadoes and earthquakes that threaten DoD installations and supporting infrastructure, as well as 2-3 planned COCOM exercise events (Vigilant Shield, Ardent Sentry, and PANAMAX).\n- Cyber Mission Assurance - The funding increase from FY 2019 to FY 2020 reflects increased research on network mission assurance of defense missions and operations and enhancements of Red Team assessment capabilities. These capabilities increase the amount of time and labor required to maintain awareness of network vulnerabilities during and post-assessment to enhance the mitigations and solutions for cyber security of critical Navy and DoD networks. This persistence increases the costs associated with conducting these evaluations. The increased cost reflects the additional red team members necessary to conduct 2-3 cyber mission assurance assessments per year across DoD and NAVSEA enterprises.\nDefense Critical Electric Infrastructure - The funding increase from FY 2019 to FY 2020 reflects the increased focus on electric grid dependencies and vulnerabilities that Energy Security analysis has revealed and the efforts to increase DoD and Interagency resilience from the natural or manmade effects. 79 installations will need analysis of their critical electric power paths supported by 47 utility providers, entities needed for implementation and execution that require constant attention to ensure reliable data and analytical rigor is applied. Multiple interagency entities will be involved with both exercise (Liberty Eclipse, NERC Grid Ex, and follow on) and potential real world issues involving complex policy and technical guidance, increasing costs to the program to maintain the data from multiple industry databases.\n- Mission Assurance Program Management -  The funding increase from FY 2019 to FY 2020 reflects the increased oversight from management efforts and utilization of centralized management tool (Innoslate) to better track programmatic requirements and subsequent related tasks, costs, and contracts.\n- Defense Critical Infrastructure - The funding increase from FY 2019 to FY 2020 supports infrastructure specific asset analysis to particular DoD assets and missions, the Defense Industrial Base, and the supporting infrastructure. To provide a more overarching view of mission analysis, the increase reflects the prototype and use of models based system engineering methods and tools to enhance deliverables being asked for by senior leadership. Congressional legislative pilot studies from NDAA 1647 and 1650 related to cybersecurity of weapons platforms and critical infrastructure are due in 2020 and will need follow on analysis for the multiple weapons platforms and critical infrastructure on at least 2 prioritized sites.\n- Defense Critical Mission -  The funding increase from FY 2019 to FY 2020 reflect a larger number of DCMs being assessed during the period of performance. This includes 2-3 sites \/ installations every other month, necessitating an increase in assessment team members and analytical tools.\n\n\nPRJ 3312 MTMD - Maritime Theater Missile Defense Forum:\n- FY 2020 increase due to ramped up requirements for At-SEA demonstration for Ballistic Missile targeting.\nPRJ 3330 - Naval Research Laboratory (NRL) Facilities Modernization:\n- NRL Facilities Modernization -  The increase in FY 2020 is planned for projects to replace critical equipment in the upgraded and relocated labs across NRL.\nPRJ 3363 - PACON Initiative:\n- PACOM Initiative -  Increased funding will support more advanced, critical research projects that address China Strategic Initiative Derivation knowledge gaps; further enhancement and refinement of the Critical Factors Analysis suite of analytical tools and products; dramatic increase in both the quality and quantity Emulations at the strategic and operational levels as well as expanded development for the modeling and simulation technologies that support those events; increased scope and support for the INDOPACOM Media Project that will expand to cover all Combatant Commands with added line of effort to cover unique analysis of Chinese media censorship."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0149"
                    },
                    "ProjectTitle": {
                        "val": "International Coop RDT&E"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.886"
                        },
                        "CurrentYear": {
                            "val": "3.575"
                        },
                        "BudgetYearOne": {
                            "val": "3.658"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.658"
                        },
                        "BudgetYearTwo": {
                            "val": "3.513"
                        },
                        "BudgetYearThree": {
                            "val": "3.549"
                        },
                        "BudgetYearFour": {
                            "val": "3.623"
                        },
                        "BudgetYearFive": {
                            "val": "3.696"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Provides funding for program management, execution, and support activities to implement a broad range of cooperative naval Research and Development, Test and Evaluation (RDT&E) initiatives to improve coalition interoperability, harmonize US Navy requirements with allied and friendly nations,and identify cooperative international opportunities.   The funding is used to develop approaches to international cooperation consistent with combatant commanders (COCOMs), CNO, and SECNAV priorities in the maritime domain.\n\nVarious cooperative RDT&E programs, projects and exchanges are pursued to identify cooperative acquisition programs, enhance OCO efforts and MDA development, fill capability gaps, improve US\/coalition interoperability, and standardize defense capabilities with international partners. Such efforts have resulted in:\n1. Negotiating and developing approximately 57 international RDT&E Agreements annually with allied and friendly nations;\n2. Executing approximately 300 Information Exchange Annexes (IEAs) with foreign partners;\n3. Improving IEA information dissemination with allied and friendly countries and within Department of the Navy (DoN);\n4. Coordinating Navy inputs to the Office of the Under Secretary of Defense (OUSD) Acquisition, Technology, and Logistics (AT&L) Foreign Comparative Test (FCT) Program, and Coalition Warfare Program (CWP) as well as the DoN Technology Transfer Security Assistance Review Boards (TTSARB). \n5. Represent the US Navy in Office of the Secretary of Defense (OSD) directed Armaments Cooperation Forums, including the Conference of NATO Armaments Directors' groups {NATO Naval Armaments Group (NNAG)}, and Senior National Representative (SNR);\n6.  Funding of various international RDT&E support databases including Technical Project Officer (TPO), International Agreement Generators, Information\/Data Exchange Agreements, and Project Agreements\/Memorandums of Understanding;\n7. Funding for Engineering and Scientist Exchange Program (ESEP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Coop RDT&E"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.886"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue ongoing efforts from prior FY17\n-Continue to support Maritime Missile Defense (MTMD) Forum system engineering and BMD interoperability activities, including Forum staff support, and ongoing PA activities for Battle Management C4I, Coalition Distributed Engineering Plant, Modeling and Simulation, Force Level Open Architecture Standards, and At-Sea Demonstration\n-Continue execution of approximately 150 Information Exchange Agreements\/Data Exchange Agreements (IEA\/DEA) with more than 30 countries\n-Continue execution and support in placement of U.S. Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP)\n-Continue to coordinate U.S. Navy participation in OUSD (AT&L) Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements\n-Support U.S.-India Defense Technology and Trade Initiative Working Groups, including the Joint Working Group on Aircraft Carrier Technology Cooperation (JWGACTC), the Jet Engine Technology Joint Working Group (JETJWG), and the Joint Working Group on Naval Systems (JWGNS). \n-Support U.S.-India Defense Technology and Trade Initiative Information Exchange and Terms of Reference (TOR) exchanges to promote cooperative opportunity development.\n-Navy International Agreement Database maintenance and support\n-Execution of Above Water Working Group (AWWG)\n-Continue to support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.575"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts from prior FY's\n-Identify potential from an International Theater ASW Forum with foreign partners, similar in structure to the existing MTMD Forum.\n-Continue to support Maritime Missile Defense (MTMD) Forum system engineering and BMD interoperability activities, including Forum staff support, and ongoing PA activities for Battle Management C4I, Coalition Distributed Engineering Plant, Modeling and Simulation, Force Level Open Architecture Standards, and At-Sea Demonstration\n-Continue execution of approximately 150 Information Exchange Agreements\/Data Exchange Agreements (IEA\/DEA) with more than 30 countries\n-Continue execution and support in placement of U.S. Navy and partner nation engineers and scientists under OSD's Engineer and Scientist Exchange Program (ESEP)\n-Continue to coordinate U.S. Navy participation in OUSD (AT&L) Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements\n-Support U.S.-India Defense Technology and Trade Initiative Working Groups, including the Joint Working Group on Aircraft Carrier Technology Cooperation (JWGACTC), the Jet Engine Technology Joint Working Group (JETJWG), and the Joint Working Group on Naval Systems (JWGNS). \n-Support U.S.-India Defense Technology and Trade Initiative Information Exchange and Terms of Reference (TOR) exchanges to promote cooperative opportunity development.\n-Navy International Agreement Database maintenance and support\n-Execution of Above Water Working Group (AWWG)\n-Continue to support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.658"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.658"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts from prior FYs\n-Continue and increase support for an international Theater ASW Forum with foreign partners, including expansion of international participation in technical discussions.\n-Continue execution and support in placement of U.S. Navy and partner nation engineers and scientists under OSD's\nEngineer and Scientist Exchange Program (ESEP), with a focused increase (~4-5 additional\/year) on ESEP placements in Five Eye's nations, such as Australia and the United Kingdom.\n-Continue execution of approximately 150 Information Exchange Agreements\/Data Exchange Agreements (IEA\/DEA) with more than 30 countries\n-Continue to coordinate U.S. Navy participation in OUSD (AT&L) Coalition Warfare Program (CWP) selection processes to meet emerging military capability requirements\n-Support U.S.-India Defense Technology and Trade Initiative Working Groups, including the Joint Working Group on Aircraft Carrier Technology Cooperation (JWGACTC), the Jet Engine Technology Joint Working Group (JETJWG), and the Joint Working Group on Naval Systems (JWGNS).\n-Support U.S.-India Defense Technology and Trade Initiative Information Exchange and Terms of Reference (TOR) exchanges to promote cooperative opportunity development.\n-Execution of Above Water Working Group (AWWG)\n-Continue to support NATO Naval Armaments Group (NNAG) and Five Power Groups on cooperative programs\n-Contract support for Senior National Representative (SNR) and Navy International Programs Office for international outreach, development, and administrative activities\n-Travel support for SNR participation in Senior Naval National Representative (SNNR) meetings with key foreign partners, and for select NATO meetings in support of CNO priorities"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase FY2019 to FY2020 is to support requests for additional ESEP Participation from Partner and Allied Nations.  In addition, this increase continues to support the establishment of the Maritime Theater Anti-Submarine Warfare (M-TASW) effort, providing focus on TASW efforts in the Indo-Pacific region with Japan and Australia.  In future years this effort will expand to include the United Kingdom and others in support of coordinated global ASW strategy initiatives."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Navy International Cooperative RDT&E project supports the implementation of many international cooperative program activities throughout the Department of the Navy (DoN) RDT&E communities. The project funds DoN participation in NATO and OSD lead Armaments Cooperation as well as DoN lead international cooperation that promotes coalition interoperability and set standards with international partners. The focused activities under this project maximize the DoN's efforts by leveraging international technologies and funding to fill capabilities gaps, gain access to foreign research and testing data, and avoid duplication of research and development efforts. The performance goals and metrics are, in cooperation with Maritime Partner nations, to set and harmonize requirements, utilize respective technologies, encourage financial contributions and facilities use, and support forums and work that reduce DoN funding requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1767"
                    },
                    "ProjectTitle": {
                        "val": "Naval War Col Strategic Studies Supt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.434"
                        },
                        "CurrentYear": {
                            "val": "5.263"
                        },
                        "BudgetYearOne": {
                            "val": "5.658"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.658"
                        },
                        "BudgetYearTwo": {
                            "val": "5.769"
                        },
                        "BudgetYearThree": {
                            "val": "5.879"
                        },
                        "BudgetYearFour": {
                            "val": "5.991"
                        },
                        "BudgetYearFive": {
                            "val": "6.111"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Naval War College (NWC) research, analysis and gaming activities serve as a focal point, stimulus, and major source of strategic and operational thought within the Navy, Joint and Interagency communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analysis, war gaming, political-military assessments, and provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Studies"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts research in strategic studies in response to tasking from the Secretary of the Navy (SECNAV), Chief of Naval Operation (CNO), Fleet Commanders, numbered Fleet Commanders, and Combatant Commanders.  NWC research includes strategic documents produced by its Chinese Maritime Studies Institute (CMSI), Russia Maritime Studies Institute (RMSI), Center for Cyber Conflict Studies (C3S), and Institute for Future Warfare Studies (IFWS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.512"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted research and analysis projects and provided supporting events for OPNAV, the numbered Fleets, Navy Component Commanders, and the Combatant Commanders.  \n- Supported various elements of the OPNAV Staff on tasked research projects.\n- Conducted research of Chinese maritime capabilities and affairs to enhance understanding of global developments and provide studies and advice to CNO and the Fleet.\n- Conducted research in support of 6th Fleet, Naval Forces Europe, and Commander, Pacific Fleet on operational and strategic issues associated with Russian maritime capabilities worldwide.\n- Conducted research via the Institute for Future Warfare Studies focused on future strategic maritime environment and key future capabilities for the maritime force.\n- The Mahan Advanced Research Program produced year-long research efforts of deterrence issues including, but not limited to, nuclear capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.522"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, Navy Component Commanders, and Combatant Commanders.\n- Continue to support OPNAV Staff on tasked research projects.  \n- Conduct research into Chinese, Russian, and Future maritime capabilities and affairs in order to enhance understanding of global developments and provide studies and advice for CNO and Fleet.\n- Continue research on cyber capabilities, focusing on deterrence.\n- Continue Mahan Program research on deterrence capabilities with increased focus on Navy contribution to national nuclear deterrence missions and future Navy capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.532"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.532"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct research and analysis projects and provide supporting events for OPNAV, the numbered Fleets, Navy Component Commanders, and Combatant Commanders.\n- Continue to support OPNAV Staff on tasked research projects.  \n- Conduct research into Chinese, Russian, and Future maritime capabilities and affairs in order to enhance understanding of global developments and provide studies and advice for CNO and Fleet.\n- Continue research on cyber capabilities, focusing on deterrence.\n- Continue Mahan Program research on deterrence capabilities with increased focus on Navy contribution to national nuclear deterrence missions and future Navy capabilities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval War Gaming Support"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) conducts strategic and operational war gaming and research for Office of the\nChief of Naval Operations (OPNAV), the numbered Fleets, Fleet Commanders, and the Combatant Commanders. Each\nyear, 45-60 major war games and associated events provide support to efforts that explore and analyze military, political,informational and economic aspects of differing strategic and operational scenarios and tactical imperatives.\nNWC continues to expand its capability and capacity to execute war games of increased scope, magnitude and complexity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.350"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conducted 57 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.  \n- Executed 6 Executive Committee submitted and CNO approved war games at TS(SCI) level as well as Title X war games, directed research, and analysis.  \n- Facilitated war gaming support and expertise to other services' Title X war games.\n- Fostered and sustained cooperative relationships with international partners through use of war gaming, research, and analysis.\n- Developed and implemented capstone wargaming exercises that support the International Maritime Staff Operators Course.\n- Supported NWC International Programs in the development of a War Game Practitioner Certificate Program.\n- Conducted 2 Fleet Synchronization Conferences. \n- Executed a Top Secret capstone wargame exercise for the Joint Force Maritime Component Commander (JFMCC) Course.\n- Conducted international war gaming in support of Maritime Security Cooperation.  \n- Conducted Naval Staff College and Naval Command College War Games."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.157"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct 55-60 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.  \n- Conduct 8 Executive Committee submitted and CNO approved war games and Navy Title X war games, directed research, and analysis.  \n- Continue to foster cooperative relationships with international partners through use of war gaming, research, analysis and education.\n- Refine capstone war gaming exercises that support the International Maritime Staff Operators Course.\n- Execute Fleet Synchronization Conferences. \n- Execute capstone war game exercise for the Joint Force Maritime Component Commander (JFMCC) Course.\n- Resource and provision life cycle maintenance requirements for networks, communications, and modeling and simulation capacity.\n- Resource and provision required manpower and equipment for the High Security Research and Wargaming Facility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct 55-60 major war games and related events in support of OPNAV, the numbered Fleets, and the Combatant Commands.  \n- Conduct 8 Executive Committee submitted and CNO approved war games and Navy Title X war games, directed research, and analysis.  \n- Continue to foster cooperative relationships with international partners through use of war gaming, research, analysis and education.\n- Refine capstone war gaming exercises that support the International Maritime Staff Operators Course.\n- Execute Fleet Synchronization Conferences. \n- Execute capstone war game exercise for the Joint Force Maritime Component Commander (JFMCC) Course.\n- Resource and provision life cycle maintenance requirements for networks, communications, and modeling and simulation capacity.\n- Resource and provision required manpower and equipment for the High Security Research and Wargaming Facility."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding from FY 2019 to FY 2020 continues resourcing of the Naval War College's expansion to execute high security war gaming and research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfare Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Naval War College (NWC) supports senior decision-makers from the Department of Defense, Department of the Navy, the numbered Fleets, Fleet Commanders and Combatant Commanders in reaching well-informed, objective decisions on strategic, operational and programmatic issues through collaborative research which integrates traditional research and analysis with advanced decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conducted major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the Combatant Commanders in direct support of warfighting analysis requirements for numbered Fleet commanders, expanded to include Commander Seventh Fleet (C7F) with particular focus on India and the Indian Ocean.  \n- Conducted analytical research on key strategic and operational challenges such as maritime ballistic missile defense, proliferation security initiative, global maritime security, maritime situational awareness, maritime operations headquarters, interconnectivity, and multi-service force deployment.  \n- Evaluated concepts and decision events in conjunction with war gaming center.\n- Conducted research targeted at the strategic and policy level decision making within China and Russia.\n- Provided direct support to NWC student research groups and war gaming.\n- Conducted approximately 20 major decision events in support of these efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.544"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue conducting major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the Combatant Commanders.\n- Continue warfighting analysis requirements for numbered Fleet commanders.  \n- Continue analytical research on key strategic and operational challenges such as maritime ballistic missile defense, proliferation security initiative, global maritime security, maritime situational awareness, maritime operations headquarters, interconnectivity, and multi-service force deployment.  \n- Continue evaluation of concepts and decision events in conjunction with war gaming center.\n- Continue research targeted at the strategic and policy level decision making within China and Russia.\n- Continue providing direct support to NWC student research groups and war gaming.\n- Execute approximately 20 - 22 major decision events in support of these efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.555"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue conducting major decision events in support of OPNAV, the numbered Fleets, Fleet Commanders, and the Combatant Commanders.                                  \n- Continue warfighting analysis requirements for numbered Fleet commanders.  \n- Continue analytical research on key strategic and operational challenges such as maritime ballistic missile defense, proliferation security initiative, global maritime security, maritime situational awareness, maritime operations headquarters, interconnectivity, and multi-service force deployment.  \n- Continue evaluation of concepts and decision events in conjunction with war gaming center.\n- Continue research targeted at the strategic and policy level decision making within China and Russia.\n- Continue providing direct support to NWC student research groups and war gaming.\n- Execute approximately 20 - 22 major decision events in support of these efforts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NWC Student Research Projects"
                                    },
                                    "Description": {
                                        "val": "Selected top performing Naval War College (NWC) students to conduct focused research and analysis of current and future strategic and operational challenges and tactical imperatives.  These students are organized under the supervision of the Mahan Scholars Program and the Halsey Group Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.039"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conducted focused research, analysis and war gaming of current and future strategic\/operational challenges and tactical imperatives by the Halsey Groups and Mahan Scholars programs.\n- Research groups conducted focused research, analysis and free-play war gaming of current and future operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR).  Research and analysis efforts continued in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering information denial and missile defense at the theater joint operational level.  Researched involving travel to for Numbered Fleet Commands & COCOMS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct focused research, analysis and war gaming of current and future strategic\/operational challenges and tactical imperatives by the Halsey Groups and Mahan Scholars programs.\n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR). Research and analysis efforts continue in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering information denial and missile defense at the theater joint operational level."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.041"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.041"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct focused research, analysis and war gaming of current and future strategic\/operational challenges and tactical imperatives by the Halsey Groups and Mahan Scholars programs.\n- Research groups continue to conduct focused research, analysis and free-play war gaming of current and future operational challenges and tactical imperatives arising from regional threats, homeland defense and access denial efforts at the high end of the conflict spectrum in the Pacific, European Command (EUCOM), Central Command (CENTCOM) and Northern Command (NORTHCOM) area of responsibility (AOR). Research and analysis efforts continue in those areas above, and will be expanded to include a detailed focus on counter-targeting, operational deception, and countering information denial and missile defense at the theater joint operational level."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This project provides research, analysis and war gaming to meet the needs of the Secretary of the Navy, the Chief of Naval Operations, and Fleet Commanders.  Performance is measured in terms of both the quantity and quality of war games, analysis and the extent to which demand for war games and research products can be accommodated within funding levels.  Results of research products and war games are evaluated through customer feedback and the extent to which findings are incorporated into follow-on research and practical applications such as Navy doctrine, operational tactics, and programming decisions made during the Planning, Programming, Budgeting & Execution (PPBE) process."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2098"
                    },
                    "ProjectTitle": {
                        "val": "Navy Postgraduate School (NPS) Studies Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.335"
                        },
                        "CurrentYear": {
                            "val": "11.588"
                        },
                        "BudgetYearOne": {
                            "val": "10.840"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.840"
                        },
                        "BudgetYearTwo": {
                            "val": "11.220"
                        },
                        "BudgetYearThree": {
                            "val": "11.345"
                        },
                        "BudgetYearFour": {
                            "val": "11.582"
                        },
                        "BudgetYearFive": {
                            "val": "11.816"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Navy Postgraduate School (NPS) research and analysis activities serve as a focal point, stimulus, and major source of strategic, tactical and operational thought within the Navy communities.  These efforts generate strategic and operational alternatives, tactical imperatives, quantitative analyses, technical developments and assessments, and political-military assessments.  Also, provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States.  Research will be conducted that will enhance graduate education for Naval Officers and potentially provide students with areas of studies for theses and faculty projects. These research activities also serve as a means for OPNAV Resource Sponsors and Major Commands to have analysis and decision support research conducted in the uses of the applied, soft, and hard sciences in solving diverse and complex resource allocation and strategic issues facing the Navy today and envisioned in the future."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Faculty and Student Studies, Analysis and Research"
                                    },
                                    "Description": {
                                        "val": "Navy Postgraduate School (NPS) research and analysis activities serve as a focal point, stimulus, and major source of strategic, tactical and operational alternatives, tactical imperatives, quantitative analyses, technical developments and assessments, and political-military assessments. Also, provide recommendations to the Chief of Naval Operations (CNO), Fleet Commanders and numbered Fleet Commanders regarding the formulation and execution of maritime options for the President of the United States. Research will be conducted to support graduate students theses determination and completion as part of Faculty projects. These research activities also serve as a means for OPNAV Resource Sponsors and Major Commands to have analysis and decision support research conducted in the uses of the applied, soft, and hard sciences in solving diverse and complex resource allocation and strategic issues facing the Navy today and envisioned in the future."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.335"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Studies conducted in the following areas:\n\n- 1 in the area of Applied Mathematics\n- 15 in the area of Executive Education\n- 24 in the area of Computer Science\n- 107 in the area of Defense Analysis\n- 7 in the area of Electrical and Computer Engineering\n- 14 in the area of Energy Academic Group\n- 81 in the area of Business & Public Policy\n- 112 in the area of Information Sciences\n- 31 in the area of Information Sciences and Modeling, Virtual Environments and Simulation (MOVES)\n- 25 in the area of Mechanical and Aerospace Engineering\n- 10 in the area of Meteorology\n- 20 in the area of National Security Affairs\n- 12 in the area of Oceanography\n- 282 in the area of Operations Research\n- 32 in the area of Physics\n- 3 in the area of  Space Systems\n- 144 in the area of Systems Engineering"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Studies planned in the following areas:\n\n- 1 in the area of Applied Mathematics\n- 15 in the area of Executive Education\n- 24 in the area of Computer Science\n- 107 in the area of Defense Analysis\n- 7 in the area of Electrical and Computer Engineering\n- 14 in the area of Energy Academic Group\n- 81 in the area of Business & Public Policy\n- 112 in the area of Information Sciences\n- 31 in the area of Information Sciences and Modeling, Virtual Environments and Simulation (MOVES)\n- 25 in the area of Mechanical and Aerospace Engineering\n- 10 in the area of Meteorology\n- 20 in the area of National Security Affairs\n- 12 in the area of Oceanography\n- 282 in the area of Operations Research\n- 32 in the area of Physics\n- 3 in the area of  Space Systems\n- 144 in the area of Systems Engineering"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.840"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.840"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Studies planned in the following areas:\n\n- 1 in the area of Applied Mathematics\n- 15 in the area of Executive Education\n- 24 in the area of Computer Science\n- 97 in the area of Defense Analysis\n- 7 in the area of Electrical and Computer Engineering\n- 14 in the area of Energy Academic Group\n- 76 in the area of Business & Public Policy\n- 112 in the area of Information Sciences\n- 31 in the area of Information Sciences and Modeling, Virtual Environments and Simulation (MOVES)\n- 25 in the area of Mechanical and Aerospace Engineering\n- 10 in the area of Meteorology\n- 20 in the area of National Security Affairs\n- 12 in the area of Oceanography\n- 275 in the area of Operations Research\n- 32 in the area of Physics\n- 3 in the area of  Space Systems\n- 135 in the area of Systems Engineering"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 reflects fewer studies being conducted in FY 2020 within the areas of Defense Analysis, Business and Public Policy, Operations Research and Systems Engineering."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This Project provides funding to support continuing need for studies and analysis to meet the needs of the Secretary of the Navy, the Chief of Naval Operations, Resource Sponsors, Major Commands and Fleet Commanders.  Performance is measured in terms of both the quantity and quality of the studies, research and analysis products that can be accommodated within funding levels. Results of research products are evaluated through customer feedback and the extent to which findings are incorporated into follow-on research and practical applications such as Navy doctrine, operational tactics, and programming decisions made during the Planning, Programming, Budgeting & Execution (PPBE) process.  This project supports research of both Naval Postgraduate School faculty and students."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2221"
                    },
                    "ProjectTitle": {
                        "val": "JT Mission Assessment Studies"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "23.998"
                        },
                        "CurrentYear": {
                            "val": "25.134"
                        },
                        "BudgetYearOne": {
                            "val": "25.799"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.799"
                        },
                        "BudgetYearTwo": {
                            "val": "25.866"
                        },
                        "BudgetYearThree": {
                            "val": "26.399"
                        },
                        "BudgetYearFour": {
                            "val": "26.894"
                        },
                        "BudgetYearFive": {
                            "val": "27.454"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This exhibit has been updated to reflect the establishment of the Navy Analytic Office (NAO) which is responsible for the executive oversight of Navy studies and analysis.  The NAO was stood up to better align the annual Analytic Agenda to CNO's strategic priorities while also providing for study of the more tactical requirements of the Fleet and Navy writ large.  The outcome will be synchronized modeling, simulation, assessments, wargames, experiments and exercises providing rich, shared data to support and refine warfighting concepts and to inform budget decisions. \n \nThe Navy Assessment Program supports the Analytic Agenda by providing both the development and use of modeling, simulation and analytically-based warfare, business analyses and analytic tools that provide the basis for decision making with respect to concepts of operations (CONOPS), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Systems; warfare systems, and analytical underpinnings\/basis for programmatic decisions of the Navy's top leadership regarding their architectures, force structure, and the Navy's core \"organize, train, and equip mission\" (the warfare and provider Enterprises).  The program provides capability-based planning assessment for Joint Capabilities Integration and Development System (JCIDS), conducts analysis to affect warfighting capability trades and enterprise resources, identifies needs, gaps and overlaps, and assesses alternative solutions to Joint needs.  The program provides overarching Planning, Programming, Budgeting and Execution System (PPBES) analyses and guidance for PPBES which provides gap analysis and investment strategy and total obligation authority allocation.  It provides independent capability analysis and assists in structuring follow-on Navy analyses.  The program coordinates Navy's position for the enhanced planning process and conducts net assessments.  It serves as the lead campaign analysis to approve Navy warfare and support requirements.  The program supports the Maritime Strategy which charts a course for the Navy, Coast Guard and Marine Corps to work collectively with each other and international partners to prevent crises from occurring, or reacting quickly should one occur to avoid negative impact to the United States.  The Assessment Program provides a broad-view perspective across the Fleet and Navy staff, with an integrated look at both warfighting and warfighting-support programs.  It provides Navy alternatives in assessing the implications embedded within resource decisions in a quantified context of costs versus capability versus risk.  The program provides independent analytic support to Navy leadership in conjunction with various executive level decision forums.\n\nThis project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship and associated platform force structure along with development of the tools to accomplish these efforts. Advanced platform concept studies and systems technology assessments will be conducted as will the development and upgrade of concept design and engineering tools, methods, and criteria. Concept Formulation (CONFORM)\/Concept Development and Experimentation (CDE) for ships, boats and unmanned maritime vehicles must be continuously exercised to remain viable. It takes years to train competent practitioners, and knowledge currency is quickly lost without practice. Evolving threats and technologies drive concepts (and the tools, processes, and skills needed to produce them) towards obsolescence without constant attention. Capability Based Assessments and Analysis of Alternatives (AoA) timelines are insufficient for establishing potential material solution cost versus capability relationships without significant concept formulation work beforehand. Active collaboration between the Office of the Chief of Naval Operations requirement sponsors, Program Offices, and the various System Commands (Naval Sea Systems Command, Naval Air Systems Command and Space and Naval Warfare Systems Command) engineers is critical for fully exploring the trade space by conducting analysis for affordability, effectiveness and risk.  The majority of Total Ownership Cost (TOC) is locked into a design before it is even a program. In the later stages of a program it becomes much more costly to make changes that will significantly impact TOC. Investment up front in concept design can have a high payoff in TOC reduction over the life of a platform class. Outputs include concept costing and performance parameterization for comparative assessment against capability objectives and synthesis to quantify overall (Fleet) capabilities. These products (expressions of cost vs. capability) will serve as the basis of requirements and Joint Capabilities Integration and Development System analysis, define the trade space for AoA efforts, and underpin discussion of force architecture\/structure during Quadrennial Defense Review, Long Range Shipbuilding Strategy builds, and Joint Requirements Oversight Council reviews.\nCapabilities-Based Assessment (CBA) is the Joint Capabilities Integration and Development System (JCIDS) analysis process that includes three phases: Functional Area Analysis (FAA), Functional Needs Analysis (FNA), and Functional Solution Analysis (FSA). The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval warfighting capabilities and force structure needed to support the Joint Requirements Oversight Council (JROC)\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions. This analysis includes evaluation of integration and interoperability gaps of both current and future Navy platforms and systems capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Studies & Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.287"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Developed, updated and maintained detailed level Navy Standard scenarios based on Defense Programming Guidance (DPG).\n-Developed alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Developed, updated, and maintained analytic baselines for the Major Combatant Operations (MCO) based on DPG. \n-Developed details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Developed and maintained a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data were defined and traceable to government approved\/provided source material.  \n-Developed scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Developed Measures of Performance (MOP)and Measures of Evaluation (MOE)and recommended appropriate modeling\/methodology to support analyses.  \n-At the mission level, continued to script Operational Situations (OPSITS) or Tactical Situations (TACSITS) for use in effectiveness analyses in specific warfare mission areas.\n-Provided analytically-based decision recommendations to CNO for both warfighting and support areas. \n-Developed CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Conducted Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Performed rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminated complex warfare issues which support decision-making in the PPBE process. \n-Performed analyses including joint campaign analysis that examines the ability to counter a range of coordinated threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determines system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Conducted cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Developed innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Provided rigorous business case assessments of complex issues relating to the warfighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Performed analyses for accreditation of models, use estimated cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support, aircraft maintenance, spares, facilities, and base operation support.\n-Conducted weapons safety and sea basing capability assessments.\n-Conducted Intelligence, Surveillance and Reconnaissance (ISR) and Meteorology & Oceanography (METOC) assessments to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Developed and maintained common baselines from which campaign excursions and mission-level analyses are executed. \n-Identified, developed and improved data and modeling and brokered agreements upon assumptions, CONOPS, scenarios, and data.\n-Led campaign analysis for Office of the Chief Naval Operations (OPNAV) and led Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Conducted modeling and simulation support for ongoing OPNAV missile defense analysis requirements.\n-Provided analytically-based decision recommendations to OPNAV for joint warfighting and support areas. \n-Conducted net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Participated in OSD and JS analysis assessments and provided structure for coordination across the Navy. \n-Developed new analytic models and techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategies.\n-Developed and improved the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement included mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Focused on integrated analysis capabilities that cut across business and program accounts.  Specific efforts address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Developed medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Updated the high-level readiness model that fully integrate all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers.\n-Conducted ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs).  Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Collaborated with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level.  Warfare Systems effectiveness assessment tools are being continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems.  Additionally, collaborated with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands which refines fleet level requirements.\n-Refined platform concept stage cost analysis tools to predict costs better in areas where weight-based algorithms may not be appropriate.  Continually enhanced tools to estimate total ownership costs more accurately at the ship and weapons system concept development stage.  Continued to conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts.  Developed Cost Estimating Relationships (CERs) and cost estimating tools to accommodate emerging technologies incorporated in future platforms.  \n-Conducted future force structure concept formulation.  Fleet synthesis and analysis will be conducted, which included capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired.  Areas examined included interoperability concepts, force architecture impact studies, and operational employment concept studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.617"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Continue to develop, update and maintain analytic baselines for the MCO based on DPG. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Continue to develop and maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.  \n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses.  \n-At the mission level, continue to script OPSITS or TACSITS for use in effectiveness analyses in specific warfare mission areas.\n-Continue to provide analytically-based decision recommendations to CNO for both warfighting and support areas. \n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Continue to conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminated complex warfare issues which support decision-making in the PPBE process. \n-Continue to perform analyses including joint campaign analysis that examines the ability to counter a range of coordinated threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determines system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Continue to conduct cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Continue to develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Continue to provide rigorous business case assessments of complex issues relating to the warfighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Continue to perform analyses for accreditation of models, use estimated cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support, aircraft maintenance, spares, facilities, and base operation support.\n-Continue to conduct weapons safety and sea basing capability assessments.\n-Continue to conduct ISR and METOC assessments to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Continue to develop and maintain common baselines from which campaign excursions and mission-level analyses are executed. \n-Continue to identify, develop and improve data and modeling, and broker agreements upon assumptions, CONOPS, scenarios, and data.\n-Continue to lead campaign analysis for OPNAV and lead Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements.\n-Continue to provide analytically-based decision recommendations to OPNAV for joint warfighting and support areas. \n-Continue to conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Continue to participate in OSD and JS analysis assessments and provide structure for coordination across the Navy. \n-Continue to develop new analytic models and techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategies.\n-Continue to develop and improve the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement included mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Continue to focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Continue to develop medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Continue to update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers.\n-Continue to conduct ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs).  Studies will be performed in a continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Continue to collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level.  Warfare Systems effectiveness assessment tools are being continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems.  Additionally, collaborate with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands which refines fleet level requirements.\n-Continue to refine platform concept stage cost analysis tools to predict costs better in areas where weight-based algorithms may not be appropriate.  Continually enhance tools to estimate total ownership costs more accurately at the ship and weapons system concept development stage.  Continue to conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts.  Further develop Cost Estimating Relationships (CERs) and continue to develop cost estimating tools to accommodate emerging technologies incorporated in future platforms.  \n-Continue to conduct future force structure concept formulation.  Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired.  Areas \nto be examined include interoperability concepts, force architecture impact studies, and operational employment concept studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.404"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.404"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop, update and maintain detailed level Navy Standard scenarios based on DPG.\n-Continue to develop alternative scenarios in support of Defense Review guidance, Joint studies, and Navy resource analyses. \n-Continue to develop, update and maintain analytic baselines for the MCO based on DPG. \n-Continue to develop details required to execute analysis of designated Defense Planning Scenarios and their respective Multi-Service Force Deployment Plans.\n-Continue to develop and maintain a framework and common set of processes to ensure that essential elements of warfare analyses, including scenarios, operational concepts, tactics, capabilities of platforms and systems (for Navy, Joint, coalition and threat forces), key assumptions and input data are defined and traceable to government approved\/provided source material.  \n-Continue to develop scenarios and operational concepts based on government inputs that are sufficiently detailed for use in naval and joint campaign analyses.  \n-Continue to develop MOPs and MOEs and recommend appropriate modeling\/methodology to support analyses.  \n-At the mission level, continue to script Operational Situations (OPSITS) or Tactical Situations (TACSITS) for use in effectiveness analyses in specific warfare mission areas.\n-Continue to provide analytically-based decision recommendations to CNO for both warfighting and support areas. \n-Continue to develop CNO investment strategy recommendations and assessments for Program Review and Program Objective Memorandum. \n-Continue to conduct Verification, Validation & Accreditation of warfare, performance, and pricing models. \n-Continue to perform rigorous, time critical naval and joint campaign and mission-level analyses, usually based on modeling and simulation that illuminated complex warfare issues which support decision-making in the PPBE process. \n-Continue to perform analyses including joint campaign analysis that examines the ability to counter a range of coordinated threat capabilities, high level tradeoffs between service capabilities, or impact of large-scale architecture, mission-level effectiveness analyses that determines system capabilities; conduct analyses of alternative force structures that determine the ability to meet peacetime deployment or steady-state requirements and respond to transition to war and contingency operations. \n-Continue to conduct cost-effectiveness analyses and analyses of new technologies in support of Sponsor Program Proposal, Navy Program Objective Memorandum or Warfare Capability Plan. \n-Continue to develop innovative analysis techniques that evaluate the effectiveness of operations on the Long War focus on Irregular Warfare and Sea Shaping (influence) activities such as Theater Security Cooperation. \n-Continue to provide rigorous business case assessments of complex issues relating to the warfighting support processes, manpower and personnel, training and education, infrastructure, both afloat and ashore readiness, Naval Medical Program and provider enterprise operations. \n-Continue to perform analyses for accreditation of models, use estimated cost and performance of performance-based modeled programs such as the Flying Hour Program, ship operations, ship and aircraft maintenance, spares, facilities, and base operation support, aircraft maintenance, spares, facilities, and base operation support.\n-Continue to conduct weapons safety and sea basing capability assessments.\n-Continue to conduct ISR and METOC assessments to determine the optimal mix of Naval ISR and METOC sensors, platforms, and processing, analysis and fusion disposition to support MCOs, the OCO, and intelligence preparation of the environment for both MCOs and OCO. \n-Continue to develop and maintain common baselines from which campaign excursions and mission-level analyses are executed. \n-Continue to identify, develop and improve data and modeling, and broker agreements upon assumptions, CONOPS, scenarios, and data.\n-Continue to lead campaign analysis for OPNAV and lead Navy's participation in OSD\/Joint Staff analytic agenda, baseline development, and collection of data.\n-Continue to conduct modeling and simulation support for ongoing OPNAV missile defense analysis requirements.\n-Continue to provide analytically-based decision recommendations to OPNAV for joint warfighting and support areas. \n-Continue to conduct net assessments and provide independent analytic support to Navy leadership in conjunction with various executive level decision forums. \n-Continue to participate in OSD and JS analysis assessments and provide structure for coordination across the Navy. \n-Continue to develop new analytic models and techniques for informing resource allocation decisions; conduct all campaign and warfare mission-level analyses and develop investment strategies.\n-Continue to develop and improve the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement included mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Continue to focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Continue to develop and improve the Navy's analysis capabilities which support Joint and Navy analytic agendas and resource-allocation decision making by refining the linkages between cost and performance in performance-modeled programs in support of OPNAV analysis and assessment.  Areas of tool development and improvement included mission- and campaign-level warfighting models, active and reserve manpower, afloat and ashore readiness, and medical capabilities.\n-Continue to focus on integrated analysis capabilities that cut across business and program accounts.  Specific efforts address cyber warfare and security, optimizing the training pipeline, integrating ship maintenance and operations price performance models, and improving mission- and campaign-level C5ISR models and representations. \n-Continue to develop medical analysis that links to campaign analysis including movement of injured between care facilities, life-saving treatment of injured and recuperation support of injured to support Navy Medical Program decisions.  \n-Continue to update the high-level readiness model that fully integrates all aspects of warfighting support (operational utilization, training cycles, training centers, depots, etc.) and personnel (recruitment, training, development, deployment, retention, etc.) across the Navy's warfighting platforms (aircraft, ships, submarines, etc.), facilities and personnel development centers.\n-Continue to conduct ship, boat, and unmanned marine vehicle concept studies in preparation for Capabilities Based Assessments (CBAs) and Analysis of Alternatives (AoAs).  Studies will be performed in \na continuous manner to support future recapitalization of Surface Combatants, Amphibious Ships, Carriers, Auxiliary Ships and other emerging program requirements.\n-Continue to collaborate with Warfare Systems design experts to perform continuous Warfare Systems analysis at the ship and fleet level.  Warfare Systems effectiveness assessment tools are being continually developed and enhanced as required to address future concepts and to incorporate improvements in information technology systems.  Additionally, collaborate with aircraft, C4ISR, and networks by continuing dialog and collaboration between NAVSEA, NAVAIR, and SPAWAR systems commands which refines fleet level requirements.\n-Continue to refine platform concept stage cost analysis tools to predict costs better in areas where weight-based algorithms may not be appropriate.  Continually enhance tools to estimate total ownership costs more accurately at the ship and weapons system concept development stage.  Continue to conduct cost estimates in support of future concept design exploration, CBA, and AoA efforts.  Further develop Cost Estimating Relationships (CERs) and continue to develop cost estimating tools to accommodate emerging technologies incorporated in future platforms.  \n-Continue to conduct future force structure concept formulation.  Fleet synthesis and analysis will be conducted, which includes capabilities requirements, platform design and cost and quantitative tracking of the long-term evolution of the fleet as new platforms are introduced and old ones are retired.  Areas to be examined include interoperability concepts, force architecture impact studies, and operational employment concept studies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 to FY 2020 increase reflects the need for concept studies to inform Fleet architecture and future force structure, continued development of a new model to improve the Navy's capabilities in Anti-Submarine Warfare (ASW) mission-level analysis and increased need for modeling and simulation support for Campaign analysis and ongoing OPNAV missile defense analysis requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Mission Assessment Studies"
                                    },
                                    "Description": {
                                        "val": "CBA - The CBA is the JCIDS analysis process that includes three phases: the Functional Area Analysis (FAA), the Functional Needs Analysis (FNA), and the Functional Solution Analysis (FSA). The results of the CBA are used to develop a joint capabilities document (based on the FAA and FNA) or initial capabilities document (based on the full analysis). CBA funding provides the resource sponsors the means to develop the analytic underpinning required by Chairman of the Joint Chiefs of Staff Instruction 3170.01G to support the determination of Naval war fighting capabilities and force structure needed to support the JROC\/JCIDS requirements validation process and to inform Program Objective Memorandum programming decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.711"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue CBA's such as advanced Naval surface fires and Naval aviation training to identify future capability requirements. Develop metrics to describe the effectiveness of solutions, and evaluate current and programmed systems ability to meet capability requirements to determine capability gaps. Expand warfighting gap assessments addressing interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Capabilities-Based Assessments (CBA) such as advanced Naval surface fires and Naval aviation training to identify future capability requirements. Develop metrics to describe the effectiveness of solutions, and evaluate current and programmed systems ability to meet capability requirements to determine capability gaps. Expand warfighting gap assessments addressing interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.395"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.395"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Capabilities-Based Assessments (CBA) such as advanced Naval surface fires and Naval aviation training to identify future capability requirements. Develop metrics to describe the effectiveness of solutions, and evaluate current and programmed systems ability to meet capability requirements to determine capability gaps. Expand warfighting gap assessments addressing interaction of mission area kill chain platforms, sensors, and weapons in a system-of-system construct."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A."
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goal is to conduct analysis to support Navy decisions needed to turn strategy and guidance into the Fleet capabilities required within acceptable risk. METRICS:\n\n- Risks are balanced to deliver the right capabilities within the resources available to Navy.  \n- Identify shortfalls and redundancies in existing or planned capabilities. Determine the impact of variations in warfare systems and architectures in threat, U.S. and combined forces and strategies. \n- Develop analysis plans; determine proposed alternatives for analysis; and research performance data on current and future threats, coalition and own force systems; perform technology investigations and forecasts; develop or obtain cost data for current or planned systems; develop and use Cost Estimating Relationships to determine cost for conceptual or future systems for which no cost data is available; identify analysis assumptions, limitations and uncertainties; use established models or develop new models or methodologies to perform analyses; and interpret and analyze results. \n- Develop Measures of Performance and Measures of Effectiveness and recommend appropriate modeling\/methodology to support analysis. Models\/methodology used reflect study objects, level of fidelity required and time constraints. \n- A combination of model design statements, model study reports, system specifications, updated model reports, model\/database documents, model verification and validation plans, code, and Plan of Action and Milestones reports, and technical reports.\n- Provide engineering and analytic support for the assessment and transition of technology for use in the Investment Strategy.\nThe May 2007 revision of the Joint Chiefs of Staff's Joint Capabilities Integration and Development System (JCIDS) instruction (CJCSI 3170.01F) requires a CBA to assess new requirements. A CBA instruction has been developed by the Chief Navy Office's warfare integration office that prescribes a procedure and structure to this warfighting requirements generation process (JCIDS). A CBA is required to address and validate capability shortfalls or gaps as defined by combatant commanders. It is an analytical process that includes three phases: the Functional Area Analysis, the Functional Needs Analysis, and the Functional Solution Analysis. This process is designed to address future warfighting requirements and analysis needs and improve the quality of Analysis of Alternatives. CBA supports Navy programming decisions and provides the means to develop the analytic underpinning to support the determination of Naval capabilities and force structure recapitalization investments required to fulfill the Maritime Strategy."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2801"
                    },
                    "ProjectTitle": {
                        "val": "Anti-Tamper"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.385"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.385"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Starting in FY 2019, funding for Project 2801 Anti-Tamper (AT) is realigned to 0605024N Anti-Tamper Technology Support."
                        },
                        "ProjectMissionDescription": {
                            "val": "Anti-Tamper Program -  performs as the Navy Technical Process Owner for the Anti Tamper systems engineering activity that is intended to prevent and\/or delay the exploitation of critical technologies in U.S. systems; manages the research, design, development, implementation, and testing of Anti Tamper measures and coordinates with Department of Defense Anti Tamper Executive Agent."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Tamper (AT)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue championing new technology with a focused and disciplined approach of development, assessment, evaluation, and transition to meet Navy program AT requirements. Maintain role in AT policy development for implementation and execution by the SYSCOMs incorporating Navy program AT requirements. Provide secure facilities, networks, computers, video\/telephone conference and support personnel for collateral and Special Program operational environments to enable Anti-Tamper implementation and execution by SYSCOM's programs, incorporating AT requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Manage the research, design, development, implementation and testing of Anti-Tamper measures for the Department of the Navy. Manage Information Security for all navy programs throughout their lifecycles."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3017"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise Information Systems"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.932"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.932"
                        },
                        "BudgetYearTwo": {
                            "val": "0.952"
                        },
                        "BudgetYearThree": {
                            "val": "0.970"
                        },
                        "BudgetYearFour": {
                            "val": "0.991"
                        },
                        "BudgetYearFive": {
                            "val": "1.011"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Funding realigned from PE 0605861N RDT&E Science and Technology Management project 0135 to better align with activities supported. This project is not a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds Office of Naval Research (ONR) corporate expenses including  Information Technology (IT), specifically Next Generation Enterprise Network (NGEN) corporate costs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Enterprise Network (NGEN)"
                                    },
                                    "Description": {
                                        "val": "This program funds Office of Naval Research (ONR) corporate expenses including  Information Technology (IT), specifically Next Generation Enterprise Network (NGEN) corporate costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.932"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.932"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project funds Next Generation Enterprise Network (NGEN) Corporate requirements"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in FY 2020 reflects the realignment of NGEN corporate funding from 0605861N RDT&E Science and Technology Management."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This project funds operating costs for ONR's mission. Program performance is measured by attaining financial benchmarks for planned obligations vs. actual obligations and planned expenditures vs. actual expenditures"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3027"
                    },
                    "ProjectTitle": {
                        "val": "Defense Critical Infrastructure Program"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.186"
                        },
                        "CurrentYear": {
                            "val": "5.862"
                        },
                        "BudgetYearOne": {
                            "val": "7.743"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.743"
                        },
                        "BudgetYearTwo": {
                            "val": "6.927"
                        },
                        "BudgetYearThree": {
                            "val": "7.073"
                        },
                        "BudgetYearFour": {
                            "val": "7.217"
                        },
                        "BudgetYearFive": {
                            "val": "7.361"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funds received pursuant to the transfer of budget authority from OUSD Policy (OUSD (P)) Homeland Defense Mission Assurance Directorate will be used for infrastructure analysis, assessment, and research required to support execution of the Defense Critical Infrastructure  and Mission Assurance Program (DCIP \/ MA). Additionally, the transferred budget authority will be used to provide in-depth\/cross-cutting analysis to the Mission Assurance (MA)\/DCIP programs at the Office of the Secretary of Defense (OSD), Joint Staff, Military Departments\/Services, Defense Agencies, and Combatant Commands. NSWCDD-A40 will also perform cyber mission assurance research and provide expertise in infrastructure mitigation techniques and solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Assurance Risk Management System (MARMS) Technical Support"
                                    },
                                    "Description": {
                                        "val": "Provide capabilities to meet the technical requirements in support of the developmental efforts for the current and future common operating picture for Mission Assurance supporting Joint Staff MARMS development team, program office and A40 mission assurance database organization.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff provide oversight for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.665"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.1.1\tParticipated in MARMS technical working group (TWG). Provide assistance with the requirements development input and feedback from collected stakeholder user stories into Functional requirements for industry response to RFI\n3.1.2\tUsing MARMS Configuration Management Board (CMB)-approved requirements produced a set of MARMS Department of Defense (DoD) Architecture Framework (DoDAF) diagrams for program milestones by 31 May 2018.  Deliverables were based on the outcome of TWG requirements and rules for DoDAF articles necessary for programs of record detailed from existing acquisition standards\n3.1.3\tAnalyzed and mapped data elements between existing databases for information sharing and eventual transfer to an existing or future MARMS database per guidance from Joint Staff, TWG, and CMB:\n     3.1.3.1\tConsolidated Strategic Mission Assurance Data System (SMADS) Tier 1 and 2 Task Critical Assets (TCAs), Baseline Elements of Information (BEI) and the CVAMP database into a singular database for insertion into an existing or future database as designated by Joint Staff and MARMS CMB \/ TWG requirements\n     3.1.3.2\tProvided technical support to improve interim capability with existing Mission Assurance information technology (IT) systems.  This task could include adjustments to SMADS asset data, review of classified hosting services and facilities from various defense agencies, or systems engineering analysis and code updates to enhance integration capabilities of existing MA IT systems.\n     3.1.3.3\tProvided technical assistance to support and improve the web service to and from the United States Strategic Command (USSTRATCOM) Strategic Mission Assurance Data System (SMADS) to the family of CAMS, Joint Staff Anti-terrorism Vulnerability data extracted from the Core Vulnerability Assessment Management Program (CVAMP) to a yet-to-be-determined system, and other systems used by other MA-related programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.679"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tMARMS TWG guidance & requirements traceability tracking and enforcement upon anticipated FY 2018 contract award\n2\tMARMS programmatic acquisition support to DoD CIO based on milestone decision authority phase entry and system engineering support\n3\tMARMS Architecture (DoDAF) tracking and incorporating data registry scheme between existing Joint Staff portals and MARMS developed user interface\n4\tDatabase mapping and analysis for MARMS and update of data from emerging analysis and assessment data for initial operational capability for MARMS use and implementation"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.680"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.680"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tMARMS TWG guidance & requirements traceability tracking and enforcement upon anticipated FY 2019 contract award\n2\tMARMS programmatic acquisition support to Joint Staff and DTRA Program Office based on milestone decision authority phase entry and anticipated system engineering support\n3\tMARMS Architecture (DoDAF) tracking and incorporating data registry scheme between existing Joint Staff portals and MARMS developed user interface (EPRM)\n4\tDatabase mapping and analysis for MARMS and update of data from emerging analysis and assessment data for initial operational capability for MARMS use and implementation"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2019 and FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Assurance Assessments Support"
                                    },
                                    "Description": {
                                        "val": "Provide analysis and characterization of Defense Critical Infrastructure through research and study of existing assessment data and incoming assessment data to analyze trends, provide feedback, and significant impacts to defense missions and assets during events, exercises, and planning efforts.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.965"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.2.1\tConducted annual analysis on MAA reports for trends and\/or common issues.  \n3.2.2\tConducted like asset analysis on mission or systems specific assessments in support of MA DCI, defense critical missions and\/or Defense Planning Guidance (DPG) work.  \n3.2.3\tAnalyzed designated Joint Staff processes for consistency, validity, and accuracy (mathematical formulas, weighting factors, and assessment processes using A40 analytical resources)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tMission Assurance Trends Analysis Methodology finalization and continue refinement of data inputs from latest assessment results \n2\tAnnual trends analysis on MAA reports conduct to ensure common vulnerabilities are identified, tracked, and enterprise solutions offered to enhance efficient use of limited budgets and funding for risk mitigations\n3\tReview of Joint Staff quantitative processes in Mission Assurance Assessments to ensure viable and verified risk estimates are defendable within the budget process and gain attention for immediate resolution from cyber and physical threats"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.365"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.365"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1  Mission Assurance Trends Analysis Methodology continue refinement of data inputs from latest assessment results \n2  Annual trends analysis on MAA reports conducted to ensure common vulnerabilities are identified, tracked, and enterprise solutions offered to enhance efficient use of limited budgets and funding for risk mitigations\n3  Review of Joint Staff quantitative processes in Mission Assurance Assessments to ensure viable and verified risk estimates are defendable within the budget process and gain attention for immediate resolution from cyber and physical threats\n4  Incorporate NAVSEA 00I assessment needs into existing Mission Assurance methods and execute two Mission Assurance \/ Cyber Network Assurance combined assessments at NAVSEA laboratory as pilot and shipyard as initial rollout."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 supports assessments concerned with strategic missions that will require follow on mitigation analysis and solution refinement, with potential for persistent cyber network evaluation at multiple sites.  Funding addresses the planned assessment support of 32 sites or installations with 10 being OCONUS.  Additionally, this tasking covers unplanned events like hurricanes, tornadoes and earthquakes that threaten DoD installations and supporting infrastructure, as well as 2-3 planned COCOM exercise events (Vigilant Shield, Ardent Sentry, and PANAMAX)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Mission Assurance"
                                    },
                                    "Description": {
                                        "val": "Analysts will investigate cyber impacts to missions and infrastructure associated with DoD assets.  This information will be conveyed in assessments, memorandums, and white papers to inform senior leaders and teams about the significance of cyber infrastructure and the interdependencies with physical infrastructure.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "A40 continued to work with OSD Cyber Policy and OASD HD on the Cyber dependencies of critical infrastructure assets. A40 provided follow on analysis of additional cyber studies in COCOM regions and specific defense mission assets. They also assisted in looking at how to better synchronize nascent cyber processes and capabilities, such as cyber assessments, cyber key terrain analysis, and Control System inventories into the DCIP methodology.\nA40 engaged with CCMDs and Defense Agencies on identifying and developing cyber key terrain data and resilience metrics as they pertain to key critical assets in both public and private domains. A40 analyzed technical and situational Cyber Security information (all threats, particularly industrial control systems) from intelligence message traffic, internet, private sources, other government agencies, national labs, and industry that address cyber control system infrastructure threats and vulnerabilities.\nA40 provided guidance, analysis, and technical evaluation and experimentation for Aurora Rotating Equipment Isolation Device (REID) utility engagements and test beds; maintained test data on REIDs with public sector utility companies and utilized private sector engagements to enhance knowledge about the Aurora threat and develop mitigations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tBest Practices report for risk reduction to PIT-CS will be expanded to encompass weapons platform IT constructs and other critical infrastructure platforms on which DoD has dependencies\n2\tAnnual ICS update to Best Practices Report will be conducted to identify enhanced methods and metrics to monitor progress and accomplishment towards categorizing entire inventory of critical DoD control systems and their known vulnerabilities\n3\tResearch and develop cyber-specific infrastructure assessment methods to complement assessment teams and data incoming from ongoing assessments across DoD and Services\n4\tTechnical Liaison Support to Cyber MA Enterprise will continue to identify paths for engaging MA partners on a collaborative tool that identifies cyber mission risks from assets identified as part of ongoing assessment efforts across multiple missions and cyber domains"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.498"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.498"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tBest Practices report for risk reduction to PIT-CS will be edited to encompass weapons platform IT constructs and other critical infrastructure platforms on which DoD has dependencies\n2\tAnnual ICS update to Best Practices Report will be conducted to identify enhanced methods and metrics to monitor progress and accomplishment towards categorizing entire inventory of critical DoD control systems and their known vulnerabilities\n3\tResearch and develop cyber-specific infrastructure assessment methods to complement assessment teams and data incoming from ongoing assessments across DoD and Services, with particular focus on NAVSEA Red Team enhancement\n4\tTechnical Liaison Support to Cyber MA Enterprise will continue to identify paths for engaging MA partners on a collaborative tool that identifies cyber mission risks from assets identified as part of ongoing assessment efforts across multiple missions and cyber domains"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 reflects increased research on network mission assurance of defense missions and operations and enhancements of Red Team assessment capabilities.  These capabilities increase the amount of time and labor required to maintain awareness of network vulnerabilities during and post-assessment to enhance the mitigations and solutions for cyber security of critical Navy and DoD networks.  This persistence increases the costs associated with conducting these evaluations.  The increased cost reflects the additional red team members necessary to conduct 2-3 cyber mission assurance assessments per year across DoD and NAVSEA enterprises."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Critical Electric Infrastructure (DCEI)"
                                    },
                                    "Description": {
                                        "val": "Provide electric power analysis and characterization of defense installations at the request of senior leaders engaged with energy security and resilience efforts for national security with interagency representatives from industry utilities, DHS, and DoE.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.715"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.4.1\tProduced briefing outlining findings and methodology used to identify Defense Critical Electric Infrastructure to DoD and interagency audiences.\n3.4.2\tBriefed DoD and interagency audiences, as requested.\n3.4.3\tUpdated analysis to improve accuracy, pending DoD and interagency feedback, as requested by OSD (P).\n3.4.4\tProvided courses of action (COAs) for how other entities can conduct the modeling Dahlgren conducted in this effort. At OSD (P) request, briefed other entities in detail on the methodology used so they can replicate.\n3.4.5\tProvided recommendations on what DoD processes may be appropriate to use to engage with utilities to discuss analysis findings.\n3.4.6\tProvided recommendations on organizations and points of contact (POCs) for OSD (P) personnel to engage with to deepen understanding of utility operations and grid operations.\n3.4.7\tOther support as required related to assess energy infrastructure and other dependencies of select DoD installations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.644"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tProvide briefing outlining DCEI analysis findings to interagency partners across US in support of DHS and DOE initiatives related to power grid resiliency\n2\tUpdate DCEI analysis as requested per ongoing interagency collaborations in DoD cluster areas\n3\tWriting documentation recommending COAs for how other entities can replicate A40 analysis of the grid to enhance relationships with local utility and power providers\n4\tProvide recommendations on what DoD processes may be appropriate to use to engage with utilities to discuss analysis findings\n5\tEngage with other federal and private industry agencies to deepen understanding of utility operations and grid operations (FERC, NERC, NRECA, etc.)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.850"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.850"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tUpdate installation peak power methodology and primary EP infrastructure pathways in support of interagency FAST act collaboration\n2\tUpdate DCEI analysis as requested per ongoing interagency collaborations in DoD cluster areas\n3\tAnalyzing post table top exercise feedback (Constrained Eagle) to enhance leadership understanding of commercial electric power grid dependencies for DoD Missions\n4\tProvide recommendations on what DoD processes may be appropriate to use to engage with utilities to discuss analysis findings\n5\tEngage with other federal and private industry agencies to deepen understanding of utility operations and grid operations (FERC, NERC, NRECA, etc.)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 reflects the increased focus on electric grid dependencies and vulnerabilities that Energy Security analysis has revealed and the efforts to increase DoD and Interagency resilience from the natural or manmade effects.  79 installations will need analysis of their critical electric power paths supported by 47 utility providers, entities needed for implementation and execution that require constant attention to ensure reliable data and analytical rigor is applied.  Multiple interagency entities will be involved with both exercise (Liberty Eclipse, NERC Grid Ex, and follow on) and potential real world issues involving complex policy and technical guidance, increasing costs to the program to maintain the data from multiple industry databases."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Assurance Program Management"
                                    },
                                    "Description": {
                                        "val": "Monitor, track and report on all budget related inquiries and task planning and execution for the Mission Assurance \/ DCIP programs including data calls, weekly budget reports, and deliverables.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.465"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.5.1\tProvided a program manager and POC for all interaction with OSD (P) and A40 personnel to facilitate task execution and provide direction to A40 personnel on emerging tasking.\n3.5.2\tProvided IT support and A40 business office management to develop and maintain Mission Assurance analytical tools, standards, contract support, and knowledge management systems for DoD-wide mission assurance efforts.  \n3.5.3\tSupported IT Non-Classified Internet Protocol Router Network (NIPRNet) and Secret Internet Protocol Router Network (SIPRNet) domains for DCI data analysis including Information Assurance (IA) processes, IT maintenance, infrastructure data licenses (e.g., Telecordia, PowerWorld, and ESRI ArcGIS).\n3.5.4\tProvided web services and host management for data sharing, visualization tools, and interagency collaboration via A40 Intelink portal and Inteldocs file management, and U.S. Army Aviation and Missile Research Development and Engineering Center (AMRDEC) file exchange process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1 Enhance program management support to OSD to include financial tracking and updates to support reclama notices or budget execution data calls\n2 Offer options for enhanced information sharing to MA community and related entities, potentially in support of COCOM exercises or real world events that showcases A40 expertise\n3 Continue to discover ways to save funding via IT footprint consolidation and efficient use of network resources and database files"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1 Enhance program management support to OSD  and NAVSEA to include financial tracking and updates to support reclama notices or budget execution data calls\n2 Offer options for enhanced information sharing to MA community and related entities, potentially in support of COCOM exercises or real world events that showcases A40 expertise\n3 Continue to discover ways to save funding via IT footprint consolidation and efficient use of network resources and database files"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 reflects the increased oversight from management efforts and utilization of centralized management tool (Innoslate) to better track programmatic requirements and subsequent related tasks, costs, and contracts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Critical Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Provide mission assurance assessment and support for characterization of defense critical infrastructure and supporting links to commercial industry and equipment.  Analysis and research will provide details on critical links to defense missions and assets and support risk management decision planning for installations, services, and COCOMS.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.431"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.6.1\tMaintained and QA'd Joint Staff documents and data on the Global Mission Assurance Portal-JWICS and Global Mission Assurance Portal-SIPR.  Maintain\/update MA and protection contract list on GMAP.\n3.6.2\tDrafted 20 DCI Criticality Assessments; submitted and tracked status of DCI nominations.\n3.6.3\tCoordinated input of 12 Mission Mitigation Plans (MMPs). Coordinate input of 12 Risk Reduction Plans (RRPs).\n3.6.4\tDrafted 12 Risk Assessment Plan (RMP) summaries based on MMPs and RRPs received.\n3.6.5\tDrafted three updated RMP summaries based on updated MMPs and RRPs received.\n3.6.6\tPrepared and submit staffing nomination packages for the Defense Critical Assets Review Board (DCARB).\n3.6.7\tPrepared revalidation package for all Defense Critical Assets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.347"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tMaintain GMAP portal documentation requirements and help build out database solution and provide best practices \/ option in support and coordination with MARMS effort\n2\tDCI criticality assessments and nominations will continue to flow in and be reviewed \/ analyzed for completeness and prioritized for review\n3\tMission Mitigation and Risk Reduction Plan coordination and review of new or existing nominated assets and need for budget prioritization of vulnerability solutions\n4\tRisk Management Plan draft summaries will be coordinated, edited, and reviewed for correctness, completeness and identified appropriate vulnerabilities and threats to justify risk management plan efforts cover the issues\n5\tNomination package preparation for biannual update and finalization of critical defense assets and infrastructure\n6\tRevalidation packages for DCAs will be reviewed and nominated based on previous mission plan inputs and current Joint Staff and OSD defense planning guidance updates\n7        Development of Supporting Eagle Table Top Exercise and assessment pilot to enhance Defense Industrial Base policy and assessment capabilities of supporting infrastructure to DIB missions at DoD installations"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1  Maintain GMAP portal documentation requirements and continue development of database solution and provide best practices \/ option in support and coordination with MARMS effort\n2  DCI criticality assessments and nominations will continue to flow in and be reviewed \/ analyzed for completeness and prioritized for review\n3  Mission Mitigation and Risk Reduction Plan coordination and review of new or existing nominated assets and need for budget prioritization of vulnerability solutions\n4  Risk Management Plan draft summaries will be coordinated, edited, and reviewed for correctness, completeness and identified appropriate vulnerabilities and threats to justify risk management plan efforts cover the issues\n5  Continue nomination package preparation for biannual update and finalization of critical defense assets and infrastructure\n6  Revalidation packages for DCAs will be reviewed and nominated based on previous mission plan inputs and current Joint Staff and OSD defense planning guidance updates\n7  Development and support of Defense Industrial Base pilot assessment \"Supporting Eagle\" will be executed and feedback gained from exercise execution to implement in future policy documents"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 supports infrastructure specific asset analysis to particular DoD assets and missions, the Defense Industrial Base, and the supporting infrastructure.  To provide a more overarching view of mission analysis, the increase reflects the prototype and use of models based system engineering methods and tools to enhance deliverables being asked for by senior leadership.  Congressional legislative pilot studies from NDAA 1647 and 1650 related to cybersecurity of weapons platforms and critical infrastructure are due in 2020 and will need follow on analysis for the multiple weapons platforms and critical infrastructure on at least 2 prioritized sites."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Critical Mission"
                                    },
                                    "Description": {
                                        "val": "Conduct research and provide expertise on the defense critical missions nominated by the Joint Staff and Mission Assurance community for development of mitigations and solutions to vulnerabilities discovered as part of mission assurance assessment processes.  Analysts will provide expertise and knowledge in multiple areas of engineering and infrastructure to provide robust and resilient plans and projects to enhance installation infrastructure and planning to increase successful support of critical missions.\n\nThe OSD (P) Mission Assurance Directorate and the Joint Staff will provide oversight to A40 for funding that will be used for infrastructure analysis, assessment, and research required in support of Mission Assurance and Defense Critical Infrastructure (DCI) programs at the Joint Staff and OSD (P)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.945"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "3.7.1\tFurther developed 15 Mission Maps to include collaboration with stakeholders for designated missions and enhance with current assessment data to identify potential weak links or lack of knowledge on critical links to mission accomplishment\n3.7.2\tDeveloped briefings to inform senior leaders about DCM processes and provided support to establishing DCM identification and methodologies to focus annual assessment efforts on critical information gaps\n3.7.3\tDeveloped DPG responses to OSD taskings and update briefs to the Mission Assurance Senior Steering Group (MA SSG) to decide on dedicated best path forward for utilizing the DCM concept and implementing it as part of the assessment process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.989"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1\tContinuous update of Mission Maps to maintain awareness of existing and new DCMs and the assets supporting multiple AORs and across mission owners (and de-conflict)\n2\tProvide DCM process briefings to MA community to enhance awareness of critical mission assets and their importance on executing in multiple mission domains\n3\tSupport DPG response briefings and papers to Joint Staff led initiatives incorporating the concept into doctrine or best practices\n4\tUpdate Defense Critical Mission Methodology Brief to include Plan of Action and Milestones and execute tasks to provide a more holistic concept of mission assurance and protection of assets in support of multiple missions"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "1 Continue update of Mission Maps to maintain awareness of existing and new DCMs and the assets supporting multiple AORs and across mission owners (and de-conflict)\n2 Provide DCM process briefings to MA community to enhance awareness of critical mission assets and their common vulnerabilities within domains and across operational areas to enhance enterprise solutions and identify funding dollars to fix vulnerabilities\n3 Support MA SSG and ESG briefings and papers to Joint Staff led initiatives incorporating the DCM concept into doctrine or best practices\n4 Continued update of Defense Critical Mission Methodology Brief to include Plan of Action and Milestones and execute tasks to provide a more holistic concept of mission assurance and protection of assets in support of multiple missions"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2019 to FY 2020 reflect a larger number of DCMs being assessed during the period of performance.  This includes 2-3 sites \/ installations every other month, necessitating an increase in assessment team members and analytical tools."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Program cost, schedule, and performance are measured using a systematic approach with approved program management methods.  The results are presented in a monthly financial execution status report. Reports are to be submitted to the Director, MA and the Policy Resource Management Office in OSD Policy by the 15th of each succeeding month.  The reports will reflect the progress made on each of the project tasks by deliverable and a separate accumulated cost report.  Actual versus planned costs will be reflected in the reports at the request of the sponsor."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3312"
                    },
                    "ProjectTitle": {
                        "val": "MTMD-Maritime Theater Missile Defense Forum"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "7.692"
                        },
                        "CurrentYear": {
                            "val": "7.045"
                        },
                        "BudgetYearOne": {
                            "val": "14.158"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.158"
                        },
                        "BudgetYearTwo": {
                            "val": "16.251"
                        },
                        "BudgetYearThree": {
                            "val": "15.043"
                        },
                        "BudgetYearFour": {
                            "val": "14.342"
                        },
                        "BudgetYearFive": {
                            "val": "14.523"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds participation in Maritime Integrated Air and Missile Defense projects with other nations through the Maritime Missile Defense Projects Framework Memorandum of Understanding of 2004 (as amended 2009, 2015, and 2016). Known as the Maritime Theater Missile Defense (MTMD) Forum, it promotes interoperability with the Navies of eleven participating nations (Australia, Canada, Denmark, France, Germany, Italy, Netherlands, Norway, Spain, United Kingdom and the United States).  This project funds participation in multiple Projects and includes a maritime contribution to\nthe NATO Active Layered Theater Ballistic Missile Defense (ALTBMD) project, now known as NATO Ballistic Missile Defense (BMD). Engineering analysis and recommendations from MTMD activities are provided to European, Pacific and Central Combatant Commands to influence present day operations. Specifically, the MTMD Forum is addressing challenges with \"Maritime Allied Air Defense in Support of Ballistic Missile Defense Operations\" that face the Combatant Commanders during present day operations.  The MTMD Forum is leveraging At-Sea Demonstration (ASD) test events and operational Fleet Exercises  to integrate technology with concepts of operations developed within MTMD Forum working groups.\n\nThe MTMD Forum develops systems and techniques that enhance protection and defense against the proliferation of short, medium and long-range Ballistic Missile (BM) and Advanced Anti-Ship Cruise Missile (ASCM) threats through the development of interoperable sea-based Integrated Air and Missile Defense (IAMD) capability among coalition nations.  This includes protection across the full spectrum of these threats through the enhanced utilization of existing sea-based systems to protect against current threats while progressively improving and developing systems and system-of- systems to effectively counter evolving threats. \n\nThis project supports USN participation in several Maritime IAMD related Project Arrangements and Working Groups including:\n\n(1)  Battle Management Command, Control, Communications, Computers, and Intelligence (BMC4I) to define and develop architectures as well as to perform engineering to address coalition capability gaps. \n(2)  Modeling & Simulation (M&S) to establish and maintain a maritime coalition M&S testbed and to perform legacy and future systems simulation testing.\n(3)  Coalition Distributed Engineering Plant (CDEP) to establish and maintain a maritime coalition Hardware-in-the-Loop Testbed and to conduct CDEP testing.\n(4)  Open Architecture (OA) to develop Interface Standards and Data Models.\n(5)  Test Planning and Execution (TPEX) to develop Test Plans, oversee exercise participation and conduct post event data analysis and reporting.\n(6)  Operational Requirements (OR) to develop a Coalition Maritime Missile Defense Operational Concept Document and to identify operational constraints and tactical constructs surrounding coalition maritime missile defense activities.\n(7)  Reciprocal Use of Test Facilities agreements with other nations to support Maritime IAMD and MTMD related demonstrations.\n(8) Tactical Advancement for Next Generation (TANG) to work with our Allies and International Partners using human-centered design methodologies to identify solutions to technology and sailor performance issues that have been cited during previously conducted experiments, exercises, and demonstrations.  This process will seek to leverage R&D investments and risk reduction research commercial companies are making today that can provide potential \"dual use\" technology and process solutions to complex problems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MTMD-Martime Theater Missile Defense Forum"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.692"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1) BMC4I continued engineering analysis and multi-national interoperability gap assessment for the Target Architecture based on test results and continued development of the Target Architecture based on requests for information input from member nations. BMC4I evaluated Possible Point Solutions and provided recommendations for the implementation in correcting coalition interoperability gaps. BMC4I further refined information exchange requirements in preparation for at-sea demonstrations. BMC4I developed updates to MTMD Coalition Capabilities and Interoperability (CCI) and produced the Systems Tactical Data Links Interoperability Report (STIR).\n\n(2) M&S performed analysis of Target Architectures supporting improvement of information exchange requirements identified by BMC4I and the Systems Engineering Team (SET). In support of the MTMD Forum's future capability development, the M&S Working Group continued expansion and development of the M&S lab and integration of new simulation software and further development of virtualization capabilities for the test bed. In support of concept development and experimentation, M&S developed plans for testing of Target Architecture 2, as developed by BMC4I. M&S developed Mission Models to support future concepts such as Force Threat Evaluation (FTE) and Force Weapon Assignment (FWA) (FTEWA) and other Proposed Point Solutions.\n\n(3) CDEP worked with BMC4I and OR working groups to review the Coalition Capabilities and Interoperability (CCI) gaps data set and developed test plans to assess CCI gaps suitable for land-based testing. CDEP planned and conducted Annual Test Event (ATE) 2018 which was focused on Tactical Data Link (TDL) message implementation in Link-16, Link-22, Force Threat Evaluation and Weapons Assignment (FTEWA) and Identification Friend or Foe (IFF) Mode 5.  Laboratory constraints and the Combined Federated Battle Laboratories Network (CFBLNet) connectivity issues prevented the execution of Link-22 and IFF planned events.  CDEP rescheduled these events for ATE 2019. CDEP released the ATE 2017 Final Data Analysis Test Report which includes lessons learned from the conduct of hardware-in-the-loop tests and provides assessments and recommendations to improve information exchanges required to conduct at-sea demonstrations.\n\n(4) The Open Architecture Working Group (OAWG) began developing the Force Data Model for the Threat Evaluation (TE) Force Level Function (FLF) by analyzing the Data Requirements document and evaluating inputs from other WGs such as: Mission Threads, Target and Reference Architectures. In addition to developing use cases for TE, existing data models such as; Open Architecture Radar Interface Standard (OARIS) and Combat Resource Allocation System (CORALS) are being evaluated for inclusion in the Force Data Model. The Force Data model will be used to develop the FLF component interfaces. The OAWG will collaborate with the BMC4I, M&S, and ORWGs as well as a system experts group to ensure the Force Data model aligns with the Target and Reference Architectures as well as selected Possible Point Solutions (PPSs). Preliminary technical exchanges have also begun with M&S to ensure the Force Level Open Architecture Technical Standard (FLOATS) can be exercised in the M&S environment. The FLOATS PA amendment was signed to add Netherlands and extend the term of the project by 16 months to expire in June 2019.\n\n(5) TPEX continued preparations for MTMD participation as part of ongoing at-sea test event continuums. TPEX was vital in the planning, execution, and reporting of Integrated Air and Missile Defense (IAMD) events in support of Formidable Shield 17, a SIXTH Fleet led, STRIKFORNATO-executed Fleet exercise in support of maritime IAMD live fire operations in order to build interoperability and demonstrate IAMD command and control. FS-17 was supported by MTMD Forum member nation ships from Canada, France, Germany, Italy, the Netherlands, Spain, the United Kingdom, and the United States, and was executed in the beginning of FY18. TPEX will leverage events in Exercises Rim of the Pacific (RIMPAC) 2018 and Pacific Dragon (PD) 2018 scheduled in August of FY18. These at-sea demonstrations will include live tracking events and a combination of live and simulated IAMD engagements. RIMPAC 18\/PD 18 will be supported by MTMD Forum member nation ships from Canada, Australia, and the United States.  Planning for At-Sea Demonstrations (ASD) and follow-on at-sea testing will continue into future years and include target configuration\/procurement.  Future planning in FY18 included Formidable Shield 2019, ASD 2020, and ASD 2021.  \n\n(6) Operational Requirements Working Group will continue to provide fleet inputs and operator oversight to test and evaluation events. The Operational Concept Document will be updated along with tactics, techniques and procedures in support of ongoing at-sea demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.045"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1) BMC4I will continue engineering analysis and multi-national interoperability gap assessment for the Target Architecture based on test results and complete development of the Target Architecture based on requests for information input from member nations. BMC4I will evaluate new Possible Point Solutions and provide recommendations for the implementation in correcting coalition interoperability gaps. BMC4I will update information exchange requirements in preparation for at-sea demonstrations. BMC4I will develop updates to MTMD Coalition Capabilities and Interoperability (CCI), as appropriate.\n\n(2) M&S will continue analysis of Target Architectures and conduct further assessments in support of providing recommendations to improve information exchange requirements identified by BMC4I and the Systems Engineering Team (SET). M&S will model future Target Architectures and provide analysis in support of future at-sea demonstrations. The M&S team will continue development of the test bed and add additional computing power to the test environment to provide faster and more powerful analytical capability to the Forum System Engineering Team. The M&S Working Group will continue development of the Mission Models in support of capability development to illustrate operational impact of proposed solutions to complex Integrated Air and Missile Defense (IAMD) problems. \n\n(3) CDEP will integrate joint air and land assets for the first time in Annual Test Event (ATE) 2019.  CDEP will work with BMC4I and OR working groups to update the Coalition Capabilities and Interoperability (CCI) gaps document and develop test plans to assess capabilities suitable for land-based testing. CDEP will also characterize risks of future at-sea demonstrations such as At-Sea Demonstration (ASD) 2020. CDEP will prepare for and conduct hardware-in-the-loop tests with allied partners, and will provide assessments and recommendations to improve information exchanges required to conduct at-sea demonstrations or to evaluate performance as an effective and efficient alternative to costly at-sea demonstrations. CDEP will continue to support fulfillment of stated objectives within the MTMD Forum Capability Roadmap.\n\n(4) The Open Architecture Working Group (OAWG) will finalize the Force Data Model for Threat Evaluation (TE) and begin extending the data model to incorporate other Force Level Functions (FLFs). This will be accomplished by reusing data for existing data models such as Open Architecture Radar Interface Standard (OARIS) and Combat Resource Allocation System (CORALS).  A prototype interface will be developed for insertion in a Force Threat Evaluation and Weapons Assignment (FTEWA) implementation that will be exercised in an M&S environment. Additional Force Level Function (FLF) component interfaces will be modeled and developed as the Force Level Data Model is finalized. The OAWG will collaborate with BMC4I, OR, and CDEP to ensure these interfaces align with the Target and Reference Architectures as well as selected Possible Point Solutions (PPSs) in developing the Force Level Open Architecture Technical Standard (FLOATS). The OAWG will collaborate with the FTEWA Workshops and Subject Matter Experts (SMEs) to ensure the FLF component interfaces align with FTEWA requirements.\n\n(5) TPEX will continue preparations for MTMD participation as part of ongoing at-sea test event continuums. Exercise Formidable Shield 19 (FS-19) execution will commence in Q3 of FY 2019.  Eight of the MTMD Forum nations will be providing ships for FS-19 events and six MTMD Forum nations will be firing weapons. These at-sea demonstrations will include live IAMD tracking events and a combination of live and IAMD simulated engagements with a fleet exercise and interoperability focus. Planning for At-Sea Demonstrations (ASD) and follow-on at-sea testing will continue into future years and include air & ballistic target procurement.  Future planning in FY19 will include ASD 2020 and ASD 2021.    \n\n(6) Operational Requirements Working Group will continue to provide fleet perspective while also providing operational subject matter expertise and oversight for test and evaluation events. The Operational Concept Document and tactics, techniques, and procedures will be updated for distribution to MTMD Forum nations as well as the North Atlantic Treaty Organization (NATO) through Executive Committee action."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1) BMC4I will continue engineering analysis and multi-national interoperability gap assessment for the Target Architecture based on test results and complete development of the Target Architecture based on additional requests for information input from member nations. BMC4I will evaluate any additional Possible Point Solutions and provide recommendations for the implementation in correcting coalition interoperability gaps. BMC4I will update information exchange requirements in preparation for at-sea demonstrations. BMC4I will develop updates to MTMD Coalition Capabilities and Interoperability (CCI), as appropriate.\n\n(2) M&S will continue analysis of Target Architectures and conduct further assessments in support of providing recommendations to improve information exchange requirements identified by BMC4I and the SET. M&S will model future Target Architectures and provide analysis in support of future at-sea demonstrations. The M&S team will continue development of the test bed and add additional computing power to the test environment to provide faster and more powerful analytical capability to the Forum System Engineering Team. The M&S Working Group will continue development of the Mission Models in support of capability development to illustrate operational impact of proposed solutions to complex Integrated Air and Missile Defense (IAMD) problems. \n\n(3) CDEP will continue to assess interoperability of joint air and land assets in Annual Test Event (ATE) 2020. CDEP will also characterize risks of future at-sea events such as at-sea demo (ASD) 2020 and ASD 2021.  CDEP will work with BMC4I and OR working groups to update the Coalition Capabilities and Interoperability (CCI) gaps document and develop test plans to assess capabilities suitable for land-based testing. CDEP will prepare for and conduct hardware-in-the-loop tests with allied partners, and will provide assessments and recommendations to improve information exchanges required to conduct at-sea demos or to evaluate performance as an effective and efficient alternative to costly at-sea events.  CDEP will continue to align with the stated objectives within the MTMD Forum Capability Roadmap. CDEP will continue to improve a hardware-in-the-loop (HWIL) suite that can supplement live testing and facilitate a robust engineering evaluation of integrated air and missile defense performance for coalition interoperability.\n\n(4) The Open Architecture Working Group (OAWG) will model and develop the component interfaces for the Force Level Functions (FLFs). The Force Data Model will be updated as required. Force Level Open Architecture Technical Standard (FLOATS) interfaces will be exercised within the M&S and CDEP environment via Force Threat Evaluation and Weapons Assignment (FTEWA)  implementations that incorporate FLOATS interfaces.  These exercises will demonstrate various operational methodologies for distributing data within the Force as well as identifying performance parameters for the FLOATS standard. The OAWG will continue to collaborate with BMC4I, OR, CDEP and the System Experts Meeting (SEM) to ensure these interfaces align with the Target and Reference Architectures as well as selected Possible Point Solutions (PPSs) in developing the Force Level Open Architecture Technical Standard (FLOATS). The OAWG will collaborate with the FTEWA Workshops and Subject Matter Experts (SMEs) to ensure the FLF component interfaces align with FTEWA and operational requirements.\n\n(5) TPEX will continue preparations for MTMD participation as part of ongoing at-sea test event continuums. ASD 2020 will execute in Q4 of FY 2020.  Three live-fire Integrated Air and Missile Defense (IAMD) events are planned to be conducted.   These at-sea demonstrations will include live tracking events and a combination of live and simulated engagements with a fleet exercise and interoperability focus. Planning for At-Sea Demonstrations and follow-on at-sea testing will continue into future years and include air & ballistic target procurement.  Future planning in FY20 will include ASD 2021, PD 22, and FS-23 which will be risk reduction for future ASDs.  \n\n(6) Operational Requirements Working Group will continue to provide operator's perspective and recommendations to the engineering and test activity conducted in the other working groups."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funds will be utilized to support conduct of At-Sea Demonstration 2020 (ASD 20) and Exercise Formidable Shield 2021 (FS 21) that are planned for 4th quarter FY 2020 and FY 2021, respectively. These demonstrations will involve simultaneous presentation of targets representing ballistic and cruise missile threats to create scenarios that represent the Integrated Air and Missile Defense (IAMD) threat environment maritime forces now face when deployed. Specifically, these funds will be used to procure sounding rockets that represent the ballistic missile threat, and long lead material items: Oriole solid fuel rocket motors, thrust vane controllers (for guidance accuracy function), and system integration for all up round (AUR) buildup. The sounding rockets will be used during conduct of ASD 20 and the completed AURs are planned to be launched in FS 21. This demonstration enables maritime forces to demonstrate IAMD capability and new concepts for increased mission effectiveness, while enabling assessment of IAMD interoperability with our allies in this complex and challenging mission area. Major elements of these efforts include: ballistic target shipping and buildup, test planning and analysis, and combat system integration within the Tactical Data Link architecture that supports and enables the exercises. At the completion of each ASD event, thorough data analysis will be performed to identify interoperability issues and opportunities for the next event. Additionally, identification of systems integration, technology development and Fleet training needs, along with lessons learned, will be brought forward and implemented prior to the next ASD event. The plan is to execute an underway fleet-led event or demonstration with maritime forces at an average rate of one per year in order to increase our interoperability in the IAMD arena with our International Partners and Allies."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Program Reviews and Baseline Assessments"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3330"
                    },
                    "ProjectTitle": {
                        "val": "Naval Research Laboratory (NRL) Facilities Modernization"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "18.210"
                        },
                        "CurrentYear": {
                            "val": "15.438"
                        },
                        "BudgetYearOne": {
                            "val": "19.026"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.026"
                        },
                        "BudgetYearTwo": {
                            "val": "16.351"
                        },
                        "BudgetYearThree": {
                            "val": "16.741"
                        },
                        "BudgetYearFour": {
                            "val": "16.361"
                        },
                        "BudgetYearFive": {
                            "val": "16.681"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program has been established to provide a systematic and planned approach to improve vital in-house science and technology (S&T) laboratory facilities at the Naval Research Laboratory (NRL) which are reaching or have reached critical stages of deterioration.  The program includes restoration and modernization (R&M) initiatives for about 350,000 net square feet, where the average age of the buildings is 67 years old."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NRL Facilities Modernization"
                                    },
                                    "Description": {
                                        "val": "Critical Science and Technology research cannot be sustained or succeed in deteriorated facilities. World class research can only be accomplished in facilities that are at a minimum \"adequate\", but preferably \"state-of-the-art.\" Due to their advanced age and deterioration, funds are planned to restore\/modernize various laboratory facilities at the Naval Research Laboratory."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Areas of focus for FY 2018 will be air handling and distribution systems in the center for Bio molecular Sciences, Information Technology Division, Optical Sciences Division, Acoustics Chamber and Electra Laser facilities.  Continue modernization of laboratories to ensure they can meet future technological threats. Conduct specific studies, evaluations, and the special handling of highly critical and sensitive laboratories that are being relocated into refurbished buildings. Continue planning, consolidating and relocating of over 100 laboratories into less than 80 laboratories; careful disassembly of one-of-a-kind facilities and equipment by in-house scientists and experts and contractor support with specialized skills to devise unique plans to disassemble, transport, and reassemble the facilities; and the recalibration and specialized reassembly of the highly specialized equipment (e.g., solid-state electronic devises, lasers, vacuum tubes, electrical connections, reactors, gas sensors and chambers, and chemical connectors and distribution systems)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.438"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct modernization of laboratories to ensure they can meet future technological threats. Conduct specific studies, evaluations, and the special handling of highly critical and sensitive laboratories that are being relocated into refurbished buildings. Continue planning, consolidating and relocating of over 100 laboratories into less than 80 laboratories; careful disassembly of one-of-a-kind facilities and equipment by in-house scientists and experts and contractor support with specialized skills to devise unique plans to disassemble, transport, and reassemble the facilities; and the recalibration and specialized reassembly of the highly specialized equipment (e.g., solid-state electronic devises, lasers, vacuum tubes, electrical connections, reactors, gas sensors and chambers, and chemical connectors and distribution systems)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.026"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.026"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to address planned and emergent studies, evaluations, and modernization projects of laboratory facilities and infrastructure modernization of laboratories to meet future technological threats.  Execute planned Corporate Facility Investment Plan (CFIP) actions which include continuing laboratory consolidation efforts and relocation of highly sensitive, highly specialized equipment into refurbished buildings. Projects planned for FY 2020 include but are not limited to the replacement of existing duct work and control systems for multiple air handlers that support materials science research into the synthesis, processing, characterization, and implementation of advanced materials; the renovation of additional laboratory space to support research of electronic materials including semiconductors, heterostructures, and superconductors as well as materials characterization and properties; and the replacement of 50 year old chilled water lines that service multiple facilities, laboratories, and critical equipment located within these laboratories."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2020 is planned for additional costs associated with the replacement of critical chilled water lines in multiple facilities across the laboratory."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "None"
                        },
                        "PerformanceMetrics": {
                            "val": "Restoration and modernization of the laboratory facilities will begin in a phased approach until completion."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3363"
                    },
                    "ProjectTitle": {
                        "val": "PACOM Initiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "14.520"
                        },
                        "CurrentYear": {
                            "val": "13.027"
                        },
                        "BudgetYearOne": {
                            "val": "14.587"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.587"
                        },
                        "BudgetYearTwo": {
                            "val": "14.132"
                        },
                        "BudgetYearThree": {
                            "val": "14.030"
                        },
                        "BudgetYearFour": {
                            "val": "14.345"
                        },
                        "BudgetYearFive": {
                            "val": "14.653"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "China Strategic Initiative (CSI) (LI 0605853N). The CSI became a DoD RDTE program in FY 2014. The CSI program is USPACOM's first Asia Rebalance initiative and provides critical support to operational planning efforts. The CSI program is a command-directed program that provides the Commander, USPACOM and his staff critical support at all levels of planning and decision-making for military operations within the PACOM Area Of Responsibility (AOR). The CSI program provides:  Effects Emulations, PACOM Media Project, Operational Modeling and Simulation and a Critical Factors Analysis Tool.\nThis funding is for a classified effort."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PACOM Initiative"
                                    },
                                    "Description": {
                                        "val": "The China Strategic Initiative (CSI) program is the Department of Defense's (DoD's) first Asia Rebalance initiative and provides critical support to strategic and operational policy-making and planning efforts. On behalf of DoD, CDR, USPACOM directs CSI to research and develop highly sophisticated analytic tools to supplement command decision cycles across the Joint Force and the interagency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.520"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported numerous research projects for DoD and the intelligence community that increased understanding of China's grand strategy, economic development strategy and areas of competition with the United States, as well as new developments in China's approach to warfighting; continuous near-real-time authoritative media assessments of USPACOM, USCENTCOM, and USSOUTHCOM operational activities, to include Chinese reaction to senior DoD official statements; and tested (16) strategic and operational-level policy and planning effects in support of multiple Combatant Command, the Office of the Secretary of Defense-Policy, Service Chiefs, the U.S. Trade Representative, and the National Security Council."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development and refinement of: analysis of Chinese war theory and planning, critical vulnerabilities assessments and methodology, effects testing, and expansion of China media analysis to all Combatant Commands. Integration with routine policy and planning processes will mature, alongside efforts to consolidate knowledge management of high-output data yields."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enhanced development and refinement of: deeper analysis of Chinese war theory and planning, increase in the overall number of critical vulnerabilities assessments and methodology, increase in the number of  effects testing events, and continued expansion of China media analysis to all Combatant Commands. Integration with routine policy and planning\nprocesses will mature, alongside efforts to consolidate knowledge management of high-output data yields."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding will support more advanced, critical research projects that address China Strategic Initiative Derivation knowledge gaps; further enhancement and refinement of the Critical Factors Analysis suite of analytical tools and products; dramatic increase in both the quality and quantity Emulations at the strategic and operational levels as well as expanded development for the modeling and simulation technologies that support those events; increased scope and support for the INDOPACOM Media Project that will expand to cover all Combatant Commands with added line of effort to cover unique analysis of Chinese media censorship."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Operational Emulation (OE) is meeting or exceeding program milestones, and is pacing ahead of expected developmental timeline. As the OE program continues to mature, it is also expanding as required to meet the overall mandate of supporting extensive studies and analyses for the operational and intelligence contingency planning required by the China Strategic Initiative. In FY 2017, OE conducted a beta intelligence forum and its first \"live\" intelligence forum, and is on pace to conduct an intelligence forum every two months in FY18. Currently for each two-month cycle, OE conducts an operational forum, intelligence forum, and extensive modeling and simulation using a variety of analytic tools. The first operationally-focused forum was conducted in June 2018, and the program is on track to conduct one every two months for the rest of FY 2018.\n\nOE provides operational planners and intelligence subject matter experts (SMEs) with highly structured and repeatable processes with which to develop, test, and refine concepts. OE now includes separate, but interrelated, operational and intelligence-focused events utilizing highly-qualified SMEs to provide qualitative analysis, and robust modeling and simulation for quantitative analysis. The OE program is maturing through extensive participation by operational planners and intelligence SMEs, and continues to yield significant insights that fundamentally influence the development of operational plans.\n\n\nOperational Decision Analysis (ODA). Successfully achieve Initial Operating Capability on ODA sub Line of Effort support effort with at least 80% of initial objectives being achieved by 3QTR FY 2018.\n\nODA provides funding to support continuing requirement for studies and analysis of issues critical to operational and intelligence contingency planning required by the China Strategic Roundtable (whose members include all Combatant Commanders, Service Chiefs, Deputy Secretary of Defense, Policy leadership, the Director of Defense Intelligence Agency, and Director of the National Security Agency). The PE directly support CSIs Strategic Emulation LOE and will provide critical technical inputs and strategic insights that complement the programs OE output database, which is still under development. ODA outputs will significantly enhance Combatant Component Command staffs with their operational and intelligence planning and global synchronization across multiple domains amongst all geographic and functional combatant commands.  \n\nDecision Support Elements to Operational Emulation Modeling and Simulation (DSEOMS). Successfully achieve Initial Operating Capability on this major LOE with at least 80% of initial objectives being met by 3QTR FY 2019.\n\nDSEOMS provides funding to support all four major LOEs for the CSI program and all its sub-LOEs. This effort will provide a comprehensive and campaign-quality decision support toolset to decision makers across the entire CSI enterprise: OSD, Joint Staff, Combatant Commands, Intelligence Community, and the Whole of US Government (Interagency). This PE will create a set of enhanced automated and doctrinal decision- making tools to assist key policy- and strategic leaders on a full spectrum of contingencies related to competitor nations. DSEOMS will provide analytic modeling and simulation tools that take inputs from all major CSI program LOEs; the goal being to present decision- and policy-makers and their planning staffs with a rich dataset of information that is relevant, timely, and substantive for their respective problem sets. The current scope and focus across all LOEs is to support emerging near-term and longer-term planning to both significantly enhance war planning orientation and force posture considerations but also to significantly enhance more informed strategic choices regarding future joint\/service capability investments and joint\/service operational concepts across all strategic domains.   Ultimately, fully integrated program deliverables will guide a deliberative process for identifying efficiencies in major service platform decisions to ensure they are optimized for the full-spectrum of projected adversary capabilities in the future."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "43.456"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "43.456"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Navy Research Lab Infrastructure Upgrades"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "28.971"
                                        },
                                        "Text": {
                                            "val": "The Naval Research Laboratory continues to address emergent and planned facilities sustainment and modernization projects.  These efforts will ensure the laboratory can conduct a broadly based multidisciplinary program of scientific research and advanced technological development to meet current and future threats to naval forces.  The funding provided in FY 2018 via this Congressional Add allowed the command to accelerate the submission of crucial projects whose delay due to availability of resources would have negatively impacted ongoing and planned research efforts focused on increasing naval warfighting technological advantage over near-peer competitors.  Anticipated awards in FY 2018 include but are not limited to replacement of electrical panels that support materials science and technology research which requires steady state electrical power to operate multi-million dollar additive manufacturing equipment used to develop next generation metallic and ceramic complex structural materials; replacement of transformers that provide power to the Nike Laser Facility used to conduct research in plasma physics and potential directed energy weapons development; and replacement of transformers and switching gear that supports multiple departments responsible for research and engineering related to naval space technology efforts in the areas of component design, mechanical systems development, electronic systems development, control systems development, and design test and processing of materials and systems ensuring reliable and robust use of this critical environment in support of naval operations."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Printed Circuit Board Executive Agent"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14.485"
                                        },
                                        "Text": {
                                            "val": "Program Management:\n- Leading bi-weekly TAG-UP calls and monthly Charter Leads meeting.\n- Conducting Weekly EA PM Meetings.\nTrust Assurance:\n- The PrCB EA, along with support from SAIC and their Merrillville, IN lab,\ncontinues to investigate a microvia reliability issue. \n- Supporting status and update meetings and telecons with OSD R&E\/SE, OSD\nL&MR\/MPP, DLA, OSD MIBP.\n- Continuing EA trusted accreditation process development for printed\ncircuit board design, fabrication & assembly.  \n- Overseeing DOTC Counterfeit Detection Project.\nTechnology Development:\n- Continue to develop processes and product refinement for the newly\nacquired and installed Optomec printer and LED imager.\n- Ongoing initiatives for DoD Organic supply chain: board design & assembly,\ninterconnect technology related challenges, and EA outreach for technology\ntransition purposes to academia and industry.\n- Investigating novel materials  and hybrid additive manufacturing\ntechnologies for printable and flexible  electronic interconnect and PCB\nassembly.\nSupply Chain Risk Management:\n- Continuing to review and utilize data and results from the PrCB Industrial\nBase survey conducted by the Department of Commerce for incorporation into\nthe 2017 Technology Roadmap and other initiatives.\n- Continued  engagement for a Supply Chain Risk Management project executed\nby GTSI.  \n- Continued development of PrCB Reliability guidance documents.\n- Overseeing DOTC Supply Chain Risk Mgmt. \n- Ongoing work to address military requirement gaps for IPC J-STD-001 by\ndeveloping an Aerospace and Defense Addendum as well as a User's Guide. \n- Ongoing work on Standards Development and Coordination of industry\nstandard membership and participation, including leadership roles on the\nIPC-1071 rewrite and a  printed electronics Standard.\n- Continued NSWC Crane Printed Circuit Board Mfg Facility Assessment,\nincluding Process review and development and equipment setup & maintenance."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}