{
    "id": "2020-DefenseThreatReductionAgency-PB-0400-MJBOOK-0-8-20c9efcf6d605b32d3d5f083f831185effe1f78c53559fcdc9809c2a22add379-3",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603134BR"
        },
        "ProgramElementTitle": {
            "val": "Counter Improvised-Threat Simulation"
        },
        "R1LineNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "23.366"
            },
            "CurrentYear": {
                "val": "13.648"
            },
            "BudgetYearOne": {
                "val": "49.528"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "49.528"
            },
            "BudgetYearTwo": {
                "val": "50.110"
            },
            "BudgetYearThree": {
                "val": "50.250"
            },
            "BudgetYearFour": {
                "val": "47.887"
            },
            "BudgetYearFive": {
                "val": "48.194"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Overseas Contingency Operations (OCO) for Enduring Requirements ($49.528M): OCO for Enduring Requirements are enduring in-theater and in-CONUS costs that will likely remain after combat operations cease, and have previously been funded in OCO.  Funds also enable and provide for urgent and emergent warfighter requirements from Combatant Commands and Warfighter Senior Integration Group."
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Threat Reduction Agency (DTRA) Counter Improvised-Threat Simulation Advanced Technology Development program element funds Technology Outreach as well as development of modeling-and-simulation and analysis support tools that enhance counter-improvised explosive devices (C-IED) and counter improvised threat (C-IT) efforts.\n\nEnable Rapid Capability Delivery. Understanding the threat drives DTRA's deliberate, structured, and proactive approach to identify and validate urgent or emergent capability gaps and requirements. DTRA's continuous embedded presence with deployed U.S. Joint Forces enables early identification and understanding of C-IED and C-IT gaps, vulnerabilities, and risks and the timely validation, resourcing, development, and delivery of C-IED and C-IT material and non-material solutions. DTRA's technical integrators embedded with deployed forces further enables rapid adjustments to solutions as the threat’s adaptation evolves."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "13.648"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.366"
                },
                "CurrentYear": {
                    "val": "13.648"
                },
                "BudgetYearOne": {
                    "val": "49.528"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "49.528"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "23.366"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "49.528"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "49.528"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "23.366"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "49.528"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "49.528"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in FY 2020 supports the continuation of Overseas Contingency Operations (OCO) at a higher level of funding than in FY 2019. FY 2020 supports increased investments in Advanced Technological Development (ATD) focused on Disruptive Technologies providing a greater than 70% solution to the following areas: Buried Improvised Explosive Devices (IED), Attack the Network, Home-Made Explosives (HME), and System Attributes across the Portfolio Range including Machine Learning & Artificial Intelligence. Strategically aligned investments include increased investments in improved autonomous capabilities supporting the detection and defeat of improvised threats and the integration of Artificial Reality (AR)\/Virtual Reality (VR) into C-IT capabilities.  These areas of investment continue to be identified time and again as challenging problem sets for the warfighters as identified by the CCMDs and warfighting commands in their Integrated Priority List (IPLs) and Joint Urgent Operational Need (JUON).  The Continuation of ATD activities is critical to advancing current initiatives to the prototype phase in the following areas: Remote Controlled IED (RCIED) & Stand-off Detection.  This investment supports further development, testing, and prototyping of advanced Modelling, Visualization, and Simulation capabilities for processor-intensive analytics to support warfighters operating in tactical environments. The capability directly supports mission planning, targeting, and post-operation analysis by troops operating in tactical theaters of operation. For example, the capability will support mission planning by providing first-person experiential mission planning through immersion in a 3-D virtual model of a target mission environment that is augmented by inputs from multiple sensor platforms. The tactical user may interact with the virtual model of the target mission environment through head-mounted and\/or handheld devices. Mission planning augmented in this manner may improve targeting accuracy and provide improved force protection in tactical environments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "JC"
                    },
                    "ProjectTitle": {
                        "val": "Enable Rapid Capability Delivery"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "23.366"
                        },
                        "CurrentYear": {
                            "val": "13.648"
                        },
                        "BudgetYearOne": {
                            "val": "49.528"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "49.528"
                        },
                        "BudgetYearTwo": {
                            "val": "50.110"
                        },
                        "BudgetYearThree": {
                            "val": "50.250"
                        },
                        "BudgetYearFour": {
                            "val": "47.887"
                        },
                        "BudgetYearFive": {
                            "val": "48.194"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Enable Rapid Capability Delivery: Understanding the threat drives Defense Threat Reduction Agency's (DTRA'S) deliberate, structured, and proactive approach to identify and validate urgent or emergent capability gaps and requirements. DTRA's continuous embedded presence with deployed U.S. Joint Forces enables early identification and understanding of Counter-Improvised Explosive Device (C-IED) and Counter-Improvised Threat (C-IT) gaps, vulnerabilities, and risks and the timely validation, resourcing, development, and delivery of C-IED and C-IT material and non-material solutions. DTRA's technical integrators embedded with deployed forces further enables rapid adjustments to solutions as the threat’s adaptation evolves.\n\nDTRA provides DoD up to an 18-month “head start” on addressing critical warfighter gaps, and enables DoD to deliver the most technologically advanced response to improvised threats. These capabilities are developed from previous Joint Improvised-Threat Defeat Organization (JIDO) experience and in concert with other government agencies, National Labs, Academia, Private Industry, and International Partners.\n\nThis project employs Technology Outreach as well as development of modeling-and-simulation and analysis support tools to identify and validate urgent and emergent capability requirements and associated gaps. It provides rapid acquisition and delivery of C-IED and C-IT solutions to address these requirements and gaps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JC:  Enable Rapid Capability Delivery"
                                    },
                                    "Description": {
                                        "val": "This project serves to understand the threat and drives a deliberate, structured, and proactive approach to identify and validate urgent or emergent capability gaps and requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.366"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.648"
                                            },
                                            "Text": {
                                                "val": "- Improve detection capabilities through baseline threat signatures in support of sensor capability development.\n- Develop common database for signatures for DoD and other government agencies for use in sensor development and tactics, techniques, and procedures (TTPs).\n- Identify and maintain database of future threats and technologies that can be incorporated into improvised threats in support  of future capability development.\n- Conduct testing and evaluation of future technology development in support of C-ITs.\n- Leverage capabilities and expertise primarily from DoD University Affiliated Research Centers (UARCs) such as Georgia. Tech Research Institute (GTRI) and Massachusetts Institute of Technology (MIT) Lincoln Labs.\n- Convene Joint Lab Board in support of rapid development and prototyping to C-ITs.\n- Conduct Hacking 4 Defense in support of rapid development and prototyping to C-ITs.\n- Develop Broad Area Announcement (BAA) solicitation in support of capabilities to C-ITs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.528"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "49.528"
                                            },
                                            "Text": {
                                                "val": "- Improve detection capabilities through baseline threat signatures for vehicles, explosives, and other threats in support of sensor capability development.\n- Develop common database for signatures for DoD and other government agencies to use for sensor development and tactics, techniques, and procedures (TTPs).\n- Identify and maintain database of future threats and technologies that can be incorporated into improvised threats in support  of future capability development.\n- Conduct testing and evaluation of future technology development in support of C-ITs.\n- Increase the processing, exploitation, and dissemination of data for integrated sensors identifying improvised threat facilitation networks.\n- Enhance integration of sensors identifying improvised threat facilitation networks.\n- Create new capabilities related to next generation cellular technology.\n- Improve sensor integration capability for Person Borne Improvised Explosive Device (PBIED) and Vehicle Borne Improvised Explosive Devise (VBIED) to improve detection rates and increase standoff detection.\n- Investigate incorporation of Machine Learning (ML) and Artificial Intelligence (AI) into C-IT capabilities.\n- Improve autonomous capabilities that support the detection and defeat of improvised threats in support of non-line of sight missions.\n- Integrate Artificial Reality (AR)\/Virtual Reality (VR) into C-IT capabilities.\n- Conduct Hacking 4 Defense in support of rapid development and prototyping to C-ITs.\n- Develop Broad Area Announcement (BAA) solicitation in support of capabilities to C-ITs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "DTRA increased investment for activities at the Technology Readiness Level (TRL) 5 to enable DoD to deliver the most technologically advanced response to improvised threats:  Component and\/or breadboard validation in a relevant environment or TRL 6:  System\/subsystem model or prototype demonstration in a relevant environment.  DTRA also increased investment in ML and AI C-IT capabilities, to improve autonomous capabilities that support the detection and defeat of improvised threats in support of non-line of sight missions, and the integration of Artificial Reality (AR)\/Virtual Reality (VR) into C-IT capabilities."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "10\/0602134BR\/JC"
                                    },
                                    "Title": {
                                        "val": "Improvised Threat Reduction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.502"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.502"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.512"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.522"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.533"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.543"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "94\/0604134BR\/JC"
                                    },
                                    "Title": {
                                        "val": "Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "117.640"
                                        },
                                        "CurrentYear": {
                                            "val": "148.772"
                                        },
                                        "BudgetYearOne": {
                                            "val": "103.793"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "103.793"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "59.860"
                                        },
                                        "BudgetYearThree": {
                                            "val": "109.236"
                                        },
                                        "BudgetYearFour": {
                                            "val": "105.258"
                                        },
                                        "BudgetYearFive": {
                                            "val": "106.598"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Select the best performer through studies and development boards with products that can be quickly assessed and placed into development in order to produce a product valuable to the warfighter in combating improvise threat effectiveness."
                        },
                        "PerformanceMetrics": {
                            "val": "Completing projects within a 24 month period for use by the warfighter, and transfer to the services, agencies, or organizations."
                        }
                    }
                }
            ]
        }
    }
}