{
    "id": "2020-AirForce-PB-3600-MJBOOK-1-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-93",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604759F"
        },
        "ProgramElementTitle": {
            "val": "Major T&E Investment"
        },
        "R1LineNumber": {
            "val": "124"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "111.138"
            },
            "CurrentYear": {
                "val": "216.844"
            },
            "BudgetYearOne": {
                "val": "181.663"
            },
            "BudgetYearOneBase": {
                "val": "181.663"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "164.005"
            },
            "BudgetYearThree": {
                "val": "142.090"
            },
            "BudgetYearFour": {
                "val": "81.386"
            },
            "BudgetYearFive": {
                "val": "81.843"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "82.874"
                },
                "CurrentYear": {
                    "val": "91.844"
                },
                "BudgetYearOne": {
                    "val": "181.663"
                },
                "BudgetYearOneBase": {
                    "val": "181.663"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "111.138"
                },
                "CurrentYear": {
                    "val": "216.844"
                },
                "BudgetYearOne": {
                    "val": "181.663"
                },
                "BudgetYearOneBase": {
                    "val": "181.663"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "28.264"
                },
                "CurrentYear": {
                    "val": "125.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "30.000"
                    },
                    "CurrentYear": {
                        "val": "125.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.736"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18: AF received $30 million in Congressional add funding of which $25 million modernizes equipment as part of the Gulf Range Enhancement (GRE) effort and $5 million is for weapon system cyber resiliency. \n\nFY19: AF received $125 million in Congressional add funding of which $54 million was set aside for Space Test infrastructure development, $5 million was set aside for UAV-based EW test platform capability, $5 million was allocated to the Avionics Cyber Range to procure additional test benches and software tools, $10 million was allocated to instrumentation test capabilities at both Edwards and Eglin AFBs, $25 million was assigned to procurement of a heater system at AEDC to improve hypersonic testing of thermal protection systems, and $26 million was allocated to procure marine fiber optics deployment to the SE portion of the Gulf of Mexico to accelerate GRE capabilities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "664597"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Test Investments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "111.138"
                        },
                        "CurrentYear": {
                            "val": "216.844"
                        },
                        "BudgetYearOne": {
                            "val": "181.663"
                        },
                        "BudgetYearOneBase": {
                            "val": "181.663"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "164.005"
                        },
                        "BudgetYearThree": {
                            "val": "142.090"
                        },
                        "BudgetYearFour": {
                            "val": "81.386"
                        },
                        "BudgetYearFive": {
                            "val": "81.843"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE provides planning, improvements, and modernization for test capabilities within Air Force Test Center (AFTC) Major Range and Test Facility Base organizations:  96 Test Wing at Eglin AFB FL, the 412 Test Wing at Edwards AFB CA, and Arnold Engineering Development Complex (AEDC) at Arnold AFB TN.  The 704th Test Group at Holloman AFB NM and the McKinley Climatic Lab at Eglin AFB are now aligned under AEDC as part of the management consolidation of Ground test capabilities.  The purpose is to improve and develop infrastructure and capabilities to deliver relevant and cost-effective test and evaluation capabilities suitable for current and planned weapon systems.\n\nThe improvement and modernization (l&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process. All projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in the Technology Development Acquisition Program (TDAP) database. Each project has its own planning, development, equipment acquisition, equipment installation,\nand checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year does not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full-scale integrated weapon system test to operational test.\n\nThese test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD Test and Evaluation (T&E).  These national test assets are available to others requiring their unique capabilities.\n\nThe 96 TW, at Eglin AFB FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C41SR) systems; target acquisition and weapon delivery systems; determines target\/test item spectral signatures; and provides Cyber testing capabilities as part of the Avionics Cyber Range (ACR).\n\nThe 412th Test Wing, at Edwards AFB CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nAEDC, at Arnold AFB TN, provides pre-flight reliability environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; testing of large-scale models such as space boosters together with their propulsion systems.  This capability includes the worlds largest climatic laboratory - the McKinley Climatic Laboratory at Eglin AFB which provides controlled all-weather condition testing of full scale systems.  The 704 TG at Holloman AFB, NM provides flight test and test support for joint, international and commercial customers in advanced avionics and weapons, inertial navigation systems, Global Positioning System (GPS) and other integrated aircraft and missile navigation systems.  They test subsonic through hypersonic ground performance of aircraft and missiles in a flight-representative, highly instrumented environment while also coordinating and scheduling all US Air Force test operations at White Sands Missile Range.  The 704 TG, OL-AC at Wright-Patterson AFB, OH provides independent developmental T&E in support of aircraft survivability and evaluation of full-scale aircraft landing gear, tires and brakes, including.  In addition, they provide an independent capability for component qualification.\n\nIn previous PB documentation, l&M efforts within this PE were identified via four mission area categories: Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C41SR)\/Cyber; and Space. However, in order to align the strategic capability goals set forth in the 2018 National Defense Strategy and the mission of the AFTC, several of the aforementioned areas have been discontinued and the funding realigned to new mission area categories. As of the FY20 PB, the six mission areas are:\n\n1) T&E Range and Test Asset Modernization refers to those capabilities required to acquire the ability to test long range, high-speed, highly-instrumented, high-data rate weapons in a crowded and restricted spectrum, while operating at multiple classification and cybersecurity levels. Ability to collect, analyze and store big data and ability to do multi-domain testing across the enterprise with realistic threat scenarios at multiple classification level up to Special Access Program (SAP).\n\n2) Hypersonics refers to the ability to T&E flight-representative hypersonic engines, materials, warheads and fuzes in all portions of the employment envelope and conduct flight testing both in simulation and open-air ranges with sufficient space, telemetry, photo-optics and Time Space Position Information (TSPI) to appropriately inform decision-makers fielding such systems.\n\n3) Directed Energy\/Electronic Combat acquires the ability to characterize irradiance and beam properties on aircraft, small UAVs and ground targets and create realistic environments to simulate adversary air defense capabilities in the year 2030. Enables 5-6th generation weapon testing\/tactics development in a threat-realistic Anti-Access Area Denial (A2AD) environment using a combination of indoor and open-air ranges.\n\n4) Cyberspace and Avionics Cyber is the advancement of cybersecurity\/resiliency test capability for network, C41SR and airborne weapon platforms and includes development of tools, techniques and hardware in the loop capabilities focused on cybersecurity and cyber-resiliency.\n\n5) Autonomy refers to the ability to test autonomous aerial and ground systems with hundreds of independent vehicles. Must be able to monitor system-under-test locations and states with the ability for soft and hard termination. Must develop techniques and processes to test systems with artificial intelligence.\n\n6) Space Test Infrastructure refers to the development of a Space Combined Test Force and the development of technical capabilities, both terrestrial and space-based assets, in order to deploy  an initial level of ability to test and evaluate the capability and resilience of DoD Space systems in a contested environment.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 6, RDT&E Management Support because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "T&E Range and Test Asset Modernization"
                                    },
                                    "Description": {
                                        "val": "T&E Range and Test Asset Modernization refers to those capabilities required to acquire the ability to test long range, high-speed, highly-instrumented, high-data rate weapons in a crowded and restricted spectrum, while operating at multiple classification and cybersecurity levels. Ability to collect, analyze and store big data and ability to do multi-domain testing across the enterprise with realistic threat scenarios at multiple classification level up to Special Access Program (SAP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "96.032"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "107.213"
                                            },
                                            "Text": {
                                                "val": "Plans for FY2019 include, but are not limited to, the following improvement and modernization efforts which may be accelerated or delayed due to variations in customer requirements and overall project execution.\n\nImprove Transonic Test Capability (IMTTC) will continue to install and integrate hardware and software enhancements for TCC and 16T Test Article Control System (TACS).\n\nVoice Communication System Upgrade (VCSU) Program will continue to migrate voice systems for multiple mission control rooms.\n\nCRIIS Production will complete Lot 2 and start Lot 3 procurement of OSD CTEIP developed CRIIS TSPI increment two pods, aircraft internal mounts and ground support infrastructure.\n\nNetwork Telemetry Integration Program (NTIP) will initialize and procure the first aircraft to be migrated to the iNET System.\n\nCommon Airborne Network Instrumentation System (CANIS) will continue supporting and complementing the CTEIP funded iNET Program by implementing the airborne solutions.  FY19 activity will include completing the implementation of spirals 0, 1, and 2 of the CANIS acquisition approach.\n\nNext Generation Turbine Engine Test Capability (NGTETC) will continue upgrades to exhaust coolers, compressor inbleed, power and thermal management systems.\n\nImprove Plant Reliability & Efficiency\/Transonic Aero Test Capability (IMTPC) will continue to restore the capabilities of the main drive motors (rewind main drive motors M1 and M4), C1 compressor (replace both C1 compressor rotor blades and spacers), main drive motor sub-systems (refurbish\/replace), C1 compressor subsystems (refurbish\/replace), and the electrical support systems (refurbish\/replace primary Propulsion Wind Tunnel (PWT) facility main drive electrical utilities) to original specifications.\n\nModular Mission Control Room Upgrade (MMCRU) will continue software development and roll out and integration of control room displays across multiple control rooms.\n\nAdvanced Small Military High Speed Engine Capability (AMSC) will begin Phase II procurement and integration to accommodate future test efforts.\n\nGulf Range Enhancement (GRE) begins measured implementation to extend Time Space Position Information (TSPI) capabilities south into the Gulf Range for expanded use of the airspace for increased throughput of flight test efforts as well as to support future hypersonic, swarming autonomous vehicles, and Long-Range Standoff (LRSO) test efforts.  Fiber optic network design and deployment in the SE Gulf of Mexico accelerates IOC of 500 nautical mile range test capability along the west coast of Florida at Eglin AFB.\n\nImproved C2 Test Operations Center (I-C2TOC) will continue development of secure network infrastructure and initiate procurement of software and hardware servers and workstations needed to enhance net-centric C2 battle management operations and test control capabilities, improve communication interfaces and data collection, handling, analysis and display capabilities supporting C4ISR end-to-end weapon system testing at Eglin AFB.\n\nImproved Data Links (IDL) will begin studies and pre-acquisition work for test solutions for Fourth Gen aircraft systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.538"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.538"
                                            },
                                            "Text": {
                                                "val": "Continue planning and\/or execution of the following programs: CRIIS Production, Network Telemetry Integration Program (NTIP) (formerly iSIS), Common Airborne Network Instrumentation System (CANIS), Modular Mission Control Room Upgrade (MMCRU), Voice Communication System Upgrade (VCSU), Joint Airborne Instrumentation Integration (JAII), Common Airborne Network Instrumentation System (CANIS), Combined High-Speed\/High-Resolution EO\/IR Imaging (CHSHR), Improved C2 Test Operations Center (I - C2TOC), Airborne Sensor Data Correlation Project (ASDC), Improved Data Link HITLS - Gen 4 & 5, Multi-Level Security - Joint Collaborative Environment (MLS - JCE), Advanced Large Military Engine Capability (ALMEC), Improve Transonic Test Capability (IMTTC), Test Instrumentation, Data Systems & Control (TIDSC), Next Generation Turbine Engine Test Capability (NGTETC), Improve Plant Reliability and Efficiency\/Transonic Aero Test Capability (IMTPC), Improve Large Model Supersonic Aerodynamic Ground T&E Capability (ILMSC) [formerly Tunnel 16S Reactivation], Full-scale Subsonic Wind Tunnel - Fan Blades (NFAC-Blades), Advanced Engine Requirements for Power and Thermal Loads, High-speed Small Engine Test Capability (HSETC) (previously ASMEC-II), and the Gulf Range Enhancement (GRE) project.\n\nPre-Milestone A Studies and Proof of Concepts will be implemented as required to improve future I&M acquisition efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $69.475 million due to $36 million of FY19 add funding (for GRE and instrumentation) not carried forward to FY20, a $36 million decrease for such projects as NGTETC, VCSU, IMTPC, CANIS, ASMEC Phase III, IMTTC, and I-C2TOC as they move towards completion, and a $2.5 million increase for ISIS and MMCRU projects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hypersonics"
                                    },
                                    "Description": {
                                        "val": "Hypersonics refers to the ability to T&E flight-representative hypersonic engines, materials, warheads and fuzes in all portions of the employment envelope and conduct flight testing both in simulation and open-air ranges with sufficient space, telemetry, photo-optics and Time Space Position Information (TSPI) to appropriately inform decision-makers fielding such systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.030"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.400"
                                            },
                                            "Text": {
                                                "val": "Plans for FY2019 include, but are not limited to, the following improvement and modernization efforts which may be accelerated or delayed due to variations in customer requirements and overall project execution.\n\nThe Mid-Pressure Arc Heater (MPAH) power supply project at AEDC will procure and install an improved heater to enable the arc heater to simulate larger hypersonic themal protection system samples.\n\nThe Imaging Improvement and Modernization Project (I2MP) at 704 TG will develop and procure advanced imaging cameras and tracking systems to improve photo optical data quality for hypersonic rocket sled testing.\n \nNext Generation Munitions Test Environment (NGMTE) will complete upgrades to aging gun and munitions test infrastructure, development and procurement of common data instrumentation and acquisition systems, and replacement of environmental test chambers\/facilities supporting gun and arena test capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Other Hypersonic upgrades to the AEDC range facility are being addressed by the OSD HYTIP program.\n\nPre-Milestone A Studies and Proof of Concepts will be implemented as required to improve future I&M acquisition efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $25.4 million largely attributable to $25 million in FY19 add funding not applying to FY20, used for the mid pressure arc heater increment 2 effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy\/Electronic Combat"
                                    },
                                    "Description": {
                                        "val": "Directed Energy\/Electronic Combat acquires the ability to characterize irradiance and beam properties on aircraft, small UAVs and ground targets and create realistic environments to simulate adversary air defense capabilities in the year 2030. Enables 5-6th generation weapon testing\/tactics development in a threat-realistic Anti-Access Area Denial (A2AD) environment using a combination of indoor and open-air ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.850"
                                            },
                                            "Text": {
                                                "val": "Plans for FY2019 include, but are not limited to, the following improvement and modernization efforts which may be accelerated or delayed due to variations in customer requirements and overall project execution.\n\nThe Joint Simulation Environment (JSE) program will begin planning and study efforts to create a USAF high fidelity simulation capability accreditable for test as a supplement to open air environments. As part of the expanded FY17 Defense Laboratory Modernization Pilot Program, two MILCON facilities will be built for developmental and operational test use. Planning and design for JSE (Edwards) and JSE (Nellis) will begin in FY19, with construction to begin in FY20."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "109.580"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "109.580"
                                            },
                                            "Text": {
                                                "val": "Construction of the two JSE facilities at Edwards and Nellis begins.\n\nThe Advanced Multispectral Development (AMD) program will continue execution."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $105.730 million due largely to JSE construction and stand-up. Stand-up includes $36 million for long lead specialized items to construct the simulator domes and associated manpower support."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyberspace and Avionics Cyber"
                                    },
                                    "Description": {
                                        "val": "Cyberspace and Avionics Cyber is the advancement of cybersecurity\/resiliency test capability for network, C41SR and airborne weapon platforms and includes development of tools, techniques and hardware in the loop capabilities focused on cybersecurity and cyber-resiliency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.076"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.381"
                                            },
                                            "Text": {
                                                "val": "Plans for FY2019 include, but are not limited to, the following improvement and modernization efforts which may be accelerated or delayed due to variations in customer requirements and overall project execution.\n\nCyber Defense Test Capability (CDTC) will continue in FY19. During this phase the plan for acquiring and training the workforce necessary for cybersecurity test and evaluation will continue.\n\nThe planning and design phase for the new cyberspace test facility for the 96th Test Wing Cyber Test Group at Eglin begins. The Cyberspace MILCON is the third AFTC project to leverage the FY17 expanded Defense Laboratory Modernization Pilot Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.145"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.145"
                                            },
                                            "Text": {
                                                "val": "Continue planning and execution of the Weapon System Cybersecurity (WSCS) Program.\n\nCyberspace Test facility construction begins. \n\nPre-Milestone A Studies and Proof of Concepts will be implemented as required to improve future I&M acquisition efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $11.764 million associated with the transition from planning and design in FY19 to construction in FY20 of the Cyberspace facility at Eglin."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomy"
                                    },
                                    "Description": {
                                        "val": "Autonomy refers to the ability to test autonomous aerial and ground systems with hundreds of independent vehicles. Must be able to monitor system-under-test locations and states with the ability for soft and hard termination. Must develop techniques and processes to test systems with artificial intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "$5M added to the Major T&E Investment line for UAV electronic warfare capabilities is unexecutable as the AF does not have an existing test requirement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Pre-Milestone A Studies and Proof of Concepts will be implemented as required to improve future I&M in the area of autonomous vehicle test."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in funding between FY19 and FY20 is due to the one-time UAV electronic warfare capabilities FY19 Congressional add."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space"
                                    },
                                    "Description": {
                                        "val": "Space Test Infrastructure refers to the development of a Space Combined Test Force and the development of technical capabilities, both terrestrial and space-based assets, in order to deploy  an initial level of ability to test and evaluate the capability and resilience of DoD Space systems in a contested environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "54.000"
                                            },
                                            "Text": {
                                                "val": "Build up of foundational infrastructure elements including such things as test facilities, network infrastructure, electronic warfare test equipment, and physics-based modeling and simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue FY19 efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in funding between FY19 and FY20 is a result of the one time FY19 Congressional add of $54 million."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0604256F"
                                    },
                                    "Title": {
                                        "val": "Threat Simulator Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "34.777"
                                        },
                                        "CurrentYear": {
                                            "val": "34.206"
                                        },
                                        "BudgetYearOne": {
                                            "val": "59.693"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "59.693"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "63.925"
                                        },
                                        "BudgetYearThree": {
                                            "val": "44.844"
                                        },
                                        "BudgetYearFour": {
                                            "val": "36.577"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.717"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0605807F"
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "735.688"
                                        },
                                        "CurrentYear": {
                                            "val": "692.784"
                                        },
                                        "BudgetYearOne": {
                                            "val": "717.895"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "717.895"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "721.615"
                                        },
                                        "BudgetYearThree": {
                                            "val": "761.252"
                                        },
                                        "BudgetYearFour": {
                                            "val": "765.736"
                                        },
                                        "BudgetYearFive": {
                                            "val": "779.877"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0605976F"
                                    },
                                    "Title": {
                                        "val": "Facility Restoration & Modernization - T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "135.507"
                                        },
                                        "CurrentYear": {
                                            "val": "187.216"
                                        },
                                        "BudgetYearOne": {
                                            "val": "88.445"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "88.445"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "69.293"
                                        },
                                        "BudgetYearThree": {
                                            "val": "70.730"
                                        },
                                        "BudgetYearFour": {
                                            "val": "72.019"
                                        },
                                        "BudgetYearFive": {
                                            "val": "73.315"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0605978F"
                                    },
                                    "Title": {
                                        "val": "Facility Sustainment - T&E Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.720"
                                        },
                                        "CurrentYear": {
                                            "val": "28.888"
                                        },
                                        "BudgetYearOne": {
                                            "val": "29.424"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.424"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.935"
                                        },
                                        "BudgetYearThree": {
                                            "val": "30.555"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.112"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.673"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}