{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-32",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602785A"
        },
        "ProgramElementTitle": {
            "val": "Manpower\/Personnel\/Training Technology"
        },
        "R1LineNumber": {
            "val": "38"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.791"
            },
            "CurrentYear": {
                "val": "21.847"
            },
            "BudgetYearOne": {
                "val": "20.873"
            },
            "BudgetYearOneBase": {
                "val": "20.873"
            },
            "BudgetYearTwo": {
                "val": "21.268"
            },
            "BudgetYearThree": {
                "val": "19.232"
            },
            "BudgetYearFour": {
                "val": "19.159"
            },
            "BudgetYearFive": {
                "val": "19.382"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "141.552"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) designs and validates applied behavioral and social science research to enhance the Soldier Lifecycle (e.g., selection, assignment, training, and leader development) and human relations (e.g., unit cohesion). This PE develops new personnel measures and methods that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This PE develops new performance measures and metrics for individuals and units, designs innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs.  Research in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints. \n\nWork in this PE complements PE 0603007A (Manpower, Personnel and Training Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Vision, the Army's Talent Management Strategy, and the Army Modernization Strategy.  \n\nWork is performed by the Army Research Institute (ARI) for the Behavioral and Social Sciences at Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.216"
                },
                "CurrentYear": {
                    "val": "21.862"
                },
                "BudgetYearOne": {
                    "val": "23.651"
                },
                "BudgetYearOneBase": {
                    "val": "23.651"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.791"
                },
                "CurrentYear": {
                    "val": "21.847"
                },
                "BudgetYearOne": {
                    "val": "20.873"
                },
                "BudgetYearOneBase": {
                    "val": "20.873"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.425"
                },
                "CurrentYear": {
                    "val": "-0.015"
                },
                "BudgetYearOne": {
                    "val": "-2.778"
                },
                "BudgetYearOneBase": {
                    "val": "-2.778"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.009"
                    },
                    "CurrentYear": {
                        "val": "-0.015"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.416"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.778"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.778"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "790"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.791"
                        },
                        "CurrentYear": {
                            "val": "21.847"
                        },
                        "BudgetYearOne": {
                            "val": "20.873"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.873"
                        },
                        "BudgetYearTwo": {
                            "val": "21.268"
                        },
                        "BudgetYearThree": {
                            "val": "19.232"
                        },
                        "BudgetYearFour": {
                            "val": "19.159"
                        },
                        "BudgetYearFive": {
                            "val": "19.382"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "141.552"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied behavioral and social science research to enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., unit cohesion). This Project develops new personnel measures and methods that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This Project develops new performance measures and metrics for individuals and units, designs innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Research in this Project will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.   \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas, the Army Vision, the Army's Talent Management Strategy, Army Human Capital Strategy, and the Army Modernization Strategy.\n\nThis Project is renamed from Personnel Performance and Training Technology to reflect the change in work that supports Army priorities.\n\nWork is performed by the U.S. Army Research Institute (ARI) for the Behavioral and Social Sciences in Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Talent Assessment and Development"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research that provides the Army with improved prediction and modeling of potential performance, behaviors, attitudes, and resilience of Soldiers, as well as an improved ability to recruit and sustain an effective career force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.75"
                                            },
                                            "Text": {
                                                "val": "Conducted research on developing integrated assessments (i.e., comprehensive (vs. single) personnel assessments) for predicting high-potential Soldiers and high-risk behavior (i.e., integrated measures collected across the Soldier Lifecycle that feeds holistic assessments and predictive models of behaviors, performance, and outcomes)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.5"
                                            },
                                            "Text": {
                                                "val": "Conduct research to develop a vocational interest inventory for increased prediction and selection of individual assignments and performance within select critical Military Occupational Specialties (e.g. cyberwarfare); conduct research for the application of non-cognitive measures to inform branching choices for cadets to support sustainment of professional military careers and reduce Soldier attrition costs; conduct research in big data applications to develop automatically generated test items for personnel assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.873"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.873"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to develop non-cognitive assessments for in-service assignments and initial job-choice for enlisted and officer candidates (e.g., cyber occupations) and other military occupational specialties (MOS) & Branches; will conduct research to develop outcome measures for more comprehensive assessment of the effectiveness of personnel and training programs\/policy; will conduct research to develop methods for assessing and developing complex leader competencies to perform effectively in multi-domain operations (e.g., systems and strategic thinking)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, funding in 0602785A\/ Project 790 is consolidated into this effort and accelerated in support of Army Modernization efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Team-Based Personnel Assignment"
                                    },
                                    "Description": {
                                        "val": "This effort combines and refocuses previous efforts titled ?Personnel Performance and Readiness? and ?Unit Performance and Cohesion.? This effort conducts research to create scientifically valid models, tools and techniques to assign individuals to teams to optimize team effectiveness in-garrison and in future operational environments.  Conduct research to create science-based methods to rapidly build team cohesion and collective performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.4"
                                            },
                                            "Text": {
                                                "val": "Initiated research to develop holistic training methods to help officers and NCOs enhance and sustain unit performance and resilience; initiated research to create integrated assessments of individual Soldier and unit readiness. (Holistic training methods: combining traditional lecture-based training with integrative learning methods that allow for connections among concepts\/experiences so that skills can be applied to novel and complex issues or challenges)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.757"
                                            },
                                            "Text": {
                                                "val": "Conduct research to develop methods for assessing and developing complex leader competencies to perform effectively in multi-domain operations (e.g., systems and strategic thinking)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, funding from this effort is realigned into \"Talent Assessment and Development\" research effort within Project 790 in support of Army Modernization efforts. ."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unit Performance and Cohesion"
                                    },
                                    "Description": {
                                        "val": "This effort was combined in Team-Based Personnel Assignment effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.641"
                                            },
                                            "Text": {
                                                "val": "This effort was combined in Team-Based Personnel Assignment effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.1"
                                            },
                                            "Text": {
                                                "val": "Conduct research to develop empirically-validated climate assessments based on objective behaviors (e.g., behavior checklists, unobtrusive measures) that efficiently and accurately assess key aspects of command climate; conduct research to develop methods to assess cohesion in non-traditional teams (e.g., dispersed, diverse, new tasks\/missions)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort ends in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.49"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}