{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-16",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603313A"
        },
        "ProgramElementTitle": {
            "val": "Missile and Rocket Advanced Technology"
        },
        "R1LineNumber": {
            "val": "57"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "133.433"
            },
            "CurrentYear": {
                "val": "94.561"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "227.994"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being eliminated, with continuity of effort realigned to the following PEs:\n?\t0603462A Next Generation Combat Vehicle Advanced Technology\n?\t0603464A Long Range Precision Fires Advanced Technology\n?\t0603465A Future Vertical Lift Advanced Technology\n?\t0603466A Air and Missile Defense Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures, fabricates, and demonstrates advanced rocket, missile, interceptor, and guided munition technologies to enhance weapon system lethality, survivability, agility, deployability, and affordability. Project 206 develops high fidelity simulations for advanced tactical missiles and interceptors. Project 263 demonstrates missile and interceptor systems with capabilities to provide protection against rockets, artillery, and mortars; provide precision weapons for small units in close combat; provide precision long-range fires; and provide minimum smoke propulsion for aviation missiles. Project 704 demonstrates the capability to detect and track rocket, artillery, mortar, and unmanned air vehicles threats. Project NA6 is a congressional increase Project.\n \nIn FY 2018\/FY 2019, work in this PE is complimentary to PE 0602303A (Missile Technology) and is fully coordinated with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603003A (Aviation Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), PE 0603270A (Electronic Warfare Technology), PE 0603734A (Combat Engineering Systems), and PE 0708045A (Manufacturing Technology).\n\nIn FY 2020 this PE is being eliminated, with continuity of effort realigned to other PEs as part of a strategic financial restructuring of the Science and Technology (S&T) portfolio. All FY 2020 adjustments align program requirements with Army Modernization priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nThe work in this PE is performed by the  U.S. Army Futures Command."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "62.85"
                },
                "CurrentYear": {
                    "val": "61.132"
                },
                "BudgetYearOne": {
                    "val": "56.578"
                },
                "BudgetYearOneBase": {
                    "val": "56.578"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "133.433"
                },
                "CurrentYear": {
                    "val": "94.561"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "70.583"
                },
                "CurrentYear": {
                    "val": "33.429"
                },
                "BudgetYearOne": {
                    "val": "-56.578"
                },
                "BudgetYearOneBase": {
                    "val": "-56.578"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.049"
                    },
                    "CurrentYear": {
                        "val": "-0.071"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-1.5"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "73"
                    },
                    "CurrentYear": {
                        "val": "35"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.368"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-56.578"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-56.578"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 congressional adds for Cybersecurity and supply chain risk management research ($10.000 million), Program increase ($53.000 million), and Land-based anti-ship missile development & integration ($10.000 million).\nFY19 congressional adds\/rescission for: Multi-domain demonstration unjustified request (decrease of $1.500 million); cybersecurity and supply chain risk management (increase $10.000 million); cyber security (increase $15.000 million); tactically mobile, shoot-on-the-move SHORAD demonstration (increase $10.000 million).\nFY20 decrease - PE eliminated due to S&T Financial Restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "206"
                    },
                    "ProjectTitle": {
                        "val": "Missile Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.384"
                        },
                        "CurrentYear": {
                            "val": "2.487"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.871"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603464A Long Range Precision Fires Advanced Technology, Projects:\n*\tAF4 Missile Simulation Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced modeling and simulation technologies for missile design and analysis. Evaluation of missile technology by means of modeling and simulation provides a cost-effective method that supports missile maturation throughout the weapon system life cycle. This effort permits a reduction in the number of flight tests required for programs of record as well as improves the confidence of flight test readiness and probability of flight test success.  \n\nThis Project support efforts in the Army Science and Technology Lethality portfolio.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Simulation"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced analysis and high fidelity modeling and simulation technologies for advanced missiles and interceptor design and analysis. Evaluation of missile technology through modeling and simulation provides a cost-effective method to support missile maturation throughout the weapon system life cycle. This effort shortens component design timelines, reduces integration activities, enables a reduction of flight tests required for programs of record and improves the confidence of flight test readiness and the probability of flight test success."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.384"
                                            },
                                            "Text": {
                                                "val": "Matured the distributed architecture test bed for air defense weapon behavior exploration; provided a fast running model for use in fragmentation warhead design, insensitive munitions design, and lethality analysis; matured novel methods to address deficiencies in electro-optical (EO)\/infrared (IR) real-time high-bandwidth sensor stimulation for Hardware in the loop; improved modeling and simulation capability to give more accurate lethality credit from blast effects and lower the cost of smaller missile systems; improved algorithms for forecasting air and missile tactical threat maneuvers, improve the missile threat maneuver forecaster, and mature algorithms for engagement tailoring and predicted intercept point (pip) management; mature cost-estimating tools for propulsion systems, software, modular systems, and for converting commercial off-the-shelf cost to military off-the-shelf cost ."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.412"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate algorithms for forecasting air and missile tactical threat maneuvers, improve the missile threat maneuver forecaster, and will mature algorithms for engagement tailoring and predicted intercept point (pip) management and demonstrate capabilities in experiments to quantify engagement performance; will validate a System-of-Systems simulation which provides a virtual context for research, development, and evaluation of advanced fire control and missile guidance algorithms; will mature and demonstrate cross cutting technologies that enable rapid and cost effective integration of new weapon and sensor technologies into complex system architectures; will expedite the engineering of complex software intensive systems by transforming models of interactive algorithmic behaviors into prototype software; will further mature cost-estimating tools for propulsion systems, software, modular systems, and for converting commercial off-the-shelf cost to military off-the-shelf cost; will establish behind armor debris prediction capabilities for multiple shaped charge materials and designs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 this Project has been realigned to PE 0603464\/AF4 (Long Range Precision Fires Advanced Technology\/Missile Simulation Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "263"
                    },
                    "ProjectTitle": {
                        "val": "Future Msl Tech Integr(FMTI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.387"
                        },
                        "CurrentYear": {
                            "val": "37.665"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "71.052"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603464A Long Range Precision Fires Advanced Technology, Projects:\n*\tAE8 Land-Based Anti-Ship Missile Advanced Technology\n*\tAE9 Low-Cots Tactical Extended Range Missile Advanced Technology\n*\tAH1 Multiple Simultaneous Engagement Technologies Advanced Technology\n*\tAH3 Single Multi-Mission Attack Missile Advanced Technology\nPE 0603462A Next Generation Combat Vehicle Advanced Technology, Projects:\n*\tBG7 Ground System Active Defense Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, fabricates, and demonstrates advanced missile and interceptor technologies, such as seekers, guidance and controls, propulsion, and airframes. The project goal is to reduce the life-cycle costs and cost per kill of precision guided missiles and interceptors. \n\nThis Project support efforts in the Army Science and Technology Lethality and Ground Maneuver portfolios.\n\nIn FY18\/FY19, this Project matures technologies from Program Element (PE) 0602303A and directly supports systems managed by the Program Executive Officer for Missiles and Space. Work in this Project is in collaboration with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technologies), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology) and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Tactical Extended Range Missile"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturation, fabrication, and demonstration of technologies for low-cost precision fires missile capable of deep strike engagements. The aim is to provide extended range and expanded target set capability through advanced propulsion, new payload technology, and maintain effectiveness in Global Positioning System (GPS) challenged environments through new and novel navigation technologies. This effort supports the Army need for developing capability enablers in the area of Extended Range Precision Fires."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.038"
                                            },
                                            "Text": {
                                                "val": "Continued to mature and validate the long range fires missile systems simulation to reflect the emerging navigation, propulsion, and payload technologies. This system simulation was used to assess improved missile performance provided by these technologies and guide their continued development; continued to mature navigation system concept designs that provide alternate precision navigation solutions to GPS that leverage emerging navigation technologies; conducted preliminary design review of candidate technologies; performed lab and bench evaluations; assessed system integration and performance evaluations through advanced simulation; continued to develop technologies to increase range to include motor technologies for long range precision fires and light-weight, thermally-protected airframe structures; conducted static motor testing to assess extended range performance; and performed modeling and simulation analysis of advanced materials for thermal management techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.47"
                                            },
                                            "Text": {
                                                "val": "Mature and evaluate the long range fires missile components in the areas of navigation, propulsion, and payload technologies; will conduct system simulation to assess improved missile performance provided by these technologies and guide their continued development; will continue to develop and test navigation integration architectures and algorithms and refine navigations system design concepts based on updated program requirements and technology developments and begin testing of enhanced navigation system designs at the sub-system level; will conduct fabrication and testing of high strength fiber and high temperature matrix materials for the solid rocket motorcase and missile airframe to meet objective requirements.  Will conduct analysis of results from Single Warhead for Area and Point Targets (SWAP) warhead testing to facilitate technology transition for multi-effects lethality for Fire Support applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 this effort has been realigned to PE 0603464A\/AE9 (Long Range Precision Fires Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection System Interceptor Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates modular hard-kill Active Protection System (APS) technologies with the Hit Avoidance Architecture and APS Common Controller and matures modeling and simulation for system integration and demonstration. Specifically the hard-kill APS portion and modeling and simulation efforts will be addressed by the United States (U.S.) Army Aviation and Missile Research, Development and Engineering Center (AMRDEC). This effort supports the Army's APS program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. This effort supports the development of an APS Common Architecture enabling adaptable APS solutions that can be integrated across Army vehicle platforms as required. This effort compliments work being accomplished under PE 0602601A\/Project C05, PE 0602618A\/Project H80, PE 0603004A\/Project 232, PE 0603005A\/Project 221, and PE 0603270A\/Project K16."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.25"
                                            },
                                            "Text": {
                                                "val": "Improved modeling and simulation of APS countermeasure and fire control sensor alternatives; continued maturation and adaptation of a hard-kill countermeasure and fire control sensor to improve performance of survivability equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.516"
                                            },
                                            "Text": {
                                                "val": "Continue maturation and adaptation of a hard-kill countermeasure and fire control sensor to improve performance of survivability equipment; will improve modeling and simulation of APS countermeasure and fire control sensor alternatives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 this effort has been realigned to PE 063462A\/ Project BG7 (Next Generation Combat Vehicle Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Extended Range Precision Missile Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, fabrication, integration, hardware-in-the-loop (HWIL) test, and flight demonstration of technology for an affordable discriminate extended range precision missile to include critical component technologies such as advanced propulsion, seekers, fire control, datalink, guidance and controls, and maneuverable airframes. Critical subsystem technology development transitions to 0603313A\/263 Low Cost Extended Range Missile and 0603313A\/704 Low Cost Extended Range Air Defense and to future fire support efforts for further maturation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.549"
                                            },
                                            "Text": {
                                                "val": "Provided high fidelity simulations to improve lethal effects for maritime targets, seeker technology for terminal homing, a datalink for in-flight target updates using system-level trade studies; performed system level integration activities as the subcomponent technologies mature, and began integration of an Anti-Radiation Homing (ARH) capability into Guided Multiple Launch Rocket System (GMLRS) airframe. Critical system level attributes included: target detection, target acquisition, target classification, target tracking, target aim point selection, trajectory management, thermal characterization and lethality assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.7"
                                            },
                                            "Text": {
                                                "val": "Develop radio frequency (RF) sensor technology, perform integration and will demonstration for multiple platforms to improve performance of missiles in an Anti-Access\/Anti-Denial environment; critical attributes will include target detection, target acquisition, target classification, target tracking and target aim point selection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 this effort has been realigned to PE 0603464A\/Project AE8  (Long Range Precision Fires Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Close Combat Weapons Technology"
                                    },
                                    "Description": {
                                        "val": "This effort addresses close combat weapon systems trade studies, and technology maturation and demonstration for a next generation close combat precision missile system for dismounted and mounted maneuver."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.55"
                                            },
                                            "Text": {
                                                "val": "Matured detailed system designs of critical propulsion and warhead components within severe constraints of size, weight, and power, and improve modeling and simulation of man-portable squad\/vehicle crew weapons with fire from enclosure capability, overwhelming precision, and firefight-ending lethality; improved components and flight demonstrate a precision maneuverable missile in a relevant environment; provided an application-based fire control unit for reduced operator load; provided an affordable advanced imaging sensor and advanced autotracker features for increased precision; and provided a datalink for increase range and security, and a power system that increases endurance and decreases maintenance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.572"
                                            },
                                            "Text": {
                                                "val": "Optimize missile design with multi-effects lethal mechanism and integrate with expeditionary launcher for short to medium range precision strike with man-in-the-loop and loitering capability with lethal effects against hard and soft targets; will begin validation of the optimized design through lab and field demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 this effort has been realigned to PE 0603464A\/AH3 (Long Range Precision Fires Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Domain Lethality Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, fabrication, integration, Hardware-in-the-Loop (HWIL) development and test, and flight demonstration of critical missile technology that supports Multi-Domain Battle Concept\/Cross-Domain Fires and Manned-Unmanned Teaming (MUM-T) System of Systems.  The objective is to develop capability for missile systems to destroy enemy air defenses in the land and the maritime domains.  This effort will develop and demonstrate appropriate sensor and payload component technologies for engaging and destroying maritime- and land-based air defense systems; integrate these component technologies into prototype missile hardware; and demonstrate hardware in a relevant flight environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.011"
                                            },
                                            "Text": {
                                                "val": "Will mature component development of 1) multi-mode seeker (anti-radiation homing and imaging infrared) for target classification\/discrimination and aim-point selection on critical target features and 2) warhead and fuze that maximizes lethal effects against multi-domain target sets; will conduct critical design review of component technologies; will perform test and evaluation of key enabling component technologies; will refine concepts for system integration; will mature modeling and simulation HWIL capabilities for testing and validation of integrated components."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 this effort has been realigned to PE 0603464\/AE8 (Long Range Precision Fires Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.396"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "704"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Missile Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.662"
                        },
                        "CurrentYear": {
                            "val": "19.409"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "44.071"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603466A Air and Missile Defense Advanced Technology, Projects:\n*\tAC8 Low Cost Extended Range Air Defense Advanced Technology\n*\tAD4 Maneuver Air Defense Advanced Technology\nPE 0603465A Future Vertical Lift Advanced Technology, Projects:\n*\tAK5 Multi-Role Small Guided Missile Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures advanced missile system concepts and related hardware to enhance weapon system lethality, survivability, agility, versatility, deployability, and affordability for defense against future air and ground, armored and non-armored threats.    \n \nThis Project support efforts in the Army Science and Technology Lethality portfolio.\n\nWork in this Project is in collaboration with PE 0602624A (Weapons and Munitions Technologies).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Counter Rockets, Artillery, Mortars (RAM), Unmanned Aerial Systems (UAS), and Cruise Missile Tracking and Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates system technology to provide 360 degree, near hemispherical coverage for tracking and intercept of UAS and\/or Cruise Missile threats. This effort matures fire control methodology for engagement of threat UAS and\/or Cruise Missile to generate firing solutions and determine interceptors available for an air defense mission. These efforts will be evaluated through Hardware-in-the-Loop (HWIL) experiments and multiple interceptor flights.  Effort will also mature tactical launcher configurations and designs for alternative mission profiles.  The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.197"
                                            },
                                            "Text": {
                                                "val": "Provided a surrogate demonstration launcher with integrated digital data link and inertial and network alignment technology and ground station components, and demonstrated its missile launch functionality through flight testing in a relevant environment; improved the integration of multi-mission radar input and detected data into a common tactical air picture and focused energy weapon cueing and fire control."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.273"
                                            },
                                            "Text": {
                                                "val": "mature and integrate digital data link ground station, inertial network alignment technology, and ground station components with a surrogate demonstration launcher for demonstration; will mature fire control methodology and software for air defense engagement planning and flight test demonstration planning.  Will exploit data gathered from multi-mission radar and other sensors in order to mature algorithm to autonomously detect, track, identify, rank and defeat counter-Unmanned Aerial System threat."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 PE 0603313A\/704 has been realigned to PE 0603466A\/AC8."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-cost Extended Range Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort matures key technologies of a lower-cost interceptor system with a low- to medium-altitude, medium- to long-range capability. This effort will enable lower cost interceptor integration into a net-enabled Air and Missile Defense Task Force for the protection of high value assets. Technologies will address the defeat of air defense threats such as Unmanned Aerial System (UAS) and Cruise Missile threats with secondary capabilities against Large Caliber Rockets (LCR), Short Range Ballistic Missiles (SRBM), and Tactical Air-to-Surface Missiles (TASMS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.582"
                                            },
                                            "Text": {
                                                "val": "Matured the low-cost air defense interceptor system with integrated solid rocket motor, digital data link, mission computer, power system, and flight termination system and demonstrate in ballistic flight testing; provided system analysis via hardware-in-the-loop (HWIL) flight simulation of the digital data link, mission computer, power system, navigation system, and control actuation system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.991"
                                            },
                                            "Text": {
                                                "val": "Integrate the guidance electronics unit (GEU) and control system into HWIL for demonstration of the entire guidance, navigation, and control system.  Will begin HWIL flight simulation, demonstrating GEU and control system performance with a false target generator and flight motion simulator using an emulated target with the correct radar signature and kinematics, and the emulated body motion and loading of simulated flight environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 PE 0603313A\/704 has been realigned to PE 0603466A\/AC8."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seeker and Guidance Technology for Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, integration, and fabrication of seeker and guidance technologies supporting air defense missile systems. Technologies addressed enable the defeat of multiple air defense threats such as Rockets, Artillery, and Mortars, Unmanned Aerial System (UAS), and Cruise Missile threats with secondary capabilities against Large Caliber Rockets (LCR), Short Range Ballistic Missiles (SRBM), and Tactical Air-to-Surface Missiles (TASMS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.88"
                                            },
                                            "Text": {
                                                "val": "Demonstrated active radio frequency (RF) seeker in hardware-in-the-loop flight simulation with guidance electronics unit (GEU) and in field testing in a relevant environment; continued maturation of guidance algorithms for accurate mid-course and terminal homing guidance at extended ranges; provided flight control scripts for testing the speed, accuracy, and stability of the flight control system for use in future flight testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.537"
                                            },
                                            "Text": {
                                                "val": "Continue maturation of the active RF seeker in the HWIL simulation facility; will refine seeker calibration, optimizing acquisition and track algorithms, optimizing seeker control algorithms, and debugging software; will continue maturation of guidance algorithms in hardware-in-the-loop (HWIL) for accurate mid-course and terminal homing guidance at extended ranges; will provide flight control scripts for testing the speed, accuracy, and stability of the flight control system for use in future flight testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 PE 0603313A\/704 has been realigned to PE 0603466A\/AC8."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Role Missile Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, fabrication, integration, hardware-in-the-loop (HWIL) development and test, and flight demonstration of critical technology that supports an open systems architecture to enable modular designs of guided and unguided missiles for smaller and lighter missile options with multi-role engagement capabilities reducing the life cycle cost for missiles. Critical component technologies include advanced propulsion, payload (lethal and non-lethal), seekers, fire control, datalink, guidance and controls, and maneuverable airframes.  This effort matures and demonstrates technology from PE 0602303A, Multi-Role Missile Technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.003"
                                            },
                                            "Text": {
                                                "val": "Demonstrated in a ground-launched flight test the guidance and control performance of the guided forward firing configuration and continue maturation of the component technology of the drop\/glide configuration from PE 602303A (Multi-Role Missile Technology) which included seeker, payload, guidance electronics unit, control actuation subsystem, propulsion subsystem, and subsystem interface bus."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.922"
                                            },
                                            "Text": {
                                                "val": "Continue demonstration in a ground-launched flight test the guidance and control performance of the guided forward firing configuration and will continue maturation of the component technology of the drop\/glide configuration from PE 602303A (Multi-Role Missile Technology) which includes seeker, payload, guidance electronics unit, control actuation subsystem, propulsion subsystem, and subsystem interface bus; will perform laboratory testing and simulation evaluations; will integrate modular missile technology subsystems; and will perform air dropped, unguided\/ballistic flight tests to verify mechanical and electrical integrity of the drop\/glide variant."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020 PE 0603313A\/704 has been realigned to PE 0603465A\/AK5."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.686"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NA6"
                    },
                    "ProjectTitle": {
                        "val": "Missile and Rocket Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "73"
                        },
                        "CurrentYear": {
                            "val": "35"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "108.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Missile and Rocket advanced technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Cybersecurity & Supply Chain Risk Management Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Cybersecurity & Supply Chain Risk Management Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase - House"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "Program Increase - House"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase - Senate"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "45"
                                        },
                                        "Text": {
                                            "val": "Program Increase - Senate"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase - Conference"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6"
                                        },
                                        "Text": {
                                            "val": "Program Increase - Conference"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Land-based Anti-Ship Missile Development & Integration"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Land-based Anti-Ship Missile Development & Integration"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - cybersecurity and supply chain risk management"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Program increase - cybersecurity and supply chain risk management"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - cyber security"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "Program increase - cyber security"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - tactically mobile, shoot-on-the-move SHORAD demonstration"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Program increase - tactically mobile, shoot-on-the-move SHORAD demonstration"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}