{
    "id": "2020-AirForce-PB-3600-MJBOOK-0-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-11",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602602F"
        },
        "ProgramElementTitle": {
            "val": "Conventional Munitions"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "99.543"
            },
            "CurrentYear": {
                "val": "112.841"
            },
            "BudgetYearOne": {
                "val": "142.772"
            },
            "BudgetYearOneBase": {
                "val": "142.772"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "150.085"
            },
            "BudgetYearThree": {
                "val": "165.801"
            },
            "BudgetYearFour": {
                "val": "144.606"
            },
            "BudgetYearFive": {
                "val": "147.611"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program investigates, develops, and establishes the technical feasibility and military utility of guidance and ordnance technologies for conventional air-launched munitions.  The effort supports core technical competencies of fuze technology; energetic materials; damage mechanisms; munitions aerodynamics, guidance, navigation, and control; terminal seeker sciences; and munition systems effects.  Technologies to be developed include blast, fragmentation, penetrating and low-collateral damage war-heads, hard-target fuzing, precise terminal guidance, and high-performance and insensitive explosives.  \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of such program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "112.195"
                },
                "CurrentYear": {
                    "val": "112.841"
                },
                "BudgetYearOne": {
                    "val": "129.393"
                },
                "BudgetYearOneBase": {
                    "val": "129.393"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "99.543"
                },
                "CurrentYear": {
                    "val": "112.841"
                },
                "BudgetYearOne": {
                    "val": "142.772"
                },
                "BudgetYearOneBase": {
                    "val": "142.772"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-12.652"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.379"
                },
                "BudgetYearOneBase": {
                    "val": "13.379"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-5.800"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.889"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.963"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "13.379"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.379"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2018 in Other Adjustments is due to realignment of funds to PE 0602212F to support Research and Development Projects, 10 U.S.C. Section 2358.\n\nDecrease in FY 2018 due to $5.800 million reprogramming action of funds to PE 0603601F, Conventional Weapons Technology, for hypersonic weapon technology.\n\nIncrease in FY 2020 due to civilian pay re-pricing adjustment and realignment and consolidation of Air Force Applied Research Science and Technology funding for Future Air Force Capabilities Applied Research efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622068"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Guidance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "47.273"
                        },
                        "CurrentYear": {
                            "val": "57.513"
                        },
                        "BudgetYearOne": {
                            "val": "80.641"
                        },
                        "BudgetYearOneBase": {
                            "val": "80.641"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "83.562"
                        },
                        "BudgetYearThree": {
                            "val": "90.307"
                        },
                        "BudgetYearFour": {
                            "val": "69.979"
                        },
                        "BudgetYearFive": {
                            "val": "71.433"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, develops, and evaluates conventional munitions guidance technologies to establish technical feasibility and military utility of innovative munition seekers, weapon aerodynamics, navigation and control, and guidance subsystem integration\/simulation.  Project payoffs include adverse-weather, Global Positioning System (GPS)-degraded and Global Positioning System-denied, networked, and autonomous precision munition guidance capability; increased number of kills per sortie; increased aerospace vehicle survivability; improved weapon reliability and affordability; and improved weapon survivability and effectiveness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Seeker Technologies"
                                    },
                                    "Description": {
                                        "val": "Develops seeker technologies for air-delivered munitions to provide high-confidence target discrimination and classification, precise target location, and robust terminal tracking."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.485"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.643"
                                            },
                                            "Text": {
                                                "val": "Continue to emphasize technology development of multi-function sensors, rapid data compression for targeting, bio-inspired information processing and data fusion, and low-power computation.  Continue to develop technologies that simplify, increase flexibility, and reduce the cost of advanced seeker concepts.  Continue to develop algorithmic and mathematical approaches to integrate weapons into the kill chain and enable distributive, flexible seeker imaging targeting with or without an operator in the loop.  Continue development and testing of innovative air-to-air engagements for fifth generation and beyond.  Continue to explore incorporation of open architecture principles to reduce cost and enable technology refresh within seeker subsystems.  Continue to develop distributed, low-cost seeker technology hardware.  Continue to explore specific techniques for seeker cost reduction with performance improvement; novel technical approaches such as sparse sensing and compressive sensing will be investigated.  Continue to conduct research on integrated processing techniques to enable networked systems.  Continue development and early testing of small, air-to-air, self-defense munitions seeker technology including initial captive flight testing and hardware in the loop testing.  Continue to develop open seeker architecture software in the loop integration laboratory.  Initiate the investigation of the technical challenges of cooperative radio frequency functions including coherent on transmit and coherent on receive operation.  Initiate software development kit for Open Seeker Architecture to enable rapid technology insertion into software-defined, multi-function seekers.  Initiate the development of  tools for evaluation of deep-learning networks to evaluate feasibility for weapon seekers.  Initiate exploration of Open Architecture systems' cyber vulnerabilities and formulate software resilient techniques.  Initiate data collection experiments to support cooperative radio frequency systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.416"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.416"
                                            },
                                            "Text": {
                                                "val": "Continue to emphasize technology development of multi-function sensors, rapid data compression for targeting, bio-inspired information processing and data fusion, and low-power computation.  Continue to develop technologies that simplify, increase flexibility and reduce the cost of advanced seeker concepts to include biologically inspired low-cost concepts.  Continue to develop algorithmic and mathematical approaches to integrate weapons into the kill chain to enable distributive, flexible seeker imaging targeting with or without an operator in-the-loop.  Continue development and testing of innovative air-to-air engagements for fifth generation and beyond with emphasis on radome materials that improve optical performance, as well as provide increased protection from operational environments including directed energy and rain.  Continue to explore incorporation of open architecture principles to reduce cost and enable technology refresh within seeker subsystems.  Continue to explore specific techniques for seeker cost reduction with performance improvement; novel technical approaches such as sparse and compressive sensing will be investigated.  Continue to conduct research on integrated processing techniques to enable networked systems to include early collaborative global positioning system denied navigation and miniature self-defense seeker design.  Continue to develop open seeker architecture software in-the-loop integration laboratory.  Continue to investigate the technical challenges of cooperative radio frequency functions including coherent on-transmit\/on-receive operation.  Continue to refine the software development kit for Open Seeker Architecture to enable rapid technology insertion into software-defined, multi-function seekers.  Continue to refine and further development of tools for evaluation of deep-learning networks to evaluate feasibility for weapon seekers.  Continue analysis of Open Seeker Architecture cyber vulnerabilities and formulate software resilient techniques.  Continue data collection experiments to support cooperative radio frequency systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $2.773 million. Funding increased due to development of additional modeling tools, enhanced seeker design fidelity, and expansion of cyber vulnerability analysis."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerodynamics, Navigation, and Control Technologies"
                                    },
                                    "Description": {
                                        "val": "Develops weapon aerodynamic control, navigation, and networking technologies for air-delivered munitions to provide precise, agile flight, networked effects, and immunity to countermeasures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.162"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.544"
                                            },
                                            "Text": {
                                                "val": "Continue the maturation of linked aero-structural-thermal computational tools to predict flight performance of hypersonic weapons and tools to develop prototype concepts for program office prototype demonstrations.  Continue to refine and demonstrate via captive and surrogate flight test, a precision navigation method that does not rely on GPS and includes an M-Code compliant anti-jam GPS chip set.  Continue development of weapon platform interfaces to include concepts for double increased weapons load-out.  Continue the integration of algorithms to support distributed, multi-strategy weapon concept-of-operations to defeat enemy defenses to include data link information to bound drift of a swarm of weapons.  Continue ground testing of advanced guidance laws and actuators to enable innovative air-to-air engagements and hyper-agility including hit-to-kill.  Continue conducting experiments demonstrating precision navigation using celestial aiding for long-range flights at high and low altitudes.  Continue small, air-to-air, self-defense munitions research efforts.  Initiate cooperative\/collaborative small cruise missile swarm flight demonstration to locate and overwhelm targets.  Initiate planning for flight test of a multi-vehicle mapping without Global Positioning System and saturation approach of the entrance of a hardened deeply buried facility or tunnel target.  Initiate and conduct ground tests of rocket motor component technologies to evaluate their ability to increase weapon range and reduce size\/weight.  Initiate the development of defensive cyber algorithms for autopilot and navigation functions, including swarm.  Initiate execution of Joint Capability Technology Demonstration program with system program office and Combatant Command user for Global Position System-denied navigation suite for cruise missiles.  Initiate efforts to identify cyber vulnerabilities in software define radios used on weapons by testing meshing radios.  Initiate munition cyber-hardening demonstration coordinated with Cyber Command and extend to an integrated systems test environment.  Initiate intramural Air Force study of high fidelity models for store separation from aircraft using advanced dispense technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.367"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.367"
                                            },
                                            "Text": {
                                                "val": "Complete and transitioned the hypersonic flight performance aero-structural-thermal computational tools and prototype concept development tools to the program office.  Complete the integration of algorithms to support distributed, multi-strategy weapon concept-of-operations to defeat enemy defenses.  Continue execution of Position, Navigation and Timing acceleration research to integrate emitter geo-location and Electronic Intelligence into M-Code compliant anti-jam Global Position System chip set.  Continue development of weapon platform interfaces to include concepts for double increased weapons load-out.  Continue ground testing of advanced guidance laws and actuators to enable innovative air-to-air engagements and hyper-agility including hit-to-kill.  Continue experiments demonstrating precision navigation using celestial aiding for long-range flights at high and low altitudes.  Continue small, air-to-air, self-defense munitions research efforts.  Continue cooperative\/collaborative small cruise missile swarm flight demonstration to locate and overwhelm targets.  Continue flight test of a multi-vehicle mapping (without Global Positioning System) and saturation approach of the entrance of a hardened-deeply-buried facility or tunnel target.  Continue ground tests of rocket motor component technologies to evaluate their ability to increase weapon range and reduce size\/weight.  Continue development of defensive cyber algorithms for autopilot and navigation functions, including swarm.  Continue execution of Joint Capability Technology Demonstration program with system program office and Combatant Command user for Global Position System-denied navigation suite for cruise missiles.  Continue efforts to identify cyber vulnerabilities in software define radios used on weapons by testing meshing radios.  Continue munition cyber-hardening demonstration coordinated with Cyber Command and extend to an integrated systems test environment.  Continue intramural Air Force study of high fidelity models for store separation from aircraft using advanced dispense technologies.  Initiate trade study of low-cost navigation grade Inertial Measurement Units, build weapon Size-Weight-And-Power celestial aiding sensor for upcoming high-altitude hypersonic test, use tactical software defined radio to flight test network aiding using meshing waveform.  Initiate scaled flight demonstrations of advanced guidance laws for self-defense and multi-shot air-to-air missiles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.823 million.  Justification for this increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guidance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develops guidance subsystem integration and evaluation technologies to provide open and closed-loop ground testing, flight test risk reduction, and digital simulation of novel concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.626"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.326"
                                            },
                                            "Text": {
                                                "val": "Continue to support flight demonstrations of critical behaviors for distributed collaborative and cooperative swarm strategies and other advanced guidance capabilities by improving constructive and virtual analysis tools for design, development, and analysis of advanced weapon concepts in representative environments.  Continue to perform constructive and virtual analysis on numerous weapon concepts providing design, performance, and trade space analysis to the program offices.  Continue to develop improved simulation technologies that evaluate innovative air-to-air engagements to include guidance evaluation.  Continue to develop a real-time radar\/millimeter wave signature generation capability for testing algorithms in real-time software and hardware-in-the-loop environments.  Continue to develop simulation technologies that evaluate cooperative, flexible munition target engagements.  Continue to transition refined engineering models to Air Force mission level simulation for analysis.  Continue to develop a modular radio-frequency hardware-in-the-loop capability to support munitions concepts with high speed target engagement.  Continue to improve capabilities of our reconfigurable radio-frequency hardware-in-the-loop chamber to handle faster and more complex scenes.  Continue to develop new infrared projection capabilities to evaluate a new class of multi-aperture sensor systems.  Initiate and complete the startup of a Modeling and Simulation activity enabling cross-domain, distributed, multi-level security Modeling and Simulation.  Initiate a help desk and configuration control of higher fidelity simulation codes for mission level analysis.  Initiate constructive and virtual analysis on numerous weapon concepts to provide design, performance, and trade space analysis to the program offices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.192"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.192"
                                            },
                                            "Text": {
                                                "val": "Complete transition of reconfigurable Radio Frequency Target Simulator to prime contractors to support hypersonic weapon development.  Complete and refine the Modeling and Simulation capability with multi-level security enabling cross-domain, distributed Modeling and Simulation activities.  Continue flight demonstration of critical behaviors for Distributed, Cooperative, Collaborative strategies and other advanced guidance capabilities.   Continue to improve constructive and virtual analysis tools for design, development, and analysis of advanced cruise missile concepts in representative environments and provide design, performance, and trade space analysis for hypersonic and air-to-air weapon concepts to the program offices.  Continue to improve simulation technologies that evaluate innovative air-to-air and air-to-surface engagements to include guidance and control evaluation.  Continue to develop a real-time radar\/millimeter wave signature generation capability for testing algorithms in real-time software and hardware-in-the-loop environments to include additional targets and improved terrain resolution to multi-spectral signature generation capability for testing algorithms in real-time software and hardware in-the-loop environments.  Continue to develop simulation technologies that evaluate cooperative, flexible munition target engagements.  Continue to transition refined engineering models to Air Force mission level simulation for analysis.  Continue to improve capabilities of our reconfigurable radio-frequency hardware-in-the-loop chamber to handle faster and more complex scenes to include demonstrating real-time fluid thermal structural interaction effects during hardware-in-the-loop simulation of hypersonic weapons.  Continue to develop new infrared projection capabilities to evaluate a new class of multi-aperture sensor systems to include demonstrating increased scene complexity and closed-loop real-time interface and high-density Infrared Light Emitting Diode array with improved performance.  Continue development of \"help desk” high-fidelity modeling and scene generation modules for the extended modeling and simulation community using Air Force Simulation.  Continue constructive and virtual analysis on numerous weapon concepts to provide design, performance, and trade space analysis to the program offices.  Initiate refurbishment of main Kinetic Hardware-In-the-Loop System facility.  Initiate distributed connectivity capability between multiple Air Force facilities for cross-domain, distributed, multi-level security modeling and simulation activities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.134 million.  Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future AF Capabilities Applied Research"
                                    },
                                    "Description": {
                                        "val": "Investigate, design, and develop science and technologies supporting future Air Force capabilities to provide compelling advantage to the warfighter.  To the greatest extent practical, research efforts will utilize modeling and simulation and cross-discipline systems integration (For example:  air and space vehicles, avionics, propulsion, materials, human performance, cybersecurity, command, control, communications, computer and intelligence, sensors, electronic warfare, and conventional\/unconventional weapons).\n\nThe National Defense Strategy and Air Force Science and Technology 2030 Strategy will inform investments over the FYDP."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, this work is performed under multiple projects and efforts within the following Air Force Scientific and Technology programs:  0602102F, Materials; 0602201F, Aerospace Vehicle Technologies; 0602202F, Human Effectiveness Applied Research; 0602203F, Aerospace Propulsion; 0602204F, Aerospace Sensors; 1206601F, Space Technology; 0602602F, Conventional Munitions; 0602605F, Directed Energy Technology; and 0602788F, Dominant Information Science and Methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.666"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.666"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate and mature science and technology that enables future warfighting concepts to provide leap-ahead capabilities.  The National Defense Strategy and Air Force Science and Technology 2030 Strategy focus this science and technology toward, but not limited to, the following capabilities: 1) global persistent awareness; 2) resilient information sharing; 3) rapid, effective decision-making; 4) complexity, unpredictability, and mass; and 5) speed and reach of disruption and lethality."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $19.666 million.  Funding increased to due the re-alignment and consolidation of Air Force Applied Research Science and Technology funding for Future Air Force Capabilities Applied Research efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622502"
                    },
                    "ProjectTitle": {
                        "val": "Ordnance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "52.270"
                        },
                        "CurrentYear": {
                            "val": "55.328"
                        },
                        "BudgetYearOne": {
                            "val": "62.131"
                        },
                        "BudgetYearOneBase": {
                            "val": "62.131"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "66.523"
                        },
                        "BudgetYearThree": {
                            "val": "75.494"
                        },
                        "BudgetYearFour": {
                            "val": "74.627"
                        },
                        "BudgetYearFive": {
                            "val": "76.178"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, develops, and evaluates conventional ordnance technologies to establish technical feasibility and military utility for advanced explosives, fuzes, warheads, sub-munitions, and weapon airframes, carriage, and dispensing.  The project also assesses the lethality and effectiveness of current and planned conventional weapons technology programs and assesses target vulnerability.  The payoffs include improved storage capability and transportation safety of fully assembled weapons, improved warhead and fuze effectiveness, improved sub-munitions dispensing, low-cost airframe\/subsystem components and structures, and reduced aerospace vehicle and weapon drag."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Energetic Materials Technology"
                                    },
                                    "Description": {
                                        "val": "Investigates and develops energetic materials and technology that safely and securely optimize survivability, cost, and weapon lethality for air-delivered munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.421"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.992"
                                            },
                                            "Text": {
                                                "val": "Continue to mature and develop selected energetic materials to increase energy density over that of traditional explosives while enhancing damage mechanisms and lethality for mass and volume-constrained applications.   Continue to build and implement experimental techniques\/capabilities to quantify dynamic and mechanical properties as well as survivability of energetic materials in extreme temperature and vibrational environments.   Continue to develop theoretical and virtual formulation and processing techniques for energetic materials and provide the second release of the tool\/software to the energetics community.   Continue to develop tools and analysis techniques to further understanding of energy partitioning in order to optimize lethality against a broad spectrum of targets.  Continue to formulate and test liner technologies to improve Insensitive Munitions performance.  Continue to mature additive manufacturing techniques to increase the design space for kinetic weapon lethality."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.509"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.509"
                                            },
                                            "Text": {
                                                "val": "Continue to mature and develop selected energetic materials to increase energy density over that of traditional explosives while enhancing damage mechanisms and lethality for mass and volume-constrained applications.  Continue to build and implement experimental techniques\/capabilities to quantify dynamic and mechanical properties as well as survivability of energetic materials in extreme temperature and vibrational environments.  Continue to develop theoretical and virtual formulation and processing techniques for energetic materials and provide the second release of the tool\/software to the energetics community.  Continue to develop tools and analysis techniques to further understanding of energy partitioning in order to optimize lethality against a broad spectrum of targets.  Continue to formulate and test liner technologies to improve Insensitive Munitions performance.  Continue to mature additive manufacturing techniques to increase the design space for kinetic weapon lethality.  Initiate formulation of novel explosive fill to satisfy severe environmental constraints.  Initiate development of large scale nano-energetic material fabrication."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.517 million.  Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop fuzing technology for air-delivered weapons to ensure reliable and optimal function to maximize weapon lethality for all engagement scenarios."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.996"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.015"
                                            },
                                            "Text": {
                                                "val": "Continue to develop testing capabilities for munitions penetration scenarios and increase Modeling and Simulation capabilities to reduce research and development costs and time lines.  Continue to develop and demonstrate alternative packaging technology for survivable fuze electronic components.  Continue to investigate the reliability and survivability of electronic components to predict and measure fuze performance during munition penetration at high-impact speeds.  Continue research to facilitate tailored lethal effects and enable optimum fuzing solutions across the spectrum of weapon and target interactions.  Continue research for distributed and multi-point fuzing concepts.  Continue implementing additive manufacturing techniques to increase fuze reliability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.303"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.303"
                                            },
                                            "Text": {
                                                "val": "Continue to develop testing capabilities for munitions penetration scenarios and increase Modeling and Simulation capabilities to reduce research and development costs and time lines.  Continue to develop and demonstrate alternative packaging technology for survivable fuze electronic components.  Continue to investigate the reliability and survivability of electronic components to predict and measure fuze performance during monition penetration at high-impact speeds.  Continue research to facilitate tailored lethal effects and enable optimum fuzing solutions across the spectrum of weapon and target interactions.  Continue research for distributed and multi-point fuzing concepts.  Continue implementing additive manufacturing techniques to increase fuze reliability.  Initiate fuze explosive interfaces analysis for robust definition of explosive train reliability and performance.  Initiate fuze endgame, active imaging for target detection and aim point selection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $1.288 million.  Funding increased due to additional research for high-speed fuze system penetrating weapon applicability and enhancement of target detection, aimpoint, and burst-timing calculations for active imaging fuze systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warhead Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop innovative warhead kill mechanisms for air-delivered weapons that maximize weapon lethality for all engagement scenarios."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.501"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.643"
                                            },
                                            "Text": {
                                                "val": "Continue to mature small, multi-output warhead technologies for soft-surface targets, to include limited penetration capability of hardened structures.  Continue to evolve test capabilities to enhance quantification of the mechanical response under high-rate, high-pressure loading conditions for use in high fidelity Modeling and Simulation tools, to include materials used in additive manufacturing processes.  Continue to develop additive manufacturing techniques and produce optimized sub-scale articles for test.  Continue to demonstrate technologies for effective and survivable high-speed penetration into hard targets.  Continue to develop air-to-air missile warhead concepts for the air targets in near-peer engagement scenarios.  Continue to research and develop cumulative damage mechanisms that take advantage of distributed blast, as well as shock wave and reactive particle interactions.  Continue integration of warhead research with related activities planned for the advanced\/integrated ordnance subsystems research capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.158"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.158"
                                            },
                                            "Text": {
                                                "val": "Continue to mature small, multi-output warhead technologies for soft-surface targets, to include limited penetration capability of hardened structures.  Continue to evolve test capabilities to enhance quantification of the mechanical response under high-rate, high-pressure loading conditions for use in high fidelity Modeling and Simulation tools, to include materials used in additive manufacturing processes.  Continue to develop additive manufacturing techniques and produce optimized sub-scale articles for test.  Continue to demonstrate technologies for effective and survivable high-speed penetration into hard targets.  Continue to develop air-to-air missile warhead concepts for the air targets in near-peer engagement scenarios.  Continue to research and develop cumulative damage mechanisms that take advantage of distributed blast, as well as shock wave and reactive particle interactions.  Continue integration of warhead research with related activities planned for the advanced\/integrated ordnance subsystems research capability.  Initiate a characterization of Low-Density and High-Density Reactive Materials for use in multi-mission roles.  Initiate the development of topological optimization in support of additive manufacturing.  Initiate studies of composite based warheads for penetrator\/perforator applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $1.515 million.  Funding increased due to additional research for counter-air warhead concepts, additional test and experimentation for variate-density reactive materials, and enhancement of composite-based warhead application studies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ordnance Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop ordnance sub-system (energetics, fuzes and war-heads) and integrated system concepts using both high-fidelity and fast-running engineering level Modeling and Simulation tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.352"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.678"
                                            },
                                            "Text": {
                                                "val": "Complete the development of Modeling and Simulation tools and analysis techniques to understand energy partitioning in order to optimize lethality with a focus on blast wave interactions, cumulative and collaborative damage mechanism behavior, and distributed blast effects.  Continue to develop validated mesoscale Modeling and Simulation tools for computational physics sciences.  Continue to mature engineering-level simulation architecture capability to enable weapon sub-system and system-level technology assessments.  Continue to implement cost-effective and rapid transition war-head technologies for Air Force inventory penetrator weapons.  Continue to conduct Modeling and Simulation that explores the ordnance technology trade space for low-cost, long-range munition concepts.  Continue to develop predictive analytic techniques for munition effectiveness tools used in concept development and assessment as well as studies involving analysis of alternatives.  Continue to develop test capability and data collection for Modeling and Simulation tools to characterize lethality, survivability and performance of sub-systems and integrated ordnance systems.  Complete the development of Modeling and Simulation tools and analysis techniques to understand energy partitioning in order to optimize lethality with a focus on blast wave interactions, cumulative and collaborative damage mechanism behavior, and distributed blast effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.161"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.161"
                                            },
                                            "Text": {
                                                "val": "Continue to develop validated mesoscale Modeling and Simulation tools for computational physics sciences.  Continue to mature engineering-level simulation architecture capability to enable weapon sub-system and system-level technology assessments.  Continue to implement cost-effective and rapid transition war-head technologies for inventory penetrator weapons.  Continue to conduct Modeling and Simulation that explores the ordnance technology trade space for low-cost, long-range munition concepts.  Continue to develop predictive techniques for munition effectiveness tools used in concept development and assessment as well as studies involving analysis of alternatives.  Continue to develop test capability and data collection for Modeling and Simulation tools to characterize lethality, survivability and performance of sub-systems and integrated ordnance systems.  Initiate the development of ordnance test and evaluation capabilities that include thermal and vibration management for hypersonic and high-speed flight."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $3.483 million.  Funding increased due to improved fidelity of meso-scale modeling tools, higher quality of munitions effectiveness tools, and more robust testing and evaluation of high-speed ordnance and energetic materials."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}