{
    "id": "2020-WashingtonHeadquartersService-PB-0400-JBOOK-9f13073560cfc8f9fc5aae1fb3d2119778b832f9a581c6f2b664be8bbf0a59da-0",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-WHS-U_RDTE_JustificationBook_Washington_Headquarters_Service_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Washington_Headquarters_Service_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Washington Headquarters Service",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603342D8W"
        },
        "ProgramElementTitle": {
            "val": "Defense Innovation Unit  (DIU)"
        },
        "R1LineNumber": {
            "val": "39"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Washington Headquarters Service"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "23.498"
            },
            "CurrentYear": {
                "val": "29.198"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Defense Innovation Unit Experimental (DIUx) was transferred from OSD (PE 0602230D8Z) to Washington Headquarters Services (WHS)  (PE 0603342D8W).  In July 2018, DIUx was realigned from WHS to the Office of the Under Secretary of Defense, Research and Engineering (OUSD(R&E)).  In August 2018, DIUx was re-designated the Defense Innovation Unit (DIU) to signify a permanence of the program.  Effective FY2020, DIU will transfer from WHS PE 0603342D8W to OSD PE 0603342D8Z with a functional realignment across the FYDP to OUSD(R&E). \n\nThe U.S. Department of Defense (DoD) relies on innovation to maintain our nation's ability to deter, and if need be, prevail in conflict.  The DIU increases the Department's access to leading-edge technologies and talent that reside in the commercial sector, with the ultimate goal of accelerating innovation into the hands of the warfighter.  Working across the country, and in collaboration with allied international partners, DIU is developing new ways of doing business, growing our defense industrial base to include \"non-traditional\" companies that had previously not collaborated with the military, working with traditional vendors in novel ways to increase efficiency, and challenging innovators to share their knowledge and expertise in support of our nation's defense."
        },
        "ProgramElementMissionDescription": {
            "val": "Defense Innovation Unit Experimental (DIUx) was established in April 2015 and DIUx 2.0 in May 2016. \n\nDIUx mission is to accelerate innovation in the commercially-focused technology sector to the warfighter.  Initially, DIUx was managed by the Under Secretary of Defense Acquisition, Technology and Logistics (OUSD(AT&L)) when it was established in July 2015. In May 2016, DIUx was placed under the control of the Secretary of Defense and administratively managed by WHS.  In July 2018, DIUx was realigned from WHS to the OUSD(R&E), In August 2018, DIUx was re-designated the Defense Innovation Unit (DIU) to signify a permanence of the program. Effective FY2020, DIU will transfer from WHS PE 0603342D8W to OSD PE 0603342D8Z with a functional realignment to OUSD(R&E). \n\nThe DIU program will fund the development of novel leading-edge technologies emerging from high-tech companies that are not traditional defense contractors.  An objective of this program is to obtain innovative technological advancements developed in the commercial sector and integrated into the DoD technological ecosystem."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "29.594"
                },
                "CurrentYear": {
                    "val": "29.364"
                },
                "BudgetYearOne": {
                    "val": "29.398"
                },
                "BudgetYearOneBase": {
                    "val": "29.398"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.498"
                },
                "CurrentYear": {
                    "val": "29.198"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.096"
                },
                "CurrentYear": {
                    "val": "-0.166"
                },
                "BudgetYearOne": {
                    "val": "-29.398"
                },
                "BudgetYearOneBase": {
                    "val": "-29.398"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-6.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC (General Provisions)"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.096"
                                },
                                "CurrentYear": {
                                    "val": "-0.166"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Transfer of DIU from WHS to USD(R&E)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-29.398"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-29.398"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Initially, DIUx was managed by the Under Secretary of Defense for Acquisition, Technology and Logistics (OUSD(AT&L)) when it was established in July 2015. In May 2016, DlUx was placed under the operational control of the Secretary of Defense and administratively managed by Washington Headquarters Services (WHS), with functional realignment of the resources across the FYDP to Washington Headquarters Services (WHS) beginning in FY 2018.  In July 2018, DIUx was realigned from WHS to the Under Secretary of Defense, Research and Engineering (R&E)).  In August 2018, DIUx was re-designated the Defense Innovation Unit (DIU).  Effective FY 2020, DIU will transfer from WHS PE 0603342D8W to OSD PE 0603342D8Z with a functional realignment of resources across the FYDP to OUSD(R&E). In FY 2018, Congress reduced -$6.000 million to the DIU RDT&E program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "434"
                    },
                    "ProjectTitle": {
                        "val": "DIUx"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "23.498"
                        },
                        "CurrentYear": {
                            "val": "29.198"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DIUx mission is to accelerate innovation to the warfighter by leveraging commercial technology innovations. Initially, this program was managed by the Under Secretary of Defense Acquisition, Technology, and Logistics (OUSD(AT&L)) with functional realignment of $148.8 million across the FYDP to WHS beginning in FY 2018. In July 2018, DIUx was realigned from WHS to the Under Secretary of Defense, Research and Engineering (OUSD(R&E)).  In August 2018, DIUx was re-designated the Defense Innovation Unit (DIU) to signify a permanence of the program.  Effective FY 2020, DIU will transfer from WHS PE 0603342D8W to OSD PE 0603342D8Z with a functional realignment to OUSD(R&E).  The DIU program will fund the development of novel leading-edge technologies emerging from high-tech companies that are not traditional defense contractors.  An objective of this program is to obtain innovative technological advancements developed in the commercial sector and integrated into the DoD technological ecosystem.  Incoming proposals will be assessed to ensure alignment with the DoD's strategic objectives to increase and strengthen our nation's security."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Innovation Unit - Experimental (DIU)"
                                    },
                                    "Description": {
                                        "val": "The U.S. Department of Defense (DoD) relies on innovation to maintain our nation's ability to deter, and if need be, prevail in conflict.  With outposts in Mountain View, California, Cambridge, Massachusetts, and Austin, Texas, the DIU serves as a bridge between those in the U.S. Military executing our nation's highest priority problems with companies operating at the cutting edge of technology.  DIU continuously experiments on methods to identify, contract, prototype, and transition novel innovations with commercial entities that would not otherwise do work with the DoD.  The end goal is to accelerate the adoption and utilization of cutting-edge technology for the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.498"
                                            },
                                            "Text": {
                                                "val": "The Defense Innovation Unit Experimental (DIUx) is chartered to expand the Department's access to innovative companies and technologies that enable the development of leading-edge, asymmetric capabilities and help spur development of new ways to keep the United States on par or ahead of the nation's most advanced adversaries.  The Secretary of Defense's strategic priorities includes improving the Departments lethality through multiple means to include the openness and willingness to evolve by adopting new ideas to ensure a better future for the Department and the Nation.  One of the tenets of this priority is to expand the Department's ability to access leading edge technological innovations through commercial partnerships.  The funding DIUx executes is critical as it incentivizes non-traditional defense sector companies to work with and invest in advancing DoD future capabilities.  \n\n Some of the projects undertaken include:  \n- Hardened Network Defense that provides warfighters improved network security by obscuring vital services and data, thereby significantly decreasing the ability of advancing cyber threats to map, attack or exploit tactical systems.\n- Command, Control, and Situational Awareness web-based software platform that supports user's ability to visualize relevant activities and operational metrics, collaboratively plan and approve defense activities, and monitor\/manage subsequent.  DIUx projects signal investment targets for venture capital opportunities.  While these are small when compared to the DoD total budget, the 3rd party investment multiplier they generate are without equal."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.198"
                                            },
                                            "Text": {
                                                "val": "DIU is one of the Secretary of Defense's priorities in advancing technology, especially artificial intelligence, to help the U.S. Military become more lethal and capable of defending the nation.  DIU's objective is to rapidly solve the problems of our DoD customers and deploy those solutions. Accordingly, DIU requirements are driven by DoD customers in the Services, Defense Agencies, and Combatant Commands. DoD customers come to DIU with their most challenging and most compelling technological problems.  DIU works to solve the challenges and issues for the Department in areas such as Artificial Intelligence and Machine Learning, Autonomy, Human Systems, Information Technology, and Space."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Funds were transferred to PE 0603342D8Z. \nDIU continues its mission to identify and deliver cutting-edge commercial innovation to the Joint Force.  DIU is rapidly prototyping and deploying innovative commercial technologies to fill critical capability gaps identifed by DoD customers in the Services, Defense Agencies, and Combatant Commands.  DIU works to solve challenges and issues for the Department in areas such as Artificial Intelligence and Machine Learning, Autonomy, Human Systems, Information Technology, and Space.  In FY2020, DIU will add a new technology focus area of Power and Energy to develop and deliver technologies within the fields of Tactical Power, Operational Power, Directed Energy, and Hypersonics.  DIU has plans to expand it's presence in Austin, TX to optimize outreach with innovative commercial sources and enhance collaboration with the newly established Army Futures Command."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 funds were transferred to PE 0603342D8Z. \nThe increase of $0.200 thousand will result in a minor re-balance of investments across the technology focus areas of Artificial Intelligence and Machine Learning, Autonomy, Human Systems, Information Technology, Space, and Power and Energy."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0901583D8W"
                                    },
                                    "Title": {
                                        "val": "O&M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.690"
                                        },
                                        "CurrentYear": {
                                            "val": "11.384"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0901583D8Z"
                                    },
                                    "Title": {
                                        "val": "O&M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.358"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.358"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "17.705"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.059"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.420"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.789"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "DIU O&M mission support funding."
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1. Speed - average days to award a prototype project at the close of a solicitation compared to the traditional acquisition system.\n2. Cost Savings - estimated amount saved as a result of DIU-driven solutions.\n3. Scale - measures the success at transitioning successful projects or methodologies, and increasing the number \/ diversity of partnerships within the National Security Innovation Base."
                        }
                    }
                }
            ]
        }
    }
}