{
    "id": "2020-ChemicalandBiologicalDefenseProgram-PB-0400-MJBOOK-0-0-44c3a4aff04877f327093d2fed4ed3a9907dbc9834ee536139756a9e0713feaf-1",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-CBDP-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
        },
        "R1LineNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "199.466"
            },
            "CurrentYear": {
                "val": "192.674"
            },
            "BudgetYearOne": {
                "val": "202.587"
            },
            "BudgetYearOneBase": {
                "val": "202.587"
            },
            "BudgetYearTwo": {
                "val": "204.863"
            },
            "BudgetYearThree": {
                "val": "208.999"
            },
            "BudgetYearFour": {
                "val": "210.679"
            },
            "BudgetYearFive": {
                "val": "211.892"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The projects in this program element (PE)  support applied research in the areas of physical technologies, non-traditional agent (NTA) medical and physical defense technologies, and medical technologies.  Major efforts support development of vaccines, therapeutics, next generation diagnostics systems, next generation chemical detectors, nerve agent pretreatments, and individual protection advances.\n\nIndividual projects include:\n- Chemical Biological Defense (CB2): continual improvements in CB physical sciences defense materiel, including contamination avoidance, decontamination, detection and protection technologies, as well as biological weapon\/agent surveillance (e.g. CB protective materials, textiles, and filtration, sensors and sensing algorithms, effects modeling, chemical formulations, processes, and methods for hazard mitigation).\n\n- NTA Defense (NT2): consolidation of all NTA efforts (both medical and non-medical) including pretreatments, therapeutics, detection, threat agent science, modeling, protection and hazard mitigation and characterization of emerging threats\n\n- Medical Defense (TM2): development of antidotes, drug treatments, disease surveillance and point-of-need diagnostic devices, patient decontamination and medical technologies management (e.g. drug discovery and platform technology development, biomarkers and assay development useful in drug development and diagnostics, human mimicking devices and regulatory science).\n\nCBDP S&T Applied Research Stakeholders: United States Army Edgewood Chemical Biological Center (ECBC), United States Army Medical Research Institute of Infectious Diseases (USAMRIID), United States Army Medical Research Institute of Chemical Defense (USAMRICD), United States Army Natick Soldier Systems Center, Naval Research Lab (NRL), Air Force Research Lab (AFRL), among others.  The intent is to maintain strategic partnerships with the DoD Service communities for mission success across the enterprise through collaborative planning and programming maintaining budget assurance.\n\nEfforts under this PE will transition to or will provide risk reduction for Advanced Technology Development (PE 0603384BP), Advanced Component Development and Prototypes (PE 0603884BP), and System Development and Demonstration (PE 0604384BP)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "201.053"
                },
                "CurrentYear": {
                    "val": "192.674"
                },
                "BudgetYearOne": {
                    "val": "194.061"
                },
                "BudgetYearOneBase": {
                    "val": "194.061"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "199.466"
                },
                "CurrentYear": {
                    "val": "192.674"
                },
                "BudgetYearOne": {
                    "val": "202.587"
                },
                "BudgetYearOneBase": {
                    "val": "202.587"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.587"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "8.526"
                },
                "BudgetYearOneBase": {
                    "val": "8.526"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "2.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.715"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.302"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.526"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.526"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY18 (+$2.000M): Congressional add for program increase to Chemical Biological Defense (CB2).\nFY18 (+$0.715M): Reprogramming to support therapeutics projects.\nFY18 (-$4.302M): Transfer of funding to support Small Business Innovative Research\/Small Business Technology Transfer efforts.\n\nFY20 (+$8.526M): Threat Agent Science funding increased to expand threat characterization and assessments to minimize surprise from emerging and advanced CBRN threats.\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB2"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "74.565"
                        },
                        "CurrentYear": {
                            "val": "67.994"
                        },
                        "BudgetYearOne": {
                            "val": "77.803"
                        },
                        "BudgetYearOneBase": {
                            "val": "77.803"
                        },
                        "BudgetYearTwo": {
                            "val": "77.799"
                        },
                        "BudgetYearThree": {
                            "val": "78.285"
                        },
                        "BudgetYearFour": {
                            "val": "82.463"
                        },
                        "BudgetYearFive": {
                            "val": "83.596"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project CB2 provides physical science applied research to develop future, multi-disciplinary, and multi-functional capabilities in life sciences, physical sciences, environmental sciences, mathematics, cognitive sciences, and engineering.  Efforts in this project support the seamless integration of state-of-the-art-technologies into a collection of systems across the spectrum of capabilities required to support chemical and biological defense missions.\n\nCapability areas in this project include: \n- Protection and hazard mitigation focuses on providing technologies that protect from and reduce the impact of chemical\/biological threat or hazard to the Warfighter, weapons platforms, and structures. \n- Detection focuses on developing technologies for remote and point detection and identification of chemical and biological agents.\n- Decision analysis and management focuses on advanced hazard prediction, operational effects and risk assessment, and systems performance modeling. \n- Warning and reporting focuses on non-traditional detection methods to provide indications of chemical and biological exposure risk.  \n- Biosurveillance provides methodologies to integrate open source data into advanced warning systems. \n- Threat agent science is devoted to characterizing threat agents and the hazards they present in terms of agent fate in the environment, toxicology, and pathogenicity, and focuses on the horizontal integration of CB defensive technologies in support of the Joint Services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.126"
                                            },
                                            "Text": {
                                                "val": "- Completed sorbent decontaminant formulation to advance development for tactical decontamination.\n- Completed vapor and complex surface efficacy performance evaluations. \n- Accelerated transition efforts on sprayable slurry immediate\/operational decontamination system to meet operational needs.  \n- Completed agent resistant coatings efforts for aircraft and transitioned data to the Air Force Item Manager. \n- Continued chemical hot air decontamination effort to address sensitive equipment, platform interior, and aircraft chemical warfare agent decontaminant needs and achieved proof of concept. \n- Continued responsive coatings efforts to enhance decontaminability as part of the systems approach to achieving efficacy goals. \n- Continued Wide Area Decontamination of Bacillus anthracis projects, focusing on agrochemical approaches and prepared for FY19 field demonstration. \n- Continued surface science investigations with expanded set of materials, parameters and agents to inform design for the development of the next generation of hazard mitigation technologies to achieve toxicology-based efficacy goals. \n- Continued elimination\/bulk chemical warfare agent destruction effort, focusing on neutralization and polymerization of bulk chemical warfare agents and achieved proof of concept. \n- Continued effort to examine how decontamination technologies perform on field assets when contaminated with weapon representative chemical agents. \n- Continued efforts to develop\/enhance agent mapping (disclosure\/assurance) technologies to include performance in low light conditions and improve spray surface adhesion and complex surfaces. \n- Initiated scoping study to begin Wide Area Decontamination of chemical warfare agents and confirmed feasibility of approach."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.180"
                                            },
                                            "Text": {
                                                "val": "- Continue chemical hot air decontamination effort to address sensitive equipment, platform interior, and aircraft chemical warfare agent decontaminant needs and explore using aerosol decontaminants to enhance the process. \n- Continue coatings research to understand chemical agent resistance coatings (CARC) and mechanisms of agent absorption and also investigate potential new coatings to improve agent resistance of CARC. \n- Continue Wide Area Decontamination of Bacillus anthracis project, focused on agrochemical approaches and conduct outdoor demonstration. \n- Continue surface science investigations with expanded set of materials, parameters, and agents to inform design for the development of the next generation of hazard mitigation technologies to achieve toxicology-based efficacy goals. \n- Complete elimination\/bulk chemical warfare agent destruction effort, focusing on neutralization and polymerization of bulk chemical warfare agents to explore process optimization and begin scaling efforts. \n- Continue effort to examine how decontamination technologies perform on field assets when contaminated with other than Chemical Agent Standard Analytical Reference Material (CASARM) (laboratory quality\/pure) chemical agents. \n- Continue efforts to develop\/enhance agent mapping (disclosure\/assurance) technologies. Initiate effort to develop Wide Area Decontamination of chemical warfare agents capability\/system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.823"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.823"
                                            },
                                            "Text": {
                                                "val": "- Complete optimization of chemical hot air decontamination process. Continue elimination\/bulk chemical warfare agent destruction effort, focusing on neutralization and polymerization of bulk chemical warfare agents using modeling and expand target chemical warfare agents. \n- Continue evaluating CARC and potential temporary or permanent coatings to potentially decrease logistical burden of decontamination of CARC coated equipment.\n- Continue Wide Area Decontamination (chemical) efforts to examine analytical methods and test procedures for concrete, asphalt and soil for decontamination of chemical agents.  \n- Continue effort to examine how decontamination technologies perform on field assets when contaminated with weapons representative chemical agents by expanding evaluations to include simulated relevant conditions. \n- Continue efforts to develop\/enhance agent mapping (disclosure\/assurance) technologies. \n- Continue efforts to examine impacts of in operando conditions on the hazard mitigation process to inform design to future (next generation) decontamination strategies. \n- Identify new catalytic materials that are capable of reacting, sorbing, and neutralizing chemical and biological agents."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Description: Development and integration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that include Chemical Warfare Agents (CWA), Biological Weapons Agents  (BWA), and Toxic Industrial Chemicals (TICs). Development of respiratory protection and design for better interoperability to support longer range missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.162"
                                            },
                                            "Text": {
                                                "val": "- Continued novel filtration efforts to develop respirator-helmet integration technologies. \n- Continued closed circuit Self-Contained Breathing Apparatus (SCBA) development and integration with portable air management systems. \n- Initiated relevant respiratory and ocular protection multifunctional systems configurations at scale."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.464"
                                            },
                                            "Text": {
                                                "val": "- Continue to assess improved oxygen and carbon dioxide removal technologies. \n- Continue to evaluate and assemble improved sensor technologies and control systems into Self-Contained Breathing Apparatus (SCBA) platforms. \n- Continue to coordinate with percutaneous protection whole ensemble developmental efforts that will extend the available operational time and improve interfaces with tactical equipment. \n- Continue efforts that integrate emerging respirator and helmet filtration components and technologies.  \n- Continue to develop and validate flexible and stretchable materials for tactical all hazard protective ensemble applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.707"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.707"
                                            },
                                            "Text": {
                                                "val": "- Identify new catalytic materials that are capable of reacting, sorbing, and neutralizing chemical and biological agents.  \n- Continue to explore technologies for oxygen storage and CO2 removal including materials and components of this and integrate into Full Spectrum Respiratory Protection System (FSRPS)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Develop advanced ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provide a range of solutions optimized for protection, thermal comfort, and mission performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.159"
                                            },
                                            "Text": {
                                                "val": "- Initiated the process to mount compounded materials onto fabrics for protection. \n- Initiated study to conduct fiber and yarn analysis. \n- Continued to develop knit and woven samples for evaluation.  \n- Continued to develop advanced National Fire Protection Association (NFPA) certified fully encapsulated ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provided a range of solutions optimized for protection, thermal comfort, and mission performance. \n- Continued to develop composite and novel multi-functional materials and low thermal burden garment materials which provide site-specific CB protection On Demand."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.120"
                                            },
                                            "Text": {
                                                "val": "- Continue the process to mount compounded materials onto fabrics for protection. \n- Continue to conduct fiber and yarn analysis. \n- Continue to develop knit and woven samples for evaluation. \n- Develop respirator and helmet integration, develop and qualify flexible and stretchable materials for all hazard use. Fabricate and test hood\/mask interface concepts, perform whole system agent tests. \n- Develop mechanisms at scale, and finalize proof of principle responsive materials. Determine usefulness of metal organic frameworks and other materials for use in fabrics for protective ensembles. \n- Conduct warfighter demonstration and assessment of advanced National Fire Protection Association (NFPA) certified fully encapsulated ensemble prototypes with state-of-the art materials that address the full spectrum of threats to guide development and aid in future transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.152"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.152"
                                            },
                                            "Text": {
                                                "val": "- Continue to mount compounded materials onto fabrics for protection. \n- Continue to conduct fiber and yarn analysis. \n- Continue to develop knit and woven samples and reactive stretchy fabrics for evaluation.  \n- Continue efforts to scale and evaluate membrane technologies for responsive materials to chemical and biological agents. \n- Continue development of deliverables including lessons learned and seam sealing for Chemical and Biological Operational Assessment reporting and technical assessments to inform system design and final technical and user assessments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Expeditionary Collective Protection"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies for soldiers to determine the remaining chemical vapor service life of their CWA filters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.343"
                                            },
                                            "Text": {
                                                "val": "- Continued systems integration and surveillance of Guard Bed filters and Residual Life Indicator (RLI). \n- Continued fabrication\/production of Residual Life Indicator (RLI) satellite cartridge prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.370"
                                            },
                                            "Text": {
                                                "val": "- Continue field testing and sampling of Guard Bed and Residual Life Indicator (RLI) filters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.897"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.897"
                                            },
                                            "Text": {
                                                "val": "- Complete field testing and sampling of Guard Bed and RLI filters at fixed sites and provide final report.  \n- Identify new catalytic materials that are capable of reacting, sorbing, and neutralizing chemical and biological agents."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to mitigate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.350"
                                            },
                                            "Text": {
                                                "val": "- Transitioned technology data efforts to develop an alternative to Reactive Skin Decontamination Lotion (RSDL). \n- Initiated personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.370"
                                            },
                                            "Text": {
                                                "val": "- Continue personnel decontamination efforts to enhance current processes (kinetics, dwell time, mechanics, etc.) and support mass casualty personnel decontamination warfighter operations to increase throughput and decrease logistics and burden on warfighters, including efficacy studies associated with the homeland defense mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.365"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.365"
                                            },
                                            "Text": {
                                                "val": "- Assess decontamination effectiveness of different methods of applying decontamination to hair and skin to discern the most efficient way of decontaminating personnel against chemical and biological agents.   \n- Identify new catalytic materials that are capable of reacting, sorbing, and neutralizing chemical and biological agents."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Biosurveillance"
                                    },
                                    "Description": {
                                        "val": "Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact, and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools. \n\nThis program is transferring to CB2 (Chemical Biological Defense) Threat Surveillance in FY19."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.680"
                                            },
                                            "Text": {
                                                "val": "- Developed technologies aimed at predicting, forecasting and mitigating biosurveillance events (e.g., data gathering and sharing mechanisms for event-based surveillance; compilation of historical baselines; models of plant and\/or animal disease spread; social media data analytics, uncertainty quantification).\n- Developed capabilities to intelligently fuse ubiquitous sensing capabilities (wearables, field deployed diagnostics and autonomous environmental sensing vehicles) for earlier warning.\n- Initiated enhanced data visualization capabilities for both sensor data fusion and predictive disease propagation models. \n- Initiated development of an Integrated Early Warning Ecosystem to provide improved Chemical and Biological Defense (CBD) situational awareness, a common analytical work bench for users, integration and fusion of a wide array of relevant data sources, and decision support tools for the tactical to strategic level command authorities. Leveraged and applied advances gained through development of the Biosurveillance Ecosystem"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Detection Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Focus of this effort is to develop capabilities to detect and identify chemical and biological threats.  This activity can include development of point, remote, or standoff sensors as appropriate, to address both conventional and non-traditional chemical and biological threats.  These efforts are being developed to further the detection capability for early warning of contamination exposure to the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.252"
                                            },
                                            "Text": {
                                                "val": "- Continued concept and technology development for biological and chemical threat early warning detection.\n- Continued development of sample preparation techniques to enhance environmental detection platforms.\n- Continued development of a man worn environmental sensor for detecting exposure to chemical hazards. \n- Continued the development of proteomic detection capabilities. \n- Initiated the development of detection capabilities for identifying genomic editing events.\n- Initiated the development of autonomous CB sensors for distributed reconnaissance capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.270"
                                            },
                                            "Text": {
                                                "val": "- Continue concept and technology development for biological and chemical threat early warning detection to include distributed biological reconnaissance capabilities along with the ability to reduce false alarms in a highly complex and chemical saturated environment.  \n- Continue development of detection capabilities for identifying genomic editing events.  \n- Initiate the development of exploring sensing approaches to provide unattended monitoring of perimeters for rapid defensive positioning to enable early indication of airborne chemical threats.\n- Continue the development of sensors for mobile applications, including development for unmanned systems. \n- Initiate a program to investigate an automated man-out-of-loop remote biological collection and detection system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.546"
                                            },
                                            "Text": {
                                                "val": "- Complete development of a man worn environmental sensor for detecting exposure to chemical hazards. \n- Continue concept and technology development for biological and chemical threat early warning detection to include distributed biological reconnaissance capabilities along with the ability to reduce false alarms in a highly complex chemical environment.\n- Continue development of detection capabilities for identifying genomic editing events. \n- Continue the development of sensors for mobile applications, including development for unmanned systems.\n- Continue development of detection technologies for an automated man-out-of-loop remote biological collection and detection capability. \n- Initiate development of detection technologies to provide unattended monitoring for early indication of airborne chemical threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Warning and Reporting"
                                    },
                                    "Description": {
                                        "val": "Develop non-traditional detection methods to provide indications of chemical and biological exposure risk. Integrate disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into chemical and biological threat advanced warning systems, tactical decision aids, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact, and biological threat assessment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.416"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.416"
                                            },
                                            "Text": {
                                                "val": "- Develop algorithms to utilize typical and non-typical Intelligence Surveillance and Reconnaissance (ISR) and host based data available to the warfighter to provide earlier warning of chemical and biological threats and\/or exposure.\n- Investigate individual versus group informatics for earlier warning. \n- Explore DNA storage, recording, and monitoring for longitudinal detection application. \n- Explore the use of augmented reality to provide chemical and biological threat situational awareness in head-mounted visual displays. \n- Develop tools that provide information forward to the tactical commander. Tools planned for development include a sensor placement tool and a source term estimation algorithm that are capable of producing results utilizing the computing resources available on the tactical devices. \n- Research machine learning approaches to develop quicker running models. \n- Investigate automated approaches using artificial intelligence and machine learning to detect signals and provide earlier warning of chemical and biological threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters.  This program subsumes CB2 Threat Surveillance in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Hazard Prediction"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop capability for predicting the source term of releases of chemical, biological, and industrial materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.801"
                                            },
                                            "Text": {
                                                "val": "- Continued development to improve urban subsystem, specifically coupling between indoor and outdoor dispersion models for urban releases.\n- Initiated planning phase for field studies for validation of these indoor and outdoor dispersion models. \n- Initiated development and enhancement of source-term estimation\/source characterization algorithms. \n- Completed research and development of enhancements to the fidelity of the missile intercept modeling capability within the Hazard Prediction and Assessment Capability (HPAC).\n- Initiated development of enhancements to human response models for CBRN agent and toxic industrial chemical exposures. \n- Continued development of MSS to improve hazard prediction for urban environments in HPAC and continued to implement terrain-following dense gas motions.\n- Continued development of a secondary evaporation model. \n- Continued researching new methods for the development of next generation dispersion models such as hybrid Large Eddy Simulation\/Gaussian approaches.  \n- Initiated development of a new software architecture for HPAC to meet Common CBRN Model Interface requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.253"
                                            },
                                            "Text": {
                                                "val": "- Continue development of coupled indoor and outdoor dispersion models for enhanced hazard prediction in urban environments.  Execute a field trial to collect validation data for coupled indoor and outdoor dispersion models and conduct sample analysis for all field trial samples. \n- Continue development of MicroSWIFT\/SPRAY (MSS) for improved hazard prediction in urban environments.  \n- Continue enhancements to source term estimation and source characterization algorithms.  \n- Complete development of a secondary evaporation model.  Begin integration of secondary evaporation model with MSS.  \n- Continue researching new methods for the development of next generation dispersion models such as hybrid Large Eddy Simulation\/Gaussian approaches."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop CBRN data sharing capabilities and simulation tools. Develop chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of Chemical Biological (CB) agents on equipment, personnel, and operations. These chapters are developed by a mix of contractors and labs, employing experts in each subject area."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.364"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop, revise and integrate CB-1.  \n- Continue to host and maintain online accessibility of CB-1 to the Chemical Biological Defense Program (CBDP) community, as well as enhance online capabilities based on user feedback."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters.  Program is transferring to CB2 Decision Analysis and Management in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop CBRN data sharing capabilities and simulation tools. Develop chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB agents on equipment, personnel, and operations. These chapters are developed by a mix of contractors and labs, employing experts in each subject area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.334"
                                            },
                                            "Text": {
                                                "val": "- Continued working on all 20 Chapters of CB-1. \n- Continued development of a user-friendly wiki platform that contains all the information within CB-1 and associated databases and references. \n- Continued review of CB-1 chapter content my independent subject matter experts.\n- Began hosting of CB-1 chapter content on the Biosurveillance Ecosystem."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Decision Analysis and Management"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness and support decision-making by predicting hazardous material releases and resulting human effects. Provide tools to enable the assessment and mitigation of impacts at personnel, system, tactical, operational, and strategic levels. Develop CBRN data sharing capabilities and information resources."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.436"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.436"
                                            },
                                            "Text": {
                                                "val": "Hazard Prediction:\n- Continue development of coupled indoor and outdoor dispersion models for enhanced hazard prediction in urban environments. \n- Conduct field trial to collect validation data for coupled indoor and outdoor dispersion models. \n- Continue development of enhancements to human response models for CBRN agent and toxic industrial chemical exposures. \n- Continue development of MicroSWIFT\/SPRAY (MSS) for improved hazard prediction in urban environments. \n- Complete integration of secondary evaporation model with MSS. \n- Complete development of a new software architecture for HPAC to meet Common CBRN Model Interface requirements. \n- Continue development of next generation littoral waterborne modeling system. \n\nAnalytic Applications Platform:\n- Develop and implement data standards for the transmission and storage of information sources relevant to the earlier warning of chemical and biological threat agents. \n- Continue Air Force, Navy, Army, and Marine Corps service specific human performance studies. \n- Continue efforts to determine the effects of chemical warfare agents (CWAs) on individual tasks. \n- Complete direct subsurface direct transport measurement studies and continue modeling contact transfer exposures. \n- Continue to develop, revise and integrate CB-1. Host and maintain online accessibility of CB-1 to the CBDP community on the Biosurveillance Ecosystem, as well as enhance online capabilities based on user feedback."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters.  This program subsumes CB2 Hazard Prediction, Operational Effects and Planning, Data Analysis in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Supports defensive countermeasure development against CB threats by delivering the scientific data, understanding, and relevant human estimates of the hazards posed to humans by exposure to CB agents. Toxicological and\/or infectious-dose information and environmental response supports development and\/or enhancement of both operational risk and exposure guidelines; identifies gaps in detection and protection; informs decontamination procedures; and supports the development of medical countermeasures. Knowledge generated from this program is used to inform understanding of hazards, hazard prediction models, and materiel and countermeasure development.\n\nFY20 funding increased due to emerging needs of CBDP. The increased funds will support Biological First Look, Agent Employment Assessment, and Technical Surprise, to include Horizon Scanning and Technical Advancement Impact studies, and Emerging Biology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.158"
                                            },
                                            "Text": {
                                                "val": "- Continued developing advanced methods for threat agent characterization.\n- Continued developing methods to understand agent fate on surfaces.\n- Continued studies to provide data to inform operational risk and exposure guidelines, response, detection, and protection. \n- Continued delivering data on fate, persistence, and response of priority agents in various environments. \n- Continued with relevant host response to biological threat and infectious dose studies to provide data to inform operational risk and exposure guidelines, response, detection, and protection; and goals for decontamination and medical countermeasures. \n- Conducted a tabletop exercise to explore the effects of emerging biotechnology on the biological threat space and to inform current or impending impact of technical advancements on capabilities.\n- Continued defining particle properties and agent-substrate interaction to predict agent behavior and to understand aerosolization to inform hazard assessment.  \n- Continued assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, decontamination, and disinfection)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.425"
                                            },
                                            "Text": {
                                                "val": "- Continue developing advanced methods for threat agent characterization.\n- Continue providing data on fate, persistence, and response of priority agents in various environments.  \n- Continue developing methods to understand agent fate on surfaces. \n- Continue defining particle properties and agent-substrate interaction to predict agent behavior and aerosolization to inform hazard assessment. \n- Continue studies to provide data to inform operational risk and exposure guidelines, response, detection, and protection; and define goals for the development of decontamination procedures and medical countermeasures.\n- Continue assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, decontamination, and disinfection)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.461"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.461"
                                            },
                                            "Text": {
                                                "val": "- Continue developing advanced methods for threat agent characterization. \n- Continue developing methods to understand agent fate on operational surfaces.\n- Continue developing predictive capabilities and models, linking the different properties to provide initial hazard assessment information on emerging threat compounds. Continue delivering data on fate, persistence, and response of priority agents in various environments to inform hazard assessment. \n- Continue assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, and decontamination). Continue identifying and assessing technological advancements that will impact the chemical and biological threat space. \n- Initiate a framework to quickly analyze emerging biological threats.\n- Initiate a horizon scanning capability to provide situational awareness in assessing technological convergence that can affect the chemical and biological threat space.\n- Initiate the assessment of synthetic biological tools and other biotechnology developments that can enhance or alter the threat space."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to accelerated development effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "14) Operational Effects and Planning"
                                    },
                                    "Description": {
                                        "val": "Provide tools to enable the assessment and mitigation of impacts at the personnel, system, tactical, operational and strategic levels.  Develop and institutionalize consensus-based, scientifically sound data and analytical methods to link CBRN exposures to relevant operational effects and to enhance test and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.200"
                                            },
                                            "Text": {
                                                "val": "- Completed development of health and human effects modeling capability. \n- Conducted service-specific human performance experiments aimed at better understanding operational risk for the Navy and initiated experiments for the Air Force. Provided objective, quantitative analysis in support of science and technology initiative, material developments, operational guidance, and requirements setting. \n- Developed simulation-based training to enhance decision making during weapons of mass destruction (WMD) crises. Enhanced CBRN operational risk assessment tools for the Navy. This included the development and finalization of models of various ship classes and tools to assess the impact of CBRN use on individual and team tasks. Began to study the relationships among low level chemical nerve agent exposures, adverse individual health and physiological effects, and degradation on individual military task performance. \n- Continued the development of system performance models to inform program management, test and evaluation, and operational impact for decontamination and individual protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.675"
                                            },
                                            "Text": {
                                                "val": "- Continue Air Force and Navy service specific human performance studies.  Plan and initiate Army and Marine Corps specific operational performance studies.  \n- Continue to enhance CBRN operational risk assessment tools for the Navy.  \n- Continue studies to determine the toxicity levels of Toxic Industrial Chemicals (TICs).  \n- Conduct direct subsurface transport measurement studies and continue modeling contact transfer exposures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters.  Program is transferring to CB2 Decision Analysis and Management in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "15) Threat Surveillance"
                                    },
                                    "Description": {
                                        "val": "Integrate disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into chemical and biological threat advanced warning systems, tactical decision aids, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.503"
                                            },
                                            "Text": {
                                                "val": "- Expand the number of pathogens, hosts and vectors incorporated into a robust prediction and forecasting capability.  \n- Develop tactical decision aids on mobile applications to identify risks and provide mitigation strategies for chemical and biological threats.  Identify new data streams, such as physiological markers, which can be leveraged to support early warning and forecasting.  \n- Develop a global area of concern forecasting risk map capability.  Conduct studies to determine the validity of using wearable biomonitoring data as indicative and predictive of health status in controlled environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters.  This program subsumes TM2 Biosurveillance in FY19. Program is transferring to CB2 Warning and Reporting in FY20."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.878"
                                        },
                                        "CurrentYear": {
                                            "val": "21.698"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.798"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.798"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.039"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.538"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.833"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.682"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "51.625"
                        },
                        "CurrentYear": {
                            "val": "53.720"
                        },
                        "BudgetYearOne": {
                            "val": "52.902"
                        },
                        "BudgetYearOneBase": {
                            "val": "52.902"
                        },
                        "BudgetYearTwo": {
                            "val": "50.111"
                        },
                        "BudgetYearThree": {
                            "val": "52.385"
                        },
                        "BudgetYearFour": {
                            "val": "52.377"
                        },
                        "BudgetYearFive": {
                            "val": "52.368"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project NT2 provides early applied research to enhance and develop defensive capabilities against Non-Traditional Agents (NTAs). This project focuses on expanding scientific knowledge required to develop defensive capabilities and to demonstrate fast and agile scientific responses to enhance or develop capabilities that address emerging threats.\n \nEfforts and studies conducted under this project address direction from the FDA to conduct specific post-New Drug Application (NDA)-approval efforts and studies (e.g. required studies, Post Marketing Commitments), and requirements from the joint service users. This project is a comprehensive and focused effort for developing Non-Traditional Agents (NTA) defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs.\n\nIndividual efforts in this project include:\n- Support an integrated approach to counter emerging threats through innovative science and technology (S&T) solutions for detection, protection, decontamination, information systems and modeling and simulation, and medical countermeasures. \n- Provides for the upgrade and modernization of Medical Chemical  Defense countermeasures which include U.S. Food and Drug Administration (FDA) approved prophylactics, pre-treatments, and therapeutics and intend to protect and\/or sustain the Joint Service Member in a toxic chemical threat environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Expeditionary Collective Protection"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies for soldiers to determine the remaining chemical vapor service life of their chemical warfare agent (CWA) filters."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.359"
                                            },
                                            "Text": {
                                                "val": "- Assess baseline novel filtration materials against NTAs and other emerging threats under laboratory conditions. \n- Continue to analyze and characterize the performance of Residual Life Indicator (RLI) satellite filter cartridges against NTAs and other emerging threats.\n- Continue to collect data to establish correlation or filter bed performance and pre-filter system against NTAs and other emerging threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.790"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.790"
                                            },
                                            "Text": {
                                                "val": "- Continue evaluation of advanced threats to filtration technologies including NTAs and other emerging threats.  Explore new effort for novel filtration against NTAs and other emerging threats in Collective Protection (ColPro) and other large scale filter systems. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation filter materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.609"
                                            },
                                            "Text": {
                                                "val": "- Continued integrating the full range of NTAs into the material contamination mitigation portfolio. \n- Continued responsive coatings efforts to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals. \n- Continued effort to examine how decontamination technologies perform on field assets when contaminated with NTAs.\n- Continued efforts to develop\/enhance NTA mapping (disclosure\/assurance) technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.605"
                                            },
                                            "Text": {
                                                "val": "- Continue integrating the full range of NTAs and other emerging threats into the material contamination mitigation portfolio. \n- Continue responsive coatings efforts to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals.\n- Continue effort to examine how decontamination technologies perform on field assets that include battlefield grime when contaminated with impure weapons-grade representative NTAs.  \n- Continue efforts to develop\/enhance NTA mapping (disclosure\/assurance) technologies, including generating electronic records of contamination locations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.792"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.792"
                                            },
                                            "Text": {
                                                "val": "- Continue integrating the full range of NTAs and other emerging threats into the material contamination mitigation portfolio.\n- Continue coatings efforts to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals. .\n- Continue effort to examine how decontamination technologies perform on field assets that include battlefield grime when contaminated with impure weapons-grade representative NTAs. \n- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation filter materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to mitigate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.493"
                                            },
                                            "Text": {
                                                "val": "- Transitioned technology data developed by efforts to develop an alternative to Reactive Skin Decontamination Lotion (RSDL), including efficacy data against representative NTAs to Next Generation Personnel Decontamination. \n- Initiated personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission, including efficacy data against representative NTAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.359"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts to develop an alternative to Reactive Skin Decontamination Lotion (RSDL), including efficacy data against representative NTAs in close coordination with concurrent medical testing required to achieve FDA approval. \n- Continue personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission, including efficacy data against representative NTAs required to achieve FDA approval."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.444"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.444"
                                            },
                                            "Text": {
                                                "val": "- Assess decontamination effectiveness of different methods of applying decontamination to hair and skin to discern the most efficient way of decontaminating personnel against NTAs and advanced threats.\n- Continue personnel decontamination efforts discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation filter materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of design alternatives for chemical and biological air-purifying respirators that provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.733"
                                            },
                                            "Text": {
                                                "val": "- Developed and demonstrated upgrades to existing air purification (including respiratory protection) technologies to enable broad spectrum protection and extended filter life. \n- Assessed novel filtration materials against new NTAs and compounds of interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "- Continue development and integration of component and system upgrades to existing air purification (including respiratory protection) technologies to provide protection and extended filter life against emerging threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.791"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.791"
                                            },
                                            "Text": {
                                                "val": "- Continue discovery, development and testing of materials capable of sorption and reaction of NTAs for next generation filter materials.\n- Continue to explore technologies for oxygen storage and CO2 removal including materials and components of this and integrate into Full-Spectrum Respiratory Protection Systems (FSRPS) a component of Tactical All Hazard Ensemble for advanced and emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project schedule."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Chemical Therapeutics - Medical"
                                    },
                                    "Description": {
                                        "val": "Investigates common mechanisms of agent injury. Physiological parameters and pathological assessments will be used to establish the general mode and mechanism(s) of toxicity to inform countermeasure development. Develops, assesses, evaluates, and validates therapeutics for treatment resulting from exposure to NTAs and emerging chemical threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.372"
                                            },
                                            "Text": {
                                                "val": "- Continued efforts to identify and develop prophylactics for use against selected, priority NTAs, including defining the immunogenicity, circulatory stability, dosing, shelf-life, and delivery of catalytic scavengers. \n- Completed investigation of nanotechnology to support prophylactic countermeasures.\n- Initiated prophylactic proof-of-concept studies of FDA-licensed MCMs against selected agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.272"
                                            },
                                            "Text": {
                                                "val": "- Continue pursuit of analogs of therapeutic compounds to treat NTA exposures.  \n- Continue to test compounds using high-throughput, in vitro screens.  \n- Continue to evaluate licensed FDA therapeutics against selected, priority NTAs. \n- Continue to evaluate compounds at the ADMET CoE to identify leads.  Deliver information on the evaluation of FDA licensed\/approved products for therapeutic applications for countering the deleterious effects of an NTA exposure to the advanced developer.  \n- Continue animal studies to support regulatory submission of candidate therapeutics for treatment of the toxic effects of selected, priority NTAs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.700"
                                            },
                                            "Text": {
                                                "val": "- Continue pursuit of therapeutic compounds to treat NTA exposures including evaluation of licensed FDA therapeutics and use of high-throughput in vitro screens and the ADMET CoE to identify lead candidates. Deliver information on the evaluation of additional FDA licensed\/approved products for therapeutic applications for countering the deleterious effects of an NTA exposure to the advanced developer. \n- Continue animal studies to support regulatory submission of candidate therapeutics for treatment of the toxic effects of selected, priority NTAs.\n- Continue drug formulation efforts for MCMs with a longer shelf-life and with feasibility of an auto-injector containing material and chemical composition.\n- Initiate efforts in neuroprotective therapeutics to increase the quality of life after chemical agent exposure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "Provide modeling of NTA materials for hazard prediction. Develop NTA source term algorithms for predicting chemical hazards from intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept.  Investigate NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model Validation and Verification (V&V), scaled testing, casualty estimation, and supporting data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.524"
                                            },
                                            "Text": {
                                                "val": "- Completed expansion of System for Hazard Assessment of Released Chemicals (SHARC) to model NTAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.707"
                                            },
                                            "Text": {
                                                "val": "- Complete development of agent fate modeling for NTAs.  \n- Initiate expansion of System for Hazard Assessment of Released Chemicals (SHARC) to model biological agent."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.714"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.714"
                                            },
                                            "Text": {
                                                "val": "- Continue development of methodologies to model NTAs with limited source data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of percutaneous protective technologies to include membrane and composite material (\"novel materials\"\/\"multifunctional materials\")."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "- Continue development of novel materials and ensembles that provide protection against NTAs and emerging threats. \n- Initiate additional NTA and other emerging threats tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.195"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.195"
                                            },
                                            "Text": {
                                                "val": "- Continue investigation and scaling of membrane materials for protection against NTAs and emerging threats.\n- Continue investigation of new\/novel sorptive materials for percutaneous protection.\n- Continue development of deliverables including lessons learned and seam sealing against NTAs and emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Provide critical agent characterization (chemical, physical and physiological\/toxicological) data on current and emerging threat agents to prepare for surprise, enabling and informing development and testing of NTA defense technology (e.g., detection, decontamination, protection, and hazard assessment). This characterization of new threats informs decision makers and development of Concept of Operations (CONOPs) and Tactics, Techniques and Procedures (TTP); it also provides the basis for countermeasure development and assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.053"
                                            },
                                            "Text": {
                                                "val": "- Continued characterizing priority emerging threats to provide critical supportable data to enable countermeasure development and testing as well as inform CONOPs, policies, doctrines and procedures.\n- Continued building linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps for emerging threats. \n- Continued evaluating synthesis pathways, physicochemical properties and environmental fate properties for priority threats.\n- Continued assessing the impact of environmental factors and substrate properties on threat agent activity (persistence, transport, degradation, resuspension, etc.). \n- Continued preparing laboratory and operational toxicity estimates for next priority NTAs. \n- Continued to refine and deliver human toxicity estimates for next priority NTAs.\n- Initiated the development of medium- to high-throughput laboratory approaches to predict acute systemic toxicity in support of a predictive toxicology capability. \n- Continued computational and in vitro research efforts, physical characterization and behavior to support development of a predictive toxicology program. \n- Initiated efforts to integrate the computational and in vitro predictive tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.851"
                                            },
                                            "Text": {
                                                "val": "- Continue characterizing priority emerging threats to provide critical support data to enable countermeasure development and testing as well as inform CONOPs, policies, doctrines and procedures. \n- Continue to build linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps for emerging threats.\n- Continue evaluating synthesis pathways, physicochemical properties and environmental fate properties for priority threats. \n- Continue assessing the impact of environmental factors and substrate properties on threat agent activity (e.g. persistence, transport, degradation, resuspension).  \n- Continue preparing laboratory and operationally-relevant toxicity estimates for next priority NTAs. \n- Continue to refine and deliver human toxicity estimates for next priority NTAs. \n- Continue development of medium- to high-throughput laboratory approaches to predict acute systemic toxicity.  Expand computational and in vitro research efforts concerning ADMET, physical and chemical characterization and behavior."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.076"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.076"
                                            },
                                            "Text": {
                                                "val": "- Continue characterizing priority emerging threats to provide critical support data to enable countermeasure development and testing as well as inform CONOPs, policies, doctrines and procedures.\n- Continue to build linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps for emerging threats. \n- Continue evaluating synthesis pathways, physicochemical properties and environmental fate properties for priority threats.\n- Continue assessing the impact of environmental factors and substrate properties on threat agent activity (e.g. persistence, transport, degradation, resuspension). \n- Continue preparing laboratory and operationally-relevant toxicity estimates for next priority NTAs. \n- Continue to refine and deliver human toxicity estimates for next priority NTAs. \n- Continue development of medium- to high-throughput laboratory approaches to predict acute toxicity. \n- Continue to expand and refine computational and in vitro research efforts, physical and chemical characterization and behavior to support toxicity evaluation and prediction."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Chemical Pretreatments and Prophylactics - Medical"
                                    },
                                    "Description": {
                                        "val": "Develops pretreatments and prophylactics that provide protection against NTAs and emerging chemical threats.  Prophylactic MCMs include catalytic and stoichiometric bioscavengers that rapidly bind and detoxify a broad spectrum of NTAs.\n\nTransferred FY19 NT2 funds to NT3 in FY20\/21 to support more advanced efforts such as the opioid MCMs and 2-PAM BBB delivery efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.841"
                                            },
                                            "Text": {
                                                "val": "- Continued efforts to identify and develop prophylactics for use against selected, priority NTAs, including defining the immunogenicity, circulatory stability, dosing, shelf-life, and delivery of catalytic scavengers. \n- Completed investigation of nanotechnology to support prophylactic countermeasures. \n- Initiated prophylactic proof-of-concept studies of FDA-licensed MCMs against selected agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.717"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts to develop catalytic enzymes for use against selected, priority NTAs.  \n- Continue to explore alternative technologies for prophylaxis to address capability gaps such as immunogenicity, circulatory stability, dosing, shelf-life, and delivery.    \n- Complete evaluation of Food and Drug Administration (FDA) licensed MCMs for potential pretreatment\/prophylaxis against NTAs and emerging chemical threats.  \n- Continue research projects at the ADMET CoE to improve MCM understanding and facilitate development.  \n- Continue new approaches to identify pretreatment and prophylaxis against multiple classes of NTAs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.400"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts to develop catalytic enzymes for use against selected, priority NTAs. \n- Continue expanded pre-clinical studies of lead catalytic scavengers to support future investigative new drug (IND) filing. \n- Continue evaluation of FDA-licensed MCMs for potential pretreatment\/prophylaxis against NTAs and emerging chemical threats. \n- Continue new approaches to identify pretreatment and prophylaxis against multiple classes of NTAs and emerging chemical threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.781"
                                        },
                                        "CurrentYear": {
                                            "val": "22.749"
                                        },
                                        "BudgetYearOne": {
                                            "val": "24.180"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "24.180"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.295"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.085"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.076"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.071"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "73.276"
                        },
                        "CurrentYear": {
                            "val": "70.960"
                        },
                        "BudgetYearOne": {
                            "val": "71.882"
                        },
                        "BudgetYearOneBase": {
                            "val": "71.882"
                        },
                        "BudgetYearTwo": {
                            "val": "76.953"
                        },
                        "BudgetYearThree": {
                            "val": "78.329"
                        },
                        "BudgetYearFour": {
                            "val": "75.839"
                        },
                        "BudgetYearFive": {
                            "val": "75.928"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TM2 provides for applied research for innovative technology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to chemical and biological threat agents.  \n\nIndividual efforts in this project include:\n- Core science efforts in Medical Chemical, Medical Biological, Diagnostics, and Medical Countermeasures.  \n- Supports applied research for the investigation of new medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants, and therapeutic drugs against identified and emerging biological and chemical warfare agents. \n- Medical Science and Technology (S&T) efforts in this Budget Activity refine promising medical initiatives identified in Budget Activity 1, resulting in the development of countermeasures to protect against and treat the effects of exposure to chemical and biological (CB) agents. \n- Diagnostic research focuses on providing high quality data closer to the point-of-need comprising device innovation, panels of biomarkers driven by bioinformatics, and epidemiological modeling tools."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Biosurveillance"
                                    },
                                    "Description": {
                                        "val": "Biosurveillance\/Disease Surveillance: Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems.  Leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools.  The CBDP partners with civil agencies and Department of Defense (DoD) agencies to provide near real-time information and provide situational awareness, yielding analytical and predictive capabilities for DoD decision makers including CCDRs. \n\nThis program is transferring in FY19 to CB2 (Chemical Biological Defense) Threat Surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.804"
                                            },
                                            "Text": {
                                                "val": "- Developed biosurveillance analytic capabilities, including real-time disease forecasting capabilities, novel visualization capabilities, mobile applications, and ecological analytics capability to monitor and map global, near-real-time areas at risk of emerging infectious diseases.\n- Matured efforts that explore utilization of ensemble approaches to disease forecasting. \n- Initiated development of an Integrated Early Warning Ecosystem to provide improved chemical and biological defense situational awareness, a common analytical work bench for users, integration and fusion of a wide array of relevant data sources, and decision support tools for the tactical to strategic level command authorities. Advances gained through development of the Biosurveillance Ecosystem were leveraged for application in the wider Integrated Early Warning domain. \n\nThis effort was funded out of both CB2 (Chemical Biological Defense)\/Biosurveillance and TM2 (Techbase Med Defense)\/Biosurveillance. Efforts in this budget focused on medical and diagnostic data and analytics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Chemical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Focuses on developing state-of-the-art laboratory\/fieldable methods that detect exposure to CWA\/NTA in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker.  \n\nThis effort is transferring in FY19 to TM2 (Techbase Med Defense) Medical Diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.198"
                                            },
                                            "Text": {
                                                "val": "- Completed development of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets for third series of compounds for organophosphate (OP) nerve agents generating butyrylcholinesterase (BChE).\n- Completed the development of confirmatory assays for discovered markers.\n- Initiated assay verification studies and investigations to mature chemical diagnostic assays for use in forward field settings or at point-of-need."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Diagnostic Assays"
                                    },
                                    "Description": {
                                        "val": "Development and verification of rapid, sensitive, and specific tests for the identification of Biological Warfare Agents (BWA) and their expressed pathogens and toxins in clinical specimens from Warfighters for the diagnosis of exposure\/infection.  Discovery of host biomarkers generated in response to exposure to biological threat agents, whether known or emerging.  \n\nThis effort is transferring in FY19 to TM2 (Techbase Med Defense) Medical Diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.266"
                                            },
                                            "Text": {
                                                "val": "- Completed verification studies on integrating identification of antimicrobial\/multi-drug resistance (AMR\/MDR) into future diagnostic systems and initiated preliminary efforts for the development of an integrated or converged platform technology to detect AMR\/MDR at the single molecular level.\n- Completed design studies on the development of vertical flow immunoassays and initiated preliminary efforts for prototype development. \n- Continued to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease. \n- Continued discovery and identification of host response and\/or agent biomarkers including novel antimicrobial resistance and susceptibility markers.\n- Initiated assay development for extremely difficult to detect\/diagnose intracellular pathogens of severe acute systemic febrile illnesses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Next Generation Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Diagnostic device development to include systems able to harness next generation technologies to revolutionize clinical diagnostics in care facilities and in hospital laboratories.  This investment will incorporate capabilities such as next generation sequencing and advanced biomolecular methods to harness both host and pathogen biomarkers in a threat agnostic approach that will serve all echelons of military medical care. \n\nThis effort is transferring in FY19 to TM2 (Techbase Med Defense) Medical Diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.394"
                                            },
                                            "Text": {
                                                "val": "- Completed development of sample preparation techniques\/protocols to enhance clinical diagnostic platforms and initiated independent verification of sequencing techniques\/protocols."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Medical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Investigate medical diagnostics ubiquitous and comprehensive against chemical and biological threats (including NTAs, pharmaceutical-based agents, and toxins) by advancing diagnostic innovations; investigating emerging technologies; ensuring medical diagnostics rapid adaptation to emerging threats; harvesting and synergizing the immense volume of diagnostic data; and aligning medical diagnostics capabilities with the FDA pipeline and larger commercial supply chain."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.150"
                                            },
                                            "Text": {
                                                "val": "- Continue the development of a diagnostic platform to diagnose chemical exposure at the point-of-care.\n- Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease.  Continue discovery and identification of host response and\/or agent biomarkers.\n- Continue assay development for extremely difficult to detect\/diagnose intracellular pathogens of severe acute systemic febrile illnesses. \n- Initiate efforts to exploit gene-editing systems for development of robust diagnostic platforms with reduced cold-chain needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.945"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.945"
                                            },
                                            "Text": {
                                                "val": "- Complete assay development for extremely difficult to detect\/diagnose intracellular pathogens of severe acute systemic febrile illnesses. \n- Continue the development of a diagnostic platform to diagnose chemical exposure at the point-of-care. \n- Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease. \n- Continue discovery and identification of host response and\/or agent biomarkers. \n- Continue efforts to exploit gene-editing systems for development of robust diagnostic platforms with reduced cold-chain needs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters.  This program subsumes TM2 (Techbase Med Defense) Chemical Diagnostics, TM2 (Techbase Med Defense) Diagnostic Assays, and TM2 (Techbase Med Defense) Next Generation Diagnostics in FY19. FY20 funding decrease due to POM reduction."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Viral\/Bacterial\/Toxins Vaccines"
                                    },
                                    "Description": {
                                        "val": "Generate novel or improved vaccines against viral, bacterial and toxin biothreat agents, and demonstrate preliminary efficacy in small animal models.  Develop assays that identify correlates of protective immunity in animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.918"
                                            },
                                            "Text": {
                                                "val": "- Continued qualification\/validation of well-defined animal models of Burkholderia and Q Fever.\n- Continued analysis of T and B cell antigen-based Q Fever vaccine candidates. Initiated manufacturing planning and investigative new drug (IND) enabling studies of OMV or other lead Burkholderia candidates based on results in animal models refined toward Animal Rule Licensure use. \n- Continued down selection of tularemia vaccine candidates based on efficacy in animals for advancement to clinical studies. \n- Demonstrated efficacy of intramuscular multivalent monoclonal antibody cocktail for protection against multiple serotypes of botulinum neurotoxin in relevant animal models.\n- Initiated evaluation potential animal models for medical countermeasure development against broad spectrum of biological toxins, including marine toxins. \n- Continued nonclinical fielding and clinical safety development of a filovirus vaccine against Zaire ebolavirus. \n- Continued comparison of homologous and heterologous prime-boost regimens with filovirus candidates. \n- Continued detailed dissection of the immune response following alphavirus and filovirus vaccination by epitope mapping and B-cell antigen receptor (BCR) antibody repertoire analysis.\n- Continued evaluation of immunogenicity and efficacy of nanoparticle adjuvanted VEEV vaccine and the trivalent WEVEE vaccine in NHP. Initiated development of multiplexed and near-time VEEV infection biomarker assays. \n- Continued to assess MCM capabilities and strategies to defend against emerging and genetically engineered biological warfare (BW) threat agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.663"
                                            },
                                            "Text": {
                                                "val": "- Continue selection of T and B cell antigens for Q Fever vaccine candidates. \n- Continue analysis of candidate Q fever vaccines.  Continue down-selection of subunit tularemia vaccine candidates in animal models.  Continue development of animal models for medical countermeasure development against aerosolized biological toxins including marine toxins.\n- Continue nonclinical efficacy and clinical safety development of candidate vaccines against Marburgvirus.  Evaluate potential for boosting of recombinant vesicular stomatitis virus (rVSV)- based ebolavirus vaccine. \n- Continue detailed immune correlate studies of filovirus vaccines for animal rule licensure including antibody response maturation and passive transfer studies.  \n- Continue improvements to delivery mechanism, immunogenicity, efficacy and manufacturing of VEEV DNA vaccine and the trivalent WEVEE vaccine including animal modeling.  \n- Initiate development of multiplexed VEEV infection biomarker assay.  \n- Continue to assess MCM capabilities and strategies to defend against emerging and genetically engineered bioweapon (BW) threat agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.486"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.486"
                                            },
                                            "Text": {
                                                "val": "- Evaluate Q fever vaccines based on selected T and B cell antigens. \n- Continue development of well-defined animal models for medical countermeasure development against aerosolized biological toxins including marine toxins.\n- Continue development of nanoparticle and other subunit tularemia vaccines. \n- Continue development of Burkholderia and Yersinia vaccines. \n- Continue nonclinical efficacy, safety and manufacturing development of candidate vesicular stomatitis virus (VSV) and DNA vaccines against Marburg virus.\n- Continue improvements to delivery mechanism, immunogenicity, efficacy and manufacturing of VEEV DNA vaccine. \n- Continue qualification\/validation of well-defined animal models for alphaviruses. \n- Continue development of multiplexed VEEV infection biomarker assay and qualification\/validation of VEEV immune assays for clinical and pivotal animal studies. \n- Continue to assess MCM capabilities and strategies to defend against emerging and genetically engineered biological warfare (BW) threat agents"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Vaccine Platforms and Research Tools"
                                    },
                                    "Description": {
                                        "val": "Use novel technology and methods to support development of vaccine candidates.  Conduct studies to determine potential immune interference between lead vaccine candidates, the effect of alternative vaccine delivery methods, and thermo-stabilization technologies on the efficacy of lead vaccine candidates.  Identify correlates of protection in humans, and predict the success of lead vaccine candidates in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.145"
                                            },
                                            "Text": {
                                                "val": "- Initiated construction and evaluation of hybrid alphavirus E1\/E2 antigenic vaccines. \n- Maintained capability and assessed biodefense Burkholderia vaccine candidates in the in vitro biomimetic Modular Immune In-vitro Construct (MIMIC) system.\n- Evaluated production and scale-up of trivalent inactivated alphavirus vaccines.\n- Established and continued organization, of the Human Specimen Archive at USAMRIID. \n- Continued in vivo down selection of next generation TLR agonist adjuvants. \n- Initiated evaluation of hybrid antigenic proteins for use in broad spectrum vaccines for alphaviruses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.087"
                                            },
                                            "Text": {
                                                "val": "- Continue evaluation of multivalent hybrid vaccines: structural analysis and performance in the biomimetic Modular Immune In-vitro Construct (MIMIC) system.  \n- Maintain capability and continue assessment of Burkholderia and Q fever vaccine candidates in the MIMIC system.  \n- Continue MIMIC development for use in evaluation of pulmonary responses to biodefense vaccines.  \n- Complete evaluation of production and scale-up of trivalent inactivated alphavirus vaccines and use of these vaccines to generate new WEVEE monoclonal antibodies (mAbs).  Analyze mAbs for neutralizing activity and map epitopes of strongly neutralizing mAbs.  \n- Sustain the Human Specimen Archive at USAMRIID.  \n- Continue in vivo down selection of next generation Toll Like Receptor agonist adjuvants for use in Q fever and other biodefense vaccines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.108"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.108"
                                            },
                                            "Text": {
                                                "val": "- Continue nonclinical evaluation of hybrid arenavirus and filovirus antigen vaccines in animal models. \n- Continue evaluation of Burkholderia, Q Fever and filovirus vaccines in the biomimetic Modular Immune In-vitro Construct (MIMIC) system. \n- Continue development of inactivated alphavirus vaccine. \n- Qualify\/validate MIMIC for use in evaluation of pulmonary responses to biodefense vaccines Sustain the Human Specimen Archive at USAMRIID. \n- Continue evaluation of next generation adjuvants for use in biodefense vaccines.\n- Continue evaluation of the combined Zaire\/Sudan vaccine platform for filovirus."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Viral Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead candidate therapeutics for efficacy against viral pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.382"
                                            },
                                            "Text": {
                                                "val": "- Continued screening, evaluation and development of novel small molecule inhibitors and monoclonal antibodies effective against filo- and alpha-virus infections in vitro and in vivo. \n- Continued development of small molecule ribonucleoside inhibitors directed against alphaviruses. \n- Initiated development of rodent and non-human primate  alphavirus animal models for evaluation of therapeutic countermeasures.  \n- Continued optimization of broad-spectrum inhibitors of filovirus infection that antagonize the NPC1-GP interaction.\n- Continued studies to enhance Anti-viral Therapy Against Ebola (Zaire), Sudan, Bundibugyo and Marburg Viruses. \n- Continued funding small molecule\/repurposing efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.910"
                                            },
                                            "Text": {
                                                "val": "- Continue screening, evaluation and development of novel small molecule inhibitors and monoclonal antibodies effective against filo- and alpha-virus infections in vitro and in vivo. \n- Continue development of small molecule ribonucleoside viral replication inhibitors directed against alphaviruses.  Develop alphavirus animal models for evaluation of therapeutic countermeasures for use with Animal Rule Guidance by the FDA.  \n- Continue optimization of broad-spectrum inhibitors of filovirus infection that antagonize NPC1-GP interactions.  \n- Continue studies to enhance anti-viral therapies against Ebola (Zaire) and Marburg Viruses.  \n- Continue funding small molecule\/repurposing efforts.  \n- Begin feasibility studies on reducing neuro-inflammation by repurposing existing therapeutics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.895"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.895"
                                            },
                                            "Text": {
                                                "val": "- Continue screening, evaluation and development of novel small molecule inhibitors and monoclonal antibodies effective against filo- and alpha-virus infections in vitro and in vivo. \n- Continue the development of small molecule ribonucleoside viral replication inhibitors directed against alphaviruses. \n- Continue development of rodent and non-human primate alphavirus animal models for evaluation of therapeutic countermeasures for use with Animal Rule Guidance by the FDA.\n- Continue optimization of broad-spectrum inhibitors of filovirus infection that antagonize NPC1-GP interactions.\n- Continue studies to enhance anti-viral therapies against Ebola (Zaire, Sudan, Bundibugyo), and Marburg Viruses. \n- Continue funding small molecule\/repurposing efforts. \n- Continue feasibility studies on reducing neuro-inflammation by repurposing existing therapeutics. Test feasibility of hemofiltration for treatment of cytokine induced shock from filoviral infection and bacterial-induced sepsis. \n- Continue discovery and early development of novel monoclonal antibodies from survivors to alphavirus and arenavirus infections."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Bacterial Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead therapeutic candidates effective against designated bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.122"
                                            },
                                            "Text": {
                                                "val": "- Continued the discovery and advancement of non-traditional, as well as traditional, strategies to diversify approaches to identify lead therapeutic candidates against bacterial infection.\n- Continued evaluation of FDA approved and mid to late stage therapeutics for activity against wildtype and multi-drug resistant (MDR) Francisella tularensis, Bacillus anthracis, Yersinia pestis, and Burkholderia species. \n- Continued to evaluate reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.933"
                                            },
                                            "Text": {
                                                "val": "- Continue the discovery and advancement of novel, non-traditional, as well as traditional, strategies to diversify approaches to identify lead therapeutic candidates against bacterial infection.  \n- Continue evaluation of FDA approved and mid to late stage therapeutics for activity against wild-type and MDR Francisella tularensis, Bacillus anthracis, Yersinia pestis, and Burkholderia species.  \n- Complete evaluation of reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.379"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.379"
                                            },
                                            "Text": {
                                                "val": "- Continue the discovery and advancement of novel, non-traditional, as well as traditional, strategies to diversify approaches to identify lead therapeutic candidates against bacterial infection.\n- Initiate evaluation of the potential of antibody and derivatives to treat intracellular bacterial infection.\n- Continue evaluation of FDA approved and mid to late stage therapeutics for activity against wild-type and MDR Francisella tularensis, Bacillus anthracis, Yersinia pestis, and Burkholderia species."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters.  FY20 funding increase due to multiple ongoing projects in discovery and new awards (begin ramping up in FY19)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Toxin Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate therapeutic candidates that are effective against biological toxin agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.958"
                                            },
                                            "Text": {
                                                "val": "- Continued evaluation of adjunctive IGF-1 for treatment post BoNT A intoxication. \n- Initiated studies to assess targeted monoclonal antibody approaches to deactivate BoNT within the neuromuscular junction. \n- Initiated evaluations of small molecules to enhance neurotransmitter release within the nerve terminal.\n- Explored repurposing efforts for small molecule therapeutics already approved for orphan indications within the EU."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.156"
                                            },
                                            "Text": {
                                                "val": "- Develop single domain monoclonal antibody in small animal studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.319"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.319"
                                            },
                                            "Text": {
                                                "val": "- Continue development of a scMAb (single chain monoclonal antibody) which is capable of entering the neuromuscular junction in an attempt to abrogate BoNT intoxication."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Chemical Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Focuses on therapeutic strategies to effectively minimize injuries resulting from exposure to CWAs. This effort involves the development of neuroprotectants, anticonvulsants, improved therapies for enzyme reactivation, and investigation of alternate pathways leading to treatment. This effort also includes discovery and development of therapeutic strategies to treat dermal, ocular and respiratory injuries of CWAs. Efforts in this area are designed to develop potential candidates that will ultimately be submitted for Food and Drug Administration (FDA) licensure or to identify previously licensed products for new uses in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.553"
                                            },
                                            "Text": {
                                                "val": "- Continued to synthesize and screen broad spectrum reactivators.\n- Continued to develop computational capabilities using molecular dynamics to predict compound ability to penetrate the blood brain barrier (BBB). Identified a novel acetylcholinesterase reactivator candidate that penetrates the BBB to provide therapeutic efficacy in the brain. \n- Continued to explore alternate modes of drug encapsulation for delivery across the BBB. \n- Continued the development of animal models for operationally relevant threat agent exposure and medical countermeasure efficacy. Screened approximately 35 compounds as potential therapeutic agent decontaminants for use on skin and in wounds; down-selected to nine compounds for further research.\n- Initiated development effort of therapeutic Medical Countermeasures (MCM) to treat sulfur mustard induced pulmonary damage using a rodent model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.512"
                                            },
                                            "Text": {
                                                "val": "- Continue supporting validation and characterization of therapeutics for: 1) an improved broad spectrum oxime; 2) compounds effective in the brain for enhanced neuroprotection and 3) compounds effective in the brain for enhanced survival.\n- Continue exploring technologies for delivery of therapeutics to the brain crossing the Blood Brain Barrier (BBB). \n- Continue supporting development and screening for broad spectrum cholinesterase reactivators that work in the brain.\n- Continue development of animal models for operationally relevant threat agent exposure and medical countermeasure efficacy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.213"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.213"
                                            },
                                            "Text": {
                                                "val": "- Continue validation and characterization of therapeutics for: 1) an improved broad spectrum oxime-based reactivator and 2) compounds effective in the brain for enhanced neuroprotection and\/or increased survival. \n- Continue exploring technologies for delivery of therapeutics to the brain (crossing the BBB).\n- Continue development of current and screening for novel broad spectrum cholinesterase reactivators that are effective in the brain. \n- Continue development of animal models for operationally relevant threat agent exposure and medical countermeasure efficacy.\n- Continue efforts to explore safety and efficacy of down-selected therapeutic decontaminants. \n- Continue efforts to develop therapeutic medical countermeasures to treat mustard agent pulmonary injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Pretreatments and Prophylactics, Nerve Agents"
                                    },
                                    "Description": {
                                        "val": "Develop pretreatments and prophylactics that provide protection against chemical warfare agents, including organophosphorus nerve agents (OPNA), such as stoichiometric and catalytic scavengers and other entities that rapidly bind and detoxify a broad spectrum of agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.536"
                                            },
                                            "Text": {
                                                "val": "- Terminated preclinical studies for adeno-associated-virus-expressed Butyrylcholinesterase (BuChE) due to adverse events during animal studies.\n- Initiated effort to develop capability for rapid development of medical countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.549"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts developing prophylactic and pretreatment medical countermeasures. \n- Continue development of animal models for operationally relevant exposures to better support development of pretreatment and prophylactic MCMs and MCM concepts of use including post-exposure pre-symptomatic applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.537"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.537"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts to develop capability for rapid development of medical countermeasures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "92.231"
                                        },
                                        "CurrentYear": {
                                            "val": "88.188"
                                        },
                                        "BudgetYearOne": {
                                            "val": "120.526"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "120.526"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "128.035"
                                        },
                                        "BudgetYearThree": {
                                            "val": "127.992"
                                        },
                                        "BudgetYearFour": {
                                            "val": "122.006"
                                        },
                                        "BudgetYearFive": {
                                            "val": "122.553"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "71.070"
                                        },
                                        "CurrentYear": {
                                            "val": "65.209"
                                        },
                                        "BudgetYearOne": {
                                            "val": "48.166"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "48.166"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "75.343"
                                        },
                                        "BudgetYearThree": {
                                            "val": "70.991"
                                        },
                                        "BudgetYearFour": {
                                            "val": "78.526"
                                        },
                                        "BudgetYearFive": {
                                            "val": "73.550"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.666"
                                        },
                                        "CurrentYear": {
                                            "val": "2.388"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "7.054"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "130.240"
                                        },
                                        "CurrentYear": {
                                            "val": "117.331"
                                        },
                                        "BudgetYearOne": {
                                            "val": "119.227"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "119.227"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "97.501"
                                        },
                                        "BudgetYearThree": {
                                            "val": "71.221"
                                        },
                                        "BudgetYearFour": {
                                            "val": "78.435"
                                        },
                                        "BudgetYearFive": {
                                            "val": "82.815"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "58.419"
                                        },
                                        "CurrentYear": {
                                            "val": "57.545"
                                        },
                                        "BudgetYearOne": {
                                            "val": "62.051"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "62.051"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "64.331"
                                        },
                                        "BudgetYearThree": {
                                            "val": "56.641"
                                        },
                                        "BudgetYearFour": {
                                            "val": "28.559"
                                        },
                                        "BudgetYearFive": {
                                            "val": "26.976"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.195"
                                        },
                                        "CurrentYear": {
                                            "val": "9.021"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.720"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.720"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.365"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.887"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.179"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.552"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}