{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-10",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603118A"
        },
        "ProgramElementTitle": {
            "val": "Soldier Lethality Advanced Technology"
        },
        "R1LineNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "118.468"
            },
            "BudgetYearOneBase": {
                "val": "118.468"
            },
            "BudgetYearTwo": {
                "val": "109.968"
            },
            "BudgetYearThree": {
                "val": "107.394"
            },
            "BudgetYearFour": {
                "val": "103.007"
            },
            "BudgetYearFive": {
                "val": "101.772"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "540.609"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) was previously funded, with continuity of effort realigned from the following PEs:\n* 0603001A Warfighter Advanced Technology\n* 0603004A Weapons and Munitions Advanced Technology\n* 0603015A Next Generation Training & Simulation Systems\n* 0603606A Landmine Warfare and Barrier Advanced Technology\n* 0603607A Joint Service Small Arms Program\n* 0603710A Night Vision Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures and demonstrates Soldier Lethality technologies that improve Soldier operational performance by increasing lethality, mobility, protection, and optimizing situational awareness across the spectrum of operating environments and missions. This PE matures Soldier weapons and enabling components\/subsystems, demonstrates lethal weapons systems with potential to provide greater lethality, target acquisition, fire control, and range at a significantly reduced weight for optimized Soldier and Small Unit system performance. The major focus areas for Soldier Lethality S&T are Soldier weapons and ammunition technologies, protection technologies, cognitive and physical performance measures, training in synthetic training environments, and mission support capabilities such as situational awareness sensors and displays, dismounted power and energy technologies, and Soldier and Small Unit sustainment capabilities. This technology diverse PE also matures and demonstrates sensor technologies that increase Warfighter situational understanding, survivability, and lethality by providing sensor capabilities to acquire and engage all targets and threats at longer ranges in complex environments and operational conditions (e.g. day\/night, obscured, smoke, adverse weather, and other degraded visual environments), and for advancing live training technologies that accurately replicate and realistically represent the effects of current and future weapons systems during force-on-force and force-on-target training. This PE matures and demonstrates effective technology in personal combat clothing, protective equipment such as personal armor, helmets, and eyewear, combat rations, shelters, logistical support items for aerial delivery of personnel and cargo, and energy systems to power current and emerging Soldier-born ISR, sensor, optical, and communication systems with the least weight and sustainment burden on the Soldiers and Small Combat Units. This PE matures and demonstrates technologies supporting the Army's Synthetic Training Environment (STE), a single, interconnected synthetic training system that will enable Army units and leaders to conduct realistic multi-echelon \/ multi-domain combined arms maneuver and mission command training, increasing proficiency through repetition. A specific research thrust area is applying systems-based practices to mature and demonstrate scientific and tailored knowledge of Soldiers' physical and cognitive architecture to facilitate rapid and efficient designs, assessments and trade-off analyses of technology insertions on the Soldier. Significant S&T investments are directed to improve the effectiveness of the technologies a Soldier utilizes while reducing the size and weight of the form factor of the equipment. \n\nWork in this PE complements PE 0602143A-Soldier Lethality Technology.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in Support of the National Defense Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "118.468"
                },
                "BudgetYearOneBase": {
                    "val": "118.468"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "118.468"
                },
                "BudgetYearOneBase": {
                    "val": "118.468"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "118.468"
                                },
                                "BudgetYearOneBase": {
                                    "val": "118.468"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020 funding reflects a strategic financial restructure of the Science and Technology portfolio in support of Army Modernization Priorities. Efforts in this PE were previously funded in other PEs as noted above."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AY5"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Squad Small Arms Armaments Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "8"
                        },
                        "BudgetYearOneBase": {
                            "val": "8"
                        },
                        "BudgetYearTwo": {
                            "val": "6.5"
                        },
                        "BudgetYearThree": {
                            "val": "6.5"
                        },
                        "BudgetYearFour": {
                            "val": "6.374"
                        },
                        "BudgetYearFive": {
                            "val": "6.446"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "33.820"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603607A Joint Service Small Arms Program, Project:\n* 627 Joint Service Small Arms Program (JSSAP)"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project demonstrates individual and crew-served weapon designs and technologies that enhance the fighting capabilities and survivability of the dismounted Warfighter in support of the Army's Soldier Lethality Modernization priority and all of the Services. All work is led by the Joint Service Small Arms Program (JSSAP) and is based upon the Joint Service Small Arms Master Plan (JSSAMP) and the Joint Capabilities Integration Development System's Small Arms Analyses.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nThis effort complements work done in 0602143A (Soldier Lethality Technology) \/ AY6 (Soldier Squad Small Arms Armaments Technology).\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Squad Small Arms Armaments Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the next generation Family of Ammunition by optimizing small arms ammunition and weapon system technologies for integration into live fire demonstrations.  It refines weapon system integration and supports the Joint Warfighter?s small arms capability needs. Validates small arms weapon system technology readiness levels and confidence of design functionality in advanced operating scenarios."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8"
                                            },
                                            "Text": {
                                                "val": "Will mature the technologies for the Next Generation Family of Ammunition (NGFoA) Advanced Armor Piercing (ADVAP) round to technology readiness level (TRL) 6, System\/subsystem model or prototype demonstration in a relevant environment, to ensure optimal performance against hard and soft targets; mature and demonstrate Joint Remote Weapon Station technologies and optimize Advanced Weapon Operating Technologies for Technology Insertions into emerging systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ Project AY5 was previously PE 0603607A \/ Project 627 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AY7"
                    },
                    "ProjectTitle": {
                        "val": "Small Arms Fire Control Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "12.88"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.88"
                        },
                        "BudgetYearTwo": {
                            "val": "13.468"
                        },
                        "BudgetYearThree": {
                            "val": "13.032"
                        },
                        "BudgetYearFour": {
                            "val": "1.5"
                        },
                        "BudgetYearFive": {
                            "val": "1.517"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "42.397"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603710A Night Vision Advanced Technology, Project:\n* K70 Night Vision Advanced Technology\nPE 0603004A Weapons and Munitions Advanced Technology, Project:\n* 232 Advanced Lethality & Survivability Demonstration"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates fire control and targeting sensor technologies and techniques to improve targeting and lethality in order to maintain overmatch at longer ranges in all operational environments and to meet the capability needs of Army Science and Technology Soldier Lethality, Next Generation Combat Vehicle, and Long Range Precision Fires modernization priorities.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThis effort complements work done in 0602143A (Soldier Lethality Technology) \/ AY8 (Small Arms Fire Control Technology).\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Squad Small Arms Armaments Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort will mature and demonstrate fire control and targeting sensor technologies and techniques to improve targeting and lethality, and maintain overmatch at longer ranges in all environments. This effort is coordinated with PE 0602143A, 0602145A, 0603462A, and 0603463A."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.88"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.88"
                                            },
                                            "Text": {
                                                "val": "Will mature and configure modular, multispectral, digital weapon sensor technologies and modalities; optimize identification range and integrate with lighter weight payload; optimize design of multifunction sensor system for fire support and dismounted Scout Operations; optimize illuminator and designator laser source; and mature image processing approaches."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work in PE 0603118\/ Project AY7 was previously PE 0603710\/K70 in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AY9"
                    },
                    "ProjectTitle": {
                        "val": "Body Armor & Integrated Headborne Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "14.809"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.809"
                        },
                        "BudgetYearTwo": {
                            "val": "8.512"
                        },
                        "BudgetYearThree": {
                            "val": "5.819"
                        },
                        "BudgetYearFour": {
                            "val": "5.935"
                        },
                        "BudgetYearFive": {
                            "val": "6.001"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "41.076"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tFF6 Individual Protection"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates body armor weight reductions and improves the performance of personal protection and survivability equipment. It also demonstrates combat helmet ballistic, blast, and small arms protection performance enhancements and the integration and optimization of power, energy, and digital sensor and display headborne technologies.\n\nThis effort supports Force Protection capability demonstrations for Soldiers and Small Units and demonstrated technologies from this effort transition to various Program Executive Office (PEO) Soldier programs. This effort complements work done in PE 0602143A (Soldier Lethality Technology) \/ AZ2 (Body Armor & Integrated Headborne Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Body Armor & Integrated Headborne Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturing, integrating and demonstrating personal protective capabilities against ballistic, blast and directed energy threats as well as the development and demonstration of Soldier worn platform architectures to optimize the integration of personal protective equipment and Soldier lethality enabling technologies. Demonstrates advanced test methods to validate personal protective equipment performance enhancements against current and emerging small arms, fragmentation and blast threats from anti-personnel munitions. The objective of these technology development efforts is to significantly increase Soldier lethality by enhancing the protective capabilities and reducing sub-system and system level weight of individual protective equipment to reduce the Soldier burden and increase survivability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.809"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.809"
                                            },
                                            "Text": {
                                                "val": "Will mature combat helmet forming processes to enhance protective performance by integrating state of the art, high performance polyethylene materials; exploit hybridized material configurations and architectures to demonstrate a combat helmet with lower weight small arms protective capability; demonstrate a real time ballistic helmet test methodology to improve behind-helmet blunt trauma measurement capabilities and provide performance data for correlation to emerging head\/brain injury criteria to inform future combat helmets requirements; integrate hearing and eyewear protection findings onto optimized platforms to enhance individual Soldier hearing protection and maximize operational situational awareness; optimize and mature head-borne shock tube test methodology as a means to improve blast-over pressure profiles that can be correlated to operational blast environment conditions; exploit existing and developmental ballistic resistant materials in new system architectures to provide vital torso region protection against emerging, near peer, small arms threats to provide near term performance trade space analysis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A\/ Project AY9 was previously PE 0603001A\/ Project FF6 in FY19. Funding has been realigned to reflect the financial restructure. PE 0603118A\/AY9 is not a new start in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AZ6"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Signature Management Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.711"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.711"
                        },
                        "BudgetYearTwo": {
                            "val": "1.745"
                        },
                        "BudgetYearThree": {
                            "val": "1.78"
                        },
                        "BudgetYearFour": {
                            "val": "1.816"
                        },
                        "BudgetYearFive": {
                            "val": "1.836"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.888"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tFF6 Individual Protection"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project optimizes, matures and demonstrates advances novel materials, technologies, techniques and applications increasing the capabilities of camouflage and concealment against known and emerging sensor threats, providing effective deception capabilities, as well as combinations of physical and electronic signature decoy components and maturing analytical processes for modeling performance of signature management technologies during multi-domain operations. These technologies will produce demonstrator proof of concept systems that decrease the probability of detection and targeting by peer and near-peer adversaries, enabling freedom of movement of semi-independent and dispersed formations and increased protection of high-valued assets. Demonstrations conducted under this Project will support S&T efforts in Soldier Lethality protection\/survivability Projects to provide disruptive Camouflage, Concealment and Deception technologies to the Operational Army, supporting expeditionary maneuver in the Multi-Domain Battle Environment to open and retain windows of advantage.\n\nWork in this Project supports key Army needs and leverages\/complements the technical research of several PEs to include 0602143\/BB4, Dismounted Soldier Survivability Materials, 0602143\/AZ5, Soldier-Borne Advanced Protection Materials, 0602143\/BE1 Support Technology to Mission Command, 0602143A\/AZ9, Soldier-Small Unit Protection Technology Detectability, 0601102A, Defense Science Research, and 0602712\/H35 Camouflage and Counter-Recon Tech.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Camouflage, Concealment and Decoys Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates innovative camouflage, concealment and deception technologies for the dismounted Soldier to defeat advanced current and emerging adversary Intelligence, Surveillance and Reconnaissance (ISR) threats and to reduce the probability of detection, identification across the electromagnetic spectrum. Matures physics-based models for material and system performance that support probability of detection metrics in the multi-domain operational environment, assisting in closing the capability gap between current camouflage, concealment and deception technologies and defeating enemy sensorial capabilities in future operating environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.711"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.711"
                                            },
                                            "Text": {
                                                "val": "Will improve coatings and overgarment clothing for Soldier clothing and individual equipment that reduces the probability of Soldier detection from thermal sensors; mature topical applications to conceal exposed skin (i.e. face, hands) from thermal sensors; demonstrate performance of advanced textile printing that imparts multiple functionalities to include durable camouflage patterns to clothing and individual equipment from visual and thermal sensors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ Project AZ6 was previously PE 0603001A\/ Project FF6 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AZ8"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Squad Small Arms Armaments Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.175"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.175"
                        },
                        "BudgetYearTwo": {
                            "val": "3"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.175"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tFF6 Individual Protection"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project optimizes, matures and demonstrates novel materials, technologies, techniques and applications that increase camouflage and concealment capabilities for high-value assets against known and emerging sensor threats, provide effective deception capabilities, mature analytical processes for modeling performance of signature management technologies during multi-domain operations as well as developing combinations of physical and electronic signature decoy components. These technologies will produce proof of concept system demonstrators that decrease the probability of detection and targeting by peer and near-peer adversaries, enabling freedom of movement of semi-independent and dispersed formations and increased protection of high-valued assets. Demonstrations conducted under this project will support S&T efforts in Soldier Lethality protection\/survivability projects to provide disruptive Camouflage, Concealment and Deception technologies to the Operational Army, supporting expeditionary maneuver in the Multi-Domain Battle Environment to open and retain windows of advantage.\n\nWork in this Project supports key Army needs and leverages\/complements the technical research of several PEs to include 0601102A, Defense Science Research,0602143\/BB4, Dismounted Soldier Survivability Materials, 0602143\/AZ5, Soldier-Borne Advanced Protection Materials, 0602143\/BE1 Support Technology to Mission Command, 0602143A\/AZ9, Soldier-Small Unit Protection Technology Detectability, and 0602712\/H35 Camouflage and Counter-Recon Tech.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High-Value Asset Camouflage, Concealment and Decoys Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates innovative camouflage, concealment and deception technologies for high-value assets to defeat advanced current and emerging adversary Intelligence, Surveillance and Reconnaissance (ISR) threats, including multispectral, hyperspectral and Light Detection and Ranging (LiDAR) sensors, and to reduce the probability of detection in multi-domain operations. Matures physics-based models for material and system performance that support probability of detection metrics in the multi-domain operational environment, assisting in closing the capability gap between current camouflage, concealment and deception technologies and defeating enemy sensorial capabilities in future operating environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.175"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.175"
                                            },
                                            "Text": {
                                                "val": "Will mature the performance of advanced camouflage laminate and textile systems and decoy technology on high value assets (i.e. mission command platforms, battle management centers); mature and demonstrate integrated signature management technologies for high-valued assets to improve effectiveness against visual and thermal sensors to enable expeditionary maneuver and mission command during multi-domain operations and to increase survivability of friendly forces while retaining combat power and resilient formations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A\/ Project AZ8 was previously PE 0603001A\/ Project FF6 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB3"
                    },
                    "ProjectTitle": {
                        "val": "Dismounted Soldier Survivability Equip\/Tech Integ"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.466"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.466"
                        },
                        "BudgetYearTwo": {
                            "val": "1.02"
                        },
                        "BudgetYearThree": {
                            "val": "2.748"
                        },
                        "BudgetYearFour": {
                            "val": "2.803"
                        },
                        "BudgetYearFive": {
                            "val": "2.834"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.871"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tFF6 Individual Protection"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates the integration of Soldier survivability materials and technologies to increase the speed and efficiency of dismounted Soldier movement and maneuver. This Project focuses on reducing Soldier worn equipment weight, improving Soldier and system integration and reduce the dismounted Soldier's detectability, susceptibility and vulnerability to operational threats. Operational threats are characterized as combat threats (e.g. flame and thermal, blast and ballistic, multispectral sensors, and laser threats), environmental threats (e.g. cold, heat, wet, vector, water contamination, concealment, antimicrobial, etc.), and Soldier system components and system limitations (e.g. size, weight, and bulk). This effort includes the demonstration and validation of integrated technologies, novel subsystems\/systems, and test methods.\n\nThis effort complements work done in 0602143A (Soldier Lethality Technology) \/ Project BB4 (Dismounted Soldier Survivability Materials).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Survivability Equipment and Technology Integration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and integrates multifunctional protective materials, sub-components and systems for field demonstrations to significantly increase the survivability of the Soldier through their multi-functional clothing and individual protective equipment. This effort also demonstrates and validates tradeoff analyses in sub-component and system level designs of ballistic, blast, signature management and integrated protection clothing and equipment technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.466"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.466"
                                            },
                                            "Text": {
                                                "val": "Will optimize integration opportunities of Soldier individual protective and loadbearing equipment to realize near term system level weight reduction; demonstrate 3D woven and knit garments for cold weather applications to reduce the bulk and weight of the extreme climate protective ensemble; demonstrate operational benefit of advanced textile printing capabilities at the sub-system and system level for individual equipment that can impart multiple functionalities (e.g. signature management, vector protection, flame resistance, etc.) in a single, more cost-effective process and more durable capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ Project BB3 was previously funded in PE 0603001A \/ Project FF6."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB6"
                    },
                    "ProjectTitle": {
                        "val": "Physical Augmentation: Adv Tech for Field Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4"
                        },
                        "BudgetYearOneBase": {
                            "val": "4"
                        },
                        "BudgetYearTwo": {
                            "val": "4"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tJ50 Future Warrior Technology Integration"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates human augmentation technologies for enhanced Soldier mobility & lethality to provide an advantage over adversaries during close combat and infantry tasks. This will be achieved by demonstrating and validating operationally ready physical augmentation systems that meet the mission requirements by optimizing movement & maneuver and logistics sustainment task performance. \n\nWork in this Project leverages research of PEs including PE 0602143A (BC2, BB9 and BC5) and PE 0603118A (BC1, BB5 & BB8). Additionally, work in this Project complements and is coordinated with Military Research and Materiel Command and the Veteran Administration's exoskeleton research area. This Project is also coordinated with work performed across the DoD under the Reliance 21 Human Systems Community of Interest: Protection, Sustainment, and Warfighter Performance.\n\nResults of these efforts may transition to the Program Executive Office (PEO) Soldier, Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Wearable Assistive Devices Advanced Technology for Feld Demo"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates wearable physical augmentation devices to validate Soldier metrics such as endurance, survivability, speed, and strength, as well as system metrics such as power consumption and duration, actuator and controller performance, and integration with Soldier clothing and individual equipment (CIE). Results will demonstrate if the Army will benefit from leveraging industry investments and determine if these systems enhance Soldier mobility and lethality in operational environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Will conduct representative operational field demonstrations and augmentation\/assist devices integration with Soldier CIE to measure operational and physical impacts of augmentation systems and the applicability in military environments; conduct manufacturing and industrial design analyses to measure key augmentation metrics (e.g. power usage and duration, system weight, performance in military relevant environment, and integration with CIE) and physiological impacts to Soldiers using established human performance methodologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A\/ Project BB6 was previously PE 0603001A\/ Project J50 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB8"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Centric Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "7.797"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.797"
                        },
                        "BudgetYearTwo": {
                            "val": "7.336"
                        },
                        "BudgetYearThree": {
                            "val": "7.406"
                        },
                        "BudgetYearFour": {
                            "val": "8.413"
                        },
                        "BudgetYearFive": {
                            "val": "5.951"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "36.903"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tJ50 Future Warrior Technology Integration"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project will demonstrate optimized Warfighting function (e.g. shoot, move, perceive, decide, and communicate) with technologies, systems and\/or subsystems designed to augment Soldier ability during missions. This Project capitalizes on operational partnerships by providing Science and Engineering subject matter experts (SMEs) the ability to assist Commanders in course of action development for potential near term solutions and condition setting for mid\/far term science objectives. Provides Soldier touch points to optimize, improve performance, validate and integrate technologies and methodologies with users. Research focuses on the Warfighter as the capability and will rapidly iterate user driven solutions that maximize their tactical performance.\n\nThis PE is fully coordinated across PE 0602143A and PE 0603118A in the human sciences, as well as work conducted by Medical Research & Materiel Command (MRMC), Army Research Institute (ARI), U.S. Military Academy (USMA), and other academic and industry partners. This work is in partnership with Forces Command (FORSCOM) operational units and the appropriate Training and Doctrine Command (TRADOC) organizations as well as established transition partners, including Army Test and Evaluation Command (ATEC) & Program Executive Office- Soldier (PEO-S).\n\nWork in this Project complements and is fully coordinated with Military Research and Materiel Command under the Military Operational Medicine Research Program as well as Defense Medical Research and Development Program under Military Operational Medicine (JPC-5). This project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Systems Interfaces & Cognitive Processes and Protection, Sustainment, and Warfighter Performance.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Unit Partnership and Soldier Touch Point"
                                    },
                                    "Description": {
                                        "val": "This effort optimizes innovation through S&T touch points with the Operational force, resulting in rapid iteration, concept maturation, integration, validation of laboratory findings, and transition of technologies and methodologies in response to operational unit demand signal. This effort streamlines demonstration, data collection, and technology maturation for near term Doctrine, Organization, Training and Education, Materiel, Leadership, Personnel, and Facilities (DOTMLPF) solutions, enabling faster delivery of materiel and non-materiel products\/knowledge refined with direct Soldier input. This body of work allows validated, empirical, assessment of any equipment capability or training intervention as part of the Soldier architecture to inform future acquisition investments, training, and operational trade space decisions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.797"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.797"
                                            },
                                            "Text": {
                                                "val": "Will conduct operational user group field demonstration to validate the integration of technologies\/methods that maximize the Warfighter?s physical and cognitive performance; conduct large scale field studies in coordination with operational units on mission essential tasks in a realistic, constructive tactical environment employing a cross-assessment of variables such as lightweight equipment, situational awareness tools, sleep, nutrition, human augmentation for load carriage, etc. These assessments will inform multiple training\/education and materiel solutions designed to maximize the tactical performance to overcome Soldier limitations in order to achieve overmatch."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A\/ Project BB8 was previously PE 0603001A\/J50 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC1"
                    },
                    "ProjectTitle": {
                        "val": "Human Performance AdvTech for Mobility & Lethality"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.832"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.832"
                        },
                        "BudgetYearTwo": {
                            "val": "5.72"
                        },
                        "BudgetYearThree": {
                            "val": "6.776"
                        },
                        "BudgetYearFour": {
                            "val": "2.129"
                        },
                        "BudgetYearFive": {
                            "val": "2.066"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.523"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tJ50 Future Warrior Technology Integration"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures technologies, methodologies, and human performance models to demonstrate increased mobility & lethality of the individual and small unit to achieve overmatch. It validates and integrates human performance assessment methods and algorithms into training\/education, test and evaluation methodologies, and materiel solutions to compare performance impacts between different materiel and non-materiel solutions to maximize the individual Warfighter and small unit. These methods and algorithms have potential to enable the development of aspects of DOTMLPF (doctrine, organization, training, materiel, leadership and education, personnel and facilities) improvements and efficiencies. \n\nThis work is directly supported by PE 62143\/BC2 (Next Generation Mobility & Lethality Technology for Warfighters) and BB9 (Human Performance Technology for Mobility & Lethality). It is fully coordinated and complementary to PE 63118\/ BB8 (Soldier Centric Advanced Technology).\n\nWork in this Project complements and is fully coordinated with Medical Research and Materiel Command under the Military Operational Medicine Research Program as well as Defense Medical Research and Development Program under Military Operational Medicine (JPC-5) and the Army Research Laboratory (ARL). This project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Systems Interfaces & Cognitive Processes and Protection, Sustainment, and Warfighter Performance.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier\/Squad Performance Metrics for Lethality"
                                    },
                                    "Description": {
                                        "val": "This effort validates and matures technologies, methodologies, and human performance models to demonstrate increased Soldier and Small Unit mobility & lethality to achieve overmatch. The effort validates and integrates human performance sensors, models, and design guidance into training\/education, test and evaluation, and materiel. The results of this work will allow the Army to develop equipment, systems and training devices that maximize the close combat Soldier and small unit performance in multi-domain operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.832"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.832"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate the performance impacts of biometric Soldier readiness information portrayed to small units via dismounted mission command platforms; demonstrate an enhanced small unit tactical decision making process with measurable and actionable information to maximize physical and cognitive readiness levels; mature and demonstrate assessment tools and methodologies for operational test and evaluation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ Project BC1 was previously PE 0603001A \/ Project J50 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC4"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Decision Making&Comms Performance AdvTech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2"
                        },
                        "BudgetYearOneBase": {
                            "val": "2"
                        },
                        "BudgetYearTwo": {
                            "val": "2"
                        },
                        "BudgetYearThree": {
                            "val": "2.04"
                        },
                        "BudgetYearFour": {
                            "val": "2.081"
                        },
                        "BudgetYearFive": {
                            "val": "2.105"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.226"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603015A Next Generation Training & Simulation Systems, Projects:\n*\tS31 Modeling And Simulation Infrastructure Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project integrates research, theory and applied operations to maximize effectiveness of Soldiers and their equipment. Efforts in this Project support early application of Human Systems Integration (HSI) by translating research findings into performance-based design criteria for use in the Army's requirements definition process and materiel acquisition process for Army Modernization. Application of this work will yield reduced workload, fewer errors, reduced task times, enhanced Soldier protection, user acceptance, and allow the Soldier to extract maximum performance from the equipment. Major efforts address Soldier cognitive load and cognitive fusion research, advanced aircraft design to include flight in degraded visual environments, and development of human performance measures and methods to address current and future human system integration challenges. Individual efforts exploit adaptive learning methods and strategies, applied methods to accelerate expertise development, integration of displays for ease of use and optimized situational awareness, and development of technical frameworks for crew automation integration in Command and Control Systems (C2). Efforts also support flight crew decision-aiding and autonomy, advanced crew station design for aircraft, full mission operations in degraded visual environments, and advanced manned-unmanned teaming concepts.\n\nResults of these efforts are transitioned to the Program Executive Offices (PEO), Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC). This effort complements work done in PE 0602143A Soldier Lethality Technology, Project BC3 Soldier Decision Making & Communications Performance Technology.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Early Human System Integration Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort will provide early front end analysis and assessment for Human System Integration (HSI) in Army systems acquisition to influence specifications and design.  Research findings will translate into performance-based design standards for use in the Army's requirements definition process and materiel acquisition process."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will provide a technical framework, knowledge products that identify candidate technologies for degraded visual environments (DVE) mitigation, and summaries of HSI work to support the Future Vertical Lift material solution analysis and Milestone A, as well as recommendations to the Fires Center of Excellence for M-SHORAD and the Integrated Air and Missile Defense (IAMD) program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603015A \/ Project S31 has been realigned to PE 0603118A \/ Project BC4 for FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC8"
                    },
                    "ProjectTitle": {
                        "val": "Training Advanced Technology (Other than STE)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.335"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.335"
                        },
                        "BudgetYearTwo": {
                            "val": "3.011"
                        },
                        "BudgetYearThree": {
                            "val": "3.034"
                        },
                        "BudgetYearFour": {
                            "val": "1.156"
                        },
                        "BudgetYearFive": {
                            "val": "1.158"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.694"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603115A Next Generation Training & Simulation Systems, Projects:\n*\tS29 Modeling & Simulation - Advanced Technology Development\n*\tS31 Modeling And Simulation Infrastructure Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced live training technologies in support of the Army's need for live simulations that accurately replicate and realistically represent the effects of current and future weapons systems during force-on-force and force-on-target training.\n\nThis effort complements work done in 0602143A Soldier Lethality Technology, Project BC7 Training Technology (Other than Synthetic Training Environment (STE)).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Live Training Technology Applications"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technology to enhance the fidelity of live training systems and develops future live training capabilities for conducting force-on-force, combined arms exercises to enhance readiness at Army home stations and Combat Training Centers."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.335"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.335"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate integrated software and hardware components such as artificial intelligence algorithms to aid in target recognition, weapon modeling, next generation magnetometers, high resolution three dimensional terrain, and weapon orientation sensors to enhance live training technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ Project BC8 was previously PE 0603018 \/ Projects S29 and S31 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC9"
                    },
                    "ProjectTitle": {
                        "val": "Adv Soldier Sensors\/Displays AdvTech for Dismounts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "13.659"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.659"
                        },
                        "BudgetYearTwo": {
                            "val": "15.403"
                        },
                        "BudgetYearThree": {
                            "val": "20.716"
                        },
                        "BudgetYearFour": {
                            "val": "28.498"
                        },
                        "BudgetYearFive": {
                            "val": "28.815"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "107.091"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603606A Landmine Warfare and Barrier Advanced Technology, Projects:\n*\t608 Countermine & Bar Development\nPE 0603710A Night Vision Advanced Technology, Projects:\n*\tK70 Night Vision Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, optimizes, and demonstrates fully digital sensor systems, architectures, and interfacing capabilities to fuse sensors, and network situational understanding information and and targeting capabilities to enable mounted and dismounted US Soldiers maintain visual advantage, increased situational awareness, decreased fratricide, and respond expeditiously to all threats in all environments. Work in this Project supports the Army Science and Technology Soldier Lethality, Next Generation Combat Vehicle, and Future Vertical Lift Army Modernization priorities.\n\nThis effort complements work done in PE 0602143A Soldier Lethality Technology, Project BD1 Advanced Soldier Sensors\/Displays Tech for Dismounts.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Soldier Sensors\/Displays Advanced Technology for Dismounts"
                                    },
                                    "Description": {
                                        "val": "This effort will mature and demonstrate low cost Soldier-borne situational understanding systems with greater fidelity for improved maneuver and lethality, as well as mature automated algorithms to increase probability of recognition\/identification and tracking of threats in all environments. This effort is coordinated with PE 0602143A Soldier Lethality Technology, 0602145A Next Generation Combat Vehicle Technology, 0603462A Next Generation Combat Vehicle Advanced Technology, 0603463A Network C3I Advanced Technology, and 0603465A Future Vertical Lift Advanced Technology."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.659"
                                            },
                                            "Text": {
                                                "val": "Will mature augmented reality situational understanding and visual three dimensional (3D) information capabilities for mounted and dismounted Soldiers; provide an overlay and display of 3D point cloud information to Soldiers for increased scene context in near peer environments; mature explosive and hazard detection components for integration with adaptable target detection algorithms to create a baseline capability that increases Soldiers situational understanding of threats in near-peer environments; validate sensor designs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ BC9 was previously PE 0603710A \/ K70 and PE 060606A \/ 608 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BD7"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Sys Interfaces\/Integration-Sensor AdvTech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "9.671"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.671"
                        },
                        "BudgetYearTwo": {
                            "val": "9.069"
                        },
                        "BudgetYearThree": {
                            "val": "8.486"
                        },
                        "BudgetYearFour": {
                            "val": "8.653"
                        },
                        "BudgetYearFive": {
                            "val": "8.991"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "44.870"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tJ50 Future Warrior Technology Integration"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project will integrate technologies for sensing, processing, displaying information, interfacing with users, and cognitive improvement to enhance Soldier & Small Unit situational awareness & understanding. This effort will integrate battlefield and body worn sensors and data fusion algorithms to provide the dismounted Small Unit leader with clear, actionable information for making well informed, rapid, tactical decisions. This effort will mature and integrate advanced dismounted Soldier robotic and autonomous systems technologies to demonstrate autonomous navigation, manned-unmanned teaming, and networked reconnaissance to improve Soldier lethality, situational awareness, and survivability during tactical operations.\n\nWork in this Project several PEs to include (PE 0602143A\/BD6) Soldier System Interfaces & Integration (Sensor Technology), (PE 0602143A\/BB9) Human Performance Technology for Mobility & Lethality, and (PE 0603118A\/BC9) Advanced Soldier Sensors\/Displays Advanced Technology for Dismounts.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier System Interfaces & Integration (Sensor Advanced Technology)"
                                    },
                                    "Description": {
                                        "val": "This effort will integrate battlefield and body-worn sensors and mature data fusion algorithms to provide the dismounted Small Unit leader with clear, actionable information to make well informed, rapid, tactical decisions. This effort will mature and integrate advanced dismounted Soldier robotic and autonomous systems technologies to demonstrate autonomous navigation, manned-unmanned teaming, and networked reconnaissance to improve Soldier lethality, situational awareness, and survivability during tactical operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.671"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.671"
                                            },
                                            "Text": {
                                                "val": "Will integrate battlefield and Soldier worn sensors with body area networks and the Nett Warrior architecture; mature and integrate sensor fusion algorithms and user interfaces to provide actionable and timely information to the dismounted Soldier and small unit; demonstrate integrated sensor capabilities in lab and virtual environments; mature and integrate algorithms for dismounted Small Unmanned Aerial Systems (SUAS) to enable autonomous operations; mature soldier-robotic user interfaces to minimize Soldier dedicated control of robotic assets; mature and demonstrate modular robotics architectures to allow for rapid integration and demonstration of advanced capabilities; integrate dismounted robotic systems with Nett Warrior to enable sharing of tactical data between Small Units."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ Project BD7 was previously PE 0603001A \/ J50 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BD9"
                    },
                    "ProjectTitle": {
                        "val": "Soldier & Sm Unit Tactical Energy AdvTech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.101"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.101"
                        },
                        "BudgetYearTwo": {
                            "val": "3.163"
                        },
                        "BudgetYearThree": {
                            "val": "3.226"
                        },
                        "BudgetYearFour": {
                            "val": "4.3"
                        },
                        "BudgetYearFive": {
                            "val": "4.362"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.152"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tJ50 Future Warrior Technology Integration"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project will demonstrated advanced Power and Energy (P&E) technologies for the dismounted Soldier to lighten equipment load, reduce resupply need, and enhance mobility. This effort will conduct Soldier and Small Unit power and energy technology maturation, integration with clothing and individual equipment, technical analysis, and operational assessment. \n\nWork in this Project complements several PEs to include (PE 62143\/BD6) Soldier System Interfaces & Integration (Sensor Technology), (PE 0602143\/BB9) Human Performance Technology for Mobility & Lethality, (PE 0602143A\/BD8) Soldier and Small Unit Tactical Energy Technology, and (PE 0603118\/BC9) Advanced Soldier Sensors\/Displays Advanced Technology for Dismounts.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates, and demonstrates advanced Soldier Power and Energy (P&E) technologies that are used to power the dismounted Soldier and small unit?s command and control, communications, computers, and sensor devices during tactical operations. This work will result in the Army being able to provide the power and energy the future Soldier requires to operate effectively, while doing so at a reduced physical burden."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.101"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.101"
                                            },
                                            "Text": {
                                                "val": "Will mature, integrate, and demonstrate advanced dismounted Soldier power and energy technologies, including lightweight, energy dense power sources and efficient power generation technologies to reduce the Soldier?s physical burden and increase the run-time of electronics; demonstrate Soldier power management and distribution technologies to efficiently manage the transfer of power on the Soldier; analyze and assess dismounted Soldier power and energy technologies during laboratory and field experiments to characterize their performance and validate their operation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ Project BD9 was previously PE 0603001A \/ J50 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE2"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Combat Feeding Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.782"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.782"
                        },
                        "BudgetYearTwo": {
                            "val": "1.819"
                        },
                        "BudgetYearThree": {
                            "val": "1.856"
                        },
                        "BudgetYearFour": {
                            "val": "2.048"
                        },
                        "BudgetYearFive": {
                            "val": "2.071"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.576"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\tC07 Joint Service Combat Feeding Tech Demo"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates combat ration and field feeding technologies to optimize warfighter performance, decrease the risk of exposure to chemical and biological contaminants in foods, and reduce the logistics burden to enable semi-independent operations. The Army serves as the Executive Agent for this Department of Defense (DoD) program, with oversight and coordination provided by the DoD Combat Feeding Research and Engineering Board.\n\nThis effort complements work done in 0602143A (Soldier Lethality Technology) \/ Project BE3 (Joint Service Combat Feeding Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Combat Feeding Advanced Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates combat ration and field feeding technologies to optimize warfighter performance, decrease risk of exposure to chemical and biological contaminants in foods, and reduce the logistics burden to enable semi-independent operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.782"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.782"
                                            },
                                            "Text": {
                                                "val": "Mature alternative packaging configurations to reduce weight\/logistics burden and provide flexibility in rations processing applications to enable semi-independent operations; mature novel food processing and nutritional intervention strategies to validate Close Combat Assault Ration concept for reduced Soldier\/squad reliance on ration resupply during extended operations; demonstrate densification technologies that maximize nutrient value while minimizing ration weight; demonstrate portable, rapid biosensor platforms to improve food safety and reduce risk of food-borne illness on the battlefield; transition demonstrated refrigeration technology that reduces reliance on hydrofluorocarbons to Product Manager ? Force Sustainment Systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ Project BE2 was previously PE 0603001A \/ Project C07 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE5"
                    },
                    "ProjectTitle": {
                        "val": "Personnel & Airdrop Safety Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "6.77"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.77"
                        },
                        "BudgetYearTwo": {
                            "val": "6.299"
                        },
                        "BudgetYearThree": {
                            "val": "6.97"
                        },
                        "BudgetYearFour": {
                            "val": "6.96"
                        },
                        "BudgetYearFive": {
                            "val": "7.052"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "34.051"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603001A Warfighter Advanced Technology, Projects:\n*\t242 Airdrop Equipment\n*\tXW6 Small Unit Expeditionary Maneuver"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates equipment and innovative techniques for precision aerial delivery of cargo and personnel. Technologies support Army Modernization Priority, Soldier Lethality. Aerial delivery is a key capability for rapid force projection and global precision delivery to support the mission readiness profile for Global Response Force (GRF). These efforts are designed to advance state of the art precision delivery technologies such as parachutes; guidance, navigation, and control (GNC) components and subsystems; tracking sensors; software algorithms; and safety rigging that integrates with currently equipped aircraft, unmanned aerial systems (UAS), and advanced rotary wing aircraft. These efforts provide the Warfighter with highly accurate, timely cargo\/payload delivery and resupply in all terrain and weather conditions. Precision delivery\/resupply reduces vulnerability of ground Soldiers, aircraft, and aircrew. Precision aerial delivery supports remote warfare with activities such as placement of battlefield sensors and reduction of Soldier load.\n\nThis effort complements work done in the Science & Technology Precision, Navigation and Timing Modernization priority.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel & Airdrop Safety Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates parachute materials and designs, precision guidance and navigation software and hardware, tracking sensors, and safety devices to increase the accuracy of delivering cargo to remote locations and\/or complex terrains in GPS denied environments. This effort also provides technologies that increase safety during personnel insertions into theaters of operation. This effort supports capability demonstrations for mitigating the Army' s challenge of overburdened Soldiers through the use of tactical aerial resupply technologies, as well as supporting Anti-Access\/Area Denial (A2\/AD) and manned-unmanned teaming (MUM-T) operational concepts by demonstrating airdrop from non-traditional platforms."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.77"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.77"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate precision aerial delivery software and hardware components in a GPS denied\/degraded environment as well as in Dense, Urban, and Complex Terrain. Efforts will provide high precision resupply in austere environments and expand the operational footprint of the Soldier\/Squad without significant impact to existing logistics requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A \/ Project BE4 was previously PE 0603001A \/ XW6 and PE 0603001A \/ 242 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE9"
                    },
                    "ProjectTitle": {
                        "val": "STE Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "22.48"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.48"
                        },
                        "BudgetYearTwo": {
                            "val": "17.903"
                        },
                        "BudgetYearThree": {
                            "val": "17.005"
                        },
                        "BudgetYearFour": {
                            "val": "20.341"
                        },
                        "BudgetYearFive": {
                            "val": "20.567"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "98.296"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0603115A Next Generation Training & Simulation Systems, Projects:\n*\tS29 Modeling & Simulation - Advanced Technology Development\n*\tS31 Modeling And Simulation Infrastructure Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops technologies supporting the Army's Synthetic Training Environment (STE), a comprehensive live-virtual-constructive architecture that will enable Soldiers to train the spectrum of missions in virtual environments involving thousands of virtual combatants and miles of complex terrain including megacities. The STE will enable Army units and leaders to conduct realistic multi-echelon \/ Multi-Domain Operations, combined arms maneuver, and mission command training at the point of need anywhere in the world, increasing Soldier and Small Unit proficiency through repetition. Units can then master collective training tasks in the live environment. The Project leverages the capabilities of industry and the research and development community, to include work at the Institute for Creative Technologies (ICT). This project matures and demonstrates a distributed modeling and simulation (M&S) environment that integrates a collection of multi-fidelity models and simulations and tools that map to an evolving architecture and M&S activities to support decisions throughout the acquisition life-cycle; and provides a unifying M&S architecture that synchronizes and integrates multi-resolution modeling applications such as Live, Virtual, and Constructive (LVC) experimentation utilizing Artificial Intelligence (AI) enabled attributes. This Project  focuses on researching cutting-edge M&S methods to enable the Army and the Department of Defense (DoD) to perform critical System of Systems (SoS) analysis, experimentation, technology tradeoffs, capability assessments, concept development, and training that saves time and resources while increasing the effectiveness of acquisition and training activities.\n\nThis effort complements work done in 0602143A (Soldier Lethality Technology) \/ Project BE8 (Synthetic Training Environment (STE) Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "STE Soldier\/Squad Virtual Trainer"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a common battle drill squad-level mixed reality based system that allows for the rapid conduct and repetition of squad-level training. The training system will make it possible to conduct diverse, repeatable and effective training without extensive training infrastructure."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.135"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.135"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate advancements based on STE accelerated tasks to include dynamic occlusion algorithms for complex urban environments and advanced position tracking for spatialization."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A\/ Project BE9 was previously PE 0603018A\/S29 and 0603015A\/S31 in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STE Training Management Tool"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates user-friendly interfaces that allow for authoring individual and collective training scenarios, tools that automatically adapt training to the learner's skill level and conducts intelligent after action reviews, and technologies that enable visualization of and interaction with a Mixed Reality Common Operating Picture of the battlespace."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.366"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.366"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate an authoring tool for individual training scenarios; demonstrate ways to automatically tailor training based on existing learner records; and demonstrate models that predict individual competencies and tailor training to target deficiencies. Will demonstrate large-scale, mixed reality Common Operating Picture visualization and interaction of emerging STE technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A\/ Project BE9 was previously PE 0603018A\/S29 and 0603015A\/S31 in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STE One World Terrain"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates tools and methods that improve the speed, fidelity and delivery of synthetic terrain and environmental data needed to support mission planning, mission rehearsal, and mission training in the synthetic training environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.95"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.95"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate applications that enhance environmental representations commonly found in urban areas including Megacities and underground environments; exploit and modify non-traditional data sources such as Open Street Maps, crowd-sourced information, and other available data from which geo-specific information can guide placement; enhance the environment with procedural placement of appropriate urban feature models; exploit and modify a common terrain engine representation for use across game engines (i.e. consumed without modification); mature the commonality and differences between candidate game engines to derive common representations for environment elements (terrain surface, feature meshes, textures\/materials, etc.); optimize terrain reasoning data needs, especially those not typically represented in game engines; exploit a proposed common representation that is flexible and compatible with multiple game engines; validate the tradeoffs between compiled\/derived formats versus close-to-source formats and articulate how engines with specialized internal formats would leverage the proposed representation; and demonstrate the viability of the proposed representation in at least three different game engines."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A\/ Project BE9 was previously PE 0603018A\/S29 and 0603015A\/S31 in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STE Training Simulation Software"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that support Multi-Domain Operations modeling, maturing simulation configuration and scalability technologies for collective training.  In addition, matures and demonstrates technologies that allow the synthesis of robust military behaviors that enable the ?scaling? of Synthetic Training Environment (STE) collective training configurations to support squad to Army Service Component Command (ASCC) synthetic representations and delivery to the Point of Need through the exploitation of emerging computing and networking technologies that optimize computing architectures for integrating components (models, behaviors, data, etc.) of the Training Simulation Software (TSS)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.029"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.029"
                                            },
                                            "Text": {
                                                "val": "Will mature models of Multi-Domain Operations to include cyber effects and patterns of life, demonstrating state-of-the-art simulated entities and concurrent role-players in a relevant collective training exercise.  In addition, will mature methods to create simulation agnostic behavior algorithms from authoritative sources to show broad applicability to multi-echelon collective training; demonstrate hybrid scalability and Point of Need technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0603118A\/ Project BE9 was previously PE 0603018A\/S29 and 0603015A\/S31 in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}