{
    "id": "2020-Army-PB-2040-JBOOK-57289821184020429f22b377c8d8ec2b7ea1aa2758df17e0ae58ba36035ae75c-26",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604121A"
        },
        "ProgramElementTitle": {
            "val": "Synthetic Training Environment Refinement & Prototyping"
        },
        "R1LineNumber": {
            "val": "99"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "109.165"
            },
            "CurrentYear": {
                "val": "39.89"
            },
            "BudgetYearOne": {
                "val": "136.761"
            },
            "BudgetYearOneBase": {
                "val": "136.761"
            },
            "BudgetYearTwo": {
                "val": "22.672"
            },
            "BudgetYearThree": {
                "val": "10.668"
            },
            "BudgetYearFour": {
                "val": "7.735"
            },
            "BudgetYearFive": {
                "val": "7.896"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "334.787"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Synthetic Training Environment (STE) is the next generation holistic collective training capability that will train units where they will fight, with whom they will fight with, and in complex operational environments to include dense urban and sub-terrain; within the entire range of combined arms maneuver tasks in support of Multi-Domain Operations. STE will be a common synthetic environment enabled by a core of Global Terrain\/One World Terrain (OWT); common authoritative data and models; Training Simulation Software (TSS), and Training Management Tools (TMT). The STE will be available where training occurs (Home Station, Armories, Institutions, Shipboard, Deployed) and will include Air and Ground Reconfigurable Virtual Collective Trainers (RVCTs) and a Soldier\/Squad Virtual Training (S\/SVT) close combat training capability. The first increment of the SSVT is the Squad immersive Virtual Trainer (SiVT) capability and the Heads Up Display (HUD) 3.0 which comprises the Integrated Visual Augmentation System (IVAS). The STE will be cloud-enabled, compatible with the Army Enterprise Network, and service-based through the Common Operating Environment, including Live and Constructive. The STE will provide the realistic repetitions necessary to fight 25 bloodless battles before the first battle; a Secretary of Defense priority.\n\nFY 2020 base funding of $136.761 million will continue to develop and demonstrate prototype designs to reduce technical risk, validate designs, validate cost estimates, evaluate processes, and refine requirements for STE, support development and integration of the first increment of the S\/SVT, which is an embedded STE training capability that includes OWT, TSS, TMT, into the operational capability of the IVAS. Based on these refined requirements and demonstrated prototype designs, integrated systems design of the end-item system can be initiated. Additionally, these efforts ensure the level of expertise required to operate and maintain the capability is consistent with the force structure. Increments 2 and 3 of SSVT provides the NEXTGEN Marksmanship and the NEXTGEN Call For Fire Artillery Virtual Training capability into the STE baseline. The SSVT system also combines individual Soldier and squad training capabilities (STE Squad Capability (SSC), Weapon Skill Development (WSD), Joint Fires Training (JFT), and Use of Force (UoF)), into a single capability.\n\nFunds were realigned from PE 0604715A in FY 2019 and 2020 for the first increment of the SSVT which is the Squad immersive Virtual Trainer (SiVT) capability and the Heads Up Display (HUD) 3.0 which comprises the Integrated Visual Augmentation System (IVAS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.6"
                },
                "CurrentYear": {
                    "val": "77.939"
                },
                "BudgetYearOne": {
                    "val": "56.867"
                },
                "BudgetYearOneBase": {
                    "val": "56.867"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "109.165"
                },
                "CurrentYear": {
                    "val": "39.89"
                },
                "BudgetYearOne": {
                    "val": "136.761"
                },
                "BudgetYearOneBase": {
                    "val": "136.761"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "107.565"
                },
                "CurrentYear": {
                    "val": "-38.049"
                },
                "BudgetYearOne": {
                    "val": "79.894"
                },
                "BudgetYearOneBase": {
                    "val": "79.894"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.001"
                    },
                    "CurrentYear": {
                        "val": "-0.049"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-38"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "107.629"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.063"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "79.894"
                                },
                                "BudgetYearOneBase": {
                                    "val": "79.894"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funds were realigned from FY 2019 and 2020 for the first increment of the SSVT which is the Squad immersive Virtual Trainer (SiVT) capability and the Heads Up Display (HUD) 3.0 which comprises the Integrated Visual Augmentation System (IVAS). The FY 2020 increase of $79.894 million supports the Army's modernization priorities in support of the National Defense Strategy."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FD6"
                    },
                    "ProjectTitle": {
                        "val": "Synthetic Training Environment Refine & Prototype"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "109.165"
                        },
                        "CurrentYear": {
                            "val": "39.89"
                        },
                        "BudgetYearOne": {
                            "val": "41.676"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.676"
                        },
                        "BudgetYearTwo": {
                            "val": "15.672"
                        },
                        "BudgetYearThree": {
                            "val": "10.668"
                        },
                        "BudgetYearFour": {
                            "val": "7.735"
                        },
                        "BudgetYearFive": {
                            "val": "7.896"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "232.702"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Synthetic Training Environment (STE) is the next generation holistic collective training capability that will train units where they will fight, with whom they will fight with, and in complex operational environments to include dense urban and sub-terrain; within the entire range of combined arms maneuver tasks in support of Multi-Domain Operations. STE will be a common synthetic environment enabled by a core of Global Terrain\/One World Terrain (OWT); common authoritative data and models; Training Simulation Software (TSS), and Training Management Tools (TMT). The STE will be available where training occurs (Home Station, Armories, Institutions, Shipboard, Deployed) and will include Air and Ground Reconfigurable Virtual Collective Trainers (RVCTs) and a Soldier\/Squad Virtual Training (S\/SVT) close combat training capability, and a live training capability. The first increment of the SSVT is the Squad immersive Virtual Trainer (SiVT) capability and the Heads Up Display (HUD) 3.0 which comprises the Integrated Visual Augmentation System (IVAS). The STE will be cloud-enabled, compatible with the Army Enterprise Network, and service-based through the Common Operating Environment, including Live and Constructive. The STE will provide the realistic repetitions necessary to fight 25 bloodless battles before the first battle; a Secretary of Defense priority.\n\nFY 2020 base funding of $41.676 million will continue to develop and demonstrate prototype designs to reduce technical risk, validate designs, validate cost estimates, evaluate processes, and refine requirements for STE, support development and integration of the first increment of the S\/SVT, which is an embedded STE training capability that includes OWT, TSS, TMT, into the operational capability of the IVAS. Based on these refined requirements and demonstrated prototype designs, integrated systems design of the end-item system can be initiated. Additionally, these efforts ensure the level of expertise required to operate and maintain the capability is consistent with the force structure."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Will provide program management, engineering and technical oversight, contract support, and travel for the development of the program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.536"
                                            },
                                            "Text": {
                                                "val": "Funding was used for Synthetic Training Environment (STE) Program Management to execute Materiel Solutions Analysis (MSA) phase of the STE program with the purpose to choose the concept for the product that will be acquired, to begin translating validated capability gaps into system-specific requirements, including the Key Performance Parameters (KPPs) and Key System Attributes (KSAs), and to conduct planning to support a decision on the acquisition strategy for the product."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.791"
                                            },
                                            "Text": {
                                                "val": "Funding will be used for program execution of rapid prototyping which allows refinement of the requirement for the capability that will be acquired. Funds also support the translation of validated capability gaps into system specific requirements, including the Key Performance Parameters (KPPs) and Key System Attributes (KSAs). Efforts facilitate refinement and decisions on the acquisition strategy for the capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.528"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.528"
                                            },
                                            "Text": {
                                                "val": "Funding will be used for program execution of rapid prototyping which allows refinement of the requirement for the capability that will be acquired.  Funds also support the translation of validated capability gaps into system specific requirements, including the Key Performance Parameters (KPPs) and Key System Attributes (KSAs).  Efforts facilitate refinement and decisions on the acquisition strategy for the capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in FY20 funding aligns program funds to the program management requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering, Support, Test & Evaluation"
                                    },
                                    "Description": {
                                        "val": "Will provide Engineering, support, and any related test and evaluation for the development of the program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "107.629"
                                            },
                                            "Text": {
                                                "val": "N\/A - effort not funded in FY18."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.099"
                                            },
                                            "Text": {
                                                "val": "FY 2019 funding develops and demonstrates prototype designs to reduce technical risk, validates designs, validates cost estimates, evaluates processes, and refines requirements. Based on refined requirements, demonstrated prototype designs and User Assessments of the prototypes an integrated systems prototype design of the end-item system can be initiated through an OTA.  Additionally, these efforts ensure the level of expertise required to operate and maintain the capability remains within the defined force structure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.148"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.148"
                                            },
                                            "Text": {
                                                "val": "FY 2020 funding will continue to develop, demonstrate,  and conduct User Assessments of prototype designs to reduce technical risk, validate designs, validate cost estimates, evaluate processes, and refine requirements. Based on refined requirements and demonstrated prototype designs, integrated systems design of the end-item system can be continued through an OTA. Additionally, these efforts ensure the level of expertise required to operate and maintain the capability remains within the defined force structure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY20 funding is due to the integration of the live capability into the STE, per the Secretary of the Army?s guidance."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NA2020"
                                    },
                                    "Title": {
                                        "val": "Synthetic Training Environment (STE)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "20.749"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.749"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "70.978"
                                        },
                                        "BudgetYearThree": {
                                            "val": "70.887"
                                        },
                                        "BudgetYearFour": {
                                            "val": "72.969"
                                        },
                                        "BudgetYearFive": {
                                            "val": "66.683"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "302.266"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Synthetic Training Environment (STE) program will employ an incremental acquisition strategy where the full capability will occur in multiple increments as new capability is developed and delivered. Initial competitive prototyping development efforts will be conducted through Other Transactional Authority (OTA) awards resulting in system prototypes that reduce program risk and technology maturation risk."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.536"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.791"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.528"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.528"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.357"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.212"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "To Be Determined"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "To Be Determined"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "107.629"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "32.906"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "37.523"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "37.523"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "37.773"
                                                    },
                                                    "TotalCost": {
                                                        "val": "215.831"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "To Be Determined"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "To Be Determined"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.193"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.625"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.625"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.841"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.659"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_FD6.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "CDD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Acquisition Entry Point"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Other Transaction Authority 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OTA Tech Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Integration Contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SV1"
                    },
                    "ProjectTitle": {
                        "val": "Soldier\/Squad Virtual Trainer"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "95.085"
                        },
                        "BudgetYearOneBase": {
                            "val": "95.085"
                        },
                        "BudgetYearTwo": {
                            "val": "7"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "102.085"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "S\/SVT is not a New Start for FY2020.  The program was previously funded under PE 0604715A."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Synthetic Training Environment (STE) is the next generation holistic collective training capability that will train units where they will fight, with whom they will fight with, and in complex operational environments to include dense urban and sub-terrain; within the entire range of combined arms maneuver tasks in support of Multi-Domain Operations. STE will be a common synthetic environment enabled by a core of Global Terrain\/One World Terrain (OWT); common authoritative data and models; Training Simulation Software (TSS), and Training Management Tools (TMT). The STE will be available where training occurs (Home Station, Armories, Institutions, Shipboard, Deployed) and will include Air and Ground Reconfigurable Virtual Collective Trainers (RVCTs) and a Soldier\/Squad Virtual Training (S\/SVT) close combat training capability, and a live training capability. The first increment of the SSVT is the Squad immersive Virtual Trainer (SiVT) capability and the Heads Up Display (HUD) 3.0 which comprises the Integrated Visual Augmentation System (IVAS). The STE will be cloud-enabled, compatible with the Army Enterprise Network, and service-based through the Common Operating Environment, including Live and Constructive. The STE will provide the realistic repetitions necessary to fight 25 bloodless battles before the first battle; a Secretary of Defense priority.\n\nFY 2020 base funding of $95.085 million will continue to develop and demonstrate prototype designs to reduce technical risk, validate designs, validate cost estimates, evaluate processes, refine requirements, and support development and integration of the first increment of the S\/SVT, which is an embedded STE training capability that includes OWT, TSS, TMT, into the operational capability of the IVAS. Based on these refined requirements and demonstrated prototype designs, integrated systems design of the end-item system can be initiated. Additionally, these efforts ensure the level of expertise required to operate and maintain the capability is consistent with the force structure.\n\nThe first increment of the SSVT which is the Squad immersive Virtual Trainer (SiVT) capability and the Heads Up Display (HUD) 3.0 which comprises the integrated Visual Augmentation System (IVAS). Increments 2 and 3 of SSVT provides the NEXTGEN Marksmanship and the NEXTGEN Call For Fire Artillery Virtual Training capability into the STE baseline. The SSVT system also combines individual Soldier and squad training capabilities (STE Squad Capability (SSC), Weapon    Skill Development (WSD), Joint Fires Training (JFT), and Use of Force (UoF)), into a single capability.\n\nS\/SVT is not a New Start for FY2020.  The program was previously funded under PE 0604715A."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering, Support, Test & Evaluation"
                                    },
                                    "Description": {
                                        "val": "Will provide Engineering, support, and any related test and evaluation for the development of the program."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "95.085"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "95.085"
                                            },
                                            "Text": {
                                                "val": "FY 2020 funds the remaining two capability sets of the Squad immersive Virtual Trainer (SiVT) capability and the Heads Up Display (HUD) 3.0 which comprises the Integrated Visual Augmentation System (IVAS) and will continue to develop, demonstrate, and conduct User Assessments of prototype designs to reduce technical risk, validate designs, validate cost estimates, evaluate processes, and refine requirements. Based on refined requirements and demonstrated prototype designs, integrated systems design of the end-item system can be continued through an OTA."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY20 funding is due to the requirement for the accelerated Research and Development for IVAS, per the Secretary of the Army's and Secretary of Defense's guidance, as well as the SVT integration."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Synthetic Training Environment (STE) program will employ an incremental acquisition strategy where the full capability will occur in multiple increments as new capability is developed and delivered.  Soldier and Squad Virtual Trainer (S\/SVT) program will employ an incremental acquisition strategy where the full capability will occur in multiple increments as new capability is developed and delivered.  Initial competitive prototyping development efforts will be conducted through Other Transactional Authority (OTA) awards resulting in system prototypes that reduce program risk and technology maturation risk."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Proving Grounds"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "95.085"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "95.085"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "95.085"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_SV1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "IVAS\/HUD 3.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SVT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}