{
    "id": "2020-TheJointStaff-PB-0400-MJBOOK-0-0-d1987b0fd370b5a1aa30691c25a4364a88cdaac49ace6ad89bc88e2bfcf9f939-6",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-TJS-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0804768J"
        },
        "ProgramElementTitle": {
            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2) - Non MHA"
        },
        "R1LineNumber": {
            "val": "191"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "42.653"
            },
            "BudgetYearOne": {
                "val": "40.073"
            },
            "BudgetYearOneBase": {
                "val": "40.073"
            },
            "BudgetYearTwo": {
                "val": "39.209"
            },
            "BudgetYearThree": {
                "val": "41.042"
            },
            "BudgetYearFour": {
                "val": "41.044"
            },
            "BudgetYearFive": {
                "val": "41.041"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "For FY 2018 and prior year data, please see PE 0804767J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA."
        },
        "ProgramElementMissionDescription": {
            "val": "These programs support readiness of the joint force by creating a joint training environment to replicate the complex and changing operational environment.  These investments directly support defense strategic guidance and enhance joint warfighting readiness by building training capabilities that support the operational readiness of the force.  The elements associated with this coordinated effort consist of:\n\n- Joint National Training Capability (JNTC)\n\n- Joint Knowledge Development & Distribution Capability (JKDDC)\n\n- Air Force Joint National Training Capability (JNTC)\n\n- Navy Joint National Training Capability (JNTC)\n\n- Joint Interoperability Division (JID)\n\n- Marine Corps Joint National Training Capability (JNTC)\n\n- Advanced Distributed Learning (ADL)\n\nJNTC:  The mission of the Joint National Training Capability (JNTC) program is to advance joint capabilities and interoperability by concentrating on emerging joint training requirements through collective training using a managed set of globally distributed capabilities and activities. The program resources Service and Special Operations Forces joint training to improve interoperability and create realistic tactical and operational joint training.  JNTC enables joint training for Combatant Commands and Services by developing joint training content and ensuring global distributed access. JNTC enabling capabilities support Services and USSOCOM requirements to provide trained and ready forces in support of Combatant Command operational requirements. This program focuses efforts on improving readiness and create a ready surge force consistent with Chairman’s guidance.\n\nJKDDC:  Joint Knowledge Development & Distribution Capability (JKDDC) Joint Knowledge Online (JKO) is the program of record for online joint training that implements and operationalizes the OSD training transformation JKDDC.  JKO directly supports the CE2T2 program by developing, delivering, tracking, reporting, and supporting online training for Combatant Command exercises; Combatant Command required training; doctrinally based Joint Operations Core Curriculum; multinational, coalition, interagency training; OSD required training; and administration of the Senior Enlisted Joint Professional Military Education program.  JKO expends RDT&E funding for leading edge technology review, market research, and integration to directly enhance various aspects of the training capability required to support Combatant Commanders, CE2T2 Program Goals and Objectives, and the Chairman's training guidance. JKO satisfies all requirements necessary to provide CE2T2 stakeholders with a distributed learning capability and access to web-based training content, learning resources, and distributed online training tools.\n\nAir Force JNTC:  The Air Force JNTC funding provides a focused upgrade to develop models for space-based and cyber capabilities for integration into the Joint Live, Virtual, and Constructive (JLVC) environment.  Air Force supports development of cross-domain solutions that enable the integration of systems with disparate security requirements which significantly increases the training audience to additional joint and coalition participants.  Additionally, the Air Force supports the integration of tactical models into the virtual environment.  \n\nNavy JNTC:  These funds enable Navy to develop unique maritime capabilities that integrate JLVC elements into a seamless joint training environment. The Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems.  Additionally, the program develops cross-domain architectures for U.S. and coalition forces and ensures sister service modeling\/simulation and instrumentation efforts follow a unified standard.\n\nJID: Joint Interoperability Division (JID) supports 35 annual schoolhouse interoperability courses and up to six CAPSTONE Joint Interface Control Officer (JICO) courses tied to various Combatant Command (CCMD) joint exercises. JID trains CCMD, Services and partner nations' operations center personnel on interoperability planning tasks required during contingencies and exercises in emerging mission areas such as joint fires, net enabled weapons, remotely piloted aircraft, integrated air and missile defense, and contested operations including secure internet with Link-16\/TDL equipped major weapon systems and smart bombs.\n\nMarine Corps JNTC:  These funds provide USMC stability and risk reduction to a variety of ongoing joint efforts focused on improving the fidelity and realism of training simulation systems that prepare Marine Air Ground Task Force (MAGTF) units for deployment in support of CCMD operations.  In support of the Commandant’s planning guidance, the Marine Corps will continue to improve performance and support of the MAGTF Tactical Warfare Simulation in the areas of the JLVC-Multi-Resolution Federation (MRF) Bridge, common database terrain data ingestion, and JLVC interoperability.  It also provides a single source training environment capability enabling users to select single or multiple play boxes (terrain data sets) for training simulation systems. In addition to developing an exercise planning, design, implementation, execution, and control tool, it also enhances pattern of life and indigenous population modular service enabling exercise designers' ability to rapidly build new scenarios and incorporate human geography elements into training scenarios. \n\nADL: The Advanced Distributed Learning (ADL) initiative supports innovation and provides policy oversight to help the Services, Joint Staff, and partner agencies deliver training and education more efficiently and cost effectively. ADL provides policy oversight and coordination across DoD, coalition partners, and other Federal agencies for distributed learning. This oversight supports interagency interoperability and promotes personnel readiness, ensuring the right people receive the right training at the right time."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "42.940"
                },
                "BudgetYearOne": {
                    "val": "40.073"
                },
                "BudgetYearOneBase": {
                    "val": "40.073"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "42.653"
                },
                "BudgetYearOne": {
                    "val": "40.073"
                },
                "BudgetYearOneBase": {
                    "val": "40.073"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.287"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.287"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Funding transferred from PE 0804767J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA to PE 0804768J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - Non MHA beginning FY 2019 and beyond to properly align CE2T2 RDT&E funding to a Non-MHA PE.  For FY 2018 and prior year data, please see R-2 for PE 0804767J \/ COCOM Exercise Engagement and Training Transformation (CE2T2) - MHA.\n\nFY 2019 Congressional reduction of $287K taken for FFRDC reductions (Section 8024)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "758"
                    },
                    "ProjectTitle": {
                        "val": "Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "29.584"
                        },
                        "BudgetYearOne": {
                            "val": "27.201"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.201"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "27.775"
                        },
                        "BudgetYearThree": {
                            "val": "30.703"
                        },
                        "BudgetYearFour": {
                            "val": "30.705"
                        },
                        "BudgetYearFive": {
                            "val": "30.702"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Investment in the Joint National Training Capability (JNTC) program enables Service and Combatant Commands to train as they operate. The requested funding continues to modernize joint training capabilities into a single integrating architecture aligned to DoD Chief Information Officer IT mandates.  Funding supports development of cloud-enabled modular training application services within an Open Systems Architecture (OSA).  JNTC focuses on delivering operationally relevant training environments and respond to changes in the global security landscape and the warfighter’s operational environment.  JNTC enables the Department of Defense to be responsive to the warfighters’ changing operational concepts, threat environments, and best practices. Funds support improved relevance and realism of training by providing capabilities that replicate the contemporary and future operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "JNTC provides the technical standards, architecture, and development processes required to integrate\/link joint training programs.  Funding supports the technical integration of Joint and Service models and simulations with the Joint, Live, Virtual, Constructive (JLVC) training capabilities.  The capabilities enable aggregation of training audiences at the Combatant Command, Joint Task Force, and Component Command headquarter levels.  The funding also supports modernization of the Joint Training Environment (JTE) through a Modular Open Systems Architecture (MOSA) approach to include a cloud enabled web accessible Joint Training Tool (JTT) that supports all phases of an exercise (planning, execution, and AAR). JTT will increase warfighter access to semi-automated training enablers within the Joint Training Synthetic Environment (JTSE)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.584"
                                            },
                                            "Text": {
                                                "val": "FY 2019 Plans: \n1. Continue to modernize the information technology architecture supporting the delivery of joint training capabilities and services.  \n\n2. Continue to develop the joint simulation service. Coordinate a “proof of concept” first use of the simulation service, and execute “proof of concept” use of JTT design and planning services supporting an exercise Joint Exercise Life Cycle (JELC).  Exercise planning begins in FY2019 and continues through the exercise, which occurs in FY2020.  \n\n3. Design, develop, and integrate tailored architectures, adaptive technology, and plans for Joint Staff, Combatant Commander, and Service training events\/exercises.\n\n4. Add capability to the Joint Training Synthetic Environment (JTSE) aligned to supporting Global Integrated Exercises (GIE) and the ability to validate concepts while exercising operational and global campaign plans.\n\n5. Develop functional capabilities aligned with the Joint Training Synthetic Environment (JTSE) modeling and simulation roadmap (2019), available at: https:\/\/jsportal.sp.pentagon.mil\/sites\/J7\/JT\/EA\/MS%20Roadmap\/Forms\/AllItems.aspx.\n\n6. Enhance current joint simulation (within JLVC) to keep pace with operational environment changes.  \n\n7.  Manage the enhancements to Service-owned JLVC federates and technically integrate the broader JLVC federation following these enhancements.\n\n8. Oversee implementation of Director of Joint Force Development’s Joint Training Technical Interoperability (JTTI) Strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.201"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.201"
                                            },
                                            "Text": {
                                                "val": "1. Use JTT design and planning services as the primary tool in support of an exercise JELC.\n\n2. Conduct a “proof of concept” use of JTT simulation service.  Continue planning transition of the JTT as the primary tool supporting all aspects of exercises.  \n\n3. Integrate, test, and validate Service and Agency JLVC capabilities.\n\n4. Enhance joint simulation (within JLVC) to keep pace with operational environment changes (annual requirement)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is FY 2020 funding is a result of a CE2T2 programming decision in the FY 2019 POM to accept more risk in adaptive enablers and innovation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on the performance metrics below.  This ensures the JNTC capability development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to: access, cost, realism, relevance, and technology and are defined below.\n\nAccess – Develop design standards that enable participation across DoD and, as applicable, with Coalition Partners. Make the environment available to meet user demands.\n\nCost – Enable the Joint Force Trainer to prepare and execute training more efficiently than current capabilities allow.\n \nRealism – Enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow.\n\nRelevance – Maintain operational relevance through adaptation to the changing operational environment.\n\nTechnology – Sustain the training environment network through developments for distributed home station training that include modular cloud-enabled training services.\n\nMeasures:\n\nCost - Vendors provide ordered hours and projected costs remain within 10 percent of government estimates.\n\nSchedule - Task completions (software enhancements, bug fixes, and cyber security requirements) delivered within six months of government estimate.\n\nTask Performance - Product results, outcomes or milestones meet specified requirements and successfully pass more than 80 percent of operational assessment test cases."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "769"
                    },
                    "ProjectTitle": {
                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.126"
                        },
                        "BudgetYearOne": {
                            "val": "1.608"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.608"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.108"
                        },
                        "BudgetYearThree": {
                            "val": "1.108"
                        },
                        "BudgetYearFour": {
                            "val": "1.108"
                        },
                        "BudgetYearFive": {
                            "val": "1.108"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Knowledge Online (JKO) is the DoD unique and authoritative source for online joint training.  JKO is tasked to develop a DoD enterprise-wide, joint individual training toolkit of web-enabled individual and small group training products, services, and enabling training technology.  Products and services are developed in response to OSD program goals, CJCS high interest training issues, Joint Staff training priorities, and JKO stakeholders (Combatant Commands, Services, Combat Support Agencies, Interagency, and multinational partners) prioritized training requirements.  JKO supports a career-long joint learning continuum, joint professional military education, and tailored common training standards to Service members on tasks that are jointly executed.  JKO research and development will improve all components of the Joint Content Management Architecture (JCMA) including:  \n\n1. JKO Learning Content Management System (LCMS): Development and enhancement is required to integrate advanced individual and staff training technologies and methodologies with larger scale, collective training exercises, and modernize military training capability with a DoD enterprise-wide online training toolkit. There are currently over 3.6 million registered users of the JKO LCMS.\n\n2. Small Group Scenario Trainer (SGST) desktop modeling and simulation based training: This JKO capability trains and prepares thousands of military and civilian personnel deploying to Combatant Command theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. JKO integration of SGST simulation exercise scenarios and prerequisite JKO courses significantly enhance blended learning training support to large-scale, collective training exercises.\n\n3. JKO mobile application training development:  Development and enhancements will significantly increase availability and access of web-based joint training content on portable, hand-held platforms (e.g. cell phones and tablets)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                                    },
                                    "Description": {
                                        "val": "Joint Knowledge Online (JKO) advance technology initiatives primarily include the JKO Learning Content Management System (LCMS) application, Small Group Scenario Trainer (SGST) desktop modeling and simulation based training capability, and mobile courseware training applications.  These capabilities increase access to, and facilitate the training and preparation of, hundreds of thousands of military and civilian personnel deploying to Combatant Command (CCMD) theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets.  JKO LCMS development and enhancements are required to develop, host, deliver, track, report and support students’ completions, progress and survey results more effectively and efficiently.  C\/JTF “battle staffs” will be better trained, as individuals and as staffs, based on SGST development and implementation throughout the joint training enterprise.  JKO mobile courseware training development facilitates the global distribution of web-based joint training content on portable, hand-held platforms for DoD personnel."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.126"
                                            },
                                            "Text": {
                                                "val": "1. Develop, test, and deliver two JKO Learning Content Management System (LCMS) releases resulting in improved cybersecurity, and a more effective and efficient online training management application that is interoperable with DoD personnel management systems.  JKO anticipates these enhancements will improve access and ease of use for the projected ~50,000 daily log-ins and ~560,000 monthly course completions by DoD personnel.  \n\n2. Develop, test, and deliver four JKO Small Group Scenario Trainer (SGST) desktop modeling and simulation application releases resulting in a more effective and efficient training capability integrated within the JKO LCMS.  JKO anticipates these enhancements will improve the quality of the training experience for Combatant Command and Service exercise participants resulting in heightened preparedness for real world operations. Individual training proficiency improvement will be measured and quantified as part of the exercise design.  \n\n3. JKO will assess, refine, and continue executing a comprehensive plan to enhance the JKO mobile capability and mobile training products via Responsive Design. JKO’s planned components include courseware and video conversions to portable hand-held devices while leveraging other DoD agencies, interagency, and multinational training courseware ported to the JKO. JKO anticipates the development and conversion of ~200 training courses, eBooks, Podcasts, job aids, and videos resulting in reduced cost for classroom training and thousands of hours delivered onsite and on demand to DoD personnel mobile platforms worldwide."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.608"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.608"
                                            },
                                            "Text": {
                                                "val": "1. Continue development of the LCMS, SGST, and JKO mobile initiatives in the FY2019 plans.\n\n2. JKO will research, develop, test, and evaluate a virtual classroom (VClass) open source capability (Sakai) to be integrated into the JKO LCMS suite of tools for synchronous (live) and non-synchronous (video-taped) instructor led training as well as a micro learning technology (Pervasive Learning System (PERLS)), in conjunction with ADL, for content development and delivery on both the mobile and LCMS platforms. JKO’s new VClass capability will provide required enhanced distributed learning (DL) much like today’s universities with an expectation of student-to-instructor collaboration; student-to-student collaboration; written assignment evaluation; live instructor response and teaching; and critical thinking exercises and assignments.  PERLS delivers self-regulated micro-learning training that is designed to be engaging, usable and practical, allowing individuals to quickly access desired learning content whenever an opportunity arises. As DoD organizations increase training via DL opportunities to mitigate expenses due to decreased funding and personnel, the methodologies of developing and delivering DL must be cutting edge, timely and optimize the learning experience of the joint warfighter.  PERLS and micro-learning provide that edge and optimization."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increase was a CE2T2 programming decision in the FY 2020 POM to fund open source virtual classroom (Sakai) and micro learning technology (PERLS) research, test, development, and evaluation to keep pace with current state-of-the-art on-line collaborative training."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Staff prescribed performance metrics include, but are not limited to: time, cost, realism, and fidelity and are defined below.\n\nTime – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more timely than current capabilities allow?\n\nCost – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n\nRealism – Will the effort enable the Joint Force Trainer (subject matter expert) to create a training environment that is closer to the real world environment than current capabilities allow? \n\nFidelity – Will the effort enable the Joint Force Trainer (subject matter expert) to create more detailed capabilities in the training environment than current capabilities allow? \n\nMeasures:\nIdentify, develop, test and implement 15 or more cybersecurity, operational, and functional JKO Learning Content Management System (LCMS) requirements.   \n\nIdentify, develop, test and implement 12 or more cybersecurity, operational, and functional JKO Small Group Scenario Trainer (SGST) requirements. \n\nIdentify, develop, test and implement 6 or more cybersecurity, operational, and functional JKO mobile application requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "701"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.917"
                        },
                        "BudgetYearOne": {
                            "val": "2.869"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.869"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.869"
                        },
                        "BudgetYearThree": {
                            "val": "2.869"
                        },
                        "BudgetYearFour": {
                            "val": "2.869"
                        },
                        "BudgetYearFive": {
                            "val": "2.869"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Air Force JNTC funding provides a focused upgrade to develop models for space-based capabilities for integration into the joint live, virtual, and constructive environment.  The Air Force supports development of cross-domain solutions that enable the integration of systems with disparate security requirements which significantly increases the training audience to additional joint and coalition participants."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Force Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Air Force continues to develop joint enablers that drive realistic\/effective training in contested and degraded environments across the CE2T2 enterprise. It supports development of a capability that replicates highly advanced surface-to-air missile and anti-aircraft artillery threats to U.S. and coalition forces. Additionally, Air Force continues to build upon prior investments in the cyber and space domains by improving fidelity of synthetic environments, ability to portray and control blue, red, and neutral entities and effects, interoperability with other Service, joint, and JLVC federation models and simulations, and support of CE2T2 mission partners."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.917"
                                            },
                                            "Text": {
                                                "val": "1. Replication of advanced adversary surface-to-air missile and anti-aircraft artillery capabilities.\n\n2. Development of new capabilities for integration of the cyber simulator environment generator and \"blue\" cyber effects simulation. Continue to add functionality to the ACE-IOS M&S suite. Further development to allow live space aggressor forces to interact with a virtual constructive environment replicating threats to the space environment.\n\n3. Space simulation improvements to model improved fidelity of space entities and adversary effects, enhance exercise control and OPFOR capabilities, and improve space simulation interoperability with CE2T2 mission partners.\n\n4. Capability to integrate live systems with constructive inputs and virtual environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.869"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.869"
                                            },
                                            "Text": {
                                                "val": "1. Replication of advanced adversary surface-to-air missile and anti-aircraft artillery capabilities.\n\n2. Development of new capabilities for integration of the cyber simulator environment generator and \"blue\" cyber effects simulation. Continue to add functionality to the ACE-IOS M&S suite. Further development to allow live space aggressor forces to interact with a virtual constructive environment replicating threats to the space environment.\n\n3. Space simulation improvements to model improved fidelity of space entities and adversary effects, enhance exercise control and OPFOR capabilities, and improve space simulation interoperability with CE2T2 mission partners.\n\n4. Capability to integrate live systems with constructive inputs and virtual environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is based on CE2T2 FY20 POM Panel decision."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of Air Force JNTC capabilities synchronize with warfighter requirements.  Performance metrics include, but are not limited to: time, cost, realism, and fidelity and are defined below.\n\nTime – Will the effort enable the Air Force JNTC to prepare and execute training more timely than current capabilities allow.\n\nCost – Will the effort enable the Air Force JNTC to prepare and execute training at a more effective and efficient cost than current capabilities allow.\n\nRealism – Will the effort enable the Air Force JNTC to create a training environment that is closer to the real world environment than current capabilities allow.\n\nFidelity – Will the effort enable the Air Force JNTC to create more detailed capabilities in the training environment than current capabilities allow.\n\nMeasures:\n\nCyber: Establish a persistent simulation environment that can be configured rapidly and accurately to reflect the desired operating environment of the training audience.  Also, create an ability to reflect cyber activities against a live Integrated Air Defense system.\n\nSpace: a fully operational GPS environment which allows space operators to actively participate in distributed mission operations space live, virtual, constructive missile warning, GPS disruption and Infrared special events. Also develop space models to model Space as a contested environment to accurately portray impacts of adversary actions in the space domain.  Also enhance exercise control and OPFOR capabilities and improve space simulation interoperability with CE2T2 mission partners.\n\nOperational Forces: a prototype for a next generation tactical surface to air threat simulator emulating modern threats fielded with potential adversary maneuver elements.  Also develop a capability to integrate live systems with constructive inputs and virtual environments."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "772"
                    },
                    "ProjectTitle": {
                        "val": "Navy Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.260"
                        },
                        "BudgetYearOne": {
                            "val": "3.041"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.041"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.042"
                        },
                        "BudgetYearThree": {
                            "val": "3.042"
                        },
                        "BudgetYearFour": {
                            "val": "3.042"
                        },
                        "BudgetYearFive": {
                            "val": "3.042"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These funds enable the Navy to develop unique maritime capabilities that integrate joint live, virtual, and constructive elements into a seamless joint training environment. The Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems.  Additionally, the program develops cross-domain architectures for U.S. and Coalition Forces and ensures sister service modeling\/simulation and instrumentation efforts follow a unified standard."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Develops unique maritime capabilities that integrate joint live, virtual, and constructive (JLVC) elements into a seamless joint training environment.  Using a scientific and phased approach that focuses on modeling ground, air, space, and maritime capabilities, this program researches new technologies and methods that provide a crucial technology-based foundation that supports all JNTC training transformation, JLVC federation, and Combatant Commanders exercise and engagement operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.260"
                                            },
                                            "Text": {
                                                "val": "1. Research and development for current and emerging Ballistic Missile Defense (BMD) threat representation. \n\n2. Development of new capabilities for integration with the annual Navy training baseline software release enabling the development of tactics, techniques and procedures for contested battlespace environments and ballistic missile defense.\n\n3. Integration of air and missile defense, electronic warfare, information operations, strike warfare, ballistic missile defense, \"blue\" force and opposition force capabilities.\n\n4. Deliver Navy Continuous Training Environment (NCTE) simulation for combat system and C4I stimulation training. \n\n5. Update emerging high-end threat capabilities into JSAF.  \n\n6. Integrate virtual and blended reality into the JLVC environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.041"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.041"
                                            },
                                            "Text": {
                                                "val": "1. Continue FY2019 efforts.\n\n2. Develop improvements to architecture and representations to support the effects of GPS jamming on sensors and weapons systems in partnership with the USAF Distributed Mission Operations Center – Space (DMOC-S).\n\n3. Develop and engineer web based graphical user interfaces to replace all existing desktop-based applications. Migrate existing desktop environment to virtualized solution. Implement failover and load balancing for simulation FY 2020 Plans: \n1. Continue FY2019 efforts.\n\n2. Develop improvements to architecture and representations to support the effects of GPS jamming on sensors and weapons systems in partnership with the USAF Distributed Mission Operations Center – Space (DMOC-S).\n\n3. Develop and engineer web based graphical user interfaces to replace all existing desktop-based applications. Migrate existing desktop environment to virtualized solution. Implement failover and load balancing for simulation components. Implement Software as a Service to align with the future joint training environment architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor funding reduction to balance RDT&E program."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer (subject matter expert) capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to: time, money, realism, and fidelity and are defined below.\n\nTime – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more timely than current capabilities allow?\n\nCost – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n\nRealism – Will the effort enable the Joint Force Trainer (subject matter expert) to create a training environment that is closer to the real world environment than current capabilities allow?\n\nFidelity – Will the effort enable the Joint Force Trainer (subject matter expert) to create more detailed capabilities in the training environment than current capabilities allow?\n\nThe Navy will produce one Navy training baseline software release to include documentation; will design and implement upgrades to Joint Semi-Automated Forces (JSAF) consistent with approved requirements and contractual requirements and document the effects of JSAF capabilities and stability.  Will design, implement, test, and integrate enhancements in accordance with requirements.\n\nFor JSAF, Joint Simulation BUS (JBUS) reliability, scalability, and tactical control, the Navy will continuously update the common operational picture during large scale JLVC exercises."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "773"
                    },
                    "ProjectTitle": {
                        "val": "Joint Interoperability Division (JID)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.845"
                        },
                        "BudgetYearOne": {
                            "val": "1.419"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.419"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.095"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "JID is the sole Department of Defense provider of joint interoperability training and Joint Interface Control Officer (JICO) production.  JID trains CCMD, Services and partner nations' operations center personnel in mission areas such as joint fires, net enabled weapons, remotely piloted aircraft, integrated air and missile defense, and contested operations including secure internet with Link-16\/TDL equipped major weapon systems and smart bombs. FY19 was the first year the JID received RDT&E funding in order to support the development of the JICO Simulator. The JICO Simulator will allow the JID to train students across the Services on the proper planning, management and execution of tactical data links (TDL) to fill the gaps for non-participating weapon systems missing in live exercises."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Interoperability Division (JID)"
                                    },
                                    "Description": {
                                        "val": "JICO Simulator will allow the JID to train students across the Services on the proper planning, management and execution of tactical data links (TDL). The simulator will allow the JID to build robust practice scenarios that students can execute fixing TDL architecture plans as necessary. This capability will not only create realistic training scenarios with the ability to inject multi-tactical data link network anomalies for training, but can also be used to support Combatant Command (CCMD) operations centers during planned exercises."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.845"
                                            },
                                            "Text": {
                                                "val": "Build robust practice scenarios for JICO\/TDL students.\n\nAutomate OPTASK LINK planning message construction.\n\nEmulate Joint Tactical Information Distribution System (JTIDS), Multifunctional Information Distribution System (MIDS), Satellite Transportable Terminal (STT) radio operations between weapon systems.\n\nProduce track files with all fields, words and message sets.\n\nPopulate TDL tabular displays for all weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.419"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.419"
                                            },
                                            "Text": {
                                                "val": "Show data link operations effects with degraded satellites and SIPR connectivity.\n\nProvide multi-level security to Partner Nations' picture.\n\nInject TDL information (including NATO Link-22) into CCMD, Component and Partner Nation operations centers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor funding reduction to balance RDT&E program."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Measures:\nCost - Vendor provides software enhancement costs within 10% of government estimate.\n\nSchedule - Vendor provides software releases delivered within one month of government estimate.\n\nPerformance - Vendor provides software that passes 80% of the Operations Assessment Cases.\n\nDoD Demand - Number of JICO courses, joint exercises, and JICO support team requests supported by the JICO simulator software.\n\nPartner Nation - Number of Five Eyes partner nations using the JICO Simulator software (active foreign military sales cases)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "774"
                    },
                    "ProjectTitle": {
                        "val": "USMC Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.921"
                        },
                        "BudgetYearOne": {
                            "val": "0.935"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.935"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.320"
                        },
                        "BudgetYearThree": {
                            "val": "0.320"
                        },
                        "BudgetYearFour": {
                            "val": "0.320"
                        },
                        "BudgetYearFive": {
                            "val": "0.320"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These funds advance USMC training capabilities by providing stability and risk reduction to a variety of efforts focused on improving the fidelity and realism of training simulation systems. These systems are tailored to prepare operational Marine Air Ground Task Force (MAGTF) units for worldwide deployment in support of CCMD operations and engagements and are available to any organization or entity training via the JLVC federation of training tools.  Based on the Commandant's planning guidance, the Marine Corps will continue to improve performance of the MAGTF Tactical Warfare Simulation in the areas of the JLVC-multi-resolution federation bridge, common database terrain data ingestion, and JLVC interoperability.  The MAGTF Tactical Warfare Simulation also provides a single source training environment capability that enables users to select single or multiple play boxes (terrain data sets) for training simulation systems easing the burden of requesting terrain, 3D models, and other geographic layers into a single source. In addition to developing an exercise planning, design, implementation, execution, and control tool, the MAGTF Tactical Warfare Simulation also enhances pattern of life (PoL) \/ indigenous population modular service enabling exercise designers the ability to rapidly build new scenarios and incorporate human geography elements into the training scenarios."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Marine Corps Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Provides pattern of life (POL) \/ indigenous population (IP) concept development and integration, supporting both constructive and virtual training simulation systems by injecting “people packs” with realistic attributes and behaviors associated with specified regions. Full integration of terrain generation 3D models and objects into joint federation synthetic training environment eliminates the burden of requesting terrain data by the Services and CCMDs creates a single, shareable, repository across the federation.  Addresses crucial integration of MTWS into the Korean side of multi-resolution federation bridge supporting Ulchi Focus Guardian covering training shortfalls in engineering obstacle simulations (minefields, chemical, anti-tank ditches, bridges, etc.). Initiates design and development of a joint exercise design and control tool enhancing connectivity across multiple platforms providing exercise planning, design and control within various joint simulation constructs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.921"
                                            },
                                            "Text": {
                                                "val": "Continue development of pattern-of-life (POL) models that can insert synthetic opposing forces and civilian population into scenarios that will autonomously respond with native behaviors of that region providing synthetic adversaries that adapt to various training scenarios in multi-domain joint training.\n\nProvide a capability for all simulation systems to use the same standardized terrain datasets across training domains. Sustain pre-deployment training for operations while supporting the readiness of deployed forces, particularly those primarily focused on global response force readiness.\n\nAddress crucial integration of MTWS into Korean side of multi-resolution federation bridge supporting Ulchi Focus Guardian covering shortfalls identified in addressing engineering obstacle simulations (minefields, chemical, anti-tank ditches, bridges, etc.).\n\nContinue design and development of a joint exercise design and control tool enhancing interoperability and connectivity across multiple platforms. Deliver sharper training environment definitions, assist with defining friendly, FY 2019 Plans: \nContinue development of pattern-of-life (POL) models that can insert synthetic opposing forces and civilian population into scenarios that will autonomously respond with native behaviors of that region providing synthetic adversaries that adapt to various training scenarios in multi-domain joint training.\n\nProvide a capability for all simulation systems to use the same standardized terrain datasets across training domains. Sustain pre-deployment training for operations while supporting the readiness of deployed forces, particularly those primarily focused on global response force readiness.\n\nAddress crucial integration of MTWS into Korean side of multi-resolution federation bridge supporting Ulchi Focus Guardian covering shortfalls identified in addressing engineering obstacle simulations (minefields, chemical, anti-tank ditches, bridges, etc.).\n\nContinue design and development of a joint exercise design and control tool enhancing interoperability and connectivity across multiple platforms. Deliver sharper training environment definitions, assist with defining friendly, enemy, neutrals (including joint multinational and synthetic forces), and support to concurrent planning tools.  \n\nExplore innovative ways to train for operations in strategically challenging transregional, multi-domain and multi-functional (TMM) environments. Use web-based cloud technologies to accelerate exercise development and execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.935"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.935"
                                            },
                                            "Text": {
                                                "val": "Continue development of pattern-of-life (POL) models that can insert synthetic opposing forces and civilian population into scenarios that will autonomously respond with native behaviors of that region providing synthetic adversaries that adapt to various training scenarios in multi-domain joint training.\n\nProvide a capability for all simulation systems to use the same standardized terrain datasets across training domains. Sustain pre-deployment training for operations while supporting the readiness of deployed forces, particularly those primarily focused on global response force readiness.\n\nAddress crucial integration of MTWS into Korean side of multi-resolution federation bridge supporting Ulchi Focus Guardian covering shortfalls identified in addressing engineering obstacle simulations (minefields, chemical, anti-tank ditches, bridges, etc.).\n\nContinue design and development of a joint exercise design and control tool enhancing interoperability and connectivity across multiple platforms. Deliver sharper training environment definitions, assist with defining friendly, enemy, neutrals (including joint multinational and synthetic forces), and support to concurrent planning tools.  \n\nExplore innovative ways to train for operations in strategically challenging transregional, multi-domain and multi-functional (TMM) environments. Use web-based cloud technologies to accelerate exercise development and execution."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor funding increase to balance RDT&E program."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures Marine Corps planners and the Joint Force Trainer (subject matter expert) capabilities involved in these development effort synchronize outcomes with warfighter requirements.  Performance metrics include, but are not limited to: time, money, realism, and fidelity and are defined below.\n\nTime – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training more timely than current capabilities allow.\n\nCost – Will the effort enable the Joint Force Trainer (subject matter expert) to prepare and execute training at a more effective and efficient cost than current capabilities allow.\n\nRealism – Will the effort enable the Joint Force Trainer (subject matter expert) to create a training environment that is closer to the real world environment than current capabilities allow.\n\nFidelity – Will the effort enable the Joint Force Trainer (subject matter expert) to create more detailed capabilities in the training environment than current capabilities allow.\nThe Marine Corps will provide key elements of the proposed change that will allow the USMC to structure a variety of LVC enhancements in a more cost-effective manner to support training efforts within the GRF, NATO, CCMDs, SP-MAGTF and other deploying forces.  By expanding the capabilities of existing capabilities through partnerships and cost-sharing efforts that focus on emerging theater training requirements, the changes proposed herein leverage cloud and other technologies to provide the training necessary to address several DoD goals and objectives listed in Commandant's planning guidance and Chairman’s joint training guidance."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "775"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Distributed Learning (ADL)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.000"
                        },
                        "BudgetYearThree": {
                            "val": "3.000"
                        },
                        "BudgetYearFour": {
                            "val": "3.000"
                        },
                        "BudgetYearFive": {
                            "val": "3.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The ADL Initiative supports innovation and provides policy oversight to help the Services, Joint Staff, and partner agencies deliver their training and education more efficiently and cost effectively—anytime, anywhere. ADL provides policy oversight and coordination across DoD, Coalition partners, and other Federal agencies for distributed learning. This work supports interoperability (i.e., ensuring interagency technical and organizational systems function together). Ultimately, this promotes personnel readiness, ensuring the right people receive the right training and education, at the right time, and at the right cost."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Distributed Learning (ADL)"
                                    },
                                    "Description": {
                                        "val": "The ADL Initiative supports innovation and provides policy oversight to help the Services, Joint Staff, and partner agencies deliver their training and education more efficiently and cost effectively—anytime, anywhere. ADL provides policy oversight and coordination across DoD, Coalition partners, and other Federal agencies for distributed learning. This work supports interoperability (i.e., ensuring interagency technical and organizational systems function together). Ultimately, this promotes personnel readiness, ensuring the right people receive the right training and education, at the right time, and at the right cost."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "1. Continue implementation of revised DoDI 1322.26 requirements, while also providing coordination with Joint Services, and guidance on the incorporation of xAPI into distributed learning software systems.\n\n2. Provide support to joint services on transitioning emerging learning systems to include digital tutors, personal learning assistants, and the like which will further personalize training.\n\n3. Further develop research to provide learning science, specifications, guidance and best practices, and technology applications to the joint services in order to further enable their capabilities to deliver next generation learning across a distributed operations environment.\n\n4. Support enhancements to multinational training by continuing collaboration with coalition partners and gaining support to integrate e-learning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "1. Continue implementation of revised DoDI 1322.26 requirements, while also providing coordination with Joint Services, and guidance on the incorporation of xAPI into distributed learning software systems. Planned pilot test with JKO-based blended learning package (in conjunction with a Combatant Command exercise).\n\n2. Mobile Training Capability Enhancement for “informal micro-learning” via a smartphone system called the “PERvasive Learning System” (PERLS). Capability capitalizes on personnel learning experience outside of formal training\/education settings. Support software development integration of PERLS in JKO LCMS and Mobile tools.\n\n3. Learner-Centric, Total Learning Architecture (TLA). Develop next-generation interoperability specifications that will form the backbone for the “learner-centric, next-generation, technology-enabled” future joint learning environment, in direct support of Joint Force Development goals. FY20 TRL = 6\n\n4. Support enhancements to multinational training by continuing collaboration with coalition partners and gaining support to integrate e-learning into multination exercises."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of Joint Force Trainer (subject matter expert) capabilities synchronize with warfighter requirements.  Performance metrics include, but are not limited to: time, cost, realism, and fidelity.\n\nMeasures:\n1. Number of collaborative advanced technology demonstrations (i.e., projects supporting transition of new technology into joint training).\n\n2. Number of improvement plans defined (i.e., articulation of plans for future enhancements to joint training).\n\n3. Influence on key Service and international ADL meetings and conferences that advance the discovery, sharing and delivery of interoperable training content. \n\n4. Increase sharing of data among DoD, other federal agencies, and state and local education departments throughout the U.S. by making educational resources discoverable and retrievable."
                        }
                    }
                }
            ]
        }
    }
}