{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-26",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603607A"
        },
        "ProgramElementTitle": {
            "val": "Joint Service Small Arms Program"
        },
        "R1LineNumber": {
            "val": "67"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.628"
            },
            "CurrentYear": {
                "val": "22.799"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "28.427"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being eliminated, with continuity of effort realigned to the following PEs:\n* PE 0603118A Soldier Lethality Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates advanced technologies that provide greater lethality, target acquisition, fire control, and range at a significantly reduced weight. These technologies lighten the Soldier's load, provide improved battlefield mobility, and reduce logistics burden while maintaining or improving current levels of performance.     \n \nEfforts in this PE support the Army Science and Technology Lethality Portfolio. \n\nIn FY18\/FY19, work in this PE was related to and fully integrated with the efforts funded in PE 0602623A (Joint Service Small Arms Program), PE 0602624A (Weapons and Munitions Technology) and PE 0602618A (Ballistic Technology). Beginning in FY20, work in this PE is related to, and fully coordinated with PE 0603118A (Soldier Lethality Advanced Technology). \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work in this PE is performed by the  U.S. Army Futures Command (AFC)"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.796"
                },
                "CurrentYear": {
                    "val": "5.885"
                },
                "BudgetYearOne": {
                    "val": "4.604"
                },
                "BudgetYearOneBase": {
                    "val": "4.604"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.628"
                },
                "CurrentYear": {
                    "val": "22.799"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.168"
                },
                "CurrentYear": {
                    "val": "16.914"
                },
                "BudgetYearOne": {
                    "val": "-4.604"
                },
                "BudgetYearOneBase": {
                    "val": "-4.604"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.003"
                    },
                    "CurrentYear": {
                        "val": "-0.006"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "16.92"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.165"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.604"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.604"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19 congressional add ($16.920 million) for soldier lethality.\nIn FY20, this PE is eliminated due to Science & Technology portfolio financial restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "627"
                    },
                    "ProjectTitle": {
                        "val": "Jt Svc Sa Prog (JSSAP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.628"
                        },
                        "CurrentYear": {
                            "val": "5.879"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.507"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603118A Soldier Lethality Advanced Technology, Project:\n* AY5 Soldier Squad Small Arms Armaments Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced technologies that provide greater lethality, target acquisition, fire control, training effectiveness and range at a significantly reduced weight. These technologies lighten the Soldier's load, provide improved battlefield mobility, and reduce logistics burden while maintaining or improving current levels of performance.     \n \nEfforts in this Project support the Army Science and Technology Lethality Portfolio.  \n\nIn FY 2018\/FY 2019 work in this Project is related to, and fully integrated with the efforts funded in Program Element (PE) 0602623A (Joint Service Small Arms Program) and PE 0602624A (Weapons and Munitions Technology). Beginning in FY 2020, work in this PE is related to, and fully coordinated with PE 0603118A (Soldier Lethality Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Volume Effects"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the maturation and demonstration of emerging small arms technologies from PE 0602623A efforts into current and next generation weapon systems to address Volume (sustained suppressive and lethal fires for area targets) capability gaps for improved effectiveness at extended ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.205"
                                            },
                                            "Text": {
                                                "val": "Continued to support technology development for Next Generation Squad Automatic Rifle (NGSAR) requirements; investigated weapon systems, fire control, and ammunition technologies to increase the current performance of the lightweight medium machine gun."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.9"
                                            },
                                            "Text": {
                                                "val": "Mature technology concepts to inform NGSAR requirements and optimize designs for the next generation carbines and Squad Designated Marksman (SDM) weapon systems; mature weapon system, fire control, and ammunition technologies to increase the current performance of the lightweight medium machine gun."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, this effort is realigned to PE 0603118A \/ Project AY5."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Effects"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation and demonstration of emerging small arms technologies from PE 0602623A efforts into current and next generation weapon systems to address precision fire (Precision fire is support fire in the offense during the assault and engagement of targets to the maximum effective range of the weapon), and fire control capability gaps for improved accuracy at extended ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.428"
                                            },
                                            "Text": {
                                                "val": "Optimized and demonstrated precision ammunition technologies to support precision ammunition requirements for extended range, accuracy and terminal effects required to perforate toughest targets and implement highly efficient aerodynamics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.008"
                                            },
                                            "Text": {
                                                "val": "Optimize and demonstrate anti-material, improved performance and subsonic precision ammunition in three different calibers to support requirements for extended range and increased accuracy and terminal effects required to meet those needs across multiple fielded or emerging weapon platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, this effort is realigned to PE 0603118A \/ Project AY5."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Systems Integration and Demo"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the maturation and demonstration of small arms component technologies resulting from PE 0602623A efforts and applied into advanced small arms technologies as to inform the user requirement process, address operational capability gaps and transition mature components and technology concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.495"
                                            },
                                            "Text": {
                                                "val": "Continued to increase lethality capabilities and assess small arms effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.45"
                                            },
                                            "Text": {
                                                "val": "Demonstrate next Generation Small Arms Squad Technologies at the Army Expeditionary Warrior Experiment (AEWE) in support of increasing small unit effectiveness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, this effort is realigned to PE 0603118A \/ Project AY5."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Service Small Arms Science and Technology Collaboration"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the continued operations of the Joint Service Small Arms Program (JSSAP) office to coordinate and harmonize new Services' materiel requirements with potential joint applications, and to maintain awareness of the Services' efforts to improve Small Arms capabilities thus reducing duplication of ongoing and planned technology, acquisition and sustainment activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Continued to manage Joint Services Small Arms Programs; continued technology developmental efforts on material solutions for transitioning to small arms programs of record; continued to influence small arms technology maturation activities in collaboration with North Atlantic Treaty Organization (NATO) partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.35"
                                            },
                                            "Text": {
                                                "val": "Continue to manage Joint Services Small Arms Programs; continue technology developmental efforts on material solutions for transitioning to small arms programs of record; continue to influence small arms technology maturation activities in collaboration with North Atlantic Treaty Organization (NATO) partners."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort ends in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.171"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62D"
                    },
                    "ProjectTitle": {
                        "val": "SMALL ARMS ADVANCED TECHNOLOGY DEV (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "16.92"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.920"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest FY 2019 Program Increase for Soldier Lethality."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Next Generation Squad Weapon - Carbine"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.8"
                                        },
                                        "Text": {
                                            "val": "Next Generation Squad Weapon - Carbine"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Squad Weapon Ammunition"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.12"
                                        },
                                        "Text": {
                                            "val": "Next Generation Squad Weapon Ammunition"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}