{
    "id": "2020-Army-PB-2040-JBOOK-6862ccffed1a667db11cb620e9184b2662501ed68aad7c3c768162a310d4d712-25",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606942A"
        },
        "ProgramElementTitle": {
            "val": "Assessments and Evaluations Cyber Vulnerabilities"
        },
        "R1LineNumber": {
            "val": "201"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "88.3"
            },
            "BudgetYearOne": {
                "val": "4.5"
            },
            "BudgetYearOneBase": {
                "val": "4.5"
            },
            "BudgetYearTwo": {
                "val": "4.5"
            },
            "BudgetYearThree": {
                "val": "4.5"
            },
            "BudgetYearFour": {
                "val": "4.5"
            },
            "BudgetYearFive": {
                "val": "4.68"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "110.980"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) funds cyber vulnerabilities evaluations of major weapon systems in alignment with Section 1647 of the National Defense Authorization Act (NDAA) for Fiscal Year (FY) 2016, and of critical infrastructure in alignment with Section 1650 of NDAA 2017. Efforts in this PE will: 1) identify, assess, and mitigate operational risk from cyber vulnerabilities as it pertains to critical Army weapon systems in an operational configuration; and 2) assure the confidentiality, availability, and integrity of the information and control systems that underpin Army facilities and critical infrastructure by inventorying and assessing Facility-Related Control Systems (FRCS).\n\nWeapon systems evaluations will assess and mitigate operational risk from a peer or near-peer adversary profile in accordance with existing testing requirements of the acquisition cycle. Where applicable, these evaluations will include tabletop exercises, lab assessments, and exercise\/operational assessments of Program Executive Officer Command, Control, Communications-Tactical (PEO C3T) and ground weapon systems. Cyber hardening efforts will apply knowledge from weapon systems vulnerability assessments to identify gaps and develop mitigation strategies to reduce operational risk and prioritize resources. Prioritization will be based on mission criticality, impact to readiness, and threat. This PE also provides for enhancement of existing Red Team elements and efforts attributed to Combatant Command mission-level cyber vulnerability assessments.\n\nEvaluations of cyber vulnerabilities at critical infrastructure will focus on Task Critical Assets, Defense Critical Assets, and on units with high priority Quadrennial Defense Review missions and their supporting infrastructure. This PE provides for the training of teams to conduct cyber vulnerability evaluations on critical infrastructure. Once trained, these teams will conduct cooperative vulnerability and penetration assessments (Blue Teaming), adversarial assessments (Red Teaming), and assist with conducting assessments of cyber dependencies, vulnerabilities and threats in accordance with DoDI 8501.1 \"Risk Management Framework.\" Funding will also provide for Contractor subject matter expertise to conduct Security Control Assessments and Deep Cyber Resiliency Assessments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "88.3"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "88.3"
                },
                "BudgetYearOne": {
                    "val": "4.5"
                },
                "BudgetYearOneBase": {
                    "val": "4.5"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.5"
                },
                "BudgetYearOneBase": {
                    "val": "4.5"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.5"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.5"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2020 funding is to continue conducting Cyberspace Operational Resiliency Assessments at both Platform and Installation levels (CORA-P\/I)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FL2"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Vulnerabilities Assessments and Evaluations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "88.3"
                        },
                        "BudgetYearOne": {
                            "val": "4.5"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.5"
                        },
                        "BudgetYearTwo": {
                            "val": "4.5"
                        },
                        "BudgetYearThree": {
                            "val": "4.5"
                        },
                        "BudgetYearFour": {
                            "val": "4.5"
                        },
                        "BudgetYearFive": {
                            "val": "4.68"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "110.980"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) funds cyber vulnerabilities evaluations of major weapon systems in alignment with Section 1647 of the National Defense Authorization Act (NDAA) for Fiscal Year 2016, and of critical infrastructure in alignment with Section 1650 of NDAA 2017. Efforts in this PE will: 1) identify, assess, and mitigate operational risk from cyber vulnerabilities as it pertains to critical Army weapon systems in an operational configuration; and 2) assure the confidentiality, availability, and integrity of the information and control systems that underpin Army facilities and critical infrastructure by inventorying and assessing Facility-Related Control Systems (FRCS).\n\nWeapon systems evaluations will assess and mitigate operational risk from a peer or near-peer adversary profile in accordance with existing testing requirements of the acquisition cycle. Where applicable, these evaluations will include tabletop exercises, lab assessments, and exercise\/operational assessments of Program Executive Officer Command, Control, Communications-Tactical (PEO C3T) and ground weapon systems. Cyber hardening efforts will apply knowledge from weapon systems vulnerability assessments to identify gaps and develop mitigation strategies to reduce operational risk and prioritize resources. Prioritization will be based on mission criticality, impact to readiness, and threat. This PE also provides for enhancement of existing Red Team elements and efforts attributed to Combatant Command mission-level cyber vulnerability assessments.\n\nEvaluations of cyber vulnerabilities at critical infrastructure will focus on Task Critical Assets, Defense Critical Assets, and on units with high priority Quadrennial Defense Review missions and their supporting infrastructure. First, this PE provides for the training of teams to conduct cyber vulnerability evaluations on critical infrastructure. Once trained, these teams will conduct cooperative vulnerability and penetration assessments (Blue Teaming), adversarial assessments (Red Teaming), and assist with conducting assessments of cyber dependencies, vulnerabilities and threats in accordance with DoDI 8501.1 \"Risk Management Framework.\" Funding will also provide for Contractor subject matter expertise to conduct Security Control Assessments and Deep Cyber Resiliency Assessments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyberspace Operational Resiliency Assessment ? Platform (CORA-P)"
                                    },
                                    "Description": {
                                        "val": "CORA-P is the Army?s response to Section 1647 of the 2016 National Defense Authorization Act (NDAA) which directed the Department of the Defense (DoD) to evaluate cyber vulnerabilities of major weapon systems. The effort will assess and mitigate operational risk from cyber vulnerabilities of major weapon systems from a peer or near-peer adversary profile in coordination with existing testing requirements of the acquisition cycle."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.8"
                                            },
                                            "Text": {
                                                "val": "Funding provides for the completion of the eight critical weapon systems already in some stage of the evaluation process.  Additionally, provides for the 11 remaining Program Executive Officer Command, Control, Communications-Tactical (PEO C3T) and ground weapon systems identified as a part of the Section 1647 directive by conducting tabletop exercises, lab assessments, and exercise\/operational assessments (where applicable). Provides for the enhancement of existing red team elements and efforts attributed to Combatant Command (COCOM) mission level assessments.  \n\nCyber hardening efforts will apply the knowledge from weapon systems vulnerability assessments (CORA-P) to identify the gaps, develop mitigation strategies to reduce operational risk and prioritize resources. Prioritization will be based on mission criticality, impact to readiness, and threat."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.25"
                                            },
                                            "Text": {
                                                "val": "The performance objectives is to conduct CORA-P vulnerability assessments and to produce the requisite vulnerability assessments reports in support of the Planning, Programming, and Budgeting and Execution (PPBE) cycle. These deliverables include extensive cyber tabletop exercises and other non-operational activities to identify precisely cyber threats that pose a risk to Army mission operations.  Identifying cyber threats to CORA-P\/I ensures that cyber survive-ability requirements are articulated sufficiently to ensure Army weapon systems and installations are designed\/redesigned to prevent, mitigate and recover from adversarial current and future cyber-attacks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 funding is to continue conducting CORA-P vulnerability assessments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyberspace Operational Resiliency Assessment ? Installation (CORA-I)"
                                    },
                                    "Description": {
                                        "val": "CORA-I is the Army?s response to Section 1650 of the 2017 NDAA which directed the DoD to develop and execute a plan to evaluate and mitigate cyber vulnerabilities of Army Installations critical infrastructure. The evaluations will focus on Task Critical Assets, Defense Critical Assets, and on units with high priority Quadrennial Defense Review (QDR) missions and their supporting infrastructure."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "57.5"
                                            },
                                            "Text": {
                                                "val": "Funding provides for the training of teams to conduct cyber vulnerability assessments on critical infrastructure. Once trained these teams will conduct cooperative vulnerability and penetration assessments (Blue Teaming), adversarial assessments (Red Teaming), and assist with conducting assessments of cyber dependencies, vulnerabilities and threats in accordance with DoDI 8510.1 ?Risk Management Framework.? Funding also provides for Contractor subject matter expertise to conduct Security Control Assessments and Deep Cyber Resiliency Assessments.\n\nThe 2017 Army Cybersecurity Strategy for FRCS established the requirement to inventory and conduct Risk Management Framework on legacy systems.  Concurrently, the Unified Facility Criteria 4-010-06 established the requirement to design cybersecurity protections into FRCS within all new MILCON projects.  The cyber hardening efforts will apply the knowledge from critical installation vulnerability assessments (CORA-I) to identify the gaps, develop mitigation strategies to FRCS, and prioritize resources. Prioritization will be based on mission criticality, impact to readiness, and threat."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.25"
                                            },
                                            "Text": {
                                                "val": "The performance objectives is to conduct CORA-I vulnerability assessments and to produce the requisite vulnerability assessments reports in support of the PPBE cycle. These deliverables include extensive cyber tabletop exercises and other non-operational activities to identify precisely cyber threats that pose a risk to Army mission operations.  Identifying cyber threats to CORA-P\/I ensures that cyber survive-ability requirements are articulated sufficiently to ensure Army weapon systems and installations are designed\/redesigned to prevent, mitigate and recover from adversarial current and future cyber-attacks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 funding is to continue conducting CORA-I vulnerability assessments."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}