{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-48",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604532D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Artificial Intelligence"
        },
        "R1LineNumber": {
            "val": "101"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "12.970"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "12.970"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "12.970"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "13.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Joint Artificial Intelligence Center"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.030"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018:  N\/A\nFY 2019:  Congressional Increase 13.000 million; FFRDC Reduction -0.030 million.\nFY2020:  N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "006"
                    },
                    "ProjectTitle": {
                        "val": "Joint Artificial Intelligence"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "12.970"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The JAIC was established to preserve and expand our military advantage in support of the Department’s 2018 National Defense Strategy. As a primarily executing body it will accelerate the delivery of Artificial Intelligence (AI) enabled capabilities, scale the Department-wide impact of AI, and synchronize DoD AI activities to expand Joint Force advantages.  The JAIC mission is to accelerate the delivery of AI to achieve impact scaled across the DoD at relevant speed to transform the DoD and ensure the nation maintains a competitive advantage.  JAIC capitalizes on Project Maven’s efforts as the pathfinder AI initiative for the DoD to further critical AI architecture and prototyping to rapidly expand AI to other mission areas. As JAIC efforts prove relevant, they will expedite technology transition from the laboratory to operational use, and increase Joint Force capability.  Most military data storage, utilization, and analytic tools and systems were designed pre-AI and require specialized integration to enable the insertion of algorithms into their software baseline. The JAIC will adopt or adapt commercial and government developed capabilities to improve warfighting and business processes. \n\nJAIC will execute an initial sequence of AI implementations, called National Mission Initiatives (NMI), to demonstrate value and create momentum. NMIs are high-priority, pressing operational or business reform challenges. Additionally, JAIC will work closely with individual components to help identify, shape, and accelerate component-specific AI deployments, called Component Mission Initiatives (CMI). Both NMI and CMI efforts will include government, commercial, and academic partners to prototype and develop standardized processes with respect to data, testing and evaluation, and cybersecurity. JAIC will use lessons learned from these initial projects to establish new processes and standards that will be repeatable across additional projects and immediately relevant to the Joint Force. This will be done in collaboration with partners across technology companies, consulting firms, academia, government labs, Federally Funded Research and Development Centers (FFRDC), services, and international partners.\n\nJAIC will scale use cases throughout the DoD in a manner that aligns with and leverages DoD enterprise cloud computing. It will establish a common foundation for scaling AI’s impact across DoD, including shared data, reusable tools, frameworks and standards, and cloud and edge services. This will drive greater value by enabling consistency of approach, technology, and tools for all delivery-focused AI projects.\nJAIC will foster shared lessons, and establish an enterprise approach while catalyzing efforts across DoD to enable more rapid and efficient prototyping and delivery of AI capabilities. JAIC will develop a governance framework and standards for AI development and delivery and collaborate within DoD, across government, and with industry, academia, and U.S. allies to strengthen partnerships, highlight critical needs, solve problems of urgent operational significance, and adapt AI technologies for DoD missions.\n\nJAIC develops, tests, prototypes and demonstrates innovative AI, Machine Learning (ML), data infrastructure, and model\/algorithm test and assessment capabilities to integrate AI capabilities across numerous domains and technical areas including maintenance and supply chain, personnel recovery, infrastructure assessment, geospatial monitoring during disaster, and cyber sense making. JAIC develops and evaluates integrated prototype technologies in realistic operating environments with DoD entities to assess the performance or cost reduction potential of applying such advanced technology to scale across multiple services.  JAIC does this by aligning rapid prototype projects under NMIs and leverages existing commercial technology for DoD use, built upon a common architecture that enables the DoD to rapidly scale AI capability.  \n\nFor the Predictive Maintenance NMI, JAIC uses artificial intelligence, deep learning, and predictive analytics to forecast major issues on the H-60 helicopter platform to better enable services to respond to upcoming failure. AI\/ML will help identify component failure relationships to principle end items to predict critical failure prior to corrective maintenance and reactive supply chain requisitions. This will increase efficiency, decrease fleet operating and sustainment costs for equipment platforms, and reduce the time and costs associated with repair part requisition, management and transportation. Predictive maintenance will increase fleet operational readiness through reduced deadline or degradation time, particularly by preventing critical failure during missions, thereby providing certainty for availability and tasking to combatant commands and Joint Forces. This NMI will also apply AI and ML to optimize positioning of tools, parts, and personnel to provide the Joint Force with the best location to provide efficient and cost-effective repair and supply depots.\n\nFor the Humanitarian Aid and Disaster Relief NMI, JAIC will use computer vision algorithms to detect, classify, and identify distressed or missing personnel, predict forest fire patterns and burn rates, and flooding that impact human life and infrastructure. JAIC does this within FMV images (e.g., person, forest fire lines, flood lines, terrain and infrastructure changes) and other AI algorithms for text based projects to coordinate disaster relief efforts. JAIC algorithms increase the intelligence value of ISR, reduce the human burden of screening so analysts can multi-task increasing productivity, and seeds the generation of insight from multiple intelligence sources.  This program is funded under Budget Activity 4, Demonstration and Validation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Joint Artificial Intelligence Center"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "NA"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "12.970"
                                        },
                                        "Text": {
                                            "val": "JAIC will use rapid prototype sprints to field increasing predictive maintenance capability for the H-60 helicopter fleet across the Joint Force. JAIC will use data aggregation, artificial intelligence, deep learning, and predictive analytics algorithms to detect, correlate, and predict component failure and optimize supply chain solutions. This initiative brings artificial intelligence, deep learning, and predictive algorithms into the maintenance and supply business processes of H-60 fleet management, utilizing Joint Force readiness and supply data to process at machine speed versus human speed. \nJAIC will also use rapid prototype sprints to field capability to the Joint Force that enables better response to natural disasters, particularly those caused by wildfires and flooding, both common worldwide. Computer vision and algorithms will not only reduce the human burden and provide efficient and effective exploration of data, but provide insights and capability that humans alone currently do not have the capacity to manage. JAIC will develop algorithms focused on ISR and geospatial data to develop baseline GEOINT and infrastructure, then analyze changes to that baseline to best provide humanitarian aid and disaster relief. This will aid in the more efficient, effective, and quick recovery of distressed humans, identify damage to infrastructure, and assist relief efforts or evacuation and aid response. Overall, this effort will reduce risk to human life, critical infrastructure, and improve U.S. response in times of regional or global crises. This effort will integrate AI and ML to provide actionable intelligence and enhance military decision-making by providing algorithms for predictive algorithms, computer vision to identify critical information requirements, and user alerts.\nThe JAIC will create a Joint Common Foundation (JCF) platform that will be crucial to the development, testing, and fielding of AI capabilities to the Department. This JCF will contain shared common components providing NMIs\/CMIs and the Department with the packages, frameworks, software, tools necessary to accelerate the adoption of AI-enabled capabilities. This includes the build out of AI platforms in a secure protected enclave hosted in a multi-cloud\/multi-domain environment which provides NMIs\/CMIs with compute, storage and security.\nThe JCF platform supports scalable delivery of novel, impactful AI capability across DoD through the use of several key infrastructure elements. This infrastructure\/environment will support each stage of the applied AI lifecycle, including: prototyping, integration, scaling, and support. The common foundation includes shared data, reusable tools, frameworks and standards, in addition to cloud and edge services.  As the JAIC scales and the common foundation develops, entities across DOD will be able to both use and contribute to the infrastructure, leveraging the “factory” of artifacts. This will be done in collaboration with industry and government partners, including technology companies, consulting firms, academia, government labs, and Federally Funded Research and Development Centers (FFRDC), and across the Department.\nThe JCF platform will promote information sharing and integration with Programs of Record by facilitating rapid deployment of AI capabilities into operational environments, military platforms and IT systems.  JAIC will establish its Tier 2 (Mission\/Business Processes) and Tier 3 (IS and PIT Systems)  RMF governance structure to comply with DoDI 8510.01, Risk Management Framework (RMF) for DoD Information Technology (IT) and DoDI 8500.01,  Cybersecurity. JAIC will appoint in writing officials to an organization CIO (Tier 2 position) and Authorizing Official (AO) and Authorizing Official Designated Representative (AODR) (Tier 3 positions) to meet the intend of DoD and OMB guidance."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "JAIC performance metrics are measured through internal management controls and external assessments. Performance metrics include, but are not limited to time, money, realism, fidelity, and transition as defined below:\n• Time – Enable the warfighter to execute processes faster than current capabilities allow. This includes the ability to process more, or higher levels of relevant knowledge and apply human cognitive capital to higher order judgments on a faster pace than previously capable.\n• Money – Enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities allow. This includes finding efficiencies in system lifecycle management, supply chain, replacement and repair, and more accurate requisitions, saving critical limited fiscal resources to be applied appropriately.\n• Time – Enable the warfighter to execute processes faster than current capabilities allow. This includes the ability to process more, or higher levels of relevant knowledge and apply human cognitive capital to higher order judgments on a faster pace than previously capable.  Field and transition relevant AI capabilities to the Department and build\/iterate during sprint intervals. Enable real time\/near-real time cohesive situational awareness and decision support at a pace faster than current manual aggregation and execution allow. \n• Money – Enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities allow. This includes finding efficiencies in system lifecycle management, supply chain, replacement and repair, and more accurate requisitions, saving critical limited fiscal resources to be applied appropriately. Decrease costs\/increase efficiencies in supply chain, personnel requirements, IT systems and infrastructure, equipment maintenance, and auditability over current costs and levels of measurable efficiency.\n• Readiness – Increase fleet readiness of equipment and personnel availability aggregated to increase overall Joint Force readiness to better meet current, planned, or emerging Department mission and exercise requirements. \n• Fidelity – Ensure unity of effort throughout the Department and external stakeholders for national imperative focus areas, while catalyzing and accelerating AI capabilities beyond what was previously projected to be accomplished during that time period. Provide relevant and scalable AI capabilities via agile sprint events that enables the Joint Force to build upon, iterate on, and implement relevant \nAI capabilities to meet specific operational or business needs when the Department needs them to maintain competitive advantage.\n• Transition – Select projects that have the greatest likelihood of adoption and transition to operational capabilities. Field capabilities that the Department has planned to implement and is ready to implement into new or existing programs of record within the FYDP."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Engineering Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.970"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Joint Artificial Intelligence 006"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "FY19 Project Execution"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}