{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-85",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0307588D8Z"
        },
        "ProgramElementTitle": {
            "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
        },
        "R1LineNumber": {
            "val": "189"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "221.235"
            },
            "BudgetYearOneBase": {
                "val": "221.235"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "45.261"
            },
            "BudgetYearThree": {
                "val": "45.234"
            },
            "BudgetYearFour": {
                "val": "45.193"
            },
            "BudgetYearFive": {
                "val": "46.255"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Algorithmic Warfare Cross Functional Team (AWCFT) funds Project Maven, a rapid fielding Artificial Intelligence (AI) program to augment and automate Processing, Exploitation and Dissemination (PED) for Full Motion Video (FMV) Tactical Unmanned Aerial Vehicles (TUAVs), Medium Altitude, High Altitude, and Wide Area Motion Imagery (WAMI) Intelligence, Surveillance and Reconnaissance (ISR) platforms in support of defeat-ISIS and National Defense Strategy (NDS) peer\/near peer competitor strategy. Maven also brings AI to Captured Enemy Material (CEM), Acoustical Intelligence (ACINT), Overhead Persistent Infrared program (OPIR) and Public Available Information (PAI) exploitation. Maven uses AI, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. Maven algorithms increase the intelligence value of ISR, reduce the human burden of screening so analysts can multi-task increasing productivity, and seeds the generation of insight from Geospatial Intelligence (GEOINT). Project Maven is a commercial technology initiative that inserts commercial AI into existing programs of records. Most military intelligence exploitation systems were designed pre-AI and require specialized integration to enable the insertion of algorithms into their software baseline. Project Maven is the pathfinder AI initiative for the DoD and is investing in critical AI architecture to support the rapid expansion of AI to other mission areas besides GEOINT. As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "221.235"
                },
                "BudgetYearOneBase": {
                    "val": "221.235"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "221.235"
                },
                "BudgetYearOneBase": {
                    "val": "221.235"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Departmental Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "221.235"
                                },
                                "BudgetYearOneBase": {
                                    "val": "221.235"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In order to delineate funding designation and mission execution, Algorithmic Warfare Cross Functional Teams (Maven) was transferred from PE 0305245D8Z to PE0307588D8Z beginning in FY 2020. In addition, the department increased FY 2020 across all appropriations in order for the DoD to invest in critical AI architecture to support the rapid expansion of AI to other mission areas besides GEOINT. As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "590"
                    },
                    "ProjectTitle": {
                        "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "221.235"
                        },
                        "BudgetYearOneBase": {
                            "val": "221.235"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "45.261"
                        },
                        "BudgetYearThree": {
                            "val": "45.234"
                        },
                        "BudgetYearFour": {
                            "val": "45.193"
                        },
                        "BudgetYearFive": {
                            "val": "46.255"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Algorithmic Warfare Cross Functional Team funds Project Maven which fields increasing amounts of automation to FMV ground exploitation stations for TUAVs, Medium Altitude, High Altitude ISR platforms and accelerates the development and deployment of AI capabilities across the Defense Intelligence Enterprise, including exploitation of CEM, ACINT, OPIR and PAI exploitation. Maven uses artificial intelligence, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. Maven algorithms increase the intelligence value of ISR, reduce the human burden of screening so analysts can multi-task increasing productivity, and seeds the generation of insight from GEOINT. Project Maven is a commercial technology initiative that inserts commercial AI into existing programs of records. Most military intelligence exploitation systems were designed pre-AI and require specialized integration to enable the insertion of algorithms into their software baseline. Project Maven is the pathfinder AI initiative for the DoD and is investing in critical AI architecture to support the rapid expansion of AI to other mission areas besides GEOINT. As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
                                    },
                                    "Description": {
                                        "val": "AWCFT funds Project Maven, a rapid fielding AI program to augment and automate PED for FMV of TUAVs, Medium Altitude, High Altitude, and WAMI ISR platforms in support of defeat-ISIS and NDS peer\/near peer competitor strategy. Maven also brings AI to CEM, ACINT, OPIR and PAI exploitation. Maven uses artificial intelligence, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. Maven algorithms increase the intelligence value of ISR, reduce the human burden of screening so analysts can multi-task increasing productivity, and seeds the generation of insight from GEOINT. Project Maven is a commercial technology initiative that inserts commercial AI into existing programs of records. Most military intelligence exploitation systems were designed pre-AI and require specialized integration to enable the insertion of algorithms into their software baseline. Project Maven is the pathfinder AI initiative for the DoD and is investing in critical architecture to support the rapid expansion of AI to other mission areas besides GEOINT. As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "221.235"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "221.235"
                                            },
                                            "Text": {
                                                "val": "Project Maven uses rapid prototype sprints to field increasing amounts of automation to FMV ground exploitation stations for TUAVs, Medium Altitude, High Altitude and WAMI ISR platforms and accelerate the development and deployment of AI capabilities across the Defense Intelligence Enterprise, including exploitation of CEM, ACINT,OPIR and PAI exploitation Maven will use artificial intelligence, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. This initiative brings artificial intelligence, deep learning, and computer vision into the process of object detection, identification, and tracking at computer process speed versus human speed. Incorporating computer vision and algorithms will reduce the human burden and provide efficient and effective exploration of data. Project Maven develops algorithms focused on tactical UAV FMV Automatic Target Recognition (ATR) and an operational PED environment for platforms and ground stations. AW builds capabilities, integrate AI and ML to provide actionable intelligence and enhance military decision-making by providing algorithms for object detection, classification and user alerts."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In order to delineate funding designation and mission execution, Algorithmic Warfare Cross Functional Teams (Maven) was transferred from PE 0305245D8Z to PE0307588D8Z beginning in FY 2020. In addition, the department increased FY 2020 across all appropriations in order for the DoD to invest in critical AI architecture to support the rapid expansion of AI to other mission areas besides GEOINT. As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform)."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M PE0307588D8Z"
                                    },
                                    "Title": {
                                        "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.825"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.825"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PROC PE0307588D8Z"
                                    },
                                    "Title": {
                                        "val": "Algorithmic Warfare Cross Functional Team (AWCFT)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.206"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.206"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "AWCFT’s contracting strategy follows guidance outlined in the DoD 5000 series directives, Federal Acquisition Regulation (FAR), Defense Federal Acquisition Regulation (DFAR) and rapid prototyping policies and procedures. Management uses project management tools and meetings to ensure delivery of stated capabilities and performance criteria are achieved."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance Metrics are measured through internal management controls and external assessments. Performance metrics include, but are not limited to, time, money, realism, fidelity, and transition as defined below:\n• Time – Enable the warfighter to take advantage of cutting edge technology to perform human burdened tasks at machine speed.  This allows the warfighter to perform more cognizant tasks and process more information at rapid speed.  \n• Money – Enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities allow.\n• Realism – Enable the warfighter to have a consolidated intelligence picture to increase the lethality by enabling faster and better decision making by the commander to execute operations in support of the National Defense Strategy.\n• Fidelity – Ensure unity of efforts throughout the Defense Intelligence Enterprise.\n• Transition – Establish a pipeline to allow Services to integrate Artificial Intelligence technology into programs of record to operationalize capabilities"
                        }
                    }
                }
            ]
        }
    }
}