{
    "id": "2020-AirForce-PB-3600-JBOOK-9cab6ddab5e5dde0a5f3a422686e60d747cb1b2bb20d871dd7edec860a0b0bf3-24",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603456F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "30.153"
            },
            "CurrentYear": {
                "val": "36.420"
            },
            "BudgetYearOne": {
                "val": "37.542"
            },
            "BudgetYearOneBase": {
                "val": "37.542"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "36.237"
            },
            "BudgetYearThree": {
                "val": "37.069"
            },
            "BudgetYearFour": {
                "val": "37.818"
            },
            "BudgetYearFive": {
                "val": "38.574"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to enhance Airman performance and effectiveness in the aerospace force. State-of-the-science advances are made in warfighter training, warfighter system interfaces, directed energy bioeffects, deployment and sustainment of warfighters in extreme environments, and understanding and shaping adversarial behavior. The Directed Energy Bioeffects Parameters project develops, demonstrates, and transitions technologies to predict,evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems. The Human Dynamics and Terrain Demonstration project develops, demonstrates, and transitions human-centric technologies to address processing, exploitation, and dissemination of intelligence, surveillance, and reconnaissance (ISR) capability needs. The Mission Effective Performance project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness. The Warfighter Interfaces project develops, demonstrates, and transitions technologies to revolutionize the way airmen synergistically use Air Force systems, including autonomous machines and adaptive teams of airmen and machines. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.635"
                },
                "CurrentYear": {
                    "val": "36.463"
                },
                "BudgetYearOne": {
                    "val": "37.541"
                },
                "BudgetYearOneBase": {
                    "val": "37.541"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "30.153"
                },
                "CurrentYear": {
                    "val": "36.420"
                },
                "BudgetYearOne": {
                    "val": "37.542"
                },
                "BudgetYearOneBase": {
                    "val": "37.542"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.482"
                },
                "CurrentYear": {
                    "val": "-0.043"
                },
                "BudgetYearOne": {
                    "val": "0.001"
                },
                "BudgetYearOneBase": {
                    "val": "0.001"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.027"
                    },
                    "CurrentYear": {
                        "val": "-0.043"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.960"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.495"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.001"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.001"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2018 in Other Adjustments is due to realignment of funds to PE 0602212F to support Research and Development Projects, 10 U.S.C. Section 2358."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635323"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Bioeffects Parameters"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.566"
                        },
                        "CurrentYear": {
                            "val": "5.251"
                        },
                        "BudgetYearOne": {
                            "val": "5.154"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.154"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.280"
                        },
                        "BudgetYearThree": {
                            "val": "6.602"
                        },
                        "BudgetYearFour": {
                            "val": "6.736"
                        },
                        "BudgetYearFive": {
                            "val": "6.871"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to predict, evaluate, and mitigate the effects of directed energy on personnel and mission performance, and exploits the offensive capabilities of directed energy systems.  This project also develops the human components of the guidelines for testing, deployment, and protection from high power microwave and high energy laser systems and uses this information to enhance the effectiveness of these weapon systems in air, space, and cyber operations.  The optical radiation bioeffects thrust develops and demonstrates technologies that counter optical threats, while exploiting optical systems for directed energy weapons applications.  The radio frequency (RF) radiation bioeffects thrust develops and demonstrates technologies to assess RF bioeffects and collateral hazards from high power RF directed energy systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate optical protective technologies for aircrew and ground personnel to provide protection against directed energy threats.  Develop modeling capabilities to assess collateral hazards from high power directed energy laser systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.666"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.247"
                                            },
                                            "Text": {
                                                "val": "Mature integration of predictive models of bioeffects and protection in Air Force Research Laboratory (AFRL) level analysis architectures. Complete first end-to-end methodology for incorporation of probabilistic risk-based assessments for lasers in a collateral damage estimation toolset.  Perform ground evaluation of prototype nuclear flash protection goggle to investigate  technology compatibility with cockpit displays and airman performance requirements. Mature high-energy laser bioeffects and safety analysis tools through validation and verification and end-user evaluation for initial transition to major test range environments to help advance Department of Defense directed energy concepts. Apply matured technologies to support of Self Protect High Energy Laser Demonstrator(SHiELD) Advanced Technology Demonstration and AFRL Laser Weapons System Program during ground and flight test safety planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.169"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.169"
                                            },
                                            "Text": {
                                                "val": "Provide hazard analysis for Self Protect High Energy Laser Demonstrator (SHiELD) ATD flight safety reports. Complete safety analysis for advancing Department of Defense directed energy concepts for safety review and technical review boards. Continue updates to glare models that predict mission impact from bright light exposures with real-world background illumination using validation and verification experimental results. Continue evaluation of next generation of nuclear flash-blindness technologies and the impact on mission performance. Continue integration of optical radiation hazard and vision analysis and tools into Advanced Framework for Simulation, Integration and Modeling (AFSIM) architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.078 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to assess radio frequency (RF) bioeffects and collateral hazards from high power RF directed energy systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "Integrate high average power bio-heat dosimetry models into distributed simulation environments.  Development of fast thermal gradient effects dosimetry validation models and continue effect model validation strategy.  Develop high peak power assessment models and tools to address real world concerns. Further develop\/refine high average power models and validation through use of empirical comparisons moving into finer resolution to include internal structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.985"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.985"
                                            },
                                            "Text": {
                                                "val": "Continue development and refinement of fast thermal gradient effects dosimetry validation models and continue effect model validation strategy. Continue development of high peak power assessment models and tools to address real world concerns. Investigate probability of injury from RF exposures through use of modeling and empirical comparisons. Continue integration of RF hazard analysis and tools into Advanced Framework for Simulation, Integration and Modeling (AFSIM) architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.019 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635324"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics and Terrain Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.122"
                        },
                        "CurrentYear": {
                            "val": "5.408"
                        },
                        "BudgetYearOne": {
                            "val": "5.886"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.886"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.001"
                        },
                        "BudgetYearThree": {
                            "val": "7.446"
                        },
                        "BudgetYearFour": {
                            "val": "7.597"
                        },
                        "BudgetYearFive": {
                            "val": "7.749"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to identify human threats within the air, space, and cyber domains.  These technologies will enhance Air Force capabilities in intelligence, surveillance and reconnaissance (ISR), layered sensing, autonomous and adaptive decision-making systems, decision aids for computer network attack\/defense\/support, ISR force development and training, cross-cultural communication, human-centric exploitation of measurement and signatures intelligence, and advanced molecular diagnostic methodologies to assess airman performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate human-centered design processes and operational tools that optimize ISR information exploitation and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.507"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.771"
                                            },
                                            "Text": {
                                                "val": "Transition speech to text technologies to Distributed Ground System Special Operations Forces (DGS-SOF). Preparing for transition of multi-intelligence analysis tools and airman-machine collaboration technologies to Air Force Distributed Common Ground System (AF-DCGS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.104"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.104"
                                            },
                                            "Text": {
                                                "val": "Develop and transition multi-intelligence analysis tools and airman-machine collaboration technologies to Air Force Distributed Common Ground System (AF-DCGS) via enhanced research Content Management System (ICMS) and DCGS Open-Architecture. Prepare to transition global situation-awareness and decision-making capabilities to Air and Space Operations Center (AOC) and multi-domain operations centers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.333 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate machine translation and speech-to-text tools to support the span of Air Force mission areas including ISR and cyber operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.615"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.637"
                                            },
                                            "Text": {
                                                "val": "Develop initial context awareness of deep neural networks for improving automatic speech recognition and machine translation algorithms for Intelligence Surveillance Reconnaissance (ISR) analyst applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.782"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.782"
                                            },
                                            "Text": {
                                                "val": "Continue to advance and mature deep neural networks to improve automatic speech recognition, machine translation, and natural language processing technologies as applied to multimedia information."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.145 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635325"
                    },
                    "ProjectTitle": {
                        "val": "Mission Effective Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.984"
                        },
                        "CurrentYear": {
                            "val": "6.795"
                        },
                        "BudgetYearOne": {
                            "val": "6.930"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.930"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.069"
                        },
                        "BudgetYearThree": {
                            "val": "7.213"
                        },
                        "BudgetYearFour": {
                            "val": "7.358"
                        },
                        "BudgetYearFive": {
                            "val": "7.505"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions advanced training, simulation, mission rehearsal, and other performance-aiding methods and technologies to enhance warfighter readiness.  This project also develops advanced methods and technologies to enable interactive live, virtual, and constructive (LVC) environments for performance-aiding methods and technologies.  Focus areas include integrated high-fidelity weapon systems training technologies for air, space, and cyber; tailored immersive simulation environments for airmen at the tactical and operational levels; and incorporation of performance assessment and feedback tools.  These methods and technologies facilitate the development of mission-essential competencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate secure, persistent, and standardized LVC training enterprise.  Utilize modeling capabilities for technology demonstration efforts focused on developing software-based tools for training that would replace human instructors.  This enables more efficient mission execution training in an LVC environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.984"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.795"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of sharable content across domain for airman machine team and multi-domain command and control. Define data and content standards and establish warehouse for multiple domain performance data to enable proficiency-based training. Test and evaluate proficiency-based training at an operational unit. Increase after action review data visualization for real-time lessons learned and training effectiveness. Create interfaces permitting alignment of learner\/operator engagement in learning contexts and resulting mission readiness and performance outcomes in operational contexts. Perform assessments and evaluations of common range and simulation architecture technologies for Live, Virtual, and Constructive training capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.930"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.930"
                                            },
                                            "Text": {
                                                "val": "Continue development of proficiency-based training metrics and assessments in operational contexts. Continue multi-domain operations training development and demonstration. Continue field evaluations for performance-based after action review visualization tools in unit-level and Red Flag-Level training and rehearsal. Continue  assessments and evaluations of common range and simulation architecture technologies for Live, Virtual, and Constructive training capabilities. Create methods for rapid development of mission-oriented software agent applications. Develop contested degraded operations environment for multi-domain operations training and rehearsal."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.135 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635327"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Interfaces"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.481"
                        },
                        "CurrentYear": {
                            "val": "18.966"
                        },
                        "BudgetYearOne": {
                            "val": "19.572"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.572"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "17.887"
                        },
                        "BudgetYearThree": {
                            "val": "15.808"
                        },
                        "BudgetYearFour": {
                            "val": "16.127"
                        },
                        "BudgetYearFive": {
                            "val": "16.449"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, demonstrates, and transitions technologies to revolutionize the way airmen optimize the capabilities of Air Force systems, including autonomous machines and adaptive teams of Airmen and machines.  Improvements in the presentation of operational information to the community of users, from the system operator to the commander, must be developed in step with advancements in the acquisition, storage, and retrieval of information.  This project provides the advances in understanding of human cognitive abilities, as well as the utilization of human interfaces, multisensory fusion, high-resolution image displays, and three-dimensional (3D) audio to customize communications and enhance shared understanding across a diverse user community in air, space, and cyber for maximum situational awareness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Demonstrate ability to forecast acoustic profiles for any atmospheric\/terrain condition.  Demonstrate technologies to enhance the battlefield Airman's situational awareness through wearable interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.644"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.712"
                                            },
                                            "Text": {
                                                "val": "Continue 3D audibility modeling research for special operations aviation focusing on effects of atmospherics, terrain, and psychoacoustic performance, and continue development\/refinement of advanced interfaces for real-time interaction with acoustic models of listening environments. Continue conducting usability testing and employing advanced engineering methodologies\nfor rapid prototyping, testing and seamless integration of innovative technologies into tactical ensembles supporting Battlefield Airmen and Para-rescue operations. Continue to transition enhanced, man-wearable communication systems, mobile interfaces, and physiological sensors to enhance situation awareness, improve training, and support real-time battlespace monitoring for dismounted operators."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.862"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.862"
                                            },
                                            "Text": {
                                                "val": "Validate understanding of limitations in human auditory perception to build acoustic countermeasures to control perception of special aviation acoustic signatures. Continue to develop 3D audibility models for special operations aviation through the exploitation of high-fidelity acoustic measurements focusing on effects of atmospherics and terrain. Conduct usability testing and employ advanced engineering methodologies for rapid prototyping, testing and seamless integration of man-wearable communication systems, mobile interfaces, and physiological sensors into tactical ensembles supporting Battlefield Airmen and Para-rescue operations. Expected transitions include a suite of e-textile solutions eliminating conventional cabling through-out tactical vests, an integrated\/wireless hub transfer of power and data to body-worn peripheral devices, and an array rapidly developed technology in response to urgent needs of dismounted operators."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.150 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an integrated human-centered interface for Human-Machine Teaming (HMT) scenarios to control multiple Remotely Piloted Aircraft (RPA) that have various levels of autonomy and that optimize net-centric information flow. Develop and demonstrate manned\/unmanned interaction and team concepts for tactical environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.837"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.254"
                                            },
                                            "Text": {
                                                "val": "Flight demonstrate airman-directed control and management of multiple unmanned tactical behaviors.  Develop and integrate decision support and embedded intelligent agent capabilities to assess and reason about manned-unmanned team performance and overall mission effectiveness.  Demonstrate adaptive human-machine interfaces and task allocation methods in virtual and live tests.  Initiate matrixed cooperative teams in networked simulation environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.710"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.710"
                                            },
                                            "Text": {
                                                "val": "Flight demonstrate airman-directed control and management of multiple unmanned tactical behaviors involving increasingly complex mission sets (e.g., dynamic mission objectives, high uncertainty, unreliable communication links). Demonstrate integrated decision support and embedded intelligent agent capabilities to assess and reason about manned-unmanned team performance and overall mission effectiveness. Continue to demonstrate adaptive human-machine interfaces and task allocation methods in virtual and live tests in operationally relevant environments. Demonstrate teaming concepts and technologies among cooperative human-machine teams in networked simulation environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.456 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}