{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-21",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603463A"
        },
        "ProgramElementTitle": {
            "val": "Network C3I Advanced Technology"
        },
        "R1LineNumber": {
            "val": "62"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "106.899"
            },
            "BudgetYearOneBase": {
                "val": "106.899"
            },
            "BudgetYearTwo": {
                "val": "129.790"
            },
            "BudgetYearThree": {
                "val": "135.791"
            },
            "BudgetYearFour": {
                "val": "146.246"
            },
            "BudgetYearFive": {
                "val": "144.512"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "663.238"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) was previously funded, with continuity of effort realigned from the following PEs:\n\n* PE 0603006A Space Application Advanced Technology\n* PE 0603270A Electronic Warfare Technology\n* PE 0603710A Night Vision Advanced Technology\n* PE 0603728A Environmental Quality Technology Demonstrations\n* PE 0603734A Military Engineering Advanced Technology\n* PE 0603772A Advanced Tactical Computer Science and Sensor Technology\n* PE 0603794A C3 Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures and demonstrates technologies to provide an Army tactical network and enabling infrastructure that support operations in any environment, to include where the electromagnetic spectrum is denied or degraded. This is accomplished through the exploitation and optimization of components and systems for robust, low signature communications and data networks; assured positioning, navigation, and timing in contested environments; converged and coordinated cyber and electronic warfare activities; resilient mission command on the move; and the collection, processing, and dissemination of information for intelligence, surveillance, and reconnaissance.\n\nAM7 optimizes autonomous networking protocols to automate the Primary, Alternate, Contingency, and Emergency (PACE) communication plan to initialize, adapt, and continue operations under changing environments and threats. AN4 demonstrates non-traditional waveforms and technologies for resilient communications in contested environments providing anti-jam, low probability of intercept, and low probability of detection for the dismounted and vehicular user. AN6 matures technologies providing increased resiliency for Wideband Satellite Communications (SATCOM) through the use of technologies including adaptive interference mitigation and diversity through multiple paths. AN8 and AN01 demonstrates high fidelity Cyber-Electromagnetic Activity (CEMA) situational understanding by exploiting tactical receivers with sufficient capabilities as sensors. AO3 matures and demonstrates technologies and capabilities to provide a robust and reliable communications capabilities by leveraging commercial technologies and enhancing their operation to maintain network connectivity in contested and congested environments. AO6 matures and demonstrates networked and integrated surveillance, communications, and command and control capabilities for high altitude and tactically responsive space payloads to enable information superiority, enhanced situational awareness, and support global assured access enabling distributed tactical operations. AO7 matures and demonstrates technologies that understand contested spectrum points, sense, locate, and cue fires missions to create windows of opportunity in A2\/AD environments, restore network capabilities, and enable maneuver and fires. AO9 demonstrates enhanced awareness of the information's \"provenance\" from originator to consumer (e.g. sensor to shooter) in the presence of cyber attacks, such as an attempt to manipulate data traversing the network. AP2 demonstrates disruption of enemy cyber attack through the use of cyber decoy applications with realistic user behavior algorithms, such as software that creates fake users, applications, systems, documents, networks, and communication traffic. AP6 provides System of Systems (SoS) engineering rigor on Science & Technology (S&T) projects by providing field-based risk reduction processes, quantifiable technology performance in a SoS context, data-driven programmatic decision support, and field-based performance data to supplement Technology Readiness Level (TRL) assessments. AP8 provides unified communications for the Army's modernization priorities through operationally-relevant, end-to-end network demonstrations which leverage Science & Technology (S&T) and commercial technology adapted to mitigate performance gaps in the presence of electronic warfare (EW) systems and reduce network complexity. AP9 improves performance of technologies to provide assured and resilient reach-back communications in satellite denied or degraded environments. AQ1 validates and demonstrates technologies that provide obfuscation of radio frequency (RF) spectrum signature in order to counter enemy electronic surveillance capabilities. AQ4 matures and demonstrates advanced mission management tools and workflows, to promote efficient selection and sequencing of effects to support the agile deployment and execution of Offensive Cyber Operations (OCO)\/RF Enabled capabilities. AQ5 matures and demonstrates an interoperability architecture consisting of standards, interfaces, and service; the application managers will have added artificial intelligence and functionality that allows for improved collaboration, survivability and recoverability, security, and adaptability to a dynamic network. AR2 matures and demonstrates software, algorithms, communication and control methodologies that allow more expedient, efficient, and informed use of energy resources across the battlefield. AR4 demonstrates and optimizes technologies to allow Soldiers to maneuver faster around or through existing environmental (urban\/industrial) conditions and physical landscape constraints. AR6 matures and demonstrates tools that provide capability to inform the Solider of different routes through a complex urban landscape. AS9 matures and demonstrates kitted hardware and software solutions to enable near-real-time battlespace awareness to persistently monitor and update COE regarding critical infrastructure conditions. AT3 matures and demonstrates an integrated suite of subterranean threat detection and vulnerability assessment\/decision technologies that enhance survivability and threat awareness for the soldier operating in urban, complex, and varied environments with subterranean domains. AT8 integrates and demonstrates geo-registration, feature extraction, change detection, data visualization and transmission capabilities. AU1 matures and demonstrates next generation geospatial analytical tools for 3D complex environments applicable to low echelon and tactical edge exploitation. AU4 designs, demonstrates, integrates and transitions to the Army Command Post Computing Environment, a geospatially enabled collaborative planning environment, accessible across echelons. AU6 designs and demonstrates advanced technologies to understand and visualize threat patterns and operational environment changes and support mission planning. AV2 matures and demonstrates Low Earth Orbit Constellation Management architectures and protocols. AV8 matures and demonstrates capabilities allowing the Army to monitor, understand, and control the Navigation Warfare (NAVWAR) environment. AW2 improves localization and decision making of Robotic\/Autonomous Systems by optimizing use of sensors on the platform and taking advantage of all available navigation signals; leverages Assured Positioning, Navigation, and Timing (PNT) efforts. AW4 matures, demonstrates and performs modeling and simulation of PNT technologies to provide access to trusted PNT information in global positioning system (GPS) denied or degraded environments.\n\nWork in this PE complements PE 0602146A (Network C3I Technology), PE 0602782A (Command, Control, Communications Technology), PE 0602143A (Soldier Lethality Technology), PE 0602145A (Next Generation Combat Vehicle Technology), PE 0602146A (Network C3I Technology), PE 0602147A (Long Range Precision Fires Technology), PE 0602148A (Future Vertical Lift Technology), PE 0602150A (Air and Missile Defense Technology), PE 0603118A (Soldier Lethality Advanced Technology), PE 0603462A (Next Generation Combat Vehicle Advanced Technology), PE 0603464A (Long Range Precision Fires Advanced Technology), PE 0603465A (Future Vertical Lift Advanced Technology), and PE 0603466A (Air and Missile Defense Advanced Technology).\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the U.S. Army Futures Command (AFC), the U.S. Army Space and Missile Defense Command (SMDC) and U.S. Army Engineer Research and Development Center (ERDC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "106.899"
                },
                "BudgetYearOneBase": {
                    "val": "106.899"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "106.899"
                },
                "BudgetYearOneBase": {
                    "val": "106.899"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "106.899"
                                },
                                "BudgetYearOneBase": {
                                    "val": "106.899"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 adjustments realign program funding from other Program Elements in the Science and Technology (S&T) portfolio in support of the Army Modernization Priorities and National Defense Strategy."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AM7"
                    },
                    "ProjectTitle": {
                        "val": "Modular RF Communications Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "15.82"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.82"
                        },
                        "BudgetYearTwo": {
                            "val": "9.427"
                        },
                        "BudgetYearThree": {
                            "val": "5.2"
                        },
                        "BudgetYearFour": {
                            "val": "6.1"
                        },
                        "BudgetYearFive": {
                            "val": "8.922"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "45.469"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0603794A C3 Advanced Technology, Project: \n* EL4 Tactical Comms and Networking Technology Int"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project optimizes autonomous networking protocols to automate the Primary, Alternate, Contingency, and Emergency (PACE) communication plan to initialize, adapt, and continue operations under changing environments and threats. Work in this Project complements PE 06022146A\/\\Project AM6 (Modular RF Communications Technology).\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modular RF Communications Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This project optimizes autonomous networking protocols to automate the Primary, Alternate, Contingency, and Emergency (PACE) communication plan to initialize, adapt, and continue operations under changing environments and threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.82"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.82"
                                            },
                                            "Text": {
                                                "val": "Will optimize autonomous techniques and algorithms for network initialization, detection, and\/or adaption; optimize the architecture design to enable validation of algorithms for network and networking technology initialization from initial start-up condition and\/or initial contact with an autonomous networking algorithm; demonstrate multiple approaches to autonomous networking by providing algorithms to detect available networks and networking technologies available to a single node or user, initialize network technology, and\/or adapt the changing environmental conditions, such as hostile electronic warfare emitters; mature shared interfaces between network technologies and an autonomous networking algorithms to enable initialization, detection, selection, and\/or control of networks and demonstrate the interfaces enabling the autonomous network operation in a relevant laboratory environment; validate initial instantiation of the network routing algorithms are able to optimally select and switch among the available networks to traverse data from originator to consumer across the overall tactical network in congested and electronic warfare contested environments; deliver initial routing and switching software code and documentation for demonstration in program of record systems; publish the first version of an interface standard between network technologies and an autonomous network detection and adaptation algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE0603794\/Project EL4 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AM9"
                    },
                    "ProjectTitle": {
                        "val": "Protected SATCOM Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "7.545"
                        },
                        "BudgetYearThree": {
                            "val": "16"
                        },
                        "BudgetYearFour": {
                            "val": "19"
                        },
                        "BudgetYearFive": {
                            "val": "18.835"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "61.380"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AN2"
                    },
                    "ProjectTitle": {
                        "val": "Narrowband SATCOM Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "5"
                        },
                        "BudgetYearThree": {
                            "val": "10"
                        },
                        "BudgetYearFour": {
                            "val": "16"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.000"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AN4"
                    },
                    "ProjectTitle": {
                        "val": "Non Traditional Waveforms Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5.5"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.5"
                        },
                        "BudgetYearTwo": {
                            "val": "11.178"
                        },
                        "BudgetYearThree": {
                            "val": "8"
                        },
                        "BudgetYearFour": {
                            "val": "4.464"
                        },
                        "BudgetYearFive": {
                            "val": "9.534"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.676"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this project was realigned from:\nProgram Element (PE) 0603794A C3 Advanced Technology Project: \n* EL4 Tactical Comms and Networking Technology Int"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project demonstrates non-traditional waveforms and technologies for resilient communications in contested environments providing anti-jam, low probability of intercept, and low probability of detection for the dismounted and vehicular user. This Project optimizes technologies not typically applied to the tactical environment, such as millimeter wave communications and directional networking with coherent combining of radio frequency signals, to maintain networked communications in and under contested and congested electromagnetic spectrum environments. Work in this Project complements PE 06022146A\/Project AN3 (Non Traditional Waveforms Technology).\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non Traditional Waveforms Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This project demonstrates non-traditional waveforms and technologies for resilient communications in contested environments providing anti-jam, low probability of intercept, and low probability of detection for the dismounted and vehicular user.  This project optimizes technologies not typically applied to the tactical environment, such as millimeter wave communications and directional networking with coherent combining of radio frequency signals, to maintain networked communications in and under contested and congested electromagnetic spectrum environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.5"
                                            },
                                            "Text": {
                                                "val": "Will mature cooperative beamforming technology to support dismounted or mounted operations; provide increased capacity in a contested environment to dismounted and mounted communications using cooperative technology, such as the dismount distributed tactical beamforming system, to support additional number of users and data throughput; demonstrate dismounted network technology providing local networking among dismounted unit in support of low probability of detection\/intercept communication to distant nodes, using technology such as distributed cooperative beamforming; demonstrate millimeter wave communications systems in a relevant field environments to validate performance characteristics of the delivered technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE0603794\/Project EL4 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AN6"
                    },
                    "ProjectTitle": {
                        "val": "Prot SATCOM-WB Global SATCOM Inter Canc Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2"
                        },
                        "BudgetYearOneBase": {
                            "val": "2"
                        },
                        "BudgetYearTwo": {
                            "val": "2"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603794A C3 Advanced Technology, Project: \n* EL4 Tactical Comms and Networking Technology Int"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures technologies providing increased resiliency for Wideband Satellite Communications (SATCOM) from contested and congested electromagnetics through the use of technologies including adaptive interference mitigation and diversity through multiple paths. Wideband SATCOM is the primary high-bandwidth Beyond Line of Sight (BLOS) Communications used by the tactical Army and this project demonstrates protection of this valuable communication link. Work in this Project complements PE 06022146A\/Project AN5 (Protected SATCOM-WB Global SATCOM Inter Canc Tech).\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Prot SATCOM-WB Global SATCOM Inter Canc Adv Tech"
                                    },
                                    "Description": {
                                        "val": "This project matures technologies providing increased resiliency for Wideband Satellite Communications (SATCOM) from contested and congested electromagnetics through the use of technologies including adaptive interference mitigation and diversity through multiple paths.  Wideband SATCOM is the primary high-bandwidth Beyond Line of Sight (BLOS) Communications used by the tactical Army and this project demonstrates protection of this valuable communication link."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will optimize Wideband Global Satellite (WGS) Ka-band interference cancelling technology modem algorithms based on lessons learned from previous over the air demonstrations; validate the Ka-band interference cancelling technology planning tool predicted performance matches actual field demonstration performance against Warfare (EW)  threats; provide modem enhancements to validate Ka-band interference cancelling technology for field based demonstrations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE0603794\/Project EL4 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AN8"
                    },
                    "ProjectTitle": {
                        "val": "COE - Every Receiver is a Sensor Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5.978"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.978"
                        },
                        "BudgetYearTwo": {
                            "val": "6.118"
                        },
                        "BudgetYearThree": {
                            "val": "6.24"
                        },
                        "BudgetYearFour": {
                            "val": "6.365"
                        },
                        "BudgetYearFive": {
                            "val": "6.436"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.137"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603772A Advanced Tactical Computer Science and Sensor Technology, Project: \n* 243 Sensors and Signals Processing"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and codes advanced automated exploitation and fusion analysis tools, applications, and software services that harvest, correlate and fuse tactical receiver sources with new and emerging data sources to improve understanding of the threat picture and more efficiently support near-real time Situational Understanding of the battlefield.\n\nWork in this Project complements PE 06033463A (Network C3I Advanced Technology) \\ Project AO1 (UNT - Every Receiver is a Sensor Advanced Tech).\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Data Analytics for Situational Awareness"
                                    },
                                    "Description": {
                                        "val": "This effort develops software technologies for intelligence\/mission command (MC) mission collaboration to provide faster and higher quality decision making support for the commander and his key staff. Specific efforts focus on integrating intelligence, surveillance and reconnaissance (ISR) planning and execution at the Task Force\/Battalion through troop-level, as well as efforts that provide the capability to identify, fuse, and trace\/track specific targets in an asymmetric environment. Work accomplished under Program Element (PE) 0602146A\/Project AN7 complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.978"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.978"
                                            },
                                            "Text": {
                                                "val": "Will evaluate open source and commercial-off-the-shelf (COTS) technologies to support the creation of a converged data platform which will unify tactical data silos across the warfighting functions (such as: Intel and Operations data sets), resolve data access limitations, and prioritize critical data sharing. Integrate selected data management and information sharing technologies to create initial converged data platform and demonstrate the improvement to tactical situational awareness in both timeliness and accuracy by maturing initial analytic capabilities, leveraging these aggregated data sources, to the converged data platform.\n\nWill evaluate and define communication pathways between current Mission Command, Fires, and Intelligence systems and scope potential deficiencies and latencies. Map current Army and Joint targeting protocols to proposed data flows and identify potential for algorithmic support.  Mature system platforms capable of managing cross-domain, multi-INT, multi-platform data flows, and evaluate on the basis of speed, accuracy, and data integrity. Develop and demonstrate initial multi-INT algorithms capable of facilitating timely creation of intelligence to support long range fires missions.\n\nWill mature and demonstrate algorithms that can support distributed processing, exploitation, and dissemination (PED) workflows, increase automation, and augment analyst?s capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project is realigned from PE 0603772A\/243 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AO1"
                    },
                    "ProjectTitle": {
                        "val": "UNT - Every Receiver is a Sensor Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "6.7"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.7"
                        },
                        "BudgetYearTwo": {
                            "val": "8.7"
                        },
                        "BudgetYearThree": {
                            "val": "8.86"
                        },
                        "BudgetYearFour": {
                            "val": "10.908"
                        },
                        "BudgetYearFive": {
                            "val": "5.013"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "40.181"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603794A C3 Advanced Technology, Project: \n* EL4 Tactical Comms and Networking Technology Int\nPE 0603772A Electronic Warfare Technology, Projects:\n* K15 Advanced Comm ECM Demo\n* K16 Non-Commo ECM Tech Dem"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project demonstrates high fidelity Cyber-Electromagnetic Activity (CEMA) situational understanding by exploiting tactical receivers with sufficient capabilities as sensors. This Project optimizes real-time radio frequency mapping of the tactical environment in support of network operation and decision making. Work in this Project complements PE 06022146A (Network C3I Technology) \\ Project AN9 (UNT - Every Receiver is a Sensor Technology).\n\nWork in this Project complements PE 06033463A (Network C3I Advanced Technology) \\ Project AN8 (COE Every Receiver is a Sensor Technology).\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unified Network Transport (UNT) - Every Receiver is a Sensor Advanced Tech"
                                    },
                                    "Description": {
                                        "val": "This project demonstrates high fidelity Cyber-Electromagnetic Activity (CEMA) situational understanding by exploiting tactical receivers with sufficient capabilities as sensors.  This project optimizes real-time radio frequency mapping of the tactical environment in support of network operation and decision making."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will mature software algorithms on a software defined radio and demonstrate advanced radio tasking capabilities; validate performance measures for dynamic spectrum sensing\/advanced tasking algorithms in a relevant laboratory environment; optimize advanced tasking algorithms for use on legacy fielded systems to increase the number of sensors on the battlefield."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603794\/EL4 and PE 0603772A\/Project K15 and K16 in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi Intelligence Modernization supporting Multifunction Operations"
                                    },
                                    "Description": {
                                        "val": "This effort will leverage Intelligence Community investments in software frameworks and exploits against threat SOIs to develop a library of open, modular, and scalable software solutions to address identified capability gaps and to provide the commander with electronic situational awareness while at the same time protecting his assets from enemy deception and jamming. Work accomplished under PE 0602146\/Project AN7 complement this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate electronic support functions suitable for operation in a highly contested environment with enhanced techniques for geolocation. Will integrate techniques to harden and protect electronic support and attack assets from enemy electronic warfare."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603794\/EL4 and PE 0603772A\/Project K15 and K16 in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Highly Distributable UGS"
                                    },
                                    "Description": {
                                        "val": "This effort will develop a small, low cost sensor capability that can be distributed in mass quantity and tailored to specific electro-magnetic signals or other modalities (i.e. seismic) to allow the tactical commander to obtain relevant situational awareness data within a signal dense and contested operational environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.7"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.7"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate advanced ultra-low cost disposable sensing capabilities suitable for operation in a highly contested environment and demonstrate distributed signal survey utilizing large quantities of such sensors.  Demonstrate distributed sensor information feeding the larger electronic warfare framework for improved situational understanding."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603794\/EL4 and PE 0603772A\/Project K15 and K16 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AO3"
                    },
                    "ProjectTitle": {
                        "val": "Stand-In Advanced RF Effects (STARE) Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2"
                        },
                        "BudgetYearOneBase": {
                            "val": "2"
                        },
                        "BudgetYearTwo": {
                            "val": "5"
                        },
                        "BudgetYearThree": {
                            "val": "7.5"
                        },
                        "BudgetYearFour": {
                            "val": "5.56"
                        },
                        "BudgetYearFive": {
                            "val": "6.603"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "26.663"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603794A C3 Advanced Technology, Project: \n* EL4 Tactical Comms and Networking Technology Int\nPE 0603270A Electronic Warfare Technology, Project:\n* K15 Advanced Comm ECM Demo"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies and capabilities to provide a robust and reliable communications capabilities by leveraging commercial technologies and enhancing their operation to maintain network connectivity in contested and congested environments. Work in this Project complements PE 06022146A (Network C3I Technology) \\ Project AO2 (Robust Grey C3I Technology). \n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robust Grey C3I Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This project matures and demonstrates technologies and capabilities to provide a robust and reliable communications capabilities by leveraging commercial technologies and enhancing their operation to maintain network connectivity in contested and congested environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will optimize enhancements to commercial off-the-shelf technologies, such as cellular and\/or narrowband communications, to provide dismount and mounted operators with long-range connectivity in a hostile electromagnetic spectrum environment; will demonstrate low probability of detection\/intercept and\/or anti-jam enhancements, such as radio frequency directionality and\/or frequency\/modulation coding, in a relevant field environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE06032701\/Project K15 and PE0603794\/Project EL4 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AO6"
                    },
                    "ProjectTitle": {
                        "val": "Tag Track and Locate Small Satellites Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "13.986"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.986"
                        },
                        "BudgetYearTwo": {
                            "val": "16.675"
                        },
                        "BudgetYearThree": {
                            "val": "16.956"
                        },
                        "BudgetYearFour": {
                            "val": "17.501"
                        },
                        "BudgetYearFive": {
                            "val": "17.696"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "82.814"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603006A Space Application Advanced Technology, Project: \n* 592 Space Application Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates payloads, sensors, and data down link systems for tactically responsive space and high altitude platforms supporting Army ground forces. This Project matures, demonstrates, and integrates lightweight materials, hardware components with reduced power consumption, and advanced data collection, processing, and dissemination capabilities. This Project also develops algorithms that process space and near space sensor data in real and near real time for integration into battlefield operating systems. These efforts support the Army's ability to control and exploit space assets that contribute to current and future military operations as defined in the national, Department of Defense (DoD), and Army space policies. Work supports the Army Modernization Priorities.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \nWork in this Project is performed by the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT) Technical Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tag, Track, and Locate Small Satellites"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies required for smaller, warfighter-responsive sensor and communication Low Earth Orbit small satellite constellations. Work will augment, improve, exploit and optimize existing commercial and DoD technologies and networks. Work supports the Army Modernization Priorities.\n\nThis effort will fund research and validate software, hardware, and algorithms used to enable space-based capabilities in support of the Army?s Modernization Priorities. This effort will also investigate the maturity and feasibility of commercial advances and opportunities in small satellite constellation and payload management for apply to future Army concepts.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering Science and Technology (S&T) priority focus areas and the Army Modernization Strategy.\nThis work is performed by the Army Space and Missile Defense Command\/Army Forces Strategic Command (SMDC\/ARSTRAT) in Huntsville, AL."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.986"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.986"
                                            },
                                            "Text": {
                                                "val": "Will optimize and demonstrate technologies, and validate software\/algorithms, for tracking and locating objects of interest to improve performance of space-based signal detection, processing, and dissemination; will exploit existing commercial technologies to improve warfighter capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, this effort is realigned from PE 0603006A (C3 Advanced Technology Development)."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AO7"
                    },
                    "ProjectTitle": {
                        "val": "EW for Maneuver Operations (EMO) Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.265"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.265"
                        },
                        "BudgetYearTwo": {
                            "val": "2.919"
                        },
                        "BudgetYearThree": {
                            "val": "3.045"
                        },
                        "BudgetYearFour": {
                            "val": "3.116"
                        },
                        "BudgetYearFive": {
                            "val": "3.15"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.495"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603270A Electronic Warfare Technology, Project:\n* K15 Advanced Comm Ecm Demo"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies that understand contested spectrum points, sense, locate, and cue fires missions to create windows of opportunity in A2\/AD environments, restore network capabilities, and enable maneuver and fires.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Stand-Off ISR Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware and software to conduct electronic warfare (EW) for intelligence, surveillance reconnaissance in support of Army tactical operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Will mature stand-in capabilities to find, fix, and locate adversary signals of interest that impact the Army?s ability to use the Electromagnetic Spectrum. Mature and demonstrate the capability for distributed platform sensing that efficiently collaborate to convey spectrum Situational Understanding (SU) to the Commander. Demonstrate and validate critical technologies for distributed Electronic Warfare Support (ES) at the Brigade and Below tactical engagement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE060270\/Project K15 in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW Techniques Maturation and Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates Electronic Warfare capabilities leveraging hardware-in-the-loop and modeling and simulation (M&S) of threat Intelligence, Surveillance, and Reconnaissance (ISR) systems to validate coordinated and collaborative non-kinetic effects."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.265"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.265"
                                            },
                                            "Text": {
                                                "val": "Will mature simultaneous Electronic Warfare (EW) techniques against adversarial Intelligence Surveillance and Reconnaissance (ISR) capabilities. Perform laboratory risk reduction experiments in modeling, simulation, and hardware-in-the-loop to validate EW techniques prior to the kinetic engagement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE060270\/Project K15 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AP6"
                    },
                    "ProjectTitle": {
                        "val": "C4ISR Integrated Demonstrations Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.542"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.542"
                        },
                        "BudgetYearTwo": {
                            "val": "2.474"
                        },
                        "BudgetYearThree": {
                            "val": "4.89"
                        },
                        "BudgetYearFour": {
                            "val": "5.042"
                        },
                        "BudgetYearFive": {
                            "val": "5.153"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.101"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603794A C3 Advanced Technology, Project: \n* EL4 Tactical Comms and Networking Technology Int"
                        },
                        "ProjectMissionDescription": {
                            "val": "Provides System of Systems (SoS) engineering rigor on Science & Technology (S&T) projects by providing field-based risk reduction processes, quantifiable technology performance in a SoS context, data-driven programmatic decision support, and field-based performance data to supplement Technology Readiness Level (TRL) assessments. \n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C4ISR Integrated Demonstrations Advanced Tech"
                                    },
                                    "Description": {
                                        "val": "This project provides appropriate System of Systems (SoS) engineering rigor on Science & Technology (S&T) projects by providing field-based risk reduction processes, quantifiable technology performance in a SoS context, data-driven programmatic decision support, and field-based performance data to supplement Technology Readiness Level (TRL) assessments.  This project provides network automation, resiliency, and situational understanding through science & technology advancements."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.542"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.542"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate commercial and government off-the-shelf and research and development advanced technologies in themed field-based risk reduction events that informs the Army's Modernization Priorities, including Network\/C3I, Future Vertical Lift, Next Generation Combat Vehicle, and Soldier Lethality;  provide technology assessments of science & technology efforts, such as millimeter wave communication systems and\/or spectrum decoying, in a field relevant environment to demonstrate technology maturation; Exploit virtualization to increased venue capabilities by incrementally building a more scalable tactical network; mature and demonstrate advancement of spectrum collection, injection, and management capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project is realigned from PE0603794\/Project EL4 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AP8"
                    },
                    "ProjectTitle": {
                        "val": "Comms\/Horiz Int for Army Mod Priorities Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0.68"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.68"
                        },
                        "BudgetYearTwo": {
                            "val": "4.097"
                        },
                        "BudgetYearThree": {
                            "val": "8.628"
                        },
                        "BudgetYearFour": {
                            "val": "8.086"
                        },
                        "BudgetYearFive": {
                            "val": "18.538"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "40.029"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603794A C3 Advanced Technology, Project: \n* EL4 Tactical Comms and Networking Technology Int"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project provides unified communications for the Army's modernization priorities through operationally-relevant, end-to-end network demonstrations which leverage Science & Technology (S&T) and commercial technology adapted to mitigate performance gaps in the presence of electronic warfare (EW) systems and reduce network complexity. Work in this Project complements PE 06022146A (Network C3I Technology) \/ Project AP7 (Comms Support to CSA \/ Horizontal Integ Fields Tech). \n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Communications Support to Army Modernization Priorities\/Horizontal Integration Fields Advance Technology"
                                    },
                                    "Description": {
                                        "val": "This Project provides unified communications for the Army's modernization priorities through operationally-relevant, end-to-end network demonstrations which leverage Science & Technology (S&T) and commercial technology adapted to mitigate performance gaps in the presence of electronic warfare (EW) systems and reduce network complexity."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.68"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.68"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate commercial and\/or government off-the-shelf technologies which can fulfill interim network requirements for Long Range Precision Fires (LRPF), Next Generation Combat Vehicle (NGCV), Future Vertical Lift (FVL), Air and Missile Defense (AMD), and\/or Soldier Lethality (SL), while other network science and technology projects develop future network capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project is realigned from PE0603794\/Project EL4 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AP9"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation HF Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "6"
                        },
                        "BudgetYearOneBase": {
                            "val": "6"
                        },
                        "BudgetYearTwo": {
                            "val": "4"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603794A C3 Advanced Technology, Project: \n* EL4 Tactical Comms and Networking Technology Int"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project improves performance of technologies to provide assured and resilient reach-back communications in satellite denied or degraded environments. This Project optimizes performance of new high frequency (HF) technology to provide low probability of detection and anti-jam capabilities to overcome emerging electronic warfare threats.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation HF Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This Project improves performance of technologies to provide assured and resilient reach-back communications in satellite denied or degraded environments.  This project optimizes performance of new high frequency (HF) technology to provide low probability of detection and anti-jam capabilities to overcome emerging electronic warfare threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6"
                                            },
                                            "Text": {
                                                "val": "Will optimize software code modifications to the High Frequency (HF) communications waveform to meet the Army?s HF requirements, such as anti-jam and low probability of detection\/intercept, and modernization goals to provide resilient long-range reach-back in satellite denied environments; demonstrate the modified software code in a waveform emulator to validate the code?s functionality; demonstrate the modified HF software to validate the enhancements, such as anti-jam and low probability of detection\/intercept performance, against pacing threats, such as simulated enemy systems; optimize software code based on waveform emulator demonstration results; provide waveform code for porting to communications hardware for demonstrations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project is realigned from PE0603794\/Project EL4 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AQ1"
                    },
                    "ProjectTitle": {
                        "val": "Spectrum Obfuscation Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "6"
                        },
                        "BudgetYearOneBase": {
                            "val": "6"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603794A C3 Advanced Technology, Project: \n* EL4 Tactical Comms and Networking Technology Int"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project validates and demonstrates technologies that provide obfuscation of radio frequency (RF) spectrum signature in order to counter enemy electronic surveillance capabilities. \n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Spectrum Obfuscation Advanced Technology"
                                    },
                                    "Description": {
                                        "val": "This Project validates and demonstrates technologies that provide obfuscation of radio frequency (RF) spectrum signature in order to counter enemy electronic surveillance capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6"
                                            },
                                            "Text": {
                                                "val": "Will optimize the design of a proof-of-concept wideband alluring signal projection (WASP) system to provide electromagnetic spectrum protection through the use of multichannel signal emissions capability to project high-value assets, such as Battalion and Brigade-level command post electromagnetic signatures, on the battlespace; mature and demonstrate a proof-of-concept WASP system in a relevant field environment; validate improved network communications through the operation of WASP systems to decoy high value targets and attract simulated enemy systems on the battlespace away from high-value assets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project is realigned from PE0603794\/Project EL4 in FY20."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AQ5"
                    },
                    "ProjectTitle": {
                        "val": "Sensor CE-Integrated Sensor Architecture Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.508"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.508"
                        },
                        "BudgetYearTwo": {
                            "val": "2"
                        },
                        "BudgetYearThree": {
                            "val": "2.05"
                        },
                        "BudgetYearFour": {
                            "val": "1.5"
                        },
                        "BudgetYearFive": {
                            "val": "2.022"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.080"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603710A Night Vision Advanced Technology, Project: \n* K70 Night Vision Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates an interoperability architecture consisting of standards, interfaces, and services. The application managers will have added artificial intelligence and functionality that allows for improved collaboration, survivability and recoverability, security, and adaptability to a dynamic network. Work in this Project supports the Army Science and Technology Network, Next Generation Combat Vehicle, Soldier Lethality, Air and Missile Defense, Long Range Precision Fires and Future Vertical Lift modernization priorities.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensor CE - Integrated Sensor Architecture"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates an agile and adaptive interoperability sensor architecture that allows a system to dynamically discover and leverage other systems on a network without any specific or prior knowledge across limited, heterogeneous resources and against a peer adversary. The goal of this effort is to develop standards, models, and protocols that provide a common language for sensor systems to connect, publish their capabilities and needs, and interact with other systems, even on disadvantaged networks. The benefits of this effort are increased sensor collaboration, reduced decision timelines, reduced soldier load, and reduced integration costs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.508"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate interoperability on limited-bandwidth communication networks with capability to recover from communication network denial.  Will mature tasking capability to dynamically fulfill mission objections while reducing operator knowledge burden."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603710A \/ Project K70 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AQ8"
                    },
                    "ProjectTitle": {
                        "val": "High Tempo Data Driven Decision Tools Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "1.336"
                        },
                        "BudgetYearFive": {
                            "val": "0.957"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.293"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AR2"
                    },
                    "ProjectTitle": {
                        "val": "Energy Informed Operations  Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2"
                        },
                        "BudgetYearOneBase": {
                            "val": "2"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603772A Advanced Tactical Computer Science and Sensor Technology, Project: \n* 101 Tactical Command and Control"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates software, algorithms, communication and control methodologies that allow more expedient, efficient, and informed use of energy resources across the battlefield. It provides Commanders at all echelons with situational awareness (SA) that allows them to understand and control their power and energy resources to ensure continuous operations of mission equipment and maintain overmatch of adversaries.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Energy Informed Operations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced power and thermal management and distribution technologies for command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) applications as well as validates and integrates designs in power generation, hybrid energy storage, and assessments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate and validate intelligent power system technologies at user events targeting Multi-Domain Operations and joint applications. Will develop and demonstrate predictive power and use algorithms in multi-power source configurations in support of ad-hoc, mobile arrangements of power equipment for expeditionary Command, Control, Communications, computers, Intelligence, Surveillance and Reconnaissance (C4ISR) systems; will demonstrate multiple-master control methodologies in intelligent power systems integrated into C4ISR platforms like vehicles, airframes or other platforms with critical power loads that must join together in an ad-hoc power network with competing prioritizations; and will validate and demonstrate universal translation and mixed grid control capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603772A \/ Project 101 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AR4"
                    },
                    "ProjectTitle": {
                        "val": "Intelligent Env Battlefield Awareness Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0.659"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.659"
                        },
                        "BudgetYearTwo": {
                            "val": "2.38"
                        },
                        "BudgetYearThree": {
                            "val": "3.607"
                        },
                        "BudgetYearFour": {
                            "val": "4.188"
                        },
                        "BudgetYearFive": {
                            "val": "5.206"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.040"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603728A Environmental Quality Technology Demonstrations, Project: \n* 03E Environmental Restoration Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project demonstrates and optimizes technologies to allow Soldiers to maneuver faster around or through existing environmental (urban\/industrial) conditions and physical landscape constraints. This effort matures and demonstrates web modules\/software tools delivering crucial geo-chemical resources and advanced knowledge of geo-environmental infrastructure to mission planners. This effort supports the Common Operating Environment LOE.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed by the Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geo-Forensics for Reconnaissance Exploitation"
                                    },
                                    "Description": {
                                        "val": "This effort provides unique terrestrial ?fingerprints? to describe and predict the geological, biological, and overall ecological information associated with A2\/AD sites from CONUS analogs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.659"
                                            },
                                            "Text": {
                                                "val": "Will develop of a software tool that predicts soil behavior, including ability to retain or alter chemical threats, at locations where access and knowledge are limited. Will mature and demonstrate tools to allow incorporating this data onto geospatial maps to enable mission planning and forensics applications for predicting chemical movement in the soil."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE0603728A\/03E in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AR6"
                    },
                    "ProjectTitle": {
                        "val": "Understanding the Environment as a Threat Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.31"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.31"
                        },
                        "BudgetYearTwo": {
                            "val": "2.812"
                        },
                        "BudgetYearThree": {
                            "val": "2.557"
                        },
                        "BudgetYearFour": {
                            "val": "3.304"
                        },
                        "BudgetYearFive": {
                            "val": "3.659"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.642"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603728A Environmental Quality Technology Demonstrations, Project: \n* 03E Environmental Restoration Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates tools that provide capability to inform the Solider of different routes through a complex urban landscape. Optimizes tools that balance exposure to environmental threats with mission constraints to provide a risk versus reward capability of operating in different areas of the urban theater. This Project matures and demonstrates predictive software accurately integrating the risks of physical, chemical, and biological threats in an urban environment into route planning tools. \n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Threat Technology Demonstrations for route planning"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates a software tool informing and balancing the risk of exposure to environmental threats with maneuver constraints along potential routes. The software integrates the risks associated with different environmental matrices in complex urban environments and includes the capability for routing in off-road scenarios."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.31"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.31"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a new route planning capability for off-road options through the complex urban environment. Will mature and optimize products that will inform the Soldier of risks to personnel and equipment expected along various routes, to weigh Soldier exposure and probability of mission success."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE0603728A\/03E in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AR8"
                    },
                    "ProjectTitle": {
                        "val": "Sensing in Contested Environments Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "1.672"
                        },
                        "BudgetYearThree": {
                            "val": "1.632"
                        },
                        "BudgetYearFour": {
                            "val": "1.8"
                        },
                        "BudgetYearFive": {
                            "val": "1.82"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.924"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AS9"
                    },
                    "ProjectTitle": {
                        "val": "Persistent Geophysical Sensing-Infrasound Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.583"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.583"
                        },
                        "BudgetYearTwo": {
                            "val": "3.588"
                        },
                        "BudgetYearThree": {
                            "val": "2.481"
                        },
                        "BudgetYearFour": {
                            "val": "2.483"
                        },
                        "BudgetYearFive": {
                            "val": "2.776"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.911"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603734A Military Engineering Advanced Technology, Project: \n* T08 Combat Eng Systems"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates kitted hardware and software solutions that persistently monitor (through non-line-of-sight sensing including infrasound) critical infrastructure conditions and threat activities in dynamic battlefields. These technologies provide near real time data collection, processing, and alerts of infrastructure go\/no-go condition required for maneuver planning. This Project also matures and demonstrates methodologies to assign maneuver relevant engineering attributes to geospatial feature data such as bridge load classification, road condition, and bathymetry. Work supports the Common Operating Environment LOE.\n\nWork in this Project supports the Army Science and Technology Network\/C3I Portfolio.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project conducted at Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Remote Assessment of Infrastructure for Ensured Maneuver (RAFTER) Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates a light-weight, low-power, persistent monitoring system that is capable of integration with mission command platforms with associated software for processing geophysical data in near-real-time (with no SME in the loop) to provide actionable intelligence concerning critical transportation assets. This effort complements PE 0602146A (Network C3I Technology) \/ Project AR9 (Persistent Geophysical Sensing-Infrasound Tech)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.583"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.583"
                                            },
                                            "Text": {
                                                "val": "Will optimize and validate the persistent monitoring system and associated software for near-real-time geophysical data processing through multiple field demonstrations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603734A\/T08 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AT3"
                    },
                    "ProjectTitle": {
                        "val": "Subterranean Detection and Monitoring Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.09"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.09"
                        },
                        "BudgetYearTwo": {
                            "val": "2.741"
                        },
                        "BudgetYearThree": {
                            "val": "1.047"
                        },
                        "BudgetYearFour": {
                            "val": "0.908"
                        },
                        "BudgetYearFive": {
                            "val": "1.434"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.220"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603734A Military Engineering Advanced Technology, Project: \n* T08 Combat Eng Systems"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project validates and demonstrates advanced subterranean monitoring and vulnerability assessment technologies providing mobile and man-portable solutions to enhance survivability and threat awareness during urban operations and negate enemy subterranean operation advantage. This Project also optimizes and demonstrates enhanced technologies to detect tunnels and tunneling activity in complex and varied environments. This effort supports a Common Operating Environment. \n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project conducted at Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Subterranean Threat Assessment by Real-time Sensing Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort validates and demonstrates integrated suite of tunnel detection and persistent surveillance technologies, mobile and man-portable solutions to detect underground municipal infrastructure, voids, and other subterranean vulnerabilities in urban and complex domains. This effort complements PE 0602146A (Network C3I Technology) \/ Project AT2 (Subterranean Detection and Monitoring Technology)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.09"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.09"
                                            },
                                            "Text": {
                                                "val": "Will optimize seismic acquisition hardware and software components to speed up data acquisition and transfer rates, validate sensor coupling models, and demonstrate full waveform inversion data processing algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603734A\/T08 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AT5"
                    },
                    "ProjectTitle": {
                        "val": "GeoINT - OPS Merge Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "6.543"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.543"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AT8"
                    },
                    "ProjectTitle": {
                        "val": "Network-Enabled GeoSpatial-GEOINT Services AdvTech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.992"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.992"
                        },
                        "BudgetYearTwo": {
                            "val": "3"
                        },
                        "BudgetYearThree": {
                            "val": "3.1"
                        },
                        "BudgetYearFour": {
                            "val": "3.526"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.618"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603734A Military Engineering Advanced Technology, Project: \n* T08 Combat Eng Systems"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project integrates and demonstrates the geo-registration, feature extraction, change detection, data visualization and transmission capabilities developed in the applied research portion of this effort. Tools developed for the exploitation of 3D datasets will be integrated into a streamlined workflow requiring low levels of expertise, putting advanced processing capabilities in the hands of the Soldier. This effort includes demonstrations of tactical enhancements and the integrated ability to rapidly share mission critical 3D information in support of planning and execution. This effort supports a Common Operating Environment.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integration and Demonstration of 3D Data Model Feature Extraction, Geo-registration, Analytical Tool Development and Visualization"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates the design and formulation of new urban terrain data models, frameworks and processes to automate the transformation of tactical unit generated source data (e.g. LiDAR, imagery, and full motion video derived data) to new model constructs for rapid and accurate geo-registration of features (manmade infrastructure)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.992"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.992"
                                            },
                                            "Text": {
                                                "val": "Will review, compare, and document through experiments and demonstrations baseline of industry and government technologies in 3D data processing, and data models, in terms of adaptation to modernization of mission command network. Will compare suitability for automated feature extraction and resources required for accurate Geo-registration and display."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603734A\/T08 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AU1"
                    },
                    "ProjectTitle": {
                        "val": "Tactical GeoSpatial Information Capabilities ATech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.07"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.07"
                        },
                        "BudgetYearTwo": {
                            "val": "3.743"
                        },
                        "BudgetYearThree": {
                            "val": "4.263"
                        },
                        "BudgetYearFour": {
                            "val": "5.12"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.196"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603734A Military Engineering Advanced Technology, Project: \n* T08 Combat Eng Systems"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates next generation geospatial analytical tools for 3D complex environments applicable to low echelon and tactical edge exploitation. These new capabilities will allow deployed units to enhance\/update provisioned (baseline) standard, sharable, geospatial foundation (SSGF) data through automated analytics on multi-sourced spatial data resulting in streamlined, high fidelity terrain analysis products. Reducing data gaps and processing timelines will greatly increase Soldier situational awareness and support faster decision making in complex terrain. This effort supports the Common Operating Environment LOE.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "3D Terrain Analysis"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates software models and workflows provisioned on the geospatial and GEOINT workstations for improved capabilities to generate, process and exploit terrain products enabling situational awareness and rapid decision making at the tactical edge."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.32"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.32"
                                            },
                                            "Text": {
                                                "val": "Will conduct testing of preliminary compatible framework and workflow for remotely sensed tactical data exploitation that provisions an enhanced terrain analysis capability to the geospatial engineer toolkit."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE0603734A\/T08 in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Airborne LiDAR"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates enhanced Geiger-mode LiDAR hardware\/software, for advanced testing of protocols, equipment, and products for enhanced high-altitude\/wide area terrain data collection, to support tactical operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.75"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.75"
                                            },
                                            "Text": {
                                                "val": "Will mature new Geiger-mode LiDAR sensor payload components, for increasing performance and speed of collection and processing, for more realistic portrayal of multi-domain environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE0603734A\/T08 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AU2"
                    },
                    "ProjectTitle": {
                        "val": "Optimization of Geospatial Data for Visualization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "2.1"
                        },
                        "BudgetYearThree": {
                            "val": "2.2"
                        },
                        "BudgetYearFour": {
                            "val": "1.8"
                        },
                        "BudgetYearFive": {
                            "val": "1.784"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.884"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AU4"
                    },
                    "ProjectTitle": {
                        "val": "Geospatially Enabled Operational Design Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.958"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.958"
                        },
                        "BudgetYearTwo": {
                            "val": "6.213"
                        },
                        "BudgetYearThree": {
                            "val": "6.261"
                        },
                        "BudgetYearFour": {
                            "val": "6.47"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "23.902"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603734A Military Engineering Advanced Technology, Project: \n* T08 Combat Eng Systems"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, demonstrates, integrates and transitions to the Army Command Post Computing Environment, a geospatially enabled collaborative planning environment, accessible across echelons, with capabilities that support Army Design Methodology (ADM) by providing the ability to perform conceptual planning and problem framing, supporting a greater understanding and visualization of the dynamic operational environment, a shared understanding of the operations purpose across echelons, and enhanced products to drive detailed budget planning and operational assessment processes, enhancing the collaborative interaction between commanders, staffs, and unified action partners. Work supports the Common Operating Environment LOE.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Engineer Research and Development Center."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Virtual Collaborative Operational Design Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates automation technologies to digitally visualize, create and assess critical elements of the Operational Environment required to inform the Operational Design functions, including collaborative conceptual framing of the problem."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.4"
                                            },
                                            "Text": {
                                                "val": "Will design and demonstrate tools to support Army Design Methodology (ADM) to frame the problem and visualize the desired end state in a geospatial context."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603734A\/T08 in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Data Analysis and Visualization Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates a suite of automated data aggregation analysis and visualization capabilities allowing commanders and staffs the capability to bridge conceptual planning (ADM) to deliberate planning at echelons down to battalion."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.558"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.558"
                                            },
                                            "Text": {
                                                "val": "Will design and conduct demonstrations to geospatially enable strategic guidance inputs to operational design, in a digital, integrated, collaborative planning environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603734A\/T08 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AU6"
                    },
                    "ProjectTitle": {
                        "val": "Automated Analytics for Operational Environment AT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.709"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.709"
                        },
                        "BudgetYearTwo": {
                            "val": "1.622"
                        },
                        "BudgetYearThree": {
                            "val": "2.835"
                        },
                        "BudgetYearFour": {
                            "val": "2.9"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.066"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603734A Military Engineering Advanced Technology, Project: \n* T08 Combat Eng Systems"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and demonstrates advanced technologies to understand and visualize threat patterns and operational environment changes and support mission planning by contextualizing results based on battlefield conditions and on hidden patterns discovered and merged from textual reporting. Work supports the Common Operating Environment LOE.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Engineer Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Simultaneous Multi-Domain Data Representation"
                                    },
                                    "Description": {
                                        "val": "This effort designs, demonstrates and integrates advanced capabilities to provide commanders and staffs with the ability to understand and operate in multiple domains simultaneously, utilizing data representations and algorithms to seamlessly track the enemy, determine patterns of behavior or actions, identify operational environment changes, and support mission planning by contextualizing results from textual data analysis based upon battlefield conditions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.624"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.624"
                                            },
                                            "Text": {
                                                "val": "Will exploit available advanced spatio-temporally coherent multi-domain data representations that capture explicit and implicit relationships between threat actors, and operational environment changes, distilled from raw data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE0603734A\/T08 in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automated Analysis of Multi-Domain Data"
                                    },
                                    "Description": {
                                        "val": "This effort designs and demonstrates data models to support automated sense making and analysis and advanced relevancy ranking approaches to identify and prioritize knowledge gaps and contextualized results."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.085"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.085"
                                            },
                                            "Text": {
                                                "val": "Will exploit available multi-domain data fusion capabilities for geospatial data processing, analytics and representations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE0603734A\/T08 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AU8"
                    },
                    "ProjectTitle": {
                        "val": "GEOInt\/Ops Integration for Multi-echelon Orders"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "4.553"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.553"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AV1"
                    },
                    "ProjectTitle": {
                        "val": "GEOInt\/Ops Logistics Integration-Planning Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "4.953"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.953"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AV2"
                    },
                    "ProjectTitle": {
                        "val": "LEO Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.983"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.983"
                        },
                        "BudgetYearTwo": {
                            "val": "1.981"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.964"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603006A Space Application Advanced Technology, Project: \n* 592 Space Application Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "Project AV2 will mature and develop Low Earth Orbit (LEO) constellation management for space order-of-battle architectures and protocols. The advanced technology development will involve using two spacecraft and will leverage commercial LEO mega-constellation investments to develop capabilities which support direct sensor-to-shooter data links while under control by a maneuver battalion commander. Technology will be developed to enable communications and deep strikes in contested environments. This Project supports the Army's efforts to proliferate and control space assets to support the tactical ground commander. It includes exploration efforts to augment missile warning, GPS, and global communications. Work aligns with development underway in Network, Assured Positioning Navigation and Timing (APNT), and Long-Range Precision Fires (LRPF) Cross Functional Teams (CFT).\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the US Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT) Technical Center in Huntsville, AL and the Defense Advanced Research Projects Agency (DARPA), Arlington, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Payload Technology Development"
                                    },
                                    "Description": {
                                        "val": "Mature the technology for Low Earth Orbit satellites. Payload integration will be validated as well as the architectureand design of two LEO satellites for support to an Army tactical commander.\n\nThe work cited is consistent with the Under Secretary of Defense for Research and Engineering Science and Technology (S&T) priority focus areas and the Army Modernization Strategy.\nThis work is performed by the Army Space and Missile Defense Command\/Army Forces Strategic Command (SMDC\/ARSTRAT) in Huntsville, AL."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.983"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.983"
                                            },
                                            "Text": {
                                                "val": "Will design and develop space payloads to operate in a LEO constellation and augment missile warning\/defense, GPS, and provide global communications with tactical timelines."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort was realigned from PE 0603006A \/ Project 592 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AV4"
                    },
                    "ProjectTitle": {
                        "val": "Foundational S&T for Network C3I Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "2.128"
                        },
                        "BudgetYearThree": {
                            "val": "2.648"
                        },
                        "BudgetYearFour": {
                            "val": "2.862"
                        },
                        "BudgetYearFive": {
                            "val": "2.952"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.590"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AV8"
                    },
                    "ProjectTitle": {
                        "val": "Navigation Warfare (NAVWAR) Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5.266"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.266"
                        },
                        "BudgetYearTwo": {
                            "val": "4.977"
                        },
                        "BudgetYearThree": {
                            "val": "5.191"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.434"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from:\nProgram Element (PE) 0603772A Advanced Tactical Computer Science and Sensor Technology, Project: \n* 101 Tactical Command and Control"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates capabilities allowing the Army to monitor, understand, and control the Navigation Warfare (NAVWAR) environment. This requires an integrated approach to Electronic Protection (EP), Electronic Support (ES), and Electronic Attack (EA) to rapidly characterize the NAVWAR environment, deny Positioning, Navigation, and Timing (PNT) based capabilities to our adversaries, and maintain Army capabilities.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NAVWAR for Ground Soldiers"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates capabilities allowing the Army to monitor, understand, and control the NAVWAR environment.  This requires an integrated approach to Electronic Protection (EP), Electronic Support (ES), and Electronic Attack (EA) to rapidly characterize the NAVWAR environment, deny PNT based capabilities to our adversaries, and maintain Army capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.266"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.266"
                                            },
                                            "Text": {
                                                "val": "Will improve the performance of a Navigation Warfare (NAVWAR) breadboard that will enable continued military operations in hostile, GPS denied environments by integrating electronic attack, electronic protection and electronic support hardware and software; incorporate the new Military Code (M-Code) GPS signal for offensive and defensive NAVWAR operations into the breadboard; will mature and code a PNT situational awareness software tool utilizing existing sensors and GPS receivers; will mature and demonstrate a hardware solution using multi-GNSS signals for integrity monitoring; will integrate PNT technologies such as radio frequency (RF) ranging beacons for in-building navigation to augment PNT solutions for mounted and dismounted platforms; will mature and demonstrate two way time transfer hardware that will provide accurate time to users and systems in the absence of GPS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603772A \/ Project 101 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AW2"
                    },
                    "ProjectTitle": {
                        "val": "Autonomous Navigation Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0.3"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.3"
                        },
                        "BudgetYearTwo": {
                            "val": "0.7"
                        },
                        "BudgetYearThree": {
                            "val": "0.6"
                        },
                        "BudgetYearFour": {
                            "val": "0.6"
                        },
                        "BudgetYearFive": {
                            "val": "0.607"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.807"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603772A Advanced Tactical Computer Science and Sensor Technology, Project: \n* 101 Tactical Command and Control"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project will leverage Assured Positioning, Navigation, and Timing (PNT) efforts. It improves localization and decision making of Robotic\/Autonomous Systems by optimizing use of sensors on the platform and taking advantage of all available navigation signals.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Navigation"
                                    },
                                    "Description": {
                                        "val": "This effort leverages Assured PNT efforts and improves localization and decision making of Robotic\/Autonomous Systems by optimizing use of sensors on the platform and taking advantage of all available navigation signals. Work accomplished under Program Element (PE) 0602146\/Project AW1 (Autonomous Navigation Technology) complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.3"
                                            },
                                            "Text": {
                                                "val": "Will perform a candidate component demonstration on a Mounted platform for Assured Autonomous PNT, leveraging previous sensor and component work integrated with autonomous obstacle avoidance sensors (potential sensors include inertial measurement units, vision navigation sensors, RF ranging, etc.)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603772A \/ Project 101 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AW4"
                    },
                    "ProjectTitle": {
                        "val": "DoD PNT M&S Collaborative Initiative (CI) Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3"
                        },
                        "BudgetYearOneBase": {
                            "val": "3"
                        },
                        "BudgetYearTwo": {
                            "val": "3"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0603772A Advanced Tactical Computer Science and Sensor Technology, Project: \n* 101 Tactical Command and Control"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures, demonstrates and performs modeling and simulation (M&S) of Positioning, Navigation, and Timing (PNT) technologies to provide access to trusted PNT information in global positioning system (GPS) denied or degraded environments.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD PNT M&S Collaborative Initiative (CI)"
                                    },
                                    "Description": {
                                        "val": "This effort matures, demonstrates and performs modeling and simulation (M&S) of PNT technologies to provide access to trusted PNT information in global positioning system (GPS) denied or degraded environments. Work accomplished under Program Element (PE) 0602146\/Project AW3 (DoD PNT M&S Collaborative Initiative (CI) Technology) complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Will conduct operational Tri-Service PNT M&S Analysis for a more comprehensive analysis of PNT in the battlespace. Will adopt and adapt operational mission\/campaign level simulations. Will demonstrate a PNT M&S capability in performing force effectiveness analysis of candidate PNT technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Effort is realigned from PE 0603772A \/ Project 101 in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AW6"
                    },
                    "ProjectTitle": {
                        "val": "Modular GPS Independent Sensors Advanced Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "5.307"
                        },
                        "BudgetYearFive": {
                            "val": "5.366"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.673"
                        }
                    },
                    "R2aExhibit": []
                }
            ]
        }
    }
}