{
    "id": "2020-TheJointStaff-PB-0400-MJBOOK-0-0-d1987b0fd370b5a1aa30691c25a4364a88cdaac49ace6ad89bc88e2bfcf9f939-2",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-TJS-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605126J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integrated Air & Missile Defense Organization (JIAMDO)"
        },
        "R1LineNumber": {
            "val": "150"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "342.874"
            },
            "PriorYear": {
                "val": "36.581"
            },
            "CurrentYear": {
                "val": "52.565"
            },
            "BudgetYearOne": {
                "val": "70.038"
            },
            "BudgetYearOneBase": {
                "val": "70.038"
            },
            "BudgetYearTwo": {
                "val": "65.946"
            },
            "BudgetYearThree": {
                "val": "69.770"
            },
            "BudgetYearFour": {
                "val": "75.036"
            },
            "BudgetYearFive": {
                "val": "73.721"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense chartered to plan, coordinate, and oversee Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman in meeting Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community’s proponent for requirements and capabilities in IAMD, and is the joint IAMD proponent within the DoD’s resource allocation structures.  JIAMDO also leads IAMD mission and utility analysis, integrates IAMD within the force protection joint capability area, conducts evaluations, demonstrations of joint IAMD architectures, and provides advocacy for innovative, technically mature, and affordable solutions.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the IAMD prioritized capabilities list and the global integrated IAMD assessment and analysis of the Ballistic Missile Defense System.  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues and technical oversight of homeland capability solutions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.581"
                },
                "CurrentYear": {
                    "val": "52.565"
                },
                "BudgetYearOne": {
                    "val": "56.162"
                },
                "BudgetYearOneBase": {
                    "val": "56.162"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.581"
                },
                "CurrentYear": {
                    "val": "52.565"
                },
                "BudgetYearOne": {
                    "val": "70.038"
                },
                "BudgetYearOneBase": {
                    "val": "70.038"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.876"
                },
                "BudgetYearOneBase": {
                    "val": "13.876"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "13.876"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.876"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "JIAMDO program changes from FY 2019 to FY 2020 is a combination of:\n$15,000K added to Project NIMBLE FIRE for modeling and simulation capability enhancements to improve fidelity of EW and IR capability models.\n$1,124K in FY 2020 reductions to meet MHA goals prescribed by 2016 NDAA."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Core"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "143.254"
                        },
                        "PriorYear": {
                            "val": "9.343"
                        },
                        "CurrentYear": {
                            "val": "9.967"
                        },
                        "BudgetYearOne": {
                            "val": "11.657"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.657"
                        },
                        "BudgetYearTwo": {
                            "val": "11.601"
                        },
                        "BudgetYearThree": {
                            "val": "10.860"
                        },
                        "BudgetYearFour": {
                            "val": "10.860"
                        },
                        "BudgetYearFive": {
                            "val": "10.860"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is chartered to plan, coordinate, and oversee Integrated Air and Missile Defense (IAMD) requirements, concepts, and architectures. As part of the Joint Staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to IAMD issues. JIAMDO is the IAMD proponent for requirements and capabilities within the DoD’s resource allocation system. JIAMDO leads IAMD mission and utility analysis, integrates IAMD within the force protection joint capability area, and conducts evaluations of joint IAMD architectures. \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to coordinate integration issues and requirements. In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review cost, schedule, and performance criteria of Missile Defense Agency missile defense programs. At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM development of IAMD prioritized capabilities list and the global integrated IAMD assessment and analysis of the Ballistic Missile Defense System. JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues and homeland defense solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Core"
                                    },
                                    "Description": {
                                        "val": "Provides staff support for JIAMDO operations in the area of ballistic missile defense, air and cruise missile defense, homeland defense, requirements management, combat identification, modeling and simulation, analytical functions and products, senior level briefings, and all travel costs for government and contractor support personnel. Routine functions include performing analyses, demonstrations, and programmatic assessments of technology, operations, requirements, and weapons systems.  In coordination with Services and CCMDs, JIAMDO Core funds the definition, assessment, development, and approval of Joint IAMD operational concepts, operational architectures, and capability requirements. These assessments guide the Department's joint, interagency, integrated and net-centric IAMD. JIAMDO Core provides funding to:\n\n1. Conduct and integrate joint studies, simulations, war games, force resource allocation, and interoperability initiatives.\n\n2. Manage relevant Congressional interaction and CCMD interface through a cadre of liaisons collocated with major headquarters.\n\n3. Directly support and sponsor homeland air surveillance-related demonstration and analysis activities.\n\n4. Manage the IAMD Working Group and co-chair the Protection Functional Capabilities Board focusing CCMD, Joint Staff, and Service collaboration efforts to generate joint concepts and develop the IAMD architecture and roadmap.\n\nJIAMDO Core enables strategic planning development, security, travel, and other support activities.  Funding pays for: contracted Systems Engineering and Technical Assistance (SETA) support for Air & Cruise Missile Defense (ACMD), Ballistic Missile Defense (BMD), Homeland Air Security (HAS) strategic planning, studies & analysis, combat ID, modeling & simulation. Additionally, the JIAMDO Core budget funds daily on-site security management personnel to meet DoD, National Industrial Security Program Operating Manual (NISPOM), and other security regulations, for all administrative and support functions related to higher security classifications, as well as basic office supplies and furniture, and classified\/unclassified data connections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.343"
                                            },
                                            "Text": {
                                                "val": "Continue performing Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities.  Continue DepSecDef high priority follow on assessment of non-kinetic and kinetic studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.967"
                                            },
                                            "Text": {
                                                "val": "Perform Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities.  Execute DepSecDef directed tasking for non-kinetic and kinetic layered defense modeling.  Continue support to Chairman’s Net Assessment, Joint Military Net Assessment and OSD Policy using analysis and study findings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.657"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.657"
                                            },
                                            "Text": {
                                                "val": "Perform Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities.  Continue DepSecDef directed tasking for non-kinetic and kinetic layered defense modeling.  Continue support to Chairman’s Net Assessment, Joint Military Net Assessment and OSD Policy using analysis and study findings."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 requested amount, as well as the future years request, reflects un-executed resources from prior year and an associated re-phasing of resources into FY 2021 and FY 2022."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Support two major Nimble Fire exercises during FY 2020.\n\n(2) Conduct two IAMD Working Groups and at least one Functional Capabilities Board per month.\n\n(3) Conduct the annual Black Dart Counter-Unmanned Aerial System technology demonstration.\n\n(4) Support U.S. Representative to NATO Air Defense Council and Missile Defense Committee including two overseas meetings per year and numerous lower-level supporting functions.\n\n(5) Develop and maintain operational architecture compliance with DoD Architectural Framework (DODAF) standards.\n\n(6) Ensure 100% of all government employee travel is in accordance with the Joint Federal Travel Regulation\/Joint Travel Regulation and all contractor travel is in accordance with applicable regulations.\n\n(7) Maintain all unclassified\/classified LANs on a daily basis in accordance with the Joint Staff's Office of the Chief Information Officer guidance\/policy.\n\n(8) Ensure all computers, NIPRNET\/SIPRNET, are refreshed according to applicable policy\/guidance."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "Black Dart"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "28.483"
                        },
                        "PriorYear": {
                            "val": "3.000"
                        },
                        "CurrentYear": {
                            "val": "3.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.500"
                        },
                        "BudgetYearTwo": {
                            "val": "5.634"
                        },
                        "BudgetYearThree": {
                            "val": "5.370"
                        },
                        "BudgetYearFour": {
                            "val": "6.424"
                        },
                        "BudgetYearFive": {
                            "val": "6.231"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is chartered to plan, coordinate, and oversee Integrated Air and Missile Defense (IAMD) requirements, concepts, and architectures. As part of the Joint Staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to IAMD issues. JIAMDO is the IAMD proponent for requirements and capabilities within the DoD’s resource allocation system. JIAMDO leads IAMD mission and utility analysis, integrates IAMD within the force protection joint capability area, and conducts evaluations of joint IAMD architectures. \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to coordinate integration issues and requirements. In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review cost, schedule, and performance criteria of Missile Defense Agency missile defense programs. At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM development of IAMD prioritized capabilities list and the global integrated IAMD assessment and analysis of the Ballistic Missile Defense System. JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues and homeland defense solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Black Dart Counter Unmanned Aircraft Systems Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "Provides funding to support administration and execution of Black Dart demonstrations. Black Dart is a unique joint, interagency demonstration focusing on rapid development and implementation of Counter - Unmanned Aircraft Systems (C-UAS) technology from readily-available commercial and governmental products.  Objectives include:\n\n1. Execute live-fly, live-fire C-UAS technology demonstration to assess and validate existing and emerging Integrated Air and Missile Defense (IAMD) capabilities.\n\n2. Present emerging solutions to inform requirements decision-making.\n\n3. Identify and develop IAMD operational concepts, system interoperability, and operational architectures for the C-UAS mission set.\n\n4. Advocate for C-UAS capabilities and affordable, integrated solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Expand coalition partner participation and develop scenarios integrating systems across land, littoral, and maritime domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Perform Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities. Execute DepSecDef directed tasking for non-kinetic and kinetic layered defense modeling.  Continue support to Chairman’s Net Assessment, Joint Military Net Assessment and OSD Policy using analysis and study findings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "Performing Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities.  Execute DepSecDef and JROC directed tasking for non-kinetic and kinetic layered defense modeling.  Continue support to Chairman’s Net Assessment, Joint Military Net Assessment, Comparative Area Study and OSD Policy using analysis and study findings."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Net increase of $2.3M from FY 2019 to FY 2020 is due to realignment of remaining JDEP resources into Black Dart. Additional funds are needed since Black Dart operations are being moved to the Eglin range, which is more expensive to utilize. Although the Eglin range costs more, it can incorporate maritime C-UAS systems along with land based systems for multi-domain testing."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1. Document gaps, develop and substantiate hardware, software, and employment concepts.\n\n2. Field C-UAS capability."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P004"
                    },
                    "ProjectTitle": {
                        "val": "Joint Distributed Engineering Plant"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.748"
                        },
                        "PriorYear": {
                            "val": "2.738"
                        },
                        "CurrentYear": {
                            "val": "1.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "23.486"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is chartered to plan, coordinate, and oversee Integrated Air and Missile Defense (IAMD) requirements, concepts, and architectures. As part of the Joint Staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to IAMD issues. JIAMDO is the IAMD proponent for requirements and capabilities within the DoD’s resource allocation system. JIAMDO leads IAMD mission and utility analysis, integrates IAMD within the force protection joint capability area, and conducts evaluations of joint IAMD architectures. \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to coordinate integration issues and requirements. In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review cost, schedule, and performance criteria of Missile Defense Agency missile defense programs. At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM development of IAMD prioritized capabilities list and the global integrated IAMD assessment and analysis of the Ballistic Missile Defense System. JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues and homeland defense solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Distributed Engineering Plant (JDEP)"
                                    },
                                    "Description": {
                                        "val": "The JDEP is a tool for evaluating interoperability of emerging or newly fielded systems; identifying interoperability deficiencies in existing systems; and verifying corrective actions in a controlled, repeatable environment through the use of hardware in the loop."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.738"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint IAMD weapons systems. Provide users the means to create family of systems environments by linking existing capabilities using hardware, software, and operator-in-the-loop. Link existing Service and Joint combat system engineering and test sites via distributed communications.  Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Fund multiple, distributed test events to assess the interoperability of joint IAMD weapons systems with a focus on C-UAS capabilities to counter the emerging threat of Group 1 and 2 UAS. Continue to leverage live-fly data of the Black Dart technology demonstrations to develop scenarios that replicate the future operational environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY20, JDEP will be absorbed under the Black Dart program and will no longer execute as a stand-alone program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JDEP functions will be absorbed under the Black Dart programin FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1. Each JDEP event develops measures of effectiveness (MOE) & measures of performance (MOP) based on an eighteen month test planning and event process.\n\n2. Complete events within schedule and budget. \n\n3. Events provide useful data to improve air missile defense interoperability, with implemented and recommended corrective changes.\n\n4. Events must be linked to the current approved IAMD architecture, provide joint benefit, contribute to joint interoperability, and address IAMD capability gaps."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P005"
                    },
                    "ProjectTitle": {
                        "val": "Nimble Fire"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "81.769"
                        },
                        "PriorYear": {
                            "val": "16.000"
                        },
                        "CurrentYear": {
                            "val": "14.000"
                        },
                        "BudgetYearOne": {
                            "val": "28.226"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.226"
                        },
                        "BudgetYearTwo": {
                            "val": "21.036"
                        },
                        "BudgetYearThree": {
                            "val": "21.065"
                        },
                        "BudgetYearFour": {
                            "val": "20.277"
                        },
                        "BudgetYearFive": {
                            "val": "19.155"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is chartered to plan, coordinate, and oversee Integrated Air and Missile Defense (IAMD) requirements, concepts, and architectures. As part of the Joint Staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to IAMD issues. JIAMDO is the IAMD proponent for requirements and capabilities within the DoD’s resource allocation system. JIAMDO leads IAMD mission and utility analysis, integrates IAMD within the force protection joint capability area, and conducts evaluations of joint IAMD architectures. \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to coordinate integration issues and requirements. In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review cost, schedule, and performance criteria of Missile Defense Agency missile defense programs. At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM development of IAMD prioritized capabilities list and the global integrated IAMD assessment and analysis of the Ballistic Missile Defense System. JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues and homeland defense solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Nimble Fire"
                                    },
                                    "Description": {
                                        "val": "Nimble Fire is the Department’s only IAMD operator-in-the-loop modeling and simulation capability supporting the Chairman's top five critical joint IAMD capabilities: wide-area surveillance and engagement quality tracking, pre-launch interdiction, non-kinetic post-launch capabilities, ballistic missile discrimination, and increased weapons ranges and lethality.  Nimble Fire events generally explore joint IAMD capabilities and concepts in the FYDP plus two timeframe. The events combine experienced operators from the tactical communities, virtual simulations accredited by the program offices, current and future advanced capabilities, an integrated air, ballistic and cruise missile threat, and informed scenarios based on the Department’s analytical agenda and CCMD operational plans.  JIAMDO brings together stakeholders across the engineering, analytical, and tactical communities to assess Joint interoperability of Service and MDA programs of record, explore concepts of employment, inform tactics, techniques and procedures and concepts of operation, provide insights that help shape CCMD integrated priorities and future operational plans, and inform senior leader acquisition and requirements decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "Execute two large Nimble Fire events in support of U.S. Fleet Forces Command, USPACOM, USSTRATCOM and USEUCOM.  Provide material support for two additional Service and\/or program office events.  Additionally, accomplish significant upgrades to the VWC environment and IAMD systems and capabilities:\n\n1. Electronic Warfare improvements in coordination with USSTRATCOM, Joint Electronic Preparedness for Advanced Combat (JEPAC), the Services and MIssile Defense Agency (MDA) to better model \"red\" and \"blue\" electronic attack and electronic protection.  Conduct analysis of electronic attack impact on: (1) F-15 Eagle Passive-Active Warning Survivability Systems (EPAWSS); (2) F\/A-18E Integrated Defensive Electronic Countermeasures (IDECM), Surface Electronic Warfare Improvement Program (SEWIP) for Aegis, basic electromagnetic interference effects, and foundation for representing GPS modeling.\n\n2. Multi-spectral environment improvements include upgrading the simulation backbone and service models to better handle capabilities such as Infrared Search and Track sensors, kill chains, environmental effects such as rain and clouds, and higher-fidelity threat signatures.\n \n3. Advanced capability model improvements include expanded integrated fire control concepts involving capabilities such as Naval Integrated Fire Control – Counter Air (NIFC-CA) and fighter-centric kill chains, incorporation of advanced sensor capabilities such as the new IAMD radar for Aegis, Link-16 network enhancements, future threat kill chains and capabilities, and directed energy.  Additionally, integrate an Advanced Gun Weapon System model into the environment to explore tactical command and control challenges and contributions to the overall defense of critical assets.\n\n4. Space Warfare – integrate higher fidelity representations of Overhead Persistent Infrared (OPIR) assets and national to tactical contributions to the tactical fight.\n\n5. Non-program of record experimentation of innovative uses of existing sensors and weapons across traditional IAMD assets.  Examples include: ground-based sensors providing fire-control quality tracking to tactical air assets; contributions of unmanned assets to the air picture; and joint engagement sequences.\n\n6. Explore integration of offensive and defensive capabilities (kinetic and non-kinetic) in protection of select critical assets in USEUCOM."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "Execute two Nimble Fire events in support of PACOM, USFK, STRATCOM, and MDA.  Nimble Fire 19A will introduce limited offensive capabilities, defense of hypersonic missile threats, offensive & defensive long-range fires, and continue Patriot & THAAD integration in support of USFK JEONS.  Nimble Fire 19B will provide direct support to USAF Air Combat Command (ACC) exploring several potential tactical command & control alternatives within the USAF’s 2030 air superiority concepts.\n\nModeling and simulation upgrades:\n\n1. Include weather effects (e.g., rain and clouds) on Infrared (IR) based kill chains\n\n2. Higher-fidelity IR signatures\n\n3. Surface Electronic Warfare Improvement Program (SEWIP) Block 3 capability within the Aegis simulation\n\n4. SPY-6 radar model integration into Aegis\n\n5. Increase numbers of F-35 simulations (8 to 12+)\n\n6. F-16 simulation with APG-83 advanced electronically scanned array (AESA) radar\n\n7. USA and USMC long-range precision fires and kill chains\n\n8. AARGM-ER and other long-range weapons for fighters\n\n9. Unmanned aerial systems and unmanned surface systems teaming concepts, kill chains, and capabilities\n\n10. Additional classified capabilities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.226"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.226"
                                            },
                                            "Text": {
                                                "val": "Execute two Nimble Fire events in support of the Combatant Commands, the Services, and MDA. Implement upgrades at the Virtual Warfare Center to enable robust integration of EW, space and cyber capabilities and effects.\nModeling and simulation upgrades:\n\n1. Develop infrastructure to support modeling of EW techniques to allow Virtual Warfare Center to quickly adapt to a large spectrum of threat capabilities – to include receiver sensitivities, more accurate antenna patterns, power-based radar models, and additional jamming techniques.\n\n2. Build from FY19 upgrades adding fidelity to Infrared Search and Track (IRST) kill chains; include electro-optical (EO) sensors; and directed energy weapons.\n\n3. Develop real-time visualization of clouds and rain within fighter out-the-window displays\n\n4. Integrate a Multi-platform IR sensor\n\n5. Secure necessary facility space, hardware, and software to capture additional data, achieve simulation capability enhancements to better visualize impacts of EW or IR capabilities\n\n6. Integrate higher-fidelity space representations and feasibility of using multi-level security toolsets to integrate into the facility\n\n7. Introduce limited cyber effects to explore integration of non-kinetic and kinetic fires\n\n8. Update Link-16 network modeling\n\n9. Dedicated Unmanned Aerial Systems (UAS) cell\n\n10. Additional classified capabilities"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional FY 2020 funds were added to NIMBLE FIRE to enhance modeling and simulation capability of EW and IR capability models."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1. Perform at least two Nimble Fire events per year.\n\n2. Document capability gaps and shortfalls.\n\n3. Report Nimble Fire results and finding to the Joint Capabilities Board (JCB) to refine investment strategy.\n\n4. Other metrics are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P006"
                    },
                    "ProjectTitle": {
                        "val": "Cruise Missile Combat Identification (CID)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "69.620"
                        },
                        "PriorYear": {
                            "val": "5.500"
                        },
                        "CurrentYear": {
                            "val": "4.998"
                        },
                        "BudgetYearOne": {
                            "val": "4.655"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.655"
                        },
                        "BudgetYearTwo": {
                            "val": "4.675"
                        },
                        "BudgetYearThree": {
                            "val": "4.475"
                        },
                        "BudgetYearFour": {
                            "val": "4.475"
                        },
                        "BudgetYearFive": {
                            "val": "4.475"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is chartered to plan, coordinate, and oversee Integrated Air and Missile Defense (IAMD) requirements, concepts, and architectures. As part of the Joint Staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to IAMD issues. JIAMDO is the IAMD proponent for requirements and capabilities within the DoD’s resource allocation system. JIAMDO leads IAMD mission and utility analysis, integrates IAMD within the force protection joint capability area, and conducts evaluations of joint IAMD architectures. \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to coordinate integration issues and requirements. In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review cost, schedule, and performance criteria of Missile Defense Agency missile defense programs. At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM development of IAMD prioritized capabilities list and the global integrated IAMD assessment and analysis of the Ballistic Missile Defense System. JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues and homeland defense solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cruise Missile Combat Identification (CID)"
                                    },
                                    "Description": {
                                        "val": "Establishes joint requirements for emerging national and tactical combat identification technology and advocates for fielding CID technology to frontline weapon systems. Monitors, assesses, and enhances current joint air and cruise missile defense combat ID programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified and will be provided under a separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.998"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified and will be provided under a separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.655"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.655"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified and will be provided under a separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 requested amount, as well as the future years request, reflects un-expended resources from prior year and an associated re-phasing of resources into FY 2021 - FY 2022."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details of this program are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P007"
                    },
                    "ProjectTitle": {
                        "val": "Homeland Defense Capability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "15.000"
                        },
                        "BudgetYearOne": {
                            "val": "20.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.000"
                        },
                        "BudgetYearTwo": {
                            "val": "23.000"
                        },
                        "BudgetYearThree": {
                            "val": "28.000"
                        },
                        "BudgetYearFour": {
                            "val": "33.000"
                        },
                        "BudgetYearFive": {
                            "val": "33.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This program is reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program is reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Homeland Defense Capability"
                                    },
                                    "Description": {
                                        "val": "Develop Homeland Defense Capability"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "Perform technology development efforts. Further details are reported in accordance with with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Perform technology development efforts. Further details are reported in accordance with with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase from FY 2019 to FY 2020 reflects planned ramp-up of effort in this project. No additional funds have been added. Further details are reported in accordance with with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "This program is reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P008"
                    },
                    "ProjectTitle": {
                        "val": "Joint Regional Integrated Air and Missile Defense Capability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.600"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is chartered to plan, coordinate, and oversee Integrated Air and Missile Defense (IAMD) requirements, concepts, and architectures. As part of the Joint Staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to IAMD issues. JIAMDO is the IAMD proponent for requirements and capabilities within the DoD’s resource allocation system. JIAMDO leads IAMD mission and utility analysis, integrates IAMD within the force protection joint capability area, and conducts evaluations of joint IAMD architectures. \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to coordinate integration issues and requirements. In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review cost, schedule, and performance criteria of Missile Defense Agency missile defense programs. At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM development of IAMD prioritized capabilities list and the global integrated IAMD assessment and analysis of the Ballistic Missile Defense System. JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues and homeland defense solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Regional Integrated Air and Defense Capability Mix (JRICM)"
                                    },
                                    "Description": {
                                        "val": "Joint Regional Integrated Air and Defense Capability Mix (JRICM) will use analysis of adversary ballistic and cruise missile capabilities to determine if a layered missile defense can successfully degrade or defeat adversary missile attacks to extend base defense duration and maintain aircraft sortie generations rates. Funding will enable the study to proceed with support from the various government organizations and FFRDCs. Organizations will be funded to develop detailed analysis using modeling and simulation to study and evaluate attack operations, as well as defense capabilities in the 2023 timeframe."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.600"
                                            },
                                            "Text": {
                                                "val": "Conduct studies and analysis on air and missile defense capability mix. Deliveries will include briefings summarizing the impact that layered defense capabilities have on extending defense durations and aircraft sortie generation rate.  Specific details are classified and can be provided upon request."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Study ends in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Study ends in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific details are classified and can be provided upon request."
                        }
                    }
                }
            ]
        }
    }
}