{
    "id": "2020-Army-PB-2040-JBOOK-6862ccffed1a667db11cb620e9184b2662501ed68aad7c3c768162a310d4d712-20",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605857A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology Mgmt Support"
        },
        "R1LineNumber": {
            "val": "196"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.883"
            },
            "CurrentYear": {
                "val": "3.211"
            },
            "BudgetYearOne": {
                "val": "4.681"
            },
            "BudgetYearOneBase": {
                "val": "4.681"
            },
            "BudgetYearTwo": {
                "val": "2.790"
            },
            "BudgetYearThree": {
                "val": "2.842"
            },
            "BudgetYearFour": {
                "val": "2.923"
            },
            "BudgetYearFive": {
                "val": "2.744"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "24.074"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) funds environmental quality technology (EQT)-related management support functions including support of research, development, test and evaluation required for EQT technical integration efforts at demonstration\/validation test sites, technical information and activities, test facilities and general test instrumentation, and EQT requirement assessments. Funds support the management of technology transfer associated with technology demonstrated and validated as part of Army EQT projects. In addition, this PE provides support to the Army weapon system acquisition community to address environmental quality requirements under the Environmentally Sustainable Acquisition\/Logistics Program.\n\nThe Environmentally Sustainable Acquisition\/Logistics Project includes program management for developing acquisition strategies that achieve system key performance parameters and sustain the environment without permanent and unacceptable change to the natural environment or human health from system concept refinement through disposal. The Project involves systematic consideration of environmental impacts, energy use, natural resources, installation impacts, economics, and quality of life. It provides support to the system acquisition community (Program and Project Managers) to integrate environmental quality analyses into the system acquisition process. The goal of the effort is to resolve environmental quality issues related to weapon systems that are identified during design, development, testing, operation, or support to reduce Army environmental liabilities and total ownership costs, including efforts to eliminate the use of hazardous and ozone-depleting materials from weapon systems and facilities.\n\nThe Pollution Prevention Tech Support Project funds the management support costs to execute the Toxic Metals Reduction, Airborne Lead Reduction, Low Global Warming Potential (LGWP), and Securing the Availability of Green Enhanced Coatings (SAGE-Coat) environmental quality technology programs, which support Cross Functional Teams and the Army's top modernization priorities by addressing potential obsolescence of legacy materials and current and emerging impacts on human health and the environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.087"
                },
                "CurrentYear": {
                    "val": "3.216"
                },
                "BudgetYearOne": {
                    "val": "4.876"
                },
                "BudgetYearOneBase": {
                    "val": "4.876"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.883"
                },
                "CurrentYear": {
                    "val": "3.211"
                },
                "BudgetYearOne": {
                    "val": "4.681"
                },
                "BudgetYearOneBase": {
                    "val": "4.681"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.204"
                },
                "CurrentYear": {
                    "val": "-0.005"
                },
                "BudgetYearOne": {
                    "val": "-0.195"
                },
                "BudgetYearOneBase": {
                    "val": "-0.195"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.005"
                    },
                    "CurrentYear": {
                        "val": "-0.005"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.199"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.195"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.195"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "031"
                    },
                    "ProjectTitle": {
                        "val": "Environmentally Sustainable Acquisition\/Logistics"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.201"
                        },
                        "CurrentYear": {
                            "val": "2.29"
                        },
                        "BudgetYearOne": {
                            "val": "4.119"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.119"
                        },
                        "BudgetYearTwo": {
                            "val": "2.185"
                        },
                        "BudgetYearThree": {
                            "val": "2.228"
                        },
                        "BudgetYearFour": {
                            "val": "2.272"
                        },
                        "BudgetYearFive": {
                            "val": "2.318"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.613"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Environmentally Sustainable Acquisition\/Logistics (ESAL) Project provides support to the system acquisition community to integrate environmental quality issues and concerns into the life cycle system acquisition process, including human health risks, life safety, material obsolescence due to regulatory pressures, occupational exposures and energy efficiency. This includes helping the acquisition community address high priority issues associated with hexavalent chromium, cadmium and airborne lead. The focus of ESAL is on improving readiness, enabling mission capabilities, improving acquisition processes, reducing supportability burden, and minimizing total ownership cost. The Assistant Secretary of the Army for Installations, Energy and Environment has defined the functions of the ESAL project in coordination with the Army Acquisition Executive and the Assistant Secretary of the Army (Acquisition, Logistics, and Technology). This Project provides direct support to the Army acquisition community to pursue environmental sustainability and comply with legal statutes, policies and regulations during the life cycle of Army materiel. ESAL helps address Army Modernization Priorities, while sustaining readiness and achieving compliance with its weapon systems, industrial base, field and deployed activities directed by international treaties, Federal statutes, Executive Orders, Department of Defense (DoD) and Army policies and regulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Quality (EQ) Support"
                                    },
                                    "Description": {
                                        "val": "Provide EQ Support to Acquisition Programs via Program Executive Offices (PEOs) \/ Program Managers (PMs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.095"
                                            },
                                            "Text": {
                                                "val": "Provided support to PEOs \/ PMs to integrate EQ considerations into systems engineering activities. This included fulfillment of National Environmental Policy Act requirements, definition of EQ technology needs to meet operational requirements, analysis of technical data to support implementation decisions, participation in technical and cost risk assessment activities, and assessment and revision of contractual and operational requirements for successful technology integration, operation and support. Analyzed impending legal statutes impacting production, operation and support of weapon systems.  Assessed weapon system readiness impacts (e.g., production levels, training, operational tempo and maintenance activities) resulting from EQ issues affecting industrial base and garrisons. Provided Army acquisition community representation in select Office of the Secretary of Defense (OSD) and Department of the Army (DA) committees addressing environmental legislation and rulemaking."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Provide support to PEOs \/ PMs and Cross Functional Teams (CFTs) to integrate EQ considerations into systems engineering activities. This includes fulfillment of National Environmental Policy Act requirements, definition of EQ technology needs to meet operational requirements, analysis of technical data to support implementation decisions, participation in technical and cost risk assessment activities, and assessment and revision of contractual and operational requirements for successful technology integration, operation and support. Analyze impending legal statutes impacting production, operation and support of weapon systems. Assess weapon system readiness impacts (e.g., production levels, training, operational tempo and maintenance activities) resulting from EQ issues affecting industrial base and garrisons. Will provide Army acquisition community representation in select Office of the Secretary of Defense (OSD) and Department of the Army (DA) committees addressing environmental legislation and rulemaking."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.005"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.005"
                                            },
                                            "Text": {
                                                "val": "Will provide support to PEOs \/ PMs and CFTs to integrate EQ considerations into systems engineering activities. This will include fulfillment of National Environmental Policy Act requirements, definition of EQ technology needs to meet operational requirements, analysis of technical data to support implementation decisions, participation in technical and cost risk assessment activities, and assessment and revision of contractual and operational requirements for successful technology integration, operation and support. Will analyze impending legal statutes impacting production, operation and support of weapon systems. Will assess weapon system readiness impacts (e.g., production levels, training, operational tempo and maintenance activities) resulting from EQ issues affecting industrial base and garrisons. Will provide Army acquisition community representation in select OSD and DA committees addressing environmental legislation and rulemaking."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Fund change due to economic adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Quality Technology Management"
                                    },
                                    "Description": {
                                        "val": "Provide management support for Army EQ technology efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.749"
                                            },
                                            "Text": {
                                                "val": "Provided system acquisition support to the Army's EQ technology program and coordination of EQ-related systems' needs for expanded Research and Development, Test and Evaluation (RDTE) efforts. Managed and oversaw technology integration efforts by Army Life Cycle Management Commands for weapon systems in all stages of design, procurement and operations\/support. Coordinated RDTE requirements among members of the Army EQ Technology Teams, coordinated technology evaluations and operational requirements in support of weapon system platform integration, managed and oversaw test plan development, oversaw testing activities, and analyzed test results to support weapon systems engineering decision making."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.217"
                                            },
                                            "Text": {
                                                "val": "Provide system acquisition support to the Army's EQ technology program and coordination of EQ-related systems' needs for expanded RDTE efforts. Manage and oversee technology integration efforts by Army Life Cycle Management Commands for weapon systems in all stages of design, procurement and operations\/support. Coordinate RDTE requirements among members of the Army EQ Technology Teams, coordinate technology evaluations and operational requirements in support of weapon system platform integration, manage and oversee test plan development, oversee testing activities, and analyze test results to support weapon systems engineering decision making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.137"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.137"
                                            },
                                            "Text": {
                                                "val": "Will provide system acquisition support to the Army's EQ technology program and coordination of EQ-related systems' needs for expanded RDTE efforts in support of Army Modernization Priorities. Will manage and oversee technology integration efforts by Army Life Cycle Management Commands for weapon systems in all stages of design, procurement and operations\/support. Will coordinate RDTE requirements among members of the Army EQ Technology Teams and Cross Functional Teams, will coordinate technology evaluations and operational requirements in support of weapon system platform integration, will manage and oversee test plan development, will oversee testing activities, and will analyze test results to support weapon systems engineering decision making."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Fund change due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ozone Depleting Substance Management"
                                    },
                                    "Description": {
                                        "val": "Oversee Army efforts to manage the use\/elimination of ozone depleting substances on Army weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.453"
                                            },
                                            "Text": {
                                                "val": "Oversaw Army efforts to manage the use\/elimination of ozone-depleting substances on Army weapon systems. Monitored the Army's reserve of ozone-depleting substances that contain the Army's strategic supplies of Halon used for explosion and fire suppression systems and R-22 used in fielded environmental control units. Coordinated with PEOs\/PMs to affect system replacement and retrofit to eliminate ozone depleting substances while minimizing greenhouse gases and to obtain approval to require use of Halon in new contracts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Headquarters Army Environmental System (HQAES)"
                                    },
                                    "Description": {
                                        "val": "Headquarters Army Environmental System support (HQAES) is the Army's environmental enterprise business system of record enabling the Army to collect, analyze, and report environmental data.  HQAES is used by Installations, Commands, Headquarters Department of the Army, and various service providers (e.g., U.S Army Corps of Engineers, U.S. Army Environmental Command) for managing the environmental program. HQAES is the feeder system for environmental liabilities reporting, which is the largest liability on the Army's financial statement. HQAES has the capability to track environmental project execution and end-to-end program management and provides visibility and transparency needed for cost and functional environmental management, including cleanup, compliance and conservation at active Army, Army National Guard; Army Reserve and Base Realignment and Closure (BRAC) installations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.904"
                                            },
                                            "Text": {
                                                "val": "PEO Enterprise Information Systems (EIS) officially assumed operational\/acquisition control of HQAES on 1 October 2018."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.977"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.977"
                                            },
                                            "Text": {
                                                "val": "In FY20 the HQAES PMO will continue execution of capability enhancements to improve usability, enhance decision support, and improve the integrity and available of actionable data.  This will include the following to include those identified during the roadmap\/acquisition refinement:  \n \n- Provide remote capabilities to perform Environmental Performance Assessment System audits, data analysis, and other processes required for critical business lines\n- Develop data interfaces been remote applications, data storage systems or front-end views and HQAES\n- Integrate solid waste management capabilities\n-  Integrate data from authoritative Army and DoD sources (real property, financial, geospatial, global mail etc.)\n- Provide universal reporting formats for Army-wide use"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds are programmed every other year to support HQAES PMO."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.073"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "TBD"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "06I"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Quality Technology Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.682"
                        },
                        "CurrentYear": {
                            "val": "0.921"
                        },
                        "BudgetYearOne": {
                            "val": "0.562"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.562"
                        },
                        "BudgetYearTwo": {
                            "val": "0.605"
                        },
                        "BudgetYearThree": {
                            "val": "0.614"
                        },
                        "BudgetYearFour": {
                            "val": "0.651"
                        },
                        "BudgetYearFive": {
                            "val": "0.426"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.461"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides Research, Development, Test, & Evaluation (RDTE) Management Support for the demonstration and validation of innovative technologies to modernize materials and processes required for current and future operational sustainment and warfighter training capabilities within the Army's Environmental Quality Technology program. The Project supports technologies that increase life safety, reduce Soldier and worker human health risks, enhance readiness and enable mission capabilities of the current and future force, while simultaneously increasing performance and standardization across the Army. This Project provides for management of RDTE activities conducted under project 0603779A (Environmental Quality Technology Dem\/Val) \/ Project E21 (Environmental Quality Technology Dem\/Val), which supports the Cross Functional Teams and the Army's top modernization priorities by addressing potential obsolescence of legacy materials and current and emerging impacts on human health and the environment. The Project expedites technology transition from the laboratory to operational use by establishing toxicology assessments to support the demonstration of modern materials and processes fulfilling or surpassing the performance requirements outlined in Material Specifications, Depot Maintenance Work Requirements, Technical Manuals, Drawings, and other technical data."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management of Army Environmental Quality Technology Programs"
                                    },
                                    "Description": {
                                        "val": "Manage and oversee the demonstration\/validation of weapon system pollution prevention technologies within the Army's Environmental Quality Technology Program with a focus on eliminating the high priority issues associated with hexavalent chromium, cadmium and airborne lead through material substitution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.682"
                                            },
                                            "Text": {
                                                "val": "Managed and oversaw the demonstration\/validation of two pollution prevention technology efforts: Toxic Metal Reduction in Surface Finishing of Army Weapon Systems; and Airborne Lead Reduction from Army Weapon Systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.439"
                                            },
                                            "Text": {
                                                "val": "Manage and oversee the demonstration\/validation of three pollution prevention technology efforts: Toxic Metal Reduction in Surface Finishing of Army Weapon Systems; Airborne Lead Reduction from Army Weapon Systems; and Low Global Warming Potential Alternatives to Ozone Depleting Substances."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.562"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.562"
                                            },
                                            "Text": {
                                                "val": "Will manage and oversee the demonstration\/validation of three technology efforts that support the Future Vertical Lift, Next Generation Combat Vehicle, Long Range Precision Fire and Soldier Lethality Army modernization priorities: Toxic Metal Reduction in Surface Finishing of Army Weapon Systems; Airborne Lead Reduction from Army Weapon Systems; and Low Global Warming Potential Alternatives to Ozone Depleting Substances."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds increase reflects slight shift in projected requirements related to Army modernization efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental, Safety and Occupational Health Impacts of Short-Term Noise Assessment Procedures"
                                    },
                                    "Description": {
                                        "val": "Manage and oversee the demonstration and validation of technologies for making Army blast noise short-term noise assessment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.247"
                                            },
                                            "Text": {
                                                "val": "Develop training modules for using short-term noise assessment tools. These self-guided on-line training modules will be for use by installation range managers and address the use of short-term noise assessment procedures and interpretation of results to minimize risk to training and maximize training throughput."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds have been strategically realigned in support of holistic within-Project program assessment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Water Reuse Technology for Fixed Installations"
                                    },
                                    "Description": {
                                        "val": "Advanced water reuse technologies demonstration and guidance for Army fixed installations applications."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.235"
                                            },
                                            "Text": {
                                                "val": "Summarize results of prior demonstration studies, recommending updates to guidance documents from Army Public Health Center and Unified Facilities Criteria."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds strategically realigned in pursuit of within-Project requirements related to Army modernization priorities."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}