{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-69",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605142D8Z"
        },
        "ProgramElementTitle": {
            "val": "Systems Engineering"
        },
        "R1LineNumber": {
            "val": "152"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "218.709"
            },
            "PriorYear": {
                "val": "36.313"
            },
            "CurrentYear": {
                "val": "38.784"
            },
            "BudgetYearOne": {
                "val": "37.140"
            },
            "BudgetYearOneBase": {
                "val": "37.140"
            },
            "BudgetYearTwo": {
                "val": "41.606"
            },
            "BudgetYearThree": {
                "val": "33.842"
            },
            "BudgetYearFour": {
                "val": "34.701"
            },
            "BudgetYearFive": {
                "val": "35.564"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) establishes the dedicated funding line to carry out the mission and systems engineering duties as described in Deputy Secretary of Defense Memorandum, \"Establishment of the Office of the Under Secretary of Defense for Research and Engineering and the Office of the Under Secretary of Defense for Acquisition and Sustainment,\" July 13, 2018.  The Director, Mission Engineering (D, ME) and Director, Systems Engineering under the Deputy Director, Mission Engineering & Integration (DD, ME&I) are the principal advisors to the Secretary of Defense and the Under Secretary of Defense for Research and Engineering (USD(R&E)) on systems engineering, development planning, and related technical fields in the Department of Defense (DoD).  The DD, ME&I develops policies and guidance for: (1) the use of systems engineering principles and best practices; (2) the use of systems, and software engineering planning and contracting approaches to enhance manufacturing, reliability, availability and maintainability on major defense acquisition programs (MDAPs); (3) the systems engineering plans (SEPs) for MDAPs including software, and systems engineering considerations in support of lifecycle management and sustainment; and (4) the inclusion of provisions relating to systems engineering and reliability in requests for proposals.  The DD, ME&I develops new methods, processes, and tools (MPTs) incorporating state of the practice into engineering for the DoD in both weapon system design, and design tools.  The DD, ME&I reviews and approves the SEP for each MDAP, and monitors and reviews the systems engineering and development planning activities of MDAPs and other defense acquisition programs, as directed by the Secretary of Defense.  Based on the DD, ME&I’s continuous program engagement, the DD, ME&I advises and makes recommendations to the Secretary of Defense regarding systems engineering, development planning, reliability and maintainability (R&M) engineering planning, and the execution of these activities.  As a member of the Defense Acquisition Board (DAB), the DD, ME&I provides independent assessments of defense acquisition program’s systems engineering, development planning, technical execution, and risk.  The DD, ME&I also provides input on the inclusion of systems engineering requirements as part of the Joint Requirements Oversight Council's process for joint military requirements (e.g. the Sustainment Key Performance Parameter), to include developing specific inputs relating to each capabilities development document.\n\nIn alignment with the National Defense Strategy (NDS), the Systems Engineering (SE) Program Element supports a more lethal force by analyzing near-, mid-, and long-term approaches to realizing mission capability, assessing that capability against anticipated adversaries in relevant AORs, and determine revised system, architectural, tech surprise opportunities to maintain tactical edge, insert technology, improve interoperability and formulate long-term strategies to retain or improve our capabilities against our adversaries. The SE Program Element oversees, initiates, or recommends opportunities to align technology investments to accelerate capability delivery, or modification of existing systems. SE Program Element supports modernizing key capabilities and cultivating workforce talent by developing SE methods, policies, processes, and tools that cross cuts technologies and integrates technical disciplines to advance DoD engineering practices and providing advocacy and oversight for the Department's systems engineering workforce to build a capable, current, and innovative engineering workforce. The SE Program Element also supports reforming the Department for greater performance and affordability by conducting independent technical risk assessments (ITRAs) on MDAPs to advise the USD(R&E) on progress towards achieving key performance parameters, technology maturation, interoperability, and cyber security posture.\n\nThe DD, ME&I issues guidance to, and consults with, the Services and Agencies with respect to systems engineering across the Department.  The DD, ME&I improves DoD’s SE capabilities through advocacy, oversight, policy, and guidance for the acquisition workforce responsible for Engineering, and Production, Quality & Manufacturing (PQM); in Engineering Tools and Environments; and in Specialty Engineering.  \n\nThe DD, ME&I periodically reviews the organizations and capabilities of the military departments with respect to systems engineering, development planning, and lifecycle management and sustainability, and identifies needed changes or improvements to such organizations and capabilities.  \n\nBeginning in FY 2019, this PE will support activities to carry out responsibilities described in Fiscal Year 2017 National Defense Authorization Act (NDAA) Section 855 titled Mission Integration Management (MIM).\n\nFunding from Project Code 143, Program Protection, will be re-aligned to a new Maintaining Technology Advantage Program Element (PE) 0605797D8Z, beginning in FY 2020 to support efforts which have transitioned to the Deputy Director, Strategic Technology Protection and Exploitation (STP&E)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.622"
                },
                "CurrentYear": {
                    "val": "38.872"
                },
                "BudgetYearOne": {
                    "val": "39.252"
                },
                "BudgetYearOneBase": {
                    "val": "39.252"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.313"
                },
                "CurrentYear": {
                    "val": "38.784"
                },
                "BudgetYearOne": {
                    "val": "37.140"
                },
                "BudgetYearOneBase": {
                    "val": "37.140"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.309"
                },
                "CurrentYear": {
                    "val": "-0.088"
                },
                "BudgetYearOne": {
                    "val": "-2.112"
                },
                "BudgetYearOneBase": {
                    "val": "-2.112"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.236"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.073"
                                },
                                "CurrentYear": {
                                    "val": "-0.088"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.112"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.112"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2020, funding was re-aligned to the Maintaining Technology Advantage PE0605797D8Z; changes were made in accordance with new OUSD(R&E) re-organization."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "142"
                    },
                    "ProjectTitle": {
                        "val": "Systems Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "193.309"
                        },
                        "PriorYear": {
                            "val": "32.506"
                        },
                        "CurrentYear": {
                            "val": "32.914"
                        },
                        "BudgetYearOne": {
                            "val": "35.140"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.140"
                        },
                        "BudgetYearTwo": {
                            "val": "39.606"
                        },
                        "BudgetYearThree": {
                            "val": "31.842"
                        },
                        "BudgetYearFour": {
                            "val": "32.701"
                        },
                        "BudgetYearFive": {
                            "val": "33.564"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project P142 supports the execution of the missions of the Deputy Director, Mission Engineering & Integration (DD, ME&I) to: (1) provide flexible engineering policy, guidance, and workforce development requirements for the DoD acquisition workforce; (2) foster an acquisition environment of collaboration, teamwork, and joint ownership of program success through a proactive program oversight process, ensuring appropriate levels of systems engineering discipline are applied through all phases of the acquisition life cycle; and (3) engage all stakeholders across government, industry, and academia to collectively advance systems engineering practices and achieve acquisition excellence.  The outcome of this effort is to ensure systems engineering principles and disciplines are modern, and fully accepted and assimilated into the DoD acquisition workforce positioning the DoD for acquisition excellence and leading to a stronger national defense.\n\nActivities include the following functions:\n• Work with acquisition program managers to prepare systems engineering plans (SEPs) to document the technical management approach.\n• Conduct periodic program engagements in support of technical reviews to confirm programs are executed in accordance with the SEP.\n• Review all aspects of the systems engineering process for major defense acquisition programs (MDAPs) to ensure they are adequate to support fielding and the achievement of cost, performance, and readiness goals including producibility, reliability, maintainability, sustainment, and other considerations.\n• Participate in Systems Engineering Integrated Project Teams (IPTs), Systems Engineering Working Integrated Project Teams (WIPTs), and Systems Engineering technical reviews, especially Preliminary Design Reviews and Critical Design Reviews.\n• Work with DoD Service program managers, their staffs, and other organizations, technical authorities, and oversight organizations to develop and implement technical management programs for MDAPs.\n• Conceive plans and lead program support reviews and assessments of MDAP weapons systems and other programs to shape technical planning and management to ensure program success.\n• Conduct other technical reviews as requested (e.g., Nunn-McCurdy certification reviews, Non-Advocate Reviews, focused technical assessments, and software readiness reviews to identify and mitigate program risk).\n• Establish engineering policy, guidance, and workforce development to drive the development of fully capable and supportable weapons systems.\n• Oversee Component implementation of engineering initiatives and conduct independent assessments.  Advance the principles of modularity and open systems and incorporate them, when practicable in the design, and acquisition of weapon systems.\n• Develop education and training materials for instructing, maintaining, and enhancing the defense acquisition workforce.  Activities include: (1) developing guidance to enhance Engineering (ENG) and Production Quality and Manufacturing (PQM) acquisition career planning and progression; and (2) monitoring, and facilitating Defense Acquisition University (DAU) updates to the systems engineering, quality and specialty engineering courses, to ensure the curriculum represents the education and training requirements necessary to be a viable team member in the acquisition process.\n• Improve the DoD’s capabilities in Specialty Engineering (e.g., reliability & maintainability, human-systems integration, weapons safety, value engineering and manufacturing) through policy, program oversight, fostering practice and technology improvements, initiating long-term strategic improvements, and collaborating with industry.\n• Advance DoD engineering practices through the use of new MPTS, such as digital engineering and model-based systems engineering, for development of weapon systems.\n• Serve as the Defense Standardization Executive and oversee the Defense Standardization Program.\n• Guide Service and other component organizations in the development planning process to ensure proposed MDAP programs are executable within acceptable levels of risk.\n• Resolve long-term major systems engineering challenges such as systems of systems (SoS) systems engineering, systems engineering of complex systems, and pre-program formulation systems engineering trade off analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Engineering Initiatives"
                                    },
                                    "Description": {
                                        "val": "The DD, ME&I provides objective assessments of program risk to support knowledge-based decision making by DoD leaders regarding DoD MDAPs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.506"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Program Support \n• Monitor programs, providing SE oversight and support to all MDAPs, Major Automated Information Systems (MAIS), and special interest programs.\n• Expand root cause analysis conducted during and after Program Support Assessments (PSAs).\n• Expand use of detailed performance measurement and analysis.\n• Provide decision-quality information and recommendations to DABs, In Progress Reviews, Peer Reviews, and PDR\/CDR assessments.\n\nStrategic Thrust:  Work Force Development\n• Carry out duties as Functional Lead for Engineering (ENG), Production, Quality, and Manufacturing(PQM), all Department non-construction engineering and assist software engineering.\n• Build an enduring high performance engineering culture across the Department in Systems Engineering.\n• Update and deploy courses with increased technical rigor and complex, case-based exercises.\n• Investigate workforce development initiatives including leadership development, specialized training, and improved instructional methods.\n• Assess engineering workforce capability and capacity, and, working with Components, develop strategies to address identified gaps.\n• Perform outreach to services and OSD to focus the Department’s attention and behavior on promoting an engineering culture.\n\nStrategic Thrust:  Engineering Policy and Guidance\n• Develop and update core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Develop engineering guidance and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process including, but not limited to, program protection\/system security engineering; software; manufacturing, reliability, availability, and maintainability; modeling and simulation; configuration management; data management; and risk management. \n• Assess challenges and impact; develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems.\n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP throughout the program’s lifecycle. \n\nStrategic Thrust: Systems Engineering Capabilities Assessment \n• Work jointly with DT&E to develop and track measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n• Periodically review the organizations and capabilities of the Military Departments and Defense Agencies with respect to systems engineering, development planning, and lifecycle management and sustainability, and identify needed changes or improvements to such organizations and capabilities. \n• Issue guidance to and consult with the Heads of the DoD Components with respect to systems engineering and development planning in the DoD. \n• Store and analyze performance criteria in SEPs and Test and Evaluation Master Plans (TEMPs) for MDAPs; develop program metrics to aid SE assessments and program execution.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support: (1) Services and COCOMs in pre-MS A formulation; (2) requirements analyses and analysis of alternatives; and (3) initial capabilities document definition and development.\n\nStrategic Thrust:  Engineering Tools and Environments\n• Establish guidance and education to support digital engineering use in Systems Engineering.\n• Continue collaboration in digital engineering methods, processes, tools development and gap identification.\n• Oversee development of, and incorporation of modularity and open system technical enablers by Services in their acquisition efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.914"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Program Support \n• Monitor programs, providing SE oversight and support to all MDAPs and special interest programs.\n• Expand root cause analysis conducted during and after Independent Technical Risk Assessments (ITRAs).\n• Expand use of detailed performance measurement and analysis.\n• Provide decision-quality information and recommendations to DABs, In Progress Reviews, Peer Reviews, and PDR\/CDR assessments.\n\nStrategic Thrust:  Work Force Development\n• Carry out duties as Functional Lead for Engineering (ENG), Production, Quality, and Manufacturing (PQM), all Department non-construction engineering and assist software engineering.\n• Build an enduring high performance engineering culture across the Department in Systems Engineering.\n• Update and deploy courses with increased technical rigor and complex, case-based exercises.\n• Investigate workforce development initiatives including leadership development, specialized training, and improved instructional methods.\n• Assess engineering workforce capability and capacity, and, working with Components, develop strategies to address identified gaps.\n• Perform outreach to services and OSD to focus the Department’s attention and behavior on promoting an engineering culture.\n\nStrategic Thrust:  Engineering Policy and Guidance\n• Develop and update core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Develop engineering guidance and policies for SE responsibility in the acquisition process including, but not limited to, software modeling and simulation; configuration management; data management; and risk management.\n• Assess challenges and impact; develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems.\n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP throughout the program’s lifecycle. \n\nStrategic Thrust: Specialty Engineering\n• Develop engineering guidance and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process including, but not limited to manufacturing engineering; reliability and maintainability engineering; human systems integration and value engineering. \n• Conduct studies and analyses of MPT to identify challenges and opportunities and develop and promulgate best practices and guidance for applying specialty engineering principles, concepts, and practices in defense acquisition programs.  \n• Conduct activities to develop and implement plans to enhance the specialty engineering workforce.\n\nStrategic Thrust: Systems Engineering Capabilities Assessment \n• Work jointly with DT&E to develop and track measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n• Periodically review the organizations and capabilities of the Military Departments and Defense Agencies with respect to systems engineering, development planning, and lifecycle management and sustainability, and identify needed changes or improvements to such organizations and capabilities. • Issue guidance to and consult with the Heads of the DoD Components with respect to systems engineering and development planning in the DoD. \n• Store and analyze performance criteria from MDAP SEPs and test documentation; develop program metrics to aid SE assessments and program execution.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support: (1) Services and COCOMs in pre-MS A formulation; (2) requirements analyses and analysis of alternatives; and (3) initial capabilities document definition and development.\n\nStrategic Thrust:  Engineering Tools and Environments\n• Support implementation of digital engineering principles, concepts and practices into the activities of the DoD related to all aspects of weapon system lifecycle and use.\n• Establish guidance and education to support digital engineering use in Systems Engineering.\n• Normalize the separate concepts of digital engineering, modeling and simulation, and model-based\/model-centric items into a cohesive enabler for national defense system lifecycle activities.\n• Continue collaboration in digital engineering methods, processes, tools development and gap identification to initiate research and development of gap filling technologies and methods.\n• Oversee the collaborative development of comprehensive guidance for proper identification of modular and open enablers; and effective use of such in the lifecycle activities of national defense systems.\n• Oversee development of, and incorporation of modularity and open system technical enablers by Services in their acquisition efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.140"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.140"
                                            },
                                            "Text": {
                                                "val": "FY 2020 Plans: \nContinue to:\nStrategic Thrust:  Program Support \n• Monitor programs, providing SE oversight and support to all MDAPs and special interest programs.\n• Expand root cause analysis conducted during and after Independent Technical Risk Assessments (ITRAs).\n• Expand use of detailed performance measurement and analysis.\n• Provide decision-quality information and recommendations to DABs, In Progress Reviews, Peer Reviews, and PDR\/CDR assessments.\n\nStrategic Thrust:  Work Force Development\n• Carry out duties as Functional Lead for Engineering (ENG), Production, Quality, and Manufacturing (PQM), all Department non-construction engineering and assist software engineering.\n• Build an enduring high performance engineering culture across the Department in Systems Engineering.\n• Update and deploy courses with increased technical rigor and complex, case-based exercises.\n• Investigate workforce development initiatives including leadership development, specialized training, and improved instructional methods.\n• Assess engineering workforce capability and capacity, and, working with Components, develop strategies to address identified gaps.\n• Perform outreach to services and OSD to focus the Department’s attention and behavior on promoting an engineering culture.\n\nStrategic Thrust:  Engineering Policy and Guidance\n• Develop and update core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Develop engineering guidance and policies for SE responsibility in the acquisition process including, but not limited to, software modeling and simulation; configuration management; data management; and risk management.\n• Assess challenges and impact; develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems.\n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP throughout the program’s lifecycle. \n\nStrategic Thrust: Specialty Engineering\n• Develop engineering guidance and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process including, but not limited to manufacturing engineering; reliability and maintainability engineering; human systems integration; and value engineering. \n• Conduct studies and analyses of MPT to identify challenges and opportunities and develop and promulgate best practices and guidance for applying specialty engineering principles, concepts, and practices in defense acquisition programs.  \n• Conduct activities to develop and implement plans to enhance the specialty engineering workforce.\n\nStrategic Thrust: Systems Engineering Capabilities Assessment \n• Work jointly with DT&E and DD, STP&E to develop and track measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n• Periodically review the organizations and capabilities of the Military Departments and Defense Agencies with respect to systems engineering, development planning, and lifecycle management and sustainability, and identify needed changes or improvements to such organizations and capabilities. \n• Issue guidance to and consult with the Heads of the DoD Components with respect to systems engineering and development planning in the DoD. \n• Store and analyze performance criteria from MDAP SEPs and test documentation; develop program metrics to aid SE assessments and program execution.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support: (1) Services and COCOMs in pre-MS A formulation; (2) requirements analyses and analysis of alternatives; and (3) initial capabilities document definition and development.\n\nStrategic Thrust:  Engineering Tools and Environments\n• Support implementation of digital engineering principles, concepts and practices into the activities of the DoD related to all aspects of weapon system lifecycle and use.\n• Establish guidance and education to support digital engineering use in Systems Engineering.\n• Normalize the separate concepts of digital engineering, modeling and simulation, and model-based\/model-centric items into a cohesive enabler for national defense system lifecycle activities.\n• Continue collaboration in digital engineering methods, processes, tools development and gap identification to initiate research and development of gap filling technologies and methods.\n• Oversee the collaborative development of comprehensive guidance for proper identification of modular and open enablers; and effective use of such in the lifecycle activities of national defense systems.\n• Oversee development of, and incorporation of modularity and open system technical enablers by Services in their acquisition efforts.\n• Support the development of the DoD PNT Open Architecture Standard (PNTAS) to version 1.0, and develop a virtual system integration laboratory (vSIL), as well as a PNT Fusion Module. The PNTAS v1.0 will be improved by a technical working group, on implementation on a service pathfinder, such as MAPS, EGI-M, and GPNTS. The vSIL will include development of CONOPS, a development environment, trade studies, and web server development. The PNT Fusion Module development will entail the creation of the physical system architecture based on the PNTAS, and evaluation and modification of Scorpion Code to comply with PNTAS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2019 and FY 2020.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Improved the Systems Engineering effectiveness of the Department’s acquisition enterprise and provided Department leadership with technical insights into acquisition program performance through:\n• Systems engineering plans (SEPs) reviewed and approved to document each program’s technical management approach.\n•Independent Technical Risk Assessments (ITRAs) and periodic program engagements conducted and program technical reviews supported to confirm programs are executed in accordance with the SEP.\n• Technical reviews conducted as requested (e.g., Nunn-McCurdy certification reviews, Non-Advocate Reviews, and focused technical assessments to identify and mitigate program risk).\n• DABs, Overarching Integrated Product Teams (OIPTs), and other program review participation to provide technical insights to OSD stakeholders.\n• Effective systems engineering policy and guidance established and promulgated throughout the Military Services and the Defense Acquisition System.\n• A systems engineering workforce staffed, trained and certified with capable and experienced personnel.\n• Improved reliability engineering, reliability growth management, and reliability monitoring in program development contracting, execution and sustainment.\n• Service and other component organizations engaged and supported in the development planning process through effective policy, guidance, document reviews and program engagement to ensure proposed MDAP programs are executable within acceptable levels of risk.\n• Increased use of digital artifacts in acquisition decision making and expansion of design options.\n• Increased use of modular designs and design techniques in weapon systems, coupled with appropriate contracting language and follow through."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "143"
                    },
                    "ProjectTitle": {
                        "val": "Program Protection"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "25.400"
                        },
                        "PriorYear": {
                            "val": "3.807"
                        },
                        "CurrentYear": {
                            "val": "3.870"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element supports the program protection activities of the Deputy Director, Strategic Technology Protection and Exploitation (DD, STP&E).  The Department of Defense (DoD) must address cybersecurity and supply chain risks to DoD networks, weapons systems, and information stored and processed on both DoD and Defense Industrial Base (DIB) unclassified contractor information networks that support DoD programs.  Increased reliance on the internet as a vehicle for sharing information, globalization of the supply chain, and advanced persistent threats (APTs) that can evade commercially available security tools and defeat generic security best practices, drives the need for diligent program protection planning and execution.  Program Protection Planning includes protection of classified and unclassified controlled technical information, critical program information, critical components and critical mission functions, and integrates high level security policies and practical expertise to specific acquisition and S&T practices, systems engineering activities, and risk reduction activities.  Through this initiative the Department is maturing system security engineering methodologies to protect controlled unclassified information, to include controlled technical information on contractor information networks; improve mitigation and management of supply chain risk management risks, improve integration of cybersecurity into the engineering processes, improve software assurance practices, mature processes to identify and protect Critical Program Information and improve program protection planning.  Activities carried out, support implementation of DoD Instruction 5200.44 Trusted Systems and Networks with the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes, and creation of needed technology; implementation of DoD Instruction 5200.39  Critical Program Information (CPI) Identification and Protection Within Research, Development, Test, and Evaluation (RDT&E) to identify and protect Critical Program Information; and implementation of DoD Instruction 8582.01 Security of Unclassified DoD Information on Non-DoD Information Systems for Safeguarding Controlled Unclassified Information on contractor owned networks.\n\nDD, STP&E provides independent assessments of research, technology and defense acquisition program’s system security engineering and program protection implementation.\n\nThe DD, STP&E reviews and approves the PPP  for each MDAP, and monitors and reviews the system security engineering planning activities of MDAPs and other defense acquisition programs, as directed by the Secretary of Defense.  \n\nThis PE includes efforts by the office of the DD, STP&E in implementing the Department’s Trusted Defense System Strategy.  Specifically, the PE will develop and mature the critical sub discipline of systems engineering - system security engineering (SSE), Hardware and Software Assurance, and the Comprehensive Program Protection Planning process that implements a risk-based approach to protection of critical program information, critical components and mission functions, and information in acquisition programs.  These efforts include study and maturation of policy, guidance, system security discipline fundamentals, such as engineering methods, tools, and best practices, and establishing a coalition of assurance activities across the DoD to provide analytical and technical support to acquisition programs.  These activities will be promulgated in defense acquisition as a fundamental element of the DD, STP&E systems engineering and technical reviews. \n\nIn FY 2020, funding from this project will transfer to the Maintaining Technology Advantage PE 0605797D8Z, in alignment with the DD, STP&E mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Protection"
                                    },
                                    "Description": {
                                        "val": "The project provides system security engineering policy, guidance and objective assessments to reduce risks in sharing and storing Controlled Technical Information, improve mitigation of supply chain risk management risks, improve integration of cybersecurity into the engineering processes, integrate defense exportability and anti-tamper practices, mature processes to identify Critical Program Information and improve program protection planning.  Activities carried out support implementation of DoD Instruction 5200.44 Trusted Systems and Networks with the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes; implementation of DoD Instruction 5200.39  Critical Program Information (CPI) Identification and Protection Within Research, Development, Test, and Evaluation (RDT&E) to identify and protect Critical Program Information; and implementation of DoD Instruction 8582.01 Security of Unclassified DoD Information on Non-DoD Information Systems for Safeguarding Controlled Unclassified Information on contractor owned networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.807"
                                            },
                                            "Text": {
                                                "val": "• Provide support to Acquisition Category (ACAT) I programs to conduct broad program protection planning.\n   - Conduct criticality analyses to determine system vulnerabilities.\n   - Develop Program Protection Plans, and track progress to verify protection of critical program capabilities.\n   - Review ACAT I Program Protection Plans and provide recommendations for their approval to USD(AT&L). \n \n• Advance the state of the practice of systems security engineering.\n   - Continue development of methodology to identify and mitigate system security, to include cybersecurity risk.\n   - Continue to develop courseware, refine guidance, mentor Service teams, provide training, and outreach with government and industry.\n\n• Hardware and Software Assurance (HwA and SwA)\n   - Conduct hardware and software technical working groups, assurance oversight steering council and support group.\n   - Approve HwA and SwA concept of operations for collaboration activities and program support.\n   - Approve strategic plan: establish requirements and schedule for Initial Operating Capabilities (IOC) of HwA and SwA efforts.\n   - Conduct comprehensive survey across HwA and SwA activities to: document capability and capacity, identify gaps, propose gap mediation investments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.870"
                                            },
                                            "Text": {
                                                "val": "• Provide support to Independent Cyber Vulnerability Review Assessment teams in conduct of broad program protection planning activities to assess:\n   - Conduct of criticality analyses to determine capability, systems and technology vulnerabilities.\n   - Conduct Program Protection planning activities, and track progress to verify protection of critical program capabilities and technologies.\n• Advance the state of the practice of systems security engineering:\n   - Continue development of methodology to identify and mitigate system security risk, to include cybersecurity risk.\n   - Continue to develop courseware, refine guidance, provide training, and outreach with government and industry.\n   - Refine guidance, tools and mitigation approaches to mitigate capability, system and technology risks.\n• Safeguard Controlled Technical Information and technology:\n   -  Refine implementation and guidance of marking and dissemination of distribution of technical information\n   -  Develop and refine safeguarding information protection methods for contractor unclassified information networks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2019 and FY 2020.  Small changes reflect minor budget fluctuations. In FY 2020, this funding is re-aligned to the Maintaining Technology Advantage PE 0605797D8Z."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The program protection project supports activities focused on:  (1) improve system security engineering to reduce risks in sharing and storing controlled unclassified information, to include controlled technical information, (2) improve mitigation to supply chain risks, (3) support cyber vulnerability review assessments, to include review of Program Protection Plans, (4) effective system security engineering policy and guidance, and (6) mature processes to identify and protect critical program information, controlled technical information, critical components and mission functions.  \n\nImpact of the program protection initiative is assessed based upon number of supported formal independent technical review assessments, , critical programs and technology capabilities cyber vulnerability assessments  , and through engagement supporting acquisition, counterintelligence, intelligence and cybersecurity policy initiatives related to program protection."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "842"
                    },
                    "ProjectTitle": {
                        "val": "Mission Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.000"
                        },
                        "BudgetYearThree": {
                            "val": "2.000"
                        },
                        "BudgetYearFour": {
                            "val": "2.000"
                        },
                        "BudgetYearFive": {
                            "val": "2.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) establishes a dedicated funding line to support activities to carry out responsibilities described in FY 2017 National Defense Authorization Act (NDAA) Section 855 titled Mission Integration Management (MIM)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Engineering"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "• Coordinate with Joint Service and commanders of the combatant commands to identify major threats, mission scope, Concept of Operations (CONOPS) development, and Operation Plans (OPLAN). \n• Initiate translation of multi-Service and Coalition mission-based needs for the requirements process, resulting in Capability Requirements.  \n• Develop strategy to use relevant Cross-Service mission threads in coordination with Joint Staff to identify capability gaps. \n• Determine where multi-Service and Coalition mission areas would benefit from mission engineering and a coordinated implementation approach to set an operational context."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continue to: \n• Coordinate with Joint Service and commanders of the combatant commands to identify major threats, mission scope, Concept of Operations (CONOPS) development, and Operation Plans (OPLAN). \n• Initiate translation of multi-Service and Coalition mission-based needs for the requirements process, resulting in Capability Requirements.  \n• Develop strategy to use relevant Cross-Service mission threads in coordination with Joint Staff to identify capability gaps. \n• Determine where multi-Service and Coalition mission areas would benefit from mission engineering and a coordinated implementation approach to set an operational context.\n\nAdditional activities:\n• Prioritize and\/or provide resources for initial Joint mission analysis.\n• Begin mission characterization activities for selected Joint missions. \n   - Develop mission based inputs and options for concepts, requirements, prototypes, resources, mission design, & operationally relevant test environment. Includes identification of data needs to assess capability performance (i.e., gain an understanding of objectives, key users, user roles & expectations, and constituent system capabilities).\n   - Review available performance and test data for the selected Joint mission area(s)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Not applicable."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}