{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-12",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603125A"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism - Technology Development"
        },
        "R1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "44.088"
            },
            "CurrentYear": {
                "val": "36.757"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "80.845"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2020, this PE is being eliminated, with continuity of effort realigned to the following PEs:\n* 0602145A (Next Generation Combat Vehicle Technology)"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps. Efforts include hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the United States (U.S.) Department of Energy (DOE) to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; and field demonstrations to stress and assess emerging technologies earlier in the systems development life cycle, thus reducing potential vulnerabilities and providing an improved understanding of employment risks against potential threats.\n\nWork in this Project is complementary to and is fully coordinated with PE 0602618A (Ballistics Technology) \/ Project H80 (Ballistics Technology\/Survivability and Lethality Technology), PE 0602601A (Combat Vehicle and Automotive Technology), and PE 0603005A (Combat Vehicle and Automotive Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work is performed by the U.S. Army Futures Command."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "26.903"
                },
                "CurrentYear": {
                    "val": "3.762"
                },
                "BudgetYearOne": {
                    "val": "2.741"
                },
                "BudgetYearOneBase": {
                    "val": "2.741"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "44.088"
                },
                "CurrentYear": {
                    "val": "36.757"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "17.185"
                },
                "CurrentYear": {
                    "val": "32.995"
                },
                "BudgetYearOne": {
                    "val": "-2.741"
                },
                "BudgetYearOneBase": {
                    "val": "-2.741"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.022"
                    },
                    "CurrentYear": {
                        "val": "-0.005"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "17"
                    },
                    "CurrentYear": {
                        "val": "33"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.26"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.053"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.741"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.741"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 congressional adds for Lightweight Low Power Radar Systems ($6.000 million), Long Endurance UAV Research ($8.000 million), and Open Source ISR Research ($3.000 million).\nFY19 congressional adds for artificial intelligence enabled sensor networks ($8.000 million), enhanced propulsion systems for UAS ($6.000 million), lightweight low power radar systems ($8.000 million), long endurance UAV research ($8.000 million), and open source ISR research ($3.000 million).\nFY20 adjustments realign program funds to PE 0602145A (Next Generation Combat Vehicle Technology)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DF5"
                    },
                    "ProjectTitle": {
                        "val": "Agile Integration & Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.088"
                        },
                        "CurrentYear": {
                            "val": "3.757"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "30.845"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020 this Project is being realigned to:\nPE 0602145A (Next Generation Combat Vehicle Technology), Projects: \n* BH5 (Platform Electrification and Mobility Tech) \n* BI4 (Materials Application and Integration Technology)"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps. Efforts include hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the United States Department of Energy (DOE) to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; and field demonstrations to stress and assess emerging technologies earlier in the systems development life cycle, thus reducing potential vulnerabilities and providing an improved understanding of employment risks against potential threats.\n\nWork in this Project is complementary to and is fully coordinated with PE 0602618A (Ballistics Technology) \/ Project H80 (Ballistics Technology\/Survivability and Lethality Technology), PE 0602601A (Combat Vehicle and Automotive Technology), and PE 0603005A (Combat Vehicle and Automotive Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. FY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThis work is performed by the U.S. Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Platform Subsystem Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort contributes to the Army's ground platform risk reduction efforts which seek to address technical and integration challenges in the areas of mobility, survivability, vehicle architecture, and systems integration. Specifically, this effort focuses on maturing and demonstrating integrated vehicle power management, generation and distribution technologies to increase ground vehicle energy efficiencies and ensure ground platforms have enough power to enable future capabilities such as electromagnetic armor, active protection systems, improvised explosive device detect and defeat technologies, advanced situational awareness and future network integration technologies. This effort is coordinated with PE 0603005A (Combat Vehicle and Automotive Advanced Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.006"
                                            },
                                            "Text": {
                                                "val": "Matured the Vehicle Electronics Architecture  (VEA) Mobile Demonstrator (VMD) technology by optimizing subsystem performance during hardware integration onto vehicle platform, and began demonstrations of VMD capabilities to validate system performance against future power and data requirements. Matured and validated powertrain controls architecture and algorithm to improve powertrain efficiencies and minimize parasitic losses through component modeling and simulation. Matured and validated integrated starter generator, advanced thermal management system, and advanced modular lithium ion battery technologies to improve subsystem fuel efficiency and increase electrical power generation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.073"
                                            },
                                            "Text": {
                                                "val": "Complete optimization of VEA Mobile Demonstrator (VMD) performance during hardware integration onto vehicle platform, and validate system performance against future power and data requirements. Complete validation of powertrain controls architecture and algorithms, improving powertrain efficiencies and minimizing parasitic losses. Complete validation of integrated starter generator, advanced thermal management system, and advanced modular lithium ion battery technologies to improve subsystem fuel efficiency and increase electrical power generation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort ends in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced technologies that enable military ground vehicles to become significantly more energy efficient. It collaborates with the DOE to demonstrate technologies in: advanced combustion engines and transmissions; lightweight structures and materials; energy recovery and thermal management; alternative fuels and lubricants; hybrid propulsion systems; batteries and energy storage; and analytical tools (e.g., modeling and simulation). This effort is coordinated with PE 0602601A (Combat Vehicle and Automotive Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.413"
                                            },
                                            "Text": {
                                                "val": "Continued to support the AVPTA with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Continued to provide the capability to model and simulate advanced chemistry batteries and batteries in extreme temperature conditions to improve characterizing battery life cycle estimations. Improved tire modeling and simulation capabilities based on dynamic property data from advanced tire testing. Improved corrosion prevention capabilities through results from investigation of corrosion mechanisms and effects on dissimilar material joints which identified materials and processes to inhibit corrosion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.563"
                                            },
                                            "Text": {
                                                "val": "Continue to support the AVPTA with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Develop methodology and software for optimal sizing of fuel cells and battery packs for military vehicles. Develop advanced electrolytes to increase Lithium Metal Battery energy density, performance and life. Develop and test Thermal Barrier Coatings to reduce heat loss\/improve fuel economy of combustion engines. Develop and evaluate next-generation, light-weight materials, manufacturing and related processes. Support the AVPTA project portfolio via \"Extended Enterprise\" efforts such as Improving the Fuel Efficiency of the Current Ground Tactical Fleet; JP-8 Fuel Cell Power; and other activities that will enhance Operational Energy efficiency and reduce energy consumption."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY 2020, this sub-effort realigns to PE 0602145A (NGCV Technology) \/ Project BH5 (Platform Electrification and Mobility Tech) and PE 0602145A (NGCV Technology) \/ Project BI4 (Materials Application and Integration Technology) as part of the financial restructure to continue the AVPTA partnership with the DOE."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming Field Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort conducts field demonstrations to stress emerging technologies in realistic environments and scenarios, using warfighters and adaptive adversaries. Field demonstration activities seek to place emerging technologies in the hands of Warfighters early in the development cycle to leverage their feedback and to uncover potential vulnerabilities in future systems, allowing identification of design fixes and improvements while mitigations are less expensive. Red Teaming Field Demonstration activities are coordinated with PE 0602618A (Ballistics Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.45"
                                            },
                                            "Text": {
                                                "val": "Conducted a series of live field demonstrations where warfighters utilize technologies and systems in operationally relevant scenarios to address a set of priority, threat informed challenges and areas of overmatch concern. Technical areas of interest include interoperability, internet of things, autonomous systems, and electronic warfare. Demonstrations are structured to stress the technologies\/systems and uncover vulnerabilities through their employment in complex mission scenarios with friendly and opposing forces, including emulated threat probes for electronic warfare vulnerabilities. Provided feedback to developers through structured assessments to facilitate reduction or mitigation of vulnerabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming Systems Intensive Analysis"
                                    },
                                    "Description": {
                                        "val": "This effort conducts in-depth analysis (from concepts to employment to interoperability) of selected high priority emerging technology sub-systems and systems with planned transitions to future programs of record. The intent is assess technologies using virtual and laboratory experiments across a broad range of potential threat vectors, environments, and use cases to identify and mitigate any identified vulnerabilities as early as possible..  These venues allow for detailed analysis in areas that would be too dangerous or too expensive to assess during a live, field demonstration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.394"
                                            },
                                            "Text": {
                                                "val": "Conducted intensive analysis for key emerging systems and concepts identified from intelligence, requirements, acquisition, and science and technology community stakeholder strategy events; and continued to the next phase of ongoing intensive analysis for select key emerging systems and\/or concepts to uncover vulnerabilities and potential risks pertaining to systems integration, interoperability, adaptability, user technology acceptance, and performance in contested environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming Vulnerability Exercises"
                                    },
                                    "Description": {
                                        "val": "This effort conducts tabletop exercises for in-depth assessments of emerging threats and technologies to anticipate future challenges in contested and congested environments, inform threat concepts, adapt system development practices, and maintain overmatch capability.  Outputs of these exercises influence technologies and scenarios chosen for Systems Analysis and Field Demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.866"
                                            },
                                            "Text": {
                                                "val": "Designed and conducted a series of virtual scenario based exercises, rooted in stakeholder input on emerging threats and areas of overmatch concern, with participants from government, academia, and industry who represent red (threat), blue (US forces), and green (influence base, neutrals) perspectives in order to expose assumptions, characterize needed capabilities, and identify current and future critical vulnerabilities. Exercises covered broader time and space conditions than are possible in live field experiments. Implemented team challenge experiments to identify potential vulnerabilities and risks for developing concepts or systems; and, based on previous year evaluations, modified analysis methodologies, structured assessments, and frameworks to improve data captured for analysis and feedback, with the goal of providing insight and data to enable risk mitigation, informing current or future acquisition programs early in the development lifecycle. Technical areas of interest included force protection, interoperability, internet of things, autonomous systems, and electronic warfare."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Teaming Technology Assessment"
                                    },
                                    "Description": {
                                        "val": "This effort provides an assessment of technology components and enablers required to establish a manned-unmanned teaming capability for enhanced combat power in complex and contested environments. The assessment will consider Soldiers, unmanned ground vehicles, unmanned air vehicles, command and control, communications, and lethality technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.959"
                                            },
                                            "Text": {
                                                "val": "Identified components, technologies and enablers required to establish a manned unmanned teaming capability to provide enhanced combat power in complex and contested environments. Determined component priority by assessing unmanned capabilities in support of realistic mission scenarios. Primary components of the assessment include: Soldiers, unmanned ground vehicles, unmanned air vehicles, command and control, communications and lethality."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.121"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW4"
                    },
                    "ProjectTitle": {
                        "val": "Energy Technologies (Congressional Adds (CAs))"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17"
                        },
                        "CurrentYear": {
                            "val": "33"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "50.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for technology development and demonstration."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Increase."
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "17"
                                        },
                                        "Text": {
                                            "val": "Congressional Increase."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atificial Intelligence Enabled Sensor Networks"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Atificial Intelligence Enabled Sensor Networks"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Propulsion Systems for UAS"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "6"
                                        },
                                        "Text": {
                                            "val": "Enhanced Propulsion Systems for UAS"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight Low Power Radar System"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Lightweight Low Power Radar System"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Endurance UAV Research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "Long Endurance UAV Research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Source ISR Research"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Open Source ISR Research"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}