{
    "id": "2020-Army-PB-2040-JBOOK-57289821184020429f22b377c8d8ec2b7ea1aa2758df17e0ae58ba36035ae75c-9",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603779A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology - Dem\/Val"
        },
        "R1LineNumber": {
            "val": "82"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "15.039"
            },
            "CurrentYear": {
                "val": "14.731"
            },
            "BudgetYearOne": {
                "val": "15.132"
            },
            "BudgetYearOneBase": {
                "val": "15.132"
            },
            "BudgetYearTwo": {
                "val": "16.263"
            },
            "BudgetYearThree": {
                "val": "15.324"
            },
            "BudgetYearFour": {
                "val": "14.933"
            },
            "BudgetYearFive": {
                "val": "13.944"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "105.366"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "There is broad potential application for environmental quality technology (EQT) to be applied to multiple Army weapon systems and installations. However, technology must be demonstrated and validated (total ownership cost and performance data identified) before potential users will consider exploiting it. This Program Element (PE) includes Projects focused on validating the general military utility or cost reduction potential of technology when applied to different types of infrastructure, military equipment or techniques. It may include validations and proof-of-principle demonstrations in field exercises to evaluate upgrades or provide new operational capabilities. The validation of technologies will be in as realistic an operating environment as possible to assess performance or cost reduction potential. EQT demonstration\/validation is systemic and applicable across Department of Army sites and installation problems (e.g. unexploded ordnance detection and discrimination). This PE supports the Army's top modernization priorities by addressing potential obsolescence of legacy materials and current and emerging impacts on human health and the environment. All work is endorsed by potential users and supported by a state-of-the-art assessment to determine when the technology can transition to the user for implementation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.456"
                },
                "CurrentYear": {
                    "val": "14.749"
                },
                "BudgetYearOne": {
                    "val": "14.979"
                },
                "BudgetYearOneBase": {
                    "val": "14.979"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.039"
                },
                "CurrentYear": {
                    "val": "14.731"
                },
                "BudgetYearOne": {
                    "val": "15.132"
                },
                "BudgetYearOneBase": {
                    "val": "15.132"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.583"
                },
                "CurrentYear": {
                    "val": "-0.018"
                },
                "BudgetYearOne": {
                    "val": "0.153"
                },
                "BudgetYearOneBase": {
                    "val": "0.153"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.008"
                    },
                    "CurrentYear": {
                        "val": "-0.018"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.409"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.153"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.153"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2018 reprogramming increase of $5.000 Million supports Explosive Ordnance Disposal (Project E21)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "035"
                    },
                    "ProjectTitle": {
                        "val": "National Defense Cntr For Enviro Excellence"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.628"
                        },
                        "CurrentYear": {
                            "val": "4.864"
                        },
                        "BudgetYearOne": {
                            "val": "5.121"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.121"
                        },
                        "BudgetYearTwo": {
                            "val": "5.205"
                        },
                        "BudgetYearThree": {
                            "val": "5.327"
                        },
                        "BudgetYearFour": {
                            "val": "6.455"
                        },
                        "BudgetYearFive": {
                            "val": "6.587"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "37.187"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The National Defense Center for Environmental Excellence (NDCEE) was established by Congress in 1990 with a directive to \"serve as a national leadership organization to address high priority environmental problems for the Department of Defense (DoD), other government organizations, and the industrial community.\" The NDCEE Program is a national resource for developing and disseminating advanced environmental technologies. The NDCEE is used to: demonstrate environmentally acceptable technology to industry; validate new technology prior to transferring that technology; and assist in the training of potential users as part of that technology transfer process. The NDCEE is a DoD resource for environmental quality management and technology validation. This Project is managed by the Army on behalf of the Assistant Secretary of Defense for Sustainment.  In May 2008, the Project name was re-designated from the National Defense Center for Environmental Excellence to the National Defense Center for Energy and Environment to ensure that the Center's mission recognizes and addresses the strategic interdependence of energy and environmental technology requirements within an overall sustainability framework in support of our installations, weapons systems and war fighters. This name change also directly supports the DoD's proactive implementation of Executive Order 13423, \"Strengthening Federal Environmental, Energy and Transportation Management.\"\n\nThe United States (U.S.) Army's broadly encompassing and growing mobile, personal and stationary advanced energy technology requirements include infrastructure, alternative and synthetic fuels, surety, renewables, storage, distribution, advanced power, micro-grids, transportation, systems integration and others. Further, to train as we fight, validated energy and environmental technologies need to be available and implemented at Army installations. The NDCEE will continue to demonstrate, validate, and transfer these technologies supporting our integrated environment, safety, occupational health and energy objectives in consideration of mission, readiness, innovation, lethality and modernization."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Conduct demonstration\/validation of environmentally acceptable technologies that enhance military readiness and reduce production, operating, and\/or disposal costs."
                                    },
                                    "Description": {
                                        "val": "Supports the demonstration and validation of mature (BA4) environment, safety, occupational health, and energy technologies that support the Army's Environmental Quality Technology mission. The objective is to invest in innovative technologies that support military mission\/readiness, employ a high degree of technical fidelity, have a high potential for transition success, and align with modernization goals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.588"
                                            },
                                            "Text": {
                                                "val": "Executed eighteen demonstration\/validation efforts across the environment, safety, occupational health, and energy functional areas.  These projects are on target to provide valuable end products (tangible or intellectual) to transition partners, as stated in each project?s transition agreement.  Technologies transitioned this year include:\nEnvironmental Toolkit for Expeditionary Operations (ETEO): The toolkit is an environmental technology enabling mission success in increasingly contaminated operating environments. The ETEO detects hazardous contaminants through a suite of sensors able to rapidly identify chemical and biological contaminants in air, soil and water.  The toolkit will be available to users through the Instrument Set, Reconnaissance and Surveying program of record and the U.S. Army Corps of Engineers Reachback Operations Center. \n\nLive-Round Interrupter (LRI): Over the past two years, NDCEE has supported the demonstration and validation of the effectiveness of the LRI in training scenarios.  The LRI prevents loading live rounds into a weapon during blank-fire training and has the potential to save lives and prevent injuries to Soldiers.  The LRI proved successful in preventing a live round from being chambered and allowed a weapon to cycle more closely to its design when firing blank rounds.  After the successful National Training Center (NTC) demonstration, the LRI was briefed as an emerging best practice during the FORSCOM Commander's Risk Reduction Council Video Teleconference, on 13 February 2018.  FORSCOM senior leaders observed an LRI demonstration at NTC and were very pleased with its functionality.  The ODASA(ESOH) staff will work with the appropriate Army proponents to meet final compatibility and safety requirements and pursue the LRI's formal adoption as a replacement for the current Blank Fire Adapter.\n\nNDCEE successfully transitioned the outcome of project: Replacement Refrigerant for Environmental Control Units (R438A replacement for R22), through our transition partner at Communications-Electronics Command (CECOM), to support the CECOM Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) managed systems.\nSulfur Tolerant Solid Oxide Fuel Cell (SOFC): This technology improves operating capabilities of sulfur tolerant SOFCs to promote increased ground vehicle range, autonomy, and power generation for external devices. This project, which provided development of sulfur tolerant SOFCs, lays the foundation for unmanned and manned aerial vehicles? increased range and additional power for increased electronic capabilities in commercial and military applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.593"
                                            },
                                            "Text": {
                                                "val": "The NDCEE Program Management Office (PMO) is on-boarding eight new projects for the FY 2019 funding cycle, including Autonomous Robotic and Remote Refueling Point for Rotary Wing Aircraft, Green Machining of Multi-Service Weapons by 3D Waterjet, Novel Bioaugmented Sorption Treatment Technology for CVOCs and 1,4 Dioxane, Environmentally Compliant Inorganic Mat?ls for Corrosion & Wear Protection of Structural Metals on Military Aircraft & Weapon Systems, Navy Safety Certification of Lithium-ion 6T batteries for Grounds Vehicle Use and Surface Ship Transport, Energy Efficient Expeditionary Small Unit Water Purifier, Visual Indicator for Hydrogen Fluoride Produced from Extinguishing Fires with Hydrofluorocarbons, and Lightweight Power for Warfighter Expeditionary Non-resupply Missions.  Additional funds are being distributed to continue nine projects that were initiated in FY 2017 - 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.021"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.021"
                                            },
                                            "Text": {
                                                "val": "Will conduct demonstration\/validation of environment, safety, occupational health, and energy technologies that support military mission\/readiness, employ a high degree of technical fidelity, have a high potential for transition success, and align with modernization goals. Will conduct project selection process for potential FY 2021 new starts. Technologies will be selected by the NDCEE project selection committee and approved by the NDCEE Lead Agent."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funding to support project selection process for potential FY 2021 new starts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NDCEE Government program management during contract negotiations and during project formulation, execution, and technology transfer."
                                    },
                                    "Description": {
                                        "val": "Funds the NDCEE Government program management during comprehensive NDCEE lifecycle, including project cultivation and identification, screening, selection, execution, and technology transition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.04"
                                            },
                                            "Text": {
                                                "val": "Provided comprehensive day-to-day management of the NDCEE, including project cultivation, identification, screening, financial oversight, funding distribution, and execution reporting.  Funded the Army Contracting Command at Aberdeen Proving Ground to support NDCEE contract closeouts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Provide comprehensive day-to-day management of the NDCEE, including project cultivation, identification, screening, financial oversight, funding distribution, and execution reporting.  Funding the Army Contracting Command at Aberdeen Proving Ground to support NDCEE contract closeouts.  PMO staff is traveling to project demonstration sites, as appropriate."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Will fund the NDCEE program management during comprehensive NDCEE lifecycle, including project cultivation and identification, screening, selection, execution, reporting, and technology transfer.  Includes contracting office support for contract closeouts, travel to conduct program management oversight, and program coordination and education to DoD stakeholders."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.171"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The NDCEE is a national asset focused on DoD applications that include technology transfer to appropriate DoD transition partners. The management strategy for the NDCEE ensures that all projects have a potential multi-service benefit and have a high potential for transition success. At the strategic level, the NDCEE Executive Advisory Board (EAB) is chaired by the DoD NDCEE Lead Agent on behalf of the Assistant Secretary of Defense for Sustainment and is representative of the services and DoD. The EAB and the Program Director are supported by the NDCEE Technical Advisory Group (TAG) to help ensure that NDCEE investments are maximized across DoD and the Services. At the tactical level, the three Focus Groups (environment, safety\/occupational health, and energy) cultivate and recommend priority projects to the TAG and Project Selection Committee for funding. Transition Partners ensure that NDCEE's investments are carried forward in the next phases of the Research Development Test and Evaluation process, as identified in each funded project's Technology Transition Agreement.\n\nNDCEE projects enable readiness for the Services under increasingly complex and demanding scenarios. The interdependency of national security with energy supply and costs, water supply and costs, environmental resiliency, and human health and safety are clear and NDCEE projects provide forward-looking solutions to these challenges. Failure to further fund and validate promising technologies that are at the mature or Commercial-off-the-Shelf stage, would result in lost modernization opportunities and validation before they go into a military environment. These initiatives need to be carried forward into an operational\/realistic testing environment so that they can support mission readiness and training when ultimately fielded to the Services."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "24.876"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FY2019 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.171"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.171"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development Testing and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "32.036"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.588"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.593"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.021"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.021"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_035.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NDCEE Management and Operations (Enduring)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NDCEE Env, Safety, Occ Health, and Energy Technology Dem\/Val (Enduring)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "E21"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Quality Technology Dem\/Val"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.411"
                        },
                        "CurrentYear": {
                            "val": "9.867"
                        },
                        "BudgetYearOne": {
                            "val": "10.011"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.011"
                        },
                        "BudgetYearTwo": {
                            "val": "11.058"
                        },
                        "BudgetYearThree": {
                            "val": "9.997"
                        },
                        "BudgetYearFour": {
                            "val": "8.478"
                        },
                        "BudgetYearFive": {
                            "val": "7.357"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "68.179"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports Advanced Component Development and Prototypes of innovative environmental quality technologies that modernize materials and processes required for current and future operational sustainment and warfighter training capabilities.  The Project showcases technologies that increase life safety, reduce Soldier and worker human health risks, enhance readiness and enable mission capabilities of the current and future force with a focus on eliminating the high priority issues associated with hexavalent chromium, cadmium and airborne lead through material substitution. The Project expedites technology transition from the laboratory to operational use by demonstrating modern materials and processes to fulfill or surpass the performance requirements outlined in Material Specifications, Depot Maintenance Work Requirements, Technical Manuals, Drawings and other technical data. Forward-looking materials and processes demonstrated under this project support the Cross Functional Teams and the Army's top modernization priorities by addressing potential obsolescence of legacy materials and current and emerging impacts on human health and the environment.  Modernized materials and processes have the additional benefit of reducing future regulatory compliance and cleanup requirements while simultaneously increasing performance and standardization across the Army, resulting in significantly reduced life cycle costs incurred by acquisition, industrial base and installation end users."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Toxic Metal Reduction in Surface Finishing of Army Weapon Systems (RDECOM)"
                                    },
                                    "Description": {
                                        "val": "Increase operational readiness and reduce Soldier and worker human health risks by reducing or eliminating the use of cancer-causing hexavalent chromium, cadmium and associated toxic materials used in surface finishing processes for the current and future force.  These surface coating technologies will be used to provide superior corrosion and wear protection for components used on Future Vertical Lift and Next Generation Combat Vehicles and enable increased performance\/extended barrel life for Long Range Precision Fire systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.391"
                                            },
                                            "Text": {
                                                "val": "Established hexavalent chromium-free pilot processes for depositing and repairing hard chrome surfaces; validated alternative products for sealing black oxide, hard anodize and zinc plated surfaces at Army depots."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.954"
                                            },
                                            "Text": {
                                                "val": "Demonstrate hexavalent chromium-free anodizing process on aluminum aircraft parts; establish test bed for cold spray repair of hard chrome-plated wear surfaces during depot maintenance; qualify hexavalent chromium-free alternatives for sealing heavy zinc phosphate surfaces on steel weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.102"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate zinc-nickel alternatives to cadmium for use on fasteners, electrical connectors and in brush plating; will qualify portable cold spray system and trivalent chromium electroplating as hard chrome alternatives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Airborne Lead Reduction from Army Weapon Systems (RDECOM)"
                                    },
                                    "Description": {
                                        "val": "Sustain Soldier training readiness, maintain\/restore training capability at ranges closed due to dangerous levels of lead exposure and increase life safety and protection of human health on Army installations by reducing or eliminating the use of toxic lead compounds ? which are known to cause damage to central nervous, cardiovascular and immune systems with long-term effects for children, as well as potential developmental impacts, including IQ loss, behavioral issues and hearing loss - in rocket and missile propellants and primary explosives (primers\/detonators\/initiators) for the current and future force.  These lead-free formulations will provide a domestic, readily available source for primary explosives used in all Long Range Precision Fires and Soldier Lethality systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.273"
                                            },
                                            "Text": {
                                                "val": "Loaded lead-free primers into relevant end items using new pilot-scale automated process and conducted initial performance testing; Conducted flight-weight motor testing for rocket systems utilizing reduced-lead extruded rocket propellants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.837"
                                            },
                                            "Text": {
                                                "val": "Demonstrate lead-free primary explosive composition in stab detonator and electric detonator configurations; establish pilot-scale production of lead-free percussion primers and conduct first article testing in hand held signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.727"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.727"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate lead-free primer in small\/medium caliber ammunition; will complete flight weight demonstration of reduced-lead double-base propellants for Hydra rockets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Low Global Warming Potential (LGWP) Alternatives to Ozone Depleting Substances (ODS) (RDECOM)"
                                    },
                                    "Description": {
                                        "val": "Evaluate low GWP ODS alternatives being developed by industry to assess their toxicity and flammability hazards and verify their acceptability in military unique refrigeration and fire suppression applications, including Future Vertical Lift and Next Generation Combat Vehicle."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.25"
                                            },
                                            "Text": {
                                                "val": "Demonstrate new test method suitable for classifying the flammability of refrigerants facing realistic current and future force threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.222"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.222"
                                            },
                                            "Text": {
                                                "val": "Will validate and promulgate the demonstrated refrigerant flammability test method."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: ESOH Impacts of Short-Term Noise Assessment Procedures"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and validate the technologies, including the underlying computational algorithms, for the impact of short-term noise assessment procedures on environmental footprint and Soldier readiness. When completed the program will: 1) have validated short-term noise assessment procedures, including uncertainty metrics and 2) have on-line, self-guided training modules for Sustainable Range Program range officers on performing and interpreting short-term noise assessment results."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.625"
                                            },
                                            "Text": {
                                                "val": "Completed analysis of all data sets including any updates indicated by the demonstration \/ validation results. Tested model updates to ensure continued accuracy and document the updates  \/ validation results. Initiated developments of training modules for range managers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.25"
                                            },
                                            "Text": {
                                                "val": "Provide a report that summarizes all results of the demonstration and validation study. Validation report will document assessment accuracy across a range of environmental conditions and assessment consistency across user applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort ends in FY 2019"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Advanced Water Reuse Technology for Fixed Installations"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and validate advanced water reuse technology for fixed installations and assess ESOH impacts. At the completion of this program, the following will be accomplished: 1) demonstration of energy efficient advanced water reuse technology at installations, 2) ESOH analysis of three water reuse technologies for installations including shower water recycling, distributed water reclamation, and centralized reclamation; 3) reports on best practices for permitting, design, and safe operation of advanced reuse technologies; and 4) marketing materials comparing quality of advanced reuse water to tap and bottled water to support technology adoption campaigns at installations and contingency bases."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.572"
                                            },
                                            "Text": {
                                                "val": "Executed demonstration testing at Tobyhanna Weapons Depot, Fort Riley and Fort Carson. Demonstrations included measurements of technology performance with a focus on removal of emerging micro-pollutants to guide ESOH analysis in coordination with Army Public Health Center (APHC)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Insensitive Munitions (IM) Wastewater Treatment"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and validate optimized scalable wastewater treatment system basic technology for the destructive treatment of existing and emerging insensitive munitions (IM) contaminated production wastewater generated during Army ammunition plant munitions production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.575"
                                            },
                                            "Text": {
                                                "val": "Demonstrated new IMX production process wastewater remediation technology to allow efficient, low cost destruction of harmful and regulated contaminates for increased surface water discharge. Technology will allow increased production rates of munitions compounds while meeting permit regulatory thresholds for wastewater discharge."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.685"
                                            },
                                            "Text": {
                                                "val": "Transition IM wastewater treatment technologies from a prototype pilot scale system to an initial field-scale pilot system for demonstration and validation of cost effective treatment of IM wastewater."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.635"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.635"
                                            },
                                            "Text": {
                                                "val": "Will continue operation of Fenton oxidation pilot demonstration system at MCAAP with ramp up to 500 gpd total capacity. Will adjust operations and perform manufacturing trials to optimize treatment. Will document cost savings for Fenton oxidation of IM wastewaters. Will install pilot demonstration unit for continuous precipitation and membrane concentration of IM wastewaters at MCAAP."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Fate and Risk Evaluation System for Contaminants (FRESCO?)"
                                    },
                                    "Description": {
                                        "val": "FRESCO? will ensure Solider readiness through reduction in training range down time. Validation of FRESCO? will provide the capability to model and forecast contaminant fate and health risks associated with new military materials in the environment, pursuant to unfilled technology gap identified in DoD Instruction Number 4715.18."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.254"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate software for environmental fate and transport data with user community for evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "1) Will finalize integration of upgraded existing components, perform testing and debugging ? existing component integration and testing will be finalized in FY20.\n2) Will add new capabilities to FRESCO?, perform testing and debugging ? since the development of ARAMS? and TREECS?, new fate and transport models and databases have been developed. Soils Model, Vadose Zone Model, and Channel Model will be upgraded to give greater support in evaluating the fate and transport of EC. \n3) Will validate FRESCO? System using existing army data ? the project team will work with our Technology Transition Agreement (TTA) partners to select an applicable demonstration site that will allow us to demonstration and validate the full system features."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Environmental Toolkit for Expeditionary Operations"
                                    },
                                    "Description": {
                                        "val": "Conduct pilot-scale demonstration and validation studies to determine the effectiveness of basic technologies\/ methods developed for rapidly collecting environmental data in the field for the purposes of reducing impact of environmental requirements on installations.  Demonstrate the ability of ETEO software to communicate easily with new, commercially available sensors through simple device driver (with minimal or no development).  Assess available chemical databases on the new sensor for their ability to detect and quantify environmental contaminants.  Demonstrate the operational ETEO software and sensors at designated locations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.275"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate software and sensors package for environmental baseline evaluation capabilities with engineer soldiers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.825"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.825"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate software and sensors package for environmental baseline evaluation capabilities with engineer soldiers. Perform demonstration of ETEO at an ARMY installation with Directorate of Public Works; Directorate of Plans, Training, Mobilization, and Security; and Directorate of Emergency Services on developed platform and prepare a technical\/functional assessment report. During this phase, a two-day field demonstration will be conducted. The demonstration will be conducted to test the installation?s ability to detect the presence of environmental contaminants in soils with the sensor suite to transfer that data into an EBS using ETEO software and to quickly understand the resulting information and its implication to operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Ordnance Disposal  (ERDC)"
                                    },
                                    "Description": {
                                        "val": "Evaluate innovative technology that would reduce the environmental impact associated with the remediation of munitions by eliminating the explosive hazard while leaving munitions? bodies in place. Effort partners ERDC with industry to demonstrate and validate the use of cut and capture technologies, supporting the recommended leave-in-place scenario."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.975"
                                            },
                                            "Text": {
                                                "val": "Evaluated Vendor BAA proposals and awarded Vendor contract; Demonstrated the use of cut and capture technologies for environmentally safe removal of munition explosive compounds in situ supporting the recommended leave-in-place scenario.   Developed and validated underwater remotely operated sampling devices and procedures.  Completed draft ERDC Scientific Operating Procedure Series document, titled, ?Sampling Munitions Constituents Underwater with Focus on Monitoring during Remedial Actions.?"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.362"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "06I"
                                    },
                                    "Title": {
                                        "val": "Environmental Quality Technology Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.682"
                                        },
                                        "CurrentYear": {
                                            "val": "0.921"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.562"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.562"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.605"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.614"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.651"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.426"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "4.461"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The project ultimately transitions successfully demonstrated environmental quality technologies to Army acquisition, industrial base and installation end users.  As part of the Army's Environmental Quality Technology Program, all technology efforts address a valid Army Environmental Requirements and Technology Assessments (AERTA) requirement.  The Army's Environmental Technology Integrated Product Team conducts a thorough assessment and makes funding recommendations to senior Army environmental leadership.  Efforts approved by senior Army environmental leadership receive Advanced Component Development and Prototype funding to fully demonstrate and validate the technology for transition to end users for follow on implementation."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FY2019 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.362"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.362"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Conduct Demonstrations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Varies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Varies"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.881"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.411"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.505"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.011"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.011"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_E21.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Toxic Metals Reduction Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Airborne Lead Reduction Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ESOH Impacts of Short-Term Noise Assessment Procedures Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Advanced Water Reuse Technology for Fixed Installations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Insensitive Munitions (IM) Wastewater Treatment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fate and Risk Evaluation System for Contaminants"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Environmental Toolkit for Expeditionary Operations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Low Global Warming Potential  Dem\/Val"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Securing the Availability of Green, Enhanced Coatings Dem\/Val"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}