{
    "id": "2020-DefenseLogisticsAgency-PB-0400-MJBOOK-0-0-1e647c413b24a5b4dff4ee0bb8975b28385192e916b243fc26cbddd6cc15d9dc-1",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DLA-U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Logistics_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603712S"
        },
        "ProgramElementTitle": {
            "val": "Logistics Research and Development Technology (Log R&D)"
        },
        "R1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "29.634"
            },
            "PriorYear": {
                "val": "16.105"
            },
            "CurrentYear": {
                "val": "18.127"
            },
            "BudgetYearOne": {
                "val": "10.817"
            },
            "BudgetYearOneBase": {
                "val": "10.817"
            },
            "BudgetYearTwo": {
                "val": "10.998"
            },
            "BudgetYearThree": {
                "val": "11.180"
            },
            "BudgetYearFour": {
                "val": "11.328"
            },
            "BudgetYearFive": {
                "val": "11.532"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency (DLA) is responsible for providing to the Military Services, and other Federal Agencies, as well as combined and allied forces the full spectrum of logistics, acquisition and technical services. DLA sources and provides virtually 100 percent of the consumable items the military services need to operate – including food, uniforms, fuel and energy, medical supplies, construction and barrier materials and equipment, and more than 85 percent of the military’s spare parts.  DLA also provides logistics services including logistics information data, manages the reutilization of military equipment, and documents automation and production services. DLAs Logistics Research and Development (Log R&D) program helps ensure that advanced logistics concepts and business processes are used to accomplish the agency’s mission with the leanest possible infrastructure.  Log R&D identifies the best commercial business practices and tailors them, as necessary, into the most effective business processes for the agency.  Log R&D develops and demonstrates high risk, high payoff technology that provides a significantly higher level of support at the lowest possible costs. \n\nThe DLA Log R&D program is organized into three Strategic Focus Areas (SFAs):\n• Enhancing Analysis, Modeling, and Decision Support (EAMD): R&D efforts to develop decision support tools, such as modeling, simulation, and other analytics to improve operational strategy decision-making, forecasting, and procurement, which support more effective and efficient responses to emerging market and customer requirements.  \n• Improving Logistics Processes (ILP): R&D efforts to develop and implement advanced technology in logistics processes over and above current baseline systems.\n• Emergent Logistics R&D Requirements (ELR): R&D efforts to support emergent Logistics R&D requirements that arise out of the budget cycle. These out of cycle requirements always occur.  This SFA begins new projects in a timely manner without disrupting ongoing projects by funds reallocation.  This SFA scope includes all DLA supply chains and logistics processes."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.611"
                },
                "CurrentYear": {
                    "val": "11.778"
                },
                "BudgetYearOne": {
                    "val": "12.067"
                },
                "BudgetYearOneBase": {
                    "val": "12.067"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.105"
                },
                "CurrentYear": {
                    "val": "18.127"
                },
                "BudgetYearOne": {
                    "val": "10.817"
                },
                "BudgetYearOneBase": {
                    "val": "10.817"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "5.494"
                },
                "CurrentYear": {
                    "val": "6.349"
                },
                "BudgetYearOne": {
                    "val": "-1.250"
                },
                "BudgetYearOneBase": {
                    "val": "-1.250"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "6.000"
                    },
                    "CurrentYear": {
                        "val": "7.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.506"
                    },
                    "CurrentYear": {
                        "val": "-0.651"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Funds Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.240"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.240"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.010"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.010"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY2018, the Logistics R&D program received a Congressional Add for $4 million for the Energy Readiness Program for Woody Bio Mass conversion to liquid hydrocarbon fuels and $2 million for the Supply Chain Management program for sustainable product demonstrations. In FY2019, the Logistics R&D program received a Congressional Add for $7 million for the Energy Readiness program for liquid hydrocarbon fuels. \n\nThe Small Business Innovation Research and Small Technology Transfer Research tax amounted to $0.506 million and $0.651 million in FY2018 and FY2019 respectively.\n\nRealigned funding from Log R&D to Operation and Maintenance (O&M) to fund mandatory Program Management Offices (PMO) costs and project transition."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EMM"
                    },
                    "ProjectTitle": {
                        "val": "Enhancing Analysis, Modeling, and Decision Support (formerly Analytic & Decision Support)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.561"
                        },
                        "PriorYear": {
                            "val": "1.193"
                        },
                        "CurrentYear": {
                            "val": "3.758"
                        },
                        "BudgetYearOne": {
                            "val": "3.219"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.219"
                        },
                        "BudgetYearTwo": {
                            "val": "3.295"
                        },
                        "BudgetYearThree": {
                            "val": "3.368"
                        },
                        "BudgetYearFour": {
                            "val": "3.430"
                        },
                        "BudgetYearFive": {
                            "val": "3.429"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Strategic Focus Area (SFA) funds developments in advanced analytical tools, modeling, and simulation of logistics and supply chain processes. These tools will improve DLA forecasting and procurement strategy decisions and lead to faster and more flexible responsiveness to emerging market and customer requirements.  This SFA consists of two programs:\n\nThe Medical Logistics Network (MLN) program supports the Medical Directorate’s mission to develop and implement the logistics and medical supply chain business practices that ensure the cost-effective and efficient distribution of medical materiel to the full range of Military Health System operations.  A portion of the MLN budget was realigned to other R&D efforts due to no specific projects identified.  Assessments are currently being conducted for viable R&D projects for the budgeted amounts.\n\nThe R&D Strategic Distribution & Disposition (SDD) Program collaborates with DLA Distribution and Disposition Services to identify capability shortfalls (gaps) that allow the opportunity to address these shortfalls through major applied research efforts and to further improve operational effectiveness and efficiency in support of Warfighter’s requirements. A key objective of the SDD Program is to infuse innovative solutions into distribution and disposition operations that address inadequate legacy capabilities and the challenges of future worldwide distribution, disposition, reutilization, and retrograde requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhancing Analysis, Modeling, and Decision Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.193"
                                            },
                                            "Text": {
                                                "val": "SDD will complete the lead-acid and Lithium-Ion battery technology projects in support DLA Distribution and provide support to the Distribution Modernization Program (DMP) to identify, evaluate, and test disruptive technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.758"
                                            },
                                            "Text": {
                                                "val": "The Medical Logistics Network (MLN) program supports the Medical Directorate’s mission to develop and implement the logistics and medical supply chain business practices that ensure the cost-effective and efficient distribution of medical materiel to the full range of Military Health System operations.  A portion of the MLN budget was realigned to other R&D efforts due to no specific projects identified.  Assessments are currently being conducted for viable R&D projects for the budgeted amounts.\n\nThe Strategic Distribution and Disposition (SDD) program provides applied research, analytical and decision support to DLA Distribution and Disposition Services through advanced analytical tools such as Business Case Analyses (BCAs) that support DLA Distribution and Disposition Services strategic decision making. Additionally, SDD will continue to support the Distribution Modernization Program to identify, evaluate, and test emerging and disruptive technologies that have high potential application to distribution and disposition operations. Furthermore, SDD will engage with Department of Defense (DoD) sponsored Federally Funded Research and Development Centers (FFRDCs) and University-Affiliated Research Center Laboratories (UARCs) to perform applied research in technologies such as blockchain, artificial intelligence, machine learning, Internet of Things (IoT), augmented reality, and autonomous\/robotics systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.219"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.219"
                                            },
                                            "Text": {
                                                "val": "The Medical Logistics Network program continues to support the Medical Directorate’s mission to develop and implement the logistics and medical supply chain business practices that ensure the cost-effective and efficient distribution of medical materiel to the full range of Military Health System operations.  A portion of the MLN budget was realigned to other R&D efforts due to no specific projects identified.  Assessments are currently being conducted for viable R&D projects for the budgeted amounts.\n\nThe Strategic Distribution and Disposition program continues to provide applied research, analytical and decision support to DLA Distribution and Disposition Services and provide support to the Distribution Modernization Program. Additionally, SDD will continue to engage with Industry, Department of Defense (DoD) sponsored Federally Funded Research and Development Centers (FFRDCs) and University-Affiliated Research Center Laboratories (UARCs) leveraging subject-matter expertise in key areas of research such as blockchain, artificial intelligence, machine learning, Internet of Things (IoT), augmented reality, and autonomous\/robotics systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to a FY2020 funding realignment for mandatory program management office (PMO) costs and project transition."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "GLTD"
                    },
                    "ProjectTitle": {
                        "val": "Improving Logistics Processes (formerly Logistics Process)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.403"
                        },
                        "PriorYear": {
                            "val": "9.099"
                        },
                        "CurrentYear": {
                            "val": "3.568"
                        },
                        "BudgetYearOne": {
                            "val": "4.013"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.013"
                        },
                        "BudgetYearTwo": {
                            "val": "4.125"
                        },
                        "BudgetYearThree": {
                            "val": "4.211"
                        },
                        "BudgetYearFour": {
                            "val": "4.277"
                        },
                        "BudgetYearFive": {
                            "val": "4.277"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Improving Logistics Processes (ILP) Strategic Focus Area (SFA) encompasses R&D efforts within the Weapon System Sustainment (WSS) Program to develop and implement advanced technology in the internal DLA logistics processes. To qualify for R&D funding, the R&D effort must develop and apply technology and processes over and above current baseline IT systems and continuous improvements efforts. \n\nAlthough all DLA processes are in scope, the strategic focus area for FY2019 has four thrusts: Procurement, Inventory Management, Planning, and Retail Operations process improvements.\n\nInnovative process changes and new technologies will be researched in these areas to drive improvements to internal costs, reduce award delays, reduce the threat of counterfeit parts, improve demand forecasting, and increase retail operational efficiency.  Researching the use of artificial intelligence\/Machine Learning blockchain technology, demand forecasting, adoption of Commercial Acquisition Innovation and Integration of maintenance and supply data in DLA processes are major research areas that will be pursued in the coming years."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Energy Readiness Program for Liquid Hydrocarbon Fuels"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Developed and improved upon a production process that converts cellulosic (woody) biomass in to synthetic crude oil.  The synthetic crude can be further processed into hydrocarbon fuels suitable for commercial and military use.  In FY18, the project successfully accomplished several pilot-plant level production runs of synthetic oil in the goal of validating commercial-scale production capability of the process.\n\nNote:  The FY2018 $4 million Congressional add is for and was executed by the Emergent Logistics R&D Requirements Strategic Focus Area (SFA) for the Energy Readiness Program."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Logistics Processes (ILP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.099"
                                            },
                                            "Text": {
                                                "val": "In FY2018, WSS will work with procurement to implement their long-term process improvement plans.  Projects will focus on the areas of obtaining Market Intelligence, Industrial Outreach, and Long-Term Contract cost reduction. WSS will work with TQ to develop an Anti-Counterfeiting Roadmap of projects aimed at identifying and eliminating the threat of counterfeit parts entering the supply chain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.568"
                                            },
                                            "Text": {
                                                "val": "The Weapon Systems Sustainment (WSS) program will continue working with Procurement to implement long term process improvement plans to include projects in the areas of administrative and production lead time estimation and procurement of commercially available parts (e-commerce). Another main thrust for FY2019 will be the execution of projects to improve retail operations inventory strategy and to research new processes that leverage DLA’s capabilities in operational and tactical retail operations.  WSS will also leverage condition based maintenance data from the Services to enhance planning for retail operations and depot maintenance logistical support. Initial studies will focus on a single Service.  Artificial intelligence \/ machine learning capability projects will begin in FY2019 and continue for years to come as additional opportunities are identified.  Also, machine-learning techniques will be applied to processes for lead-time estimation, demand forecasting, low demand inventory strategies, and retail operation strategies.  In addition, the use of blockchain technology in Tech Quality (TQ)  processes that monitor vendor risk will be researched as an initial study of using this technology in DLA processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.013"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.013"
                                            },
                                            "Text": {
                                                "val": "The Weapon Systems Sustainment program will continue to explore new use case studies for disruptive technologies.  Additional areas of interest for the application of artificial intelligence \/ machine learning include the ability to identify returned parts and predict fraudulent activity.  WSS will also explore opportunities for blockchain technology based on the findings from the initial study in FY2019.  Potential areas of interest include tying financial transactions to physical movement of inventory and electronic contracts.  In FY2020, projects started in FY2019 will continue.  Artificial intelligence projects, which developed a viable proof of concept in FY2019, will progress to pilot studies for final model design and testing in the process.  Projects to develop methods to use condition-based maintenance in DLA processes will continue.  WSS will work with additional Services to incorporate the data into DLA’s inventory and demand forecasting processes.  In addition, WSS projects will continue to study e-commerce methods and develop recommendations for incorporating internet-based purchases into DLA’s acquisition process."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "04"
                    },
                    "ProjectTitle": {
                        "val": "Emergent Logistics R&D Requirements (formerly Innovative Products & Services for DLA Customers)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.670"
                        },
                        "PriorYear": {
                            "val": "5.813"
                        },
                        "CurrentYear": {
                            "val": "10.801"
                        },
                        "BudgetYearOne": {
                            "val": "3.585"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.585"
                        },
                        "BudgetYearTwo": {
                            "val": "3.578"
                        },
                        "BudgetYearThree": {
                            "val": "3.601"
                        },
                        "BudgetYearFour": {
                            "val": "3.621"
                        },
                        "BudgetYearFive": {
                            "val": "3.826"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Emergent Logistics R&D Strategic Focus Area (SFA) includes R&D efforts to develop new products and services for DLA customers in two programs:\n\nThe Energy Readiness Program (ERP) roadmap helps to achieve the operational energy strategy goals of increasing sources of supply, developing and implementing alternative fuels under the ERP. \n\nThe Supply Chain Management (SCM) program addresses emergent and out of budget cycle requirements and opportunities within DLA’s supply chains. A key objective of the SCM Program is to collaborate with customers (DLA J-Codes and Major Subordinate Commands (MSCs)) to identify  capability shortfalls that can be addressed through major research efforts.  These R&D efforts strive to develop technology mitigation strategies that address current and anticipated problems within DLA’s supply chains."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Energy Readiness Program for Liquid Hydrocarbon Fuels"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.000"
                                        },
                                        "Text": {
                                            "val": "Develop innovative technologies to produce hydrocarbon biofuels from cellulosic (plant\/vegetable) matter. This effort will further develop the upscaling of woody biomass-to-fuel processes."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Supply Chain Management Program for Sustainable Product Demonstrations"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.000"
                                        },
                                        "Text": {
                                            "val": "Began the identification of emerging technologies to meet Department of Defense (DoD) requirements through technical data evaluations.  Demonstrations across up to five DoD installations will be conducted to prove the technologies in an operational environment for application and transition of successful technologies DoD-wide."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Emergent Logistics R&D Requirements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.813"
                                            },
                                            "Text": {
                                                "val": "SCM will continue to address the emerging technology opportunities that occur out of the budget cycle. This allows DLA to get a head start undertaking new technological advances without disrupting ongoing programs. In the past DLA R&D has been able to cut 12 to 24 months off the project starting lead-times. Saving the lead-time allows the agency to begin to realize the benefits of implementing new technology sooner than would otherwise be the case and maintain continuity of funding and activity for baseline programs. The Program will initiate the Advanced Thermoelectric Technology project to improve the current thermoelectric heater technology so it is more fuel-efficient, has an increased heating range, reduced maintenance requirements, and a longer service life. The Advanced Thermoelectric Heater will replace the existing Space Heater Convective standard heaters currently stocked at DLA, and will provide DoD a single, versatile heater that reduces the logistics footprint and satisfies the space heating requirements of expeditionary forces. Additionally, SCM will support DLA Strategic Materials with one or more cost saving opportunities that exist for DLA via recycling and recovery initiatives.\n\nIn FY18, the AM project will be funded under PE 0603680S \/ Manufacturing Technology Program (ManTech) Project 7 - Improving Industrial Base Manufacturing Processes (formerly Material Availability). This realignment will maintain continuity of funding and activity for this program.\n\nERP will continue to focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engage in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.801"
                                            },
                                            "Text": {
                                                "val": "The Energy Readiness Program (ERP) will focus on determining R&D solutions for ongoing issues affecting fuel and fuel additive quality and operational requirements (e.g. thermal stability, storage stability, ignition capability).  The program will assist the military services in the qualification and certification of alternative fuels to meet military specification requirements; this will be parallel to the availability of military resources necessary to complete these efforts. The ERP program will investigate and prototype, as appropriate, drone technologies applied to the energy operations.\n\nThe Supply Chain Management (SCM) program address the emerging capabilities shortfalls that occur in the supply chain through major research opportunities. Initiatives will align strategically and produce benefits such as reduced operating costs, enhanced organizational responsiveness and reliability, network resiliency, and streamlined customer service.  Additionally, SCM will complete the Advanced Thermoelectric Technology project to improve the current thermoelectric heater technology so it is more fuel-efficient, has an increased heating range, reduced maintenance requirements, and a longer service life. SCM will also work with DLA HQ Information Operations J6 on Robotic Process Automation (RPA) efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.585"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.585"
                                            },
                                            "Text": {
                                                "val": "The Energy Readiness Program will continue to focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engage in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers.  ERP will focus on determining R&D solutions for ongoing issues affecting fuel and fuel additive quality and operational requirements (e.g. thermal stability, storage stability, ignition capability). The program will continue to assist the military services in the qualification and certification of alternative fuels to meet military specification requirements; this will be parallel to the availability of military resources necessary to complete these efforts.\n\nThe Supply Chain Management program will continue to address the emerging capabilities shortfalls  that occur in the supply chain through major research opportunities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to a FY2020 funding realignment for mandatory program management office (PMO) costs and project transition."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The DLA R&D program is executed through Delivery Orders placed on Indefinite Delivery\/Indefinite Quantity Contracts that resulted from competitive Broad Agency Announcements and through interagency agreements with the Military Services when it is cost effective and\/or provides some technical advantage, e.g. improves the probability of successful transition. DLA also has a continuously open Broad Agency Announcement for Emerging Technologies."
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                }
            ]
        }
    }
}