{
    "id": "2020-Navy-PB-1319-MJBOOK-0-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-12",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602750N"
        },
        "ProgramElementTitle": {
            "val": "(U)Future Naval Capabilities Applied Research"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "147.219"
            },
            "CurrentYear": {
                "val": "137.701"
            },
            "BudgetYearOne": {
                "val": "154.755"
            },
            "BudgetYearOneBase": {
                "val": "154.755"
            },
            "BudgetYearTwo": {
                "val": "167.590"
            },
            "BudgetYearThree": {
                "val": "180.900"
            },
            "BudgetYearFour": {
                "val": "184.622"
            },
            "BudgetYearFive": {
                "val": "188.333"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) address the Applied Research associated with the Future Naval Capabilities (FNC) Program.  The objective of the work in this PE is to develop and mature technologies needed by the Navy and Marine Corps to initiate FNCs in PE 0603673N Future Naval Capabilities Advanced Technology Development that can be commenced at higher Technology Readiness Levels (TRLs).  The FNC Program was restructured for FY 2019 to accelerate transition to the Fleet and Force.  This restructuring involved a zero based review of all ongoing FNC projects where each effort was assessed for its technology maturity and transition commitment.  Ongoing efforts were categorized as FNCs or Technology Candidates.  Some efforts were terminated and others were accelerated to achieve the goals of the restructured program.  Funding for FNCs, which have higher Technology Readiness Levels (TRLs of 4\/5 to 6) and transition funding commitments, is being resourced in PE 0603673N Future Naval Capabilities Advanced Technology Development.  Funding for technology candidates at lower TRLs (3 to 4) is being resourced in this PE.  The Office of Naval Research (ONR) is working closely across the Department of the Navy (DON) and Naval Research Enterprise (NRE) to develop high priority technological capabilities needed by the operational forces.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "156.805"
                },
                "CurrentYear": {
                    "val": "147.771"
                },
                "BudgetYearOne": {
                    "val": "155.625"
                },
                "BudgetYearOneBase": {
                    "val": "155.625"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "147.219"
                },
                "CurrentYear": {
                    "val": "137.701"
                },
                "BudgetYearOne": {
                    "val": "154.755"
                },
                "BudgetYearOneBase": {
                    "val": "154.755"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-9.586"
                },
                "CurrentYear": {
                    "val": "-10.070"
                },
                "BudgetYearOne": {
                    "val": "-0.870"
                },
                "BudgetYearOneBase": {
                    "val": "-0.870"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-10.070"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.616"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.870"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.870"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.969"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in FY 2020 is due to increases in Technology Candidate development in Electromagnetic Maneuver Warfare and Combating Terrorism, Ocean Battlespace Sensing, Sea Warfare and Weapons, Warfighter Performance, and Naval Warfare and Weapons as discussed in the individual FY 2020 Plans and increase\/decrease statements of each of these R-2 Activity sections.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "(U)Future Naval Capabilities Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "147.219"
                        },
                        "CurrentYear": {
                            "val": "137.701"
                        },
                        "BudgetYearOne": {
                            "val": "154.755"
                        },
                        "BudgetYearOneBase": {
                            "val": "154.755"
                        },
                        "BudgetYearTwo": {
                            "val": "167.590"
                        },
                        "BudgetYearThree": {
                            "val": "180.900"
                        },
                        "BudgetYearFour": {
                            "val": "184.622"
                        },
                        "BudgetYearFive": {
                            "val": "188.333"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Prior to FY 2019, the underlying Future Naval Capabilities (FNC) Program investments in this program element (PE) were aligned to specific FNC projects. Future budget activity (BA) 2 investments supporting candidate FNC technologies are being developed in order to increase agility, exploit technology advances, and respond quickly to naval needs. This approach facilitates an optimum response when developing and maturing the technology options that will be developed further in PE 0603673N, Future Naval Capabilities Advanced Technology Development.  \n\nThe FNC Program has been fully restructured for FY 2019 in favor of a more direct and higher level of collaboration, PE R-2 activities are now organized by the Office of Naval Research (ONR) Departments, which are tasked to collaborate with the acquisition stakeholders and their resource sponsors.  A complete accounting of the technology candidates being developed and a full disposition of each technology development effort funded in this PE will be provided separately to the Congressional oversight committees."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CAPABLE MANPOWER (CMP)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n-  Complete Manpower Planning and Optimization Toolset - Demonstrate the new analytics to measure variable work packaging, optimize manpower variables (task allocation, job and occupation codes, billets, and training), and estimate manpower, personnel, and training costs to better characterize manpower components of overall ship total ownership cost.\n\nFNC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Complete UAS Control Station Human Machine Interface - Validate the human machine interface design concepts for supervisory control and for documenting design lessons learned from user experimentation.\n\nFNC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Complete Decision Making-Learning Management System (DM-LMS) - Research and design measures of decision making mastery for ground infantry squad leaders in order to reliably measure acquisition of expertise.\n- Complete Digital Integrated Representation of Tactical Environment (DIRTE) - Design the Graphical User Interface (GUI) for environment generation and the capture of relevant environmental context, including maps and terrain, to train individual Marines, small unit leaders, and company level staff.\n- Complete Simulation Tailored Training and Assessment (ST2A) - Assess feasibility and design solutions for situated tutor techniques and unobtrusive monitoring techniques, and develop software and hardware prototypes to execute adaptive decision making scenarios in simulation.\n\nFNC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS, TRAINING & EXPERIMENTATION (EDUCAT2E)\t\n- Complete Environment Designed to Undertake Counter A2AD Tactics, Training & Experimentation (EDUCAT2E) - Finish modeling of the pacing threat denied and degraded effects on the unit sensors of blue, joint and partner nations in a distributed, virtual\/constructive training, and certification\/mission rehearsal environment.\n\nFNC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Continue Operational Planning Tool - Develop new capabilities to support, plan, brief, execute, and assess the Navy planning process in order to facilitate real-time situational awareness and rapid re-planning. \n\nFNC: CMP-FY17-01 MANPOWER, PERSONNEL & TRAINING STRATEGIC PLANNING APPLICATION\n- Initiate Manpower, Personnel & Training Planning Application - For this FNC, delayed one year to start in FY18, develop a fundamental understanding of the risks and uncertainties underlying Manpower, Personnel, and Training interconnections and performance drivers, including potential impact points, time delays, and pathways of decisions across the enterprise. \n\nFNC: CMP-FY17-02 FUTURE INTEGRATED TRAINING ENVIRONMENT (FITE)\n- Continue Future Integrated Training Environment (FITE) - Assess feasibility and design solutions for a single world-like representation of available terrain databases, making them easily available to exercise planners, and develop initial requirements to link ground and air simulation trainers. \n\nFNC: CMP-FY18-01 LEARNING CONTINUUM AND PERFORMANCE AID (LCAPA)\n- Initiate Learning Continuum and Performance Aid (LCaPA) - Develop a fundamental understanding of the skills, training, and performance measures necessary to manage individualized learning and performance tracking. \n\nFNC: CMP-FY18-02 MANNED AND UNMANNED COMMON PLANNING PICTURE\n- Initiate Manned and Unmanned Common Planning Picture - Develop software heuristics and automated rule sets for future integration into a single Commander's intent planner. \n\nFNC: CMP-FY19-03 Fleet Training Technologies (FleeT2)\n- Initiate FleeT2 - Conduct analyses of representational techniques, model dynamics, and high computational tractability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENTERPRISE AND PLATFORM ENABLERS (EPE)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.469"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Conduct a final assessment of the aluminum coating to minimize radiant heat build-up and an evaluation of aluminum repair tools.  \n- Complete Aluminum Alloy Corrosion Prediction Tool - Conduct an assessment of aluminum corrosion prediction software integrated with the developed Degree of Sensitization (DoS) detection tools. \n\nFNC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Complete university hot corrosion and mechanical testing of materials and down-select the best materials for hardware development. \n\nFNC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Evaluate new material mitigation technology. \nFNC: EPE-FY16-01 ADVANCED TOPCOAT SYSTEM (ATS)\n\n- Continue Advanced Topcoat Systems for Air Vehicle (ATS-AV) - Conduct formula optimization and modification development of advanced protective coating constituent combinations and preliminary material property validation toward TRL 6 formulas.  \n\nFNC: EPE-FY19-04 Signature Management System (SMS)\n- Continue SMS - Continue applied research technology development for submarine applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FNC MANAGEMENT"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC MANAGEMENT\n- Continue FNC Management - New Start Preparations - Conduct technology analysis and studies to support the development and validation of technology performance specifications to ensure new enabling capabilities are able to commence execution in a timely manner.\n- Continue FNC Management - Support\/OPS Analysis - Conduct warfighter sustainment Applied Research and analysis, including technology management of FNC investments supporting the naval capability pillars."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE HEALTH PROTECTION (FHP)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.233"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH\n- Continue applied research efforts to exploit methods of detecting individual-specific challenges associated with combating casualties in warfighters operating at altitude.\n\nFNC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Complete Acute Care Cover for Severely Injured Limbs (ACCSIL) - Conduct efficacy testing of innovative pharmaceutical solutions and novel materials that will enhance the bandage system for management of complex limb trauma.\n\nFNC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Complete Blast Load Assessment: Sense and Test (BLAST) - Finish algorithm predictions, integrate data and power management technologies, and validate the neuro-functional assessment device to estimate Traumatic Brain Injury.\n\nFNC: FHP-FY16-01 INCAPACITATION PREDICTION FOR READINESS IN EXPEDITIONARY DOMAINS - AN INTEGRATED COMPUTATIONAL TOOL (I-PREDICT)\n- Continue I-PREDICT - Develop an integrated, in-silico, morphometrically scalable model of the human being to estimate injury response from external forces (i.e., blunt, blast and vibratory forces)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCENET (FNT)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.645"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE\n- Complete EW Battle Management (EWBM) - Integrate combat system data with cross domain data to automate tactical Electronic Warfare (EW) decision making across multiple ships.\n\nFNC: FNT-FY13-03 SILK THREAD\n- Complete Silk Thread Product 1 - Finish applied research efforts for this classified program.\n- Complete Silk Thread Product 2 - Finish applied research efforts for this classified program.\n\nFNC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Complete Adaptive TCPED for ASW Services - Complete the development of advanced techniques for automated high accuracy, low error rate, adaptive processing.\n- Complete Data Exfiltration and Networked Platform Interaction - Integrate radio components and waveforms in a host platform.\n\nFNC: FNT-FY14-03 EXCHANGE OF ACTIONABLE INFORMATION AT THE TACTICAL EDGE (EAITE)\n- Continue Actionable Information Tactical Applications - Research and design natural language processing algorithms to enable machine understanding of an information requirement. \n\nFNC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Implement real-time AEW Electronic Protection improvements within the airborne prototype. \n\nFNC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud - Perform applied research in machine learning analytics to support automated enemy course-of-action predictions based on all-source intelligence for integrated fires and integrated air and missile defense. \n\nFNC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) \n- Perform laboratory effectiveness testing to evaluate the RF design, which includes communications, cyber, information operations and electronic warfare operational performance requirements. \n- Complete Electronic Warfare Tactical Decision Aid (EW-TACAID) - Conduct analyses of efficient operator interfaces in support of netted sensor and coordinated EW operations.  \n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Conduct laboratory analysis of temporal, spectral and resource allocation management techniques for optimized resource sharing. \n\nFNC: FNT-FY16-01 BUGLE\n- Continue Bugle - Continue applied research efforts supporting advanced waveforms. \nFNC: FNT-FY16-02 COMBINED EO\/IR SURVEILLANCE AND RESPONSE SYSTEM (CESARS)\n- Continue Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Finalize development of the high resolution sensor algorithms, laser hardware, and countermeasure algorithms and techniques. \n- Continue Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Develop, assess and analyze algorithms, noise performance, resolution and sensitivity technology, and software for data capture, recording, processing and display. \n\nFNC: FNT-FY17-01 COMMUNICATIONS AND INTEROPERABILITY FOR INTEGRATED FIRES (CIIF)\n- Continue Communications as a Service (CaaS) - Validate and test distributed optimization algorithms and quality-of-service protocols. \n- Continue Mission-Based Networking for DDS (MiND) - Conduct simulation and system engineering of waveform coding\/modulation, adaptive link management and Data Distribution System (DDS) networking\/quality of service. \n\nFNC: FNT-FY17-02 SUBMARINE SIMULTANEOUS TRANSMIT AND RECEIVE (SUBSTAR)\n- Continue Submarine Simultaneous Transmit and Receive (SubSTAR) - Develop and prototype initial broadband simultaneous transmit and receive antenna designs. \n\nFNC: FNT-FY17-04 RESILIENT HULL\/INFRASTRUCTURE MECHANICAL & ELECTRICAL SECURITY (RHIMES)\t\n- Continue SCAMM - Develop information sharing capabilities for tactical platforms. \n- Continue SCRAM - Develop resilient software for integrated control systems, including those without redundant processors. \n\nFNC: FNT-FY18-04 NANOSAT COMMUNICATIONS FOR A2AD OPERATIONS\n- Initiate Nanosat Communications Payloads - Develop and prototype a nanosat communication payload in UHF- and X-bands. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity)\n- Initiate Shipboard Integration - Develop and integrate shipboard networking in UHF- and X-bands with Digital Mobile Radio and Navy multiband terminal. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY18-05 ADVANCED COORDINATION TECHNIQUES FOR DISTRIBUTED EW\n- Continue Coordinated Radio Frequency EW (CRFEW) - Continue analyzing precision geo-location and coordinated engagement techniques to support netted sensor battlespace emitter geo-location and coordinated Electronic Warfare (EW) operations. \n- Continue Next Generation Surface Electronic Warfare User Interface - Continue the analysis of surface EW to inform user requirements of single and cross-ship sensor correlation, disambiguation and fixing, and tactical decision making. \n- Continue Propagation Channel Assessment and Prediction (PCAP) - Continue analyzing real-time techniques for assessing radio frequency propagation channels in support of naval operations. ("
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "POWER AND ENERGY (P&E)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.845"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Complete High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Transition a knowledge product with relevant voltage, current and protection ratings to the acquisition sponsor.\n\nFNC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Complete Compact High Density Tactical Energy Storage - Complete module subsystem modeling, analysis, and development.\n- Continue Multi-Function High Density Shipboard Energy Storage - Conduct an analysis of the ship impact of multifunction energy storage technology with high pulse loads. \n\nFNC: P&E-FY17-02 TORPEDO ADVANCED PROPULSION SYSTEM (TAPS)\n- Continue Torpedo Advanced Propulsion System (TAPS) - Complete safety and cost analyses of the technology solutions being developed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA SHIELD (SHD)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "34.125"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Complete Compact Modular Sensor-Processing Suite (CMSS) - Finish developing an extension of the software and algorithms to include interaction with the seabed necessary for the new three dimensional cameras.\n\nFNC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Complete Cooperative Networked Radar - Finish developing software algorithms and techniques for cross-platform radar operation that deliver enhanced sensitivity.\n\nFNC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE\n- Continue ATT Timeline Compression (ATTTC) - Continue development of bi-static and acoustic communication algorithms. \n- Continue Concept C Countermeasure - Conduct electronic subsystem software integration. \n\nFNC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Complete Autonomous Threat Detection and Localization - Finalize and document algorithm development and detection, classification, localization, and tracking performance.\n- Complete Remote Command & Control - Finalize and document algorithm development and command and control functionality.\n- Complete Tactical Positioning & Fire Control - Finalize and document system autonomy and fire solution algorithms.\n\nFNC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S - Develop fire control algorithms for implementation in the Ship Self-Defense System (SSDS). \n\nFNC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Continue Expeditionary MCM Automated Data Analysis - Develop fusion algorithms for low frequency sonar and acoustic color with high frequency imaging systems. \n- Continue MCM Task Force Planning - Refine re-planning algorithms and integrate them with algorithms for the effects-based application of risk. \n\nFNC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Complete Hyper Velocity Projectile - Demonstrate the component technology required to support a hypervelocity launch and develop common interfaces for powder gun and railgun launch conditions.\n\nFNC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Continue Ship-launched EW Extended Endurance Decoy (SEWEED) - Conduct design development of the demonstrator vehicle and payload bay, and continue documentation of design and interface control. \n\nFNC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Continue Surface Ship Periscope Detection and Discrimination (SSPDD) - Continue development of the generation 2.5 government-reference prototype sensor, data fusion system, and pre-planned product improvement options. \n\nFNC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Continue Next Generation Airborne Passive System (NGAPS) - Model and test algorithms and hardware for field communications, control, health monitoring, mission planning and contact separation\/correlation. \n\nFNC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Continue Softkill Performance and Real-Time Assessment (SPARTA) - Develop and establish design criteria, system requirements, and software requirements. \n\nFNC: SHD-FY17-02 AUTONOMOUS UNMANNED SURFACE VEHICLES FOR MINE WARFARE (MIW)\n- Continue Autonomous Situational Awareness and Hazard Avoidance System for USVs - Develop autonomous situational awareness and hazard avoidance system components for Unmanned Surface Vehicles (USVs) that enable avoidance of fixed and moving hazards, while providing the ability to regain track and revisit missed areas using a low bandwidth control link. \n- Continue High Temperature Superconducting (HTS) Magnetic Influence Sweep Payload for USVs - Develop magnetic, mine-influence, sweep system technology components that can be integrated on an Unmanned Surface Vehicle (USV) enabling a sweep capability that is self-contained and capable of unmanned tactical operations. \n- Continue Underway Refueling and Data Transfer for USVs and RMMVs - Develop automated underway refueling technology for Unmanned Surface Vehicles (USVs) and unmanned semisubmersible vehicles that is capable of conducting unmanned\/automated refueling operations and data download\/upload in up to sea state 3, away from a host refueling ship. \n\nFNC: SHD-FY17-05 DEEP RELIABLE ACOUSTIC PATH EXPLOITATION SYSTEM (DRAPES)\n- Continue Deep Reliable Acoustic Path Exploitation System (DRAPES) - Develop algorithms for undersea communications, health monitoring, and contact separation\/correlation. \n\nFNC: SHD-FY18-08 FORCE-LEVEL INTEGRATED FIRES REAL-TIME ENGAGEMENT COORDINATION AND PERFORMANCE ESTIMATION (FIRECAPE)\n- Initiate FIRECAPE Algorithms - Begin development of performance estimation and coordination algorithms and validate their performance using Monte Carlo analysis against complex threat raids. \n\nFNC:  SHD-FY19-07 (IW-FY19-03) Theater ASW Commander Battle Management (TASWC BaM TDA)\n- Initiate TASWC Battle Management TDA - Establish protocol and setup for Measures of Effectiveness analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA STRIKE (STK)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.829"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Complete Long Range Find, Fix and ID - Improve Long Range ID algorithm performance within unanticipated maritime phenomenology.\n\nFNC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Complete Anti-Surface Warfare (ASuW) Weapon Upgrade - Develop and verify algorithms for Phase II.\n\nFNC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Complete SMOKE - Evaluate and model advanced kinematic technology improvements for a future air-to-air missile.\n\nFNC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Complete Collaborative Anti-Surface Warfare Engagement (CASE) - Design, develop, and improve weapon-to-weapon communications, coupled with algorithms for limited weapon autonomy addressing the surface warfare mission area.\n- Continue Collaborative Electronic Attack (CEA) - Perform applied research in cognitive electronic warfare to produce next generation electronic jamming effects. \n\nFNC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Implement real-time electronic protection improvements within the airborne test bed. \n\nFNC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Design and develop prototype concepts and new processes for a Rocket Propelled Grenade (RPG) hard-kill defense for rotorcraft. \n- Continue Multi-Spectral EO\/IR Seeker Defeat - Refine, test and finalize Infra-Red Countermeasures (IRCM) Electro-Optic\/Infra-Red (EO\/IR) techniques for flares and jammers using simulation and laboratory tests. \n\nFNC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Continue implementation and refinement of the autonomy architecture and algorithms for mission planning, waypoint navigation and vehicle health. \n- Continue MUHV Sensors, Navigation and Guidance - Continue development and maturation of multiband and hybrid sonar, inertial navigation, and fiber-optic systems. \n\nFNC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Complete Extended-Range Targeting (E-RAT) - Design, develop, and improve prototypes and processes that address extended range targeting and fire control. \n\nFNC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Continue Reactive Electronic Attack Measures (REAM) - Implement and assess real-time reactive electronic attack algorithms in a representative environment. \n\nFNC: STK-FY17-04 ALPO\n- Complete ALPO - Establish the initial feasibility and practicality solution for an advanced signal-processing system.\n\nFNC: STK-FY18-01 PRECISION ELECTRONIC ATTACK TECHNOLOGIES (PEAT)\n- Continue Multi-platform Retrodirective EW - Continue analyzing synchronized Electronic Warfare (EW) effects across multiple platforms and EW systems. \n- Continue Single Platform Coherent Arrays - Continue analyzing synchronized EW effects across intra-platform EW components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ELECTROMAGNETIC MANEUVER WARFARE (EMW) AND COMBATING TERRORISM"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity, new for FY 2019, is to develop and mature technologies in asymmetric and irregular warfare, distributed operations, information dominance, survivability and self-defense to a point where they can be proposed and continued as Future Naval Capabilities (FNC) in program element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.639"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The technologies pursued under this activity include investments that:  improve warfighter effectiveness in command, control, computers and communication for small unit naval expeditionary warfighters; enhance fires capabilities so warfighters employed in small, distributed units will have the tools they need to locate and decisively destroy larger enemy forces; improve force protection for small units and individual warfighters against a myriad of enemy attack modes; improve human performance by developing new training technologies, knowledge products, architectures, and systems that can accelerate mental, emotional and cognitive decision-making skill; mature emerging technologies for future intelligence, surveillance and reconnaissance systems; develop and mature new maintenance technologies for expeditionary combat systems; develop new expeditionary energy technologies that support distributed operations from the individual Marine to small units; develop novel technologies and innovative concepts that will improve the maneuverability of the Marine Corps Air Ground Task Force by enhancing the movement of troops and equipment from shipboard to inland objectives; and mature new technologies that will improve the standoff detection and neutralization of improvised explosive devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.723"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.723"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Future Naval Capabilities (FNC) Technology Candidate development in FY 2020 will continue to focus on the technologies noted in the FY 2019 plans. Investments include technologies that: improve warfighter effectiveness in command, control, computers and communication for small unit naval expeditionary warfighters; enhance fires capabilities so warfighters employed in small, distributed units will have the tools they need to locate and decisively destroy larger enemy forces; improve force protection for small units and individual warfighters against a myriad of enemy attack modes; improve human performance by developing new training technologies, knowledge products, architectures, and systems that can accelerate mental, emotional and cognitive decision-making skill; mature emerging technologies for future intelligence, surveillance and reconnaissance systems; develop and mature new maintenance technologies for expeditionary combat systems; develop new expeditionary energy technologies that support distributed operations from the individual Marine to small units; develop novel technologies and innovative concepts that will improve the maneuverability of the Marine Corps Air Ground Task Force by enhancing the movement of troops and equipment from shipboard to inland objectives; and mature new technologies that will improve the standoff detection and neutralization of improvised explosive devices."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase of funds from FY 2019 to FY 2020 is due to naval priorities necessitating an increased investment in technology options for future expeditionary maneuver warfare and combating terrorism Future Naval Capabilities (FNCs).  Specific efforts include autonomous and communication technologies that support the last tactical mile for Marine Corps operations as well as artificial intelligence that improve targeting and fire support coordination.  A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR AND SPECIAL PROJECTS"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity is to develop and mature technologies in data science, mathematical optimization, computational and information sciences, quantum information sciences, electronics, command and control and combat systems, communications, cyber security, cyber operations, electronic warfare, sensing and surveillance, and precision timing and navigation, as well as technologies for surface and airborne vehicles, and cruise missile defense weapons to a point where they can be proposed and continued as Future Naval Capabilities (FNC) in program element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "67.086"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The technologies pursued under this activity include investments that:  advance techniques and algorithms for information processing and integration, information operations, information assurance, cyber protection, communications and networking, computational decision-making, accurate decision making, and command and control technologies with a specific focus on enabling rapid; exploit advancements in electronics, sensors and network technologies enabling new and innovative uses of the electromagnetic spectrum in areas of surface and aerospace surveillance, communications, electronic combat, and precision time and navigation; improve adaptive persistent surveillance capabilities; develop new digital radio frequency technologies supporting active aperture, phased arrays capable of performing multiple functions simultaneously; improve soft-kill performance and real-time assessment, as well as provide multiple means to detect and measure incoming threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.720"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.720"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Future Naval Capabilities (FNC) Technology Candidate development in FY 2020 will continue to focus on technologies noted in the FY 2019 plans section above. \n\nInvestments include technologies that: advance techniques and algorithms for information processing and integration, information operations, information assurance, cyber protection, communications and networking, computational decision-making, accurate decision making, and command and control technologies with a specific focus on enabling rapid; exploit advancements in electronics, sensors and network technologies enabling new and innovative uses of the electromagnetic spectrum in areas of surface and aerospace surveillance, communications, electronic combat, and precision time and navigation; improve adaptive persistent surveillance capabilities; develop new digital radio frequency technologies supporting active aperture, phased arrays capable of performing multiple functions simultaneously; improve soft-kill performance and real-time assessment, as well as provide multiple means to detect and measure incoming threats. \n\nFY20 investments focuses on the following areas: communications and networking; decision tools; cyber; sensor deception and defeat; advanced sensing, counter ISR and processing; cross platform technologies; and advanced systems and components. The objectives of communications and networking include maturing promising communications and networking technologies and enable rapid transition to the fleet. The objectives of sensor deception and defeat include maturing the underlying technologies, techniques and algorithms that degrade, neutralize, or destroy an adversary's combat capability. The objectives of decision tools include dedicating applied research to develop decision tools to allow Commanders to rapidly and confidently move from data-to-options-to-informed decisions. The objectives of cyber include maturing innovative cyber approaches to enhance resilience, safety, reliability, and efficiency of cyber systems in warfighting platforms. The objectives of advanced sensing and processing thrust is to maturing sensing system and processing technologies to deliver enhanced operational capabilities for Intelligence, Surveillance, Reconnaissance and Targeting applications. The objectives of cross platform technologies include maturing electro-magnetic enabling technologies that rely on geographic separation of platform sensors to deliver enhanced operational capabilities. The objectives of advanced systems and components include maturing the underlying components and systems for improved electro optical (EO), radio frequency (RF) and Precision, Navigation, and Timing (PNT) systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to higher naval priorities that led to a realignment of technology candidates across PE (program element) 0602750N, Future Naval Capabilities Applied Research, R-2 Activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OCEAN BATTLESPACE SENSING"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity, new for FY 2019, is to develop and mature technologies for antisubmarine warfare, mine warfare and mine countermeasures, and environmental sensing and prediction for the ocean battlespace from sub-seafloor to space to a point where they can be proposed and continued as Future Naval Capabilities (FNC) in program element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.399"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The technologies being pursued under this activity include investments that:  improve the detection and neutralization of mines in both the ocean and littoral environment; exploit advancements in maritime sensing, ocean engineering, marine systems, and undersea signal processing, and improve our understanding of the environment and the limits of predictability by maturing technologies in fields ranging from the littoral geosciences to high latitude dynamics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.476"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.476"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Future Naval Capabilities (FNC) Technology Candidate development in FY 2020 will continue technologies noted in the FY 2019 plans with a primary focus on improving the ability to exploit environmental sensing, modeling and prediction to enable more effective anti-submarine warfare (ASW) and mine warfare (MIW) applications."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 was due to naval priorities necessitating an increased investment in technology candidates for future FNCs (Future Naval Capabilities) that leverage advances in Ocean Battlespace Sensing specifically for next generation anti-submarine warfare (ASW) and mine warfare (MIW) sensors, models, and mission planning capabilities. A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA WARFARE AND WEAPONS"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity, new for FY 2019, is to develop and mature technologies that enable superior warfighting capabilities for surface and sub-surface naval platforms and undersea weaponry to a point where they can be proposed and continued as Future Naval Capabilities in program element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.738"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The technologies being pursued under this activity include investments that: reduce the total life cycle cost of naval platforms and minimize the energy footprint of naval forces by exploiting advancements in hydrodynamics, survivability, electrical and thermal systems, platform structures and autonomy for unmanned surface vehicles; develop new functional and structural materials, materials processing and systems to fulfil the unique requirements of marine and military applications; develop concepts and technologies which enable flexible resilient logistics and maintenance: develop new guidance, control, autonomy, sensors, signal processing, undersea distributed network, energy conversion, propulsion and vehicle technologies that improve the capabilities of sea weapons; improve protection against corrosion and anti-fouling coatings; develop new battery, fuel cell, liquid and solid fuels, and motors for weapons and autonomous vehicles; exploit renewable energy resources and energy efficiency technologies for sea warfare; develop concepts and technologies which enable flexible resilient logistics; develop improved and new acoustic sensors, and related processing and autonomy algorithms, to support long-range undersea weapons; and develop primary battery technology for long-range undersea weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.104"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.104"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The focus in FY 2020 will be on maturing technologies for future FNCs (Future Naval Capabilities) involving off-board refueling and data transfer, autonomous situational awareness, hazard avoidance, and high temperature superconducting magnetic influence sweep payloads for unmanned surface vehicles; advanced batteries to increase torpedo range and endurance; robust power control for integrated surface ship power and combat systems; precision lift in austere at-sea environments for surface ship replenishment and weapons reload; digital tools to automate operation and control of unmanned platforms integrated with manned platforms in mission environments; and in situ repair of shipboard copper-nickel heat exchanger tubing.  Additionally, applied research will begin on emerging technologies in the areas of autonomy, digital analytics for platforms and logistics, platform maintenance and sustainability, undersea weapons, advanced manufacturing, and energy systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 is due to naval priorities in Sea Warfare and Weapons necessitating an increased investment in advance mine-counter-measure technologies for unmanned vehicles and artificial intelligence that improves situational awareness and hazard avoidance for autonomous platforms.  A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WARFIGHTER PERFORMANCE"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity, new in FY 2019, is to develop and mature technologies that enhance Naval warfighting effectiveness and efficiency within the broad array of Warfighter Performance science and technology domains (Undersea Medicine, Biological Sciences, Biorobotics, Capable Manpower, Command Decision Making, Force Health Protection, Human Robot Interaction, Noise-Induced Hearing Loss, and Training and Simulation) to a point where they can be proposed and continued as Future Naval Capabilities (FNC) in program element (PE) 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.115"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The technologies being pursued under this activity include investments that:  mature computational, neuroscience, bioscience, bio-mimetic, social\/organizational, training, human factors, and decision making technologies to improve warfighter performance and decision making in all environments; exploit advancements in biomaterials, biomedical technologies, expeditionary and undersea medicine, physiology and biophysics, and immunology to increase the survival of casualties through intermediate, life-saving treatments and stabilization techniques and to prevent personnel injuries caused by the stresses of demanding Naval occupations and environments; and develop new manpower, personnel, training, and education technologies that prepare sailors and Marines to fight and win in an information rich, distributed battlespace, get the right warfighters into the right job at the right time with the right tools, and provide a 21st century learning environment designed to deliver the right training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.710"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.710"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Technologies developed under this activity enhance Naval operators use of: Autonomy, Artificial Intelligence, and Robotics (AAR), including cross-domain facilitated communication between operators and unmanned vehicles; Communications and Networking\/Cyber (CN\/C) technologies such as expeditionary command, control, communications, intelligence, surveillance, and reconnaissance (C4ISR); Advanced Analytics and Decision Making (AADM) capabilities including Naval training tools and decision-assist technologies for denied and degraded environments; Manpower, Performance, Protection, and Medical support (MPPM) capabilities such as directed energy bioeffects, monitoring performance in austere environments, and predictors of blast injury."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 in Warfighter Performance technologies is due to naval priorities necessitating an increased investment for future FNCs (Future Naval Capabilities) that leverage advances in human-machine integration, communications, predictive and preventive techniques for Naval force health protection; and training technologies for Fleet\/Force.  A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVAL AIR WARFARE AND WEAPONS"
                                    },
                                    "Description": {
                                        "val": "The objective of this activity, new for FY 2019, is to develop and mature technologies in directed energy, energetic materials, autonomy, electromagnetic launch, and high speed conventional air and surface weapons to a point where they can be proposed and continued as Future Naval Capabilities in PE 0603673N, Future Naval Capabilities Advanced Technology Development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.724"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The technologies being pursued under this activity include investments that: enhance the offensive and defensive capabilities of tactical missiles and missile systems by developing and maturing new technologies in the areas of high threat time-critical strike, countermeasures to advanced seekers and hostile fire, air vehicle performance, air platform survivability, total ownership cost, operational availability, hypersonic missile defense, naval fires, non-kinetic warfare, unmanned naval aviation, warhead and propulsion energetics and design, navigation, autonomy, airframes, power and energy, propulsion design, sensors, seekers, targeting, directed energy, collaborative operations, advanced manufacturing and maintenance reduction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The focus of FY2020 will be on maturing technologies for future FNCs that will improve kinetic and non-kinetic capabilities of existing and future naval weapon systems, as well as introduce technological advancements into core Naval operations.  Technology investments will be made to introduce artificial intelligence and machine learning into mission planning, make generational enhancements to rocket motor propulsion, investigate sub-system advancement for hypersonic weapons, mature directed energy applications for defense, expand aircraft and ship self-defense capabilities, create alternate aircraft repair methodologies, and improve aircraft-ship interoperability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in Naval Air Warfare and Weapons technologies from FY 2019 to FY 2020 is due to naval priorities necessitating an increased investment in technologies for greater insertion and utilization of artificial intelligence and machine learning into Naval operations; investigation into new means for increased availability and sustainability and reduced life cycle cost of capital investments in Naval aircraft; and acceleration of subsystem development for hypersonic weapons and defense."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The performance metric for this program element (PE) and the research thrusts it funds can be measured by the number of successful Future Naval Capabilities (FNCs) that are able to be proposed and selected in the FNC budget activity (BA) 3 PE 0603673N, Future Naval Capabilities Advanced Tech Development."
                        }
                    }
                }
            ]
        }
    }
}