{
    "id": "2020-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-a68dd9fef367b9c12cbc9abe43de0f366f7fa17ff175266a426863ca981e6b3b-7",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602716E"
        },
        "ProgramElementTitle": {
            "val": "ELECTRONICS TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "283.180"
            },
            "CurrentYear": {
                "val": "348.847"
            },
            "BudgetYearOne": {
                "val": "332.192"
            },
            "BudgetYearOneBase": {
                "val": "332.192"
            },
            "BudgetYearTwo": {
                "val": "340.000"
            },
            "BudgetYearThree": {
                "val": "369.456"
            },
            "BudgetYearFour": {
                "val": "386.366"
            },
            "BudgetYearFive": {
                "val": "392.366"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Electronics Technology Program Element is budgeted in the Applied Research Budget Activity because its objective is to develop electronics that make a wide range of military applications possible.  The Electronics Technology Project focuses on turning basic advancements into the underpinning technologies required to address critical national security issues and to enable an information-driven warfighter.\n\nAdvances in microelectronic device technologies continue to significantly benefit improved weapons effectiveness, intelligence capabilities, and information superiority.  The Electronic Technology project therefore supports continued advancement in microelectronics, including electronic and optoelectronic devices, Microelectromechanical Systems (MEMS), semiconductor device design and fabrication, and new materials and material structures.  Particular focuses of this work include reducing the barriers to designing and fabricating custom electronics and exploiting improved manufacturing techniques to provide low-cost, high-performance sensors.  Programs in this project will also greatly improve the size, weight, power, and performance characteristics of electronic systems; support positioning, navigation, and timing in GPS-denied environments; and develop sensors more sensitive and robust than today's standards.\n\nThe Electronic Technology project will also investigate the feasibility, design, and development of powerful devices, including non-silicon-based materials technologies to achieve low-cost, reliable, fast, and secure computing, communication, and storage systems.  Rapid design and utilization of these new technologies will be a critical focus of ELT-01, as DoD looks for mechanisms to speed the development and fielding of advanced technologies.\n\nThis project has six major focus areas: Electronics, Photonics, MicroElectroMechanical Systems, Architectures, Algorithms, and other Electronic Technology research.\n\nThe Beyond Scaling Technology project recognizes that, within the next decade, the continuous pace of improvements in electronics performance will face the fundamental limits of silicon technology. These limits present a barrier that must be overcome in order for progress to continue. This project will therefore pursue potential electronics performance advancements that do not rely on Moore's Law but instead leverage circuit specialization, to include materials, architectures, and designs intended to suit a specific need. In addition, the Beyond Scaling Technology Project recognizes that the envisioned electronics specialization will require proper security safeguards. Electronics advancements must simultaneously make progress in performance and secure the foundation on which our digital infrastructure relies. Programs within the Beyond Scaling project will look at reducing barriers to making specialized circuits in today's silicon hardware and significantly increase the ease with which DoD can design, deliver, and eventually upgrade critical, customized electronics. Programs will also explore alternatives to traditional circuit architectures, for instance by exploiting vertical circuit integration to optimize electronic devices and by incorporating novel materials, and explore techniques for securing DoD and commercial data and hardware."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "295.447"
                },
                "CurrentYear": {
                    "val": "333.847"
                },
                "BudgetYearOne": {
                    "val": "307.073"
                },
                "BudgetYearOneBase": {
                    "val": "307.073"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "283.180"
                },
                "CurrentYear": {
                    "val": "348.847"
                },
                "BudgetYearOne": {
                    "val": "332.192"
                },
                "BudgetYearOneBase": {
                    "val": "332.192"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-12.267"
                },
                "CurrentYear": {
                    "val": "15.000"
                },
                "BudgetYearOne": {
                    "val": "25.119"
                },
                "BudgetYearOneBase": {
                    "val": "25.119"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-15.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "30.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-12.267"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "25.119"
                                },
                                "BudgetYearOneBase": {
                                    "val": "25.119"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018:  Decrease reflects SBIR\/STTR transfer.\nFY 2019:  Increase reflects Congressional adjustments.\nFY 2020:  Increase reflects initiation of the Intelligent Spectroscopic & Temporal Fusion (INSPECT) and Instinctual RF programs in FY 2020."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "ELT-01"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONIC TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "283.180"
                        },
                        "CurrentYear": {
                            "val": "115.208"
                        },
                        "BudgetYearOne": {
                            "val": "135.882"
                        },
                        "BudgetYearOneBase": {
                            "val": "135.882"
                        },
                        "BudgetYearTwo": {
                            "val": "147.300"
                        },
                        "BudgetYearThree": {
                            "val": "165.556"
                        },
                        "BudgetYearFour": {
                            "val": "182.156"
                        },
                        "BudgetYearFive": {
                            "val": "188.156"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Advances in microelectronic device technologies continue to significantly benefit improved weapons effectiveness, intelligence capabilities, and information superiority.  The Electronic Technology project therefore supports continued advancement in microelectronics, including electronic and optoelectronic devices, Microelectromechanical Systems (MEMS), semiconductor device design and fabrication, and new materials and material structures.  Particular focuses of this work include reducing the barriers to designing and fabricating custom electronics and exploiting improved manufacturing techniques to provide low-cost, high-performance sensors.  Programs in this project will also greatly improve the size, weight, power, and performance characteristics of electronic systems; support positioning, navigation, and timing in GPS-denied environments; and develop sensors more sensitive and robust than today's standards.\n\nThe Electronic Technology project will also investigate the feasibility, design, and development of powerful devices, including non-silicon-based materials technologies to achieve low-cost, reliable, fast, and secure computing, communication, and storage systems.  Rapid design and utilization of these new technologies will be a critical focus of ELT-01, as DoD looks for mechanisms to speed the development and fielding of advanced technologies.\n\nThis project has six major focus areas: Electronics, Photonics, MicroElectroMechanical Systems, Architectures, Algorithms, and other Electronic Technology research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC)"
                                    },
                                    "Description": {
                                        "val": "The High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC) program seeks to develop compact Radio Frequency (RF) signal amplifiers for air, ground, and ship-based communications and sensing systems.  HAVOC amplifiers would enable these systems to access the high-frequency millimeter-wave portion of the Electromagnetic (EM) spectrum, facilitating increased range and other performance improvements.  Today, the effectiveness of combat operations across all domains increasingly depends on DoD's ability to control and exploit the EM spectrum and to deny its use to adversaries.  However, the proliferation of inexpensive commercial RF sources has made the EM spectrum crowded and contested, challenging our spectrum dominance.  Operating at higher frequencies, such as the millimeter-wave, helps DoD to overcome these issues and offers numerous tactical advantages such as high data-rate communications and high resolution and sensitivity for radar and sensors.  Opportunities for transferring HAVOC technology to the Services will be identified during the execution of the early phases of the program.  Technology transfer efforts will follow a spiral development process to mitigate risk and provide the opportunity to incorporate new technological developments as they occur.  Basic research for this program is funded within PE 0601101E, Project ES-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Designed, fabricated, and tested wide bandwidth vacuum windows with high power handling capability.\n-  Investigated new magnetic materials and magnet configurations that enable compact, integrated beam focusing and transport architectures.\n-  Integrated components into prototype amplifiers and demonstrated both the phase one peak power and efficiency metric."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete the design, fabrication, and testing of higher power, higher duty cycle devices to meet Phase 2 program metrics.\n-  Research novel techniques and technologies to address greater thermal management requirements of higher power devices.\n-  Fabricate and test higher power, higher duty cycle devices to meet Phase 3 program metrics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "- Transition designs and prototypes to the Services."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects the program transitioning from fabrication and testing of devices to transition."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precise Robust Inertial Guidance for Munitions (PRIGM)"
                                    },
                                    "Description": {
                                        "val": "The Precise Robust Inertial Guidance for Munitions (PRIGM) program aims to develop inertial sensor technologies for positioning, navigation, and timing (PNT) in GPS-denied environments.  When GPS is not available, these inertial sensors can provide autonomous PNT information.  The program will exploit recent advances in integrating photonic (light-manipulating) components into electronics and in employing Microelectromechanical Systems (MEMS) as high-performance inertial sensors for use in extreme environments.  Whereas conventional MEMS inertial sensors can suffer from inaccuracies due to factors such as temperature sensitivity, new photonics-based PNT techniques have demonstrated the ability to mitigate these inaccuracies.  PRIGM will focus on two areas.  By 2020, it aims to develop and transition a Navigation-Grade Inertial Measurement Unit (NGIMU), a state-of-the-art MEMS device, to DoD platforms.  By 2030, it aims to develop Advanced Inertial MEMS Sensors (AIMS) that can provide gun-hard, high-bandwidth, high dynamic range navigation for GPS-free munitions.  These advances should enable navigation applications, such as smart munitions, that require low-cost, size, weight, and power inertial sensors with high bandwidth, precision, and shock tolerance.  PRIGM will advance state-of-the-art MEMS gyros from TRL-3 devices to a TRL-6 transition platform, eventually enabling the Service Labs to perform TRL-7 field demonstrations.  Basic research for this program is funded within PE 0601101E, Project ES-01 and advanced technology development for the program is budgeted in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.500"
                                            },
                                            "Text": {
                                                "val": "-  Designed and fabricated heterogeneously integrated, chip-scale waveguide optical gyroscopes.\n-  Demonstrated navigation grade accuracy and stability of integrated inertial sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate 100x increase in frequency stability and 3x reduction in power consumption in MEMS clock oscillators.\n-  Package all component technology and test photonic-MEMS inertial sensor performance, robustness to environmental temperature variation, and repeatability between routine operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate inertial sensor survival and operation through laboratory-representative launch events."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in FY 2020 reflects completion of design to transition of packaging component technology and testing inertial sensor performance."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wafer-scale Infrared Detectors (WIRED)"
                                    },
                                    "Description": {
                                        "val": "The WIRED program addresses the need for low-cost, high-performance imaging sensors in the short-wave and mid-wave infrared (SWIR\/MWIR) bands.  These sensors will provide increased standoff distances for small unmanned aerial vehicles, low-cost missiles, handheld weapon sights and surveillance systems, helmet-mounted systems, and ground-vehicle-mounted threat warning systems.  WIRED proposes to manufacture these sensors at the wafer scale, which reduces costs by processing dozens to hundreds of camera imaging arrays at a time.  Wafer-scale manufacturing has already driven a revolution in optical imaging in both the visible and the Long-Wave Infrared (LWIR) spectrum, with high-resolution digital cameras and LWIR sensors having become commonplace or widely-available.  However, no similar technologies exist for the SWIR\/MWIR bands.  WIRED could therefore drive a similar revolution in SWIR\/MWIR.  The program aims to significantly reduce the weight and volume of MWIR detectors, which today require heavy cryogenic cooling systems, and increase the resolution of SWIR detectors by dramatically reducing their pixel size relative to the state-of-the-art."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated improved imaging from MWIR detectors that are integrated directly onto readout integrated circuits (ROICs) and evaluated detector performance\/characteristics at temperatures of 250 K.\n-  Demonstrated improved imaging from small pixel SWIR detectors that are integrated directly onto ROICs and evaluated detector performance\/characteristics.\n-  Updated cost models based on detector performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate an integrated MWIR camera and evaluate performance at temperature of 270 K.\n-  Demonstrate an integrated small-pitch SWIR camera and optimize design of high-resolution SWIR camera."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.682"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.682"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate improved performance of a both the MWIR and SWIR cameras."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects the program transitioning to final demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Optical Aperture Building Blocks (MOABB)"
                                    },
                                    "Description": {
                                        "val": "The Modular Optical Aperture Building Blocks (MOABB) program aims to greatly improve the cost, size, weight, and performance of free-space optical systems.  These systems enable applications such as Light Detection And Ranging (LIDAR), laser communications, laser illumination, navigation, and 3D imaging.  Specifically, MOABB will construct millimeter-scale optical building blocks that can be coherently arrayed to form larger, higher power devices.  These building blocks would replace the traditional large and expensive precision lenses and mirrors, which require slow mechanical steering, that form conventional optical systems.  MOABB will develop scalable optical phased arrays that can steer light waves without the use of mechanical components.  These advances would allow for a 100-fold reduction in size and weight and a 1,000-fold increase in the steering rate of optical systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated beam steering using photonic phase shifters and wavelength tuning in low-loss waveguide gratings.\n-  Demonstrated a scalable unit cell and integrated amplification.\n-  Completed preliminary LIDAR system designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate frequency modulated LIDAR functionality of a unit cell.\n-  Improve the aperture size, output power, field of regard, and efficiency of optical phased array transmitters.\n-  Co-package optical phased arrays with chip-scale laser sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Synthesize multiple light beams from a single optical phased array aperture of one square centimeter area.\n-  Demonstrate integration of laser sources and optical phased arrays on a single photonic chip. \n-  Characterize and deliver a prototype LIDAR module using optical phased arrays."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atomic Clock with Enhanced Stability (ACES)"
                                    },
                                    "Description": {
                                        "val": "The Atomic Clock with Enhanced Stability (ACES) program aims to develop extremely stable chip-scale atomic clocks for unmanned aerial vehicles and other low size, weight, and power (SWaP) platforms with extended mission durations.  Atomic clocks provide the high-performance backbone of timing and synchronization for DoD navigation; communications; electronic warfare (EW); and intelligence, surveillance, and reconnaissance (ISR) systems.  However, atomic clocks are limited, particularly by temperature sensitivity, aging over long timescales, and a loss of accuracy when power cycled.  By employing alternative approaches to confining and measuring atomic particles, ACES could yield a 100x - 1,000x improvement in key performance parameters related to each of these limitations.  ACES will also focus on developing the component technologies necessary for low-cost manufacturing and for deployment in harsh DoD-relevant environments.  Among its many benefits, program success could help reduce the risk posed by a growing national dependence on GPS, allowing systems to maintain their timing accuracy in the event of temporary GPS unavailability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed laboratory demonstration of functioning ACES clock meeting Phase 1 metrics of power consumption, retrace, and instability.\n-  Designed an integrated physics package meeting Phase 2 SWaP objectives.\n-  Initiated fabrication and testing of an integrated physics package meeting the ACES Phase 2 SWaP, retrace, aging, and instability metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete fabrication and testing of an integrated physics package meeting the ACES Phase 2 SWaP, retrace, aging, and instability goals.\n-  Deliver prototype physics package and supporting electronics to government facility for testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Design an integrated physics package meeting Phase 3 SWaP objectives such that prototypes can be completed and tested."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects ACES completing fabrication and conducting final testing for transition to the Service Labs for further development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Limits of Thermal Sensors (LOTS)"
                                    },
                                    "Description": {
                                        "val": "The Limits of Thermal Sensors (LOTS) program aims to demonstrate long-wave infrared (LWIR) detector technologies with both high performance and low-size, weight, power, and cost (SWaP-C).  The resulting technologies would enable improvements in imaging systems such as night-vision goggles, infrared-guided missiles, and missile threat warning systems.  Currently, LWIR-enabled systems must choose between large and expensive cryogenically-cooled detectors, which offer high sensitivity and low response times, and uncooled detectors called microbolometers, which offer significant SWaP-C reductions at lower performance.  LOTS seeks to develop microbolometers that can compete with larger cameras in terms of higher sensitivity required to detect signals over long ranges and lower response time required to avoid image blur.  These technologies will allow DoD to deploy smaller, lighter, and cheaper sensors on critical, high-value assets while maintaining or improving their ability to engage fast-moving or distant targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Built LWIR cameras using LOTS microbolometer designs and demonstrated 2x improvement over state of the art in terms of a common microbolometer figure of merit.\n-  Tested cameras for radiometric performance and sensitivity and delivered camera hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.668"
                                            },
                                            "Text": {
                                                "val": "-  Build LWIR cameras with refined sensors to meet final program specifications.\n-  Validate test camera sensitivity and response time in a relevant application environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "- Validate improved robustness of the test camera in response to relevant radiation conditions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects the program transitioning from refining sensors to validating test camera hardening performance."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atomic Magnetometry for Biological Imaging In Earth's Native Terrain (AMBIIENT)"
                                    },
                                    "Description": {
                                        "val": "The Atomic Magnetometry for Biological Imaging In Earth's Native Terrain (AMBIIENT) program will develop novel magnetic sensors capable of providing high-sensitivity signal measurements in the presence of ambient magnetic fields.  In recent years, the value of magnetic imaging, for example for cardiac and other biological signals, has shown tremendous potential for advanced research and clinical diagnosis.  Practical application, however, has been limited.  Interference from natural and manmade ambient magnetic fields has required that the measurements be performed in specialized, magnetically-shielded research facilities.  The AMBIIENT program will exploit novel physical architectures that are resistant to the impact of common noise sources.  The AMBIIENT sensor itself must be able to detect the gradient of a local magnetic field while subtracting the much larger ambient signal.  This would enable low-cost, portable, high-sensitivity measurements for in-the-field applications.  In addition to medical research and clinical diagnosis, AMBIIENT sensors promise to enable diverse sensing applications including magnetic gradient navigation, anomaly detection, perimeter monitoring, and Ultralow Frequency (ULF) communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed preliminary architectures for direct gradient sensing of magnetic fields.\n-  Developed and tested quantitative models of gradient sensor physics.\n-  Performed laboratory validation of proof-of-principle gradient sensor physics performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.540"
                                            },
                                            "Text": {
                                                "val": "-  Fabricate and test preliminary architectures for direct gradient sensing of magnetic fields.\n-  Refine quantitative models of gradient sensor physics.\n-  Perform laboratory testing of proof-of-principle gradient sensor physics package meeting AMBIIENT Phase 1 size weight and power, accuracy, and sensitivity goals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Design sensor package architecture meeting AMBIIENT Phase 2 size weight and power, accuracy, and sensitivity goals.\n-  Fabricate and test Phase 2 architectures for direct gradient sensing of magnetic fields."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects a shift from initial testing to sensor package architecture fabrication."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamic Range-enhanced Electronics and Materials (DREaM)"
                                    },
                                    "Description": {
                                        "val": "The Dynamic Range-enhanced Electronics and Materials (DREaM) program aims to develop intrinsically linear (ideal) radio frequency (RF) transistors with improved power efficiency and extremely high dynamic range.  Linearity, power efficiency, and dynamic range are fundamental characteristics that allow RF systems to reliably transmit clear signals. Improving these characteristics is essential to operating in a crowded RF environment and to enabling next-generation communication, sensing, and electronic warfare systems.  Traditional RF transistor designs typically require a trade-off between linearity and broadcast power, and poor linearity results in undesired interference.  DREAM will overcome this tradeoff by employing new transistor materials, architectures, and designs.  The resulting DREAM-enabled technologies will allow future RF electronics to increase their operating range without polluting the already-congested RF spectrum and while consuming less system power."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Explored novel device structures and emerging materials to develop higher power, higher linearity and higher power efficiency RF transistors.\n-  Developed high power density transistor prototype with improved linearity that provides three times more current than the state of the art."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop initial low noise and lower power consumption linear transistor prototype that provides 10 times improvement of linearity figure of merit than the state of the art.\n-  Demonstrate fabrication processes for initial advanced transistor architectures and complete early characterization of RF transistor prototypes with two times improvement in output power over the state of the art."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Manufacture and characterize transistor unit cells with both a three times improvement over the state of the art in output power density and 10 times higher linearity.\n-  Optimize fabrication processes and explore novel transistor topology to enable higher breakdown voltage, for design of transistors with four times higher power density than the state of the art. \n-  Exploit new channel materials and perform device modeling to enable scaling to 30 times higher linearity than state of the art at 30 gigahertz operational frequency."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects the program transitioning from developing advanced transistor architectures to manufacturing transistor unit cells."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wideband Secured and Protected Emitter and Receiver (WiSPER)*"
                                    },
                                    "Description": {
                                        "val": "*formerly Ensured Communication Link for Identification Friend or Foe (ECLIFF)\n\nThe Wideband Secured and Protected Emitter and Receiver (WiSPER) program aims to develop an ultra-broadband technology platform to demonstrate a robust, secure and protected communication link. WiSPER technology provides high signal coding gain to deliver a secured and protected link with significantly enhanced capacity for next generation DoD communications. Current terrestrial tactical radios operate with limited bandwidth at prescribed low frequency bands, which are unable to support high capacity with multiple users, and vulnerable to interference and jamming. WISPER technology addresses military needs for assured communications, electronic warfare (EW) communications deception, throughput, security, and size, weight, and power (SWaP) limitations of future C4ISR missions. The program develops an ultra-broadband compact antenna, radio frequency front end electronics, mixed signal circuits, and featureless waveform technologies. The WiSPER program will culminate with the integration and demonstration of a secured communication link.  The WiSPER program moved from ELT-02, Beyond Scaling Technologies, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete system study of secured transceiver architecture for ultra-broadband communication links.\n-  Begin initial designs of antenna, integrated circuits, and waveform to implement ultra-broadband communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and fabricate components of the 1st-generation of transceivers.\n-  Integrate the 1st-generation prototype transceivers.\n-  Demonstrate prototype secured radio link operation in laboratory testing environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects the program shifting from initial designs of antenna, and integrated circuits to developing and fabricating components of the 1st-generation of transceivers."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SHort Range Independent Microrobotic Platforms (SHRIMP)"
                                    },
                                    "Description": {
                                        "val": "The SHort Range Independent Microrobotic Platforms (SHRIMP) program will develop and demonstrate multi-functional millimeter-to-centimeter scale robotic platforms with a focus on untethered mobility, maneuverability, and dexterity.  To achieve this goal, SHRIMP will also provide foundational research in the area of micro-actuator materials and energy efficient power systems for extremely size, weight, and power (SWaP)-constrained microrobotic systems.  The program's platform development activities will leverage recent advances in low power, application specific integrated circuit (ASIC) electronics and low power sensors from the internet of things (IoT) community to increase the functionality of microrobotic platforms while increasing platform mobility, maneuverability, and dexterity. The microrobotic platform capabilities enabled by SHRIMP will provide the DoD with significantly more access and capability to operate in small spaces that are practically inaccessible to today's state-of-the-art robotic platforms.  Such capability will have impact in search and rescue, disaster relief, infrastructure inspection, and equipment maintenance, among other operations.  Foundational research efforts are funded in PE 0601101E, Project ES-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of tethered microrobotic platforms with emphasis on program metrics for size, weight, and duration of operation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate tethered microrobotic platforms meeting program metrics on size, weight, and duration of operation.\n-  Initiate development of an untethered microrobotic platform with an emphasis on size, weight, and performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects the program shifting from initial development to demonstration of tethered microrobotic platforms."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligent Spectroscopic & Temporal Fusion (INSPECT)"
                                    },
                                    "Description": {
                                        "val": "The Intelligent Spectroscopic & Temporal Fusion (INSPECT) program will add relevant spectral content to broadband infrared (IR) imagers to enhance battlefield detection and discrimination while maintaining situational awareness.  The resulting desired capability is analogous to human vision that relies upon shape, brightness, and color to recognize and identify objects of interest.  Currently fielded systems are either broadband infrared sensors that rely on shape and brightness to identify targets or hyperspectral sensors that rely on color to identify targets.  INSPECT will (1) leverage read-out integrated circuits currently in development combined with advances in electrically tunable optical filters and micro-optical components to demonstrate hardware that simultaneously provides situational awareness and target spectral characteristics, and (2) develop intelligent processing for mission-specific band selection.  This will enable new applications in passive seeker technology for missiles, battlefield chemical sensing, laser weapon identification and protection, and low probability of detection multi-spectral optical communications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop preliminary architecture for use with existing broadband imaging hardware.\n-  Develop preliminary algorithms that provide intelligent band selection.  \n-  Begin initial design integration using INSPECT framework."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Instinctual RF"
                                    },
                                    "Description": {
                                        "val": "The Instinctual RF program will develop radio frequency (RF) front-end technology that can protect wideband digital radios against external electromagnetic threats and self-interference, through tunable filtering, limiting, or signal cancellation. Today's multi-function phased arrays that cover broad bandwidth are open to all frequencies with little or no RF filtering.  This is due to a lack of reconfigurable filtering that is small enough to integrate into the arrays,  limiting the use of wideband multi-function arrays in contested environments.  The ability to create reconfigurable bandpass and bandstop filters in the range of 2-18 GHz will be important to implementing transmit\/receive modules in next generation multi-function arrays.  Another important area of interference mitigation is self-interference.  Specifically, in electronic warfare, it would be advantageous to be able to listen while jamming.  Instinctual RF will develop the signal cancellation devices that will listen to the transmit signal and subtract the interfering signal from the input of the receiver so that it will be able to hear faint signals near the noise floor.  Instinctual RF research will provide feedback mechanisms that instinctively correct these problems, much like the nerves of the human body serve to trigger protective action without conscious thought. Whether for self-induced interference or external interference jamming, this program will show the ability to auto-correct and allow for continued operation."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.200"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate new materials, devices and\/or circuit architectures that will enable frequency tuning of band pass and band stop filters in chip-scale size for use in next generation multi-function phased arrays.\n-  Demonstrate new materials, devices and\/or circuit architectures that will enable cancellation of signal leakage between two adjacent antennas for electronic warfare applications on small platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct On-Chip Digital Optical Synthesis (DODOS)"
                                    },
                                    "Description": {
                                        "val": "The Direct On-chip Digital Optical Synthesis (DODOS) program will integrate diverse electronic and photonic components to create a compact, robust, and highly-accurate optical frequency synthesizer for various mission-critical DoD applications.  Frequency synthesis and accurate control of radiofrequency and microwave radiation is the enabling technology for radar, satellite and terrestrial communications, positioning and navigation technology, and many other core DoD capabilities.  Frequency synthesis and control of light or optical waves, however, has been constrained to laboratory experiments due to the size, fragility, and cost of optical frequency synthesizers.  DODOS will leverage recent developments in the field of integrated photonics to enable the development of a ubiquitous, low-cost optical frequency synthesizers.  The program could lead to disruptive DoD capabilities, including high-bandwidth optical communications, higher performance Light Detection And Ranging (LiDAR), portable high-accuracy atomic clocks, and high-resolution detection of chemical\/biological threats at a distance.  Basic research for this program is funded within PE 0601101E, Project ES-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed and demonstrated DODOS prototypes with integrated photonic chips compatible with large-scale batch manufacturing.\n-  Improved the long-term stability of the miniaturized DODOS prototypes and demonstrated synthesizer performance meeting the Phase 2 program goals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate operation of multiple photonic chips in initial synthesizer prototype. \n-  Characterize and deliver multiple DODOS prototypes comprising co-integrated optical frequency synthesizer and control electronics.\n-  Demonstrate a low-noise microwave frequency synthesizer using DODOS components."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Common Heterogeneous integration & IP reuse Strategies (CHIPS)"
                                    },
                                    "Description": {
                                        "val": "The Common Heterogeneous integration & IP reuse Strategies (CHIPS) program aims to develop the design tools and integration standards required to better leverage leading-edge commercial sector technologies in DoD systems.  The program aims to realize modular Integrated Circuits (ICs) that integrate designs using different commercial suppliers and silicon technologies.  CHIPS will therefore pursue standardized interfaces for integrating a variety of Intellectual Property (IP) blocks in the form of prefabricated chiplets.  The chiplets could be reused across applications, manufacturers, and transistor types, allowing DoD to amortize IC design costs across programs, better align electronics design and fabrication with military performance goals, and expand beyond its traditional reliance on the proprietary capabilities of a few on-shore manufacturers.  The CHIPS program moves to Project ELT-02, Beyond Scaling Technologies, in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.250"
                                            },
                                            "Text": {
                                                "val": "-  Finalized selection of standards for high-bandwidth interfaces of digital chiplet-based interconnections, using Intel s Advanced Interface Bus (AIB) as the basis for the CHIPS standard.\n-  Began design activities of heterogeneous circuit demonstrations to verify interface standards for chiplet-based integration of digital IP blocks, including commercial and DoD blocks.\n-  Initiated fabrication of heterogeneous circuit demonstrations to verify interface standards for chiplet-based integration of digital IP blocks, including commercial and DoD blocks.\n-  Continued the study of the system level impact of IP re-use for the optimal use of digital functional blocks in DoD systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Near Zero Energy RF and Sensor Operations (N-ZERO)"
                                    },
                                    "Description": {
                                        "val": "The Near Zero Power RF and Sensor Operations (N-ZERO) program will develop and demonstrate the technologies required to extend the lifetimes of remotely-deployed sensors from months to years.  Today's state-of-the-art sensors can be pre-placed and remain dormant until awoken by an external trigger or stimulus.  However, the active electronics that monitor for external triggers consume power, limiting sensor lifetimes to between weeks and months.  N-ZERO seeks to replace these electronics with passive or extremely low-power devices that continuously monitor the environment and wake up active electronics upon detection of a specific trigger.  This would eliminate or significantly reduce standby power consumption, ensuring that sensor lifetimes are limited only by the power required to process and communicate confirmed events.  In doing so, N-ZERO could enable wireless sensors with drastically increased mission life and help meet DoD's unfulfilled need for a persistent, event-driven sensing capability.  N-ZERO's applied research component will focus on developing radio frequency (RF) communications and physical sensor systems that use energy from an external trigger to collect, process, and detect useful information while rejecting spurious signals and noise.  The N-ZERO program moves to Project ELT-02, Beyond Scaling Technologies, in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Designed, fabricated and evaluated a range of microsystems capable of passive or near zero energy collection, processing and detection of RF communications and physical sensor signatures at reduced signal strength. \n-  RF wake-up receivers demonstrated 4 orders of magnitude improved sensitivity compared to prior art. \n-  Engaged users in the national security space to develop N-ZERO transition opportunities.\n-  Initiated development of near zero power wireless wake-up sensors for advanced failure warning in high-value aerospace components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Circuit Realization At Faster Timescales (CRAFT)"
                                    },
                                    "Description": {
                                        "val": "The Circuit Realization At Faster Timescales (CRAFT) program will develop novel integrated circuit (IC) design flows to reduce by ten times the design and verification effort required for high-performance military electronics.  CRAFT will also reduce barriers to the design and fabrication of custom ICs in leading-edge complementary metal oxide semiconductor (CMOS) technology. When selecting electronics for advanced systems, DoD currently must choose between high-performing custom ICs that take years to design and verify or significantly lower-performing general purpose ICs that can be implemented in a few months.  The need to protect sensitive IC information further limits DoD's ability to access certain leading-edge commercial electronics.  To reduce the design and verification effort, CRAFT will investigate and leverage novel design flows that utilize recent advances in electronic design automation and software design methodologies.  These design flows could reduce the manual labor required to develop and verify custom ICs.  CRAFT will also explore increased design reuse and flexibility, which will allow DoD to migrate chip fabrication between different foundries or to more advanced technology nodes.  These capabilities can help to ensure that the DoD has multiple potential suppliers for critical ICs and help keep military electronics at the leading edge.  The CRAFT program moves to Project ELT-02, Beyond Scaling Technologies, in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.430"
                                            },
                                            "Text": {
                                                "val": "-  Completed initial testing of two full object oriented design flows and demonstrated the 10X reduction goal of CRAFT in both flows.\n-  Completed third Fin Field Effect Transistor (FinFET) multi-project wafer shuttle run.\n-  Completed porting of two FinFET design fabrication on multiple technology nodes at multiple foundries.\n-  Evaluated designs from the second multi-project wafer shuttle run."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Materials"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Materials program will demonstrate the integration of novel materials into next-generation logic and memory components.  Historically, the DoD had taken the lead in shaping the electronics field through research in semiconductor materials, circuits, and processors.  However, as DoD focuses on military-specific components and commercial investments eschew the semiconductor space, U.S. fundamental electronics research is stagnant just as an inflection point in Moore's Law (silicon scaling) is about to occur.  This program will pursue potential enhancements in electronics that do not rely on Moore's Law, including research not only into new materials but also into the implications of those materials at the device, algorithm, and packaging levels.  Research areas will include heterogeneous integration of multiple materials, \"sticky logic\" devices that combine elements of computation and memory, and leveraging three-dimensional vertical circuit integration to demonstrate dramatic performance improvements with older silicon technologies.  The program aims to demonstrate the manufacturability of functioning switches, memory, and novel computational units in a large-scale system.  Previous DARPA work on unconventional computing, integration, and reprogrammable memory give confidence in this approach.  Basic research for this program is funded within PE 0601101E, Project ES-02.  The Beyond Scaling - Materials program moves to ELT-02, Beyond Scaling Technologies, in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Quantified the value of monolithic vertical integration using leading-edge modern and older technology nodes.\n-  Demonstrated the ability for a 90 nm foundry to use alternative materials to create capabilities competitive with advanced technology nodes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Design*"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of Beyond Scaling - Architectures and Design\n\nThe Beyond Scaling - Design will develop and demonstrate the tools required for rapidly designing and deploying specialized circuits. As Moore's Law slows and the nation loses the benefit of free, exponential improvements in electronics cost, speed, and power derived from silicon scaling, the DoD will need to maximize the benefits of available silicon technologies by using design tools that enable circuit specialization. Research efforts will explore technologies and techniques such as intelligent design tools, automated physical layout generation, open-source circuit designs, and complete hardware emulation prior to manufacturing. Further research will also develop tools to create exact representations of outdated hardware in the field and to rapidly, cheaply, and safely upgrade these systems with next-generation electronics.  The goal of this program is to reduce the barrier to entry for complex system-on-chip (SoC) designs and to provide a secure pathway for the rapid upgrade of electronics. Advances under this program will demonstrate a new DoD capability to create specialized hardware and provide electronics improvements that do not depend on continued, rapid silicon scaling.  Basic research for this program is funded within PE 0601101E, Project ES-02.  The Beyond Scaling - Design program moves to Project ELT-02, Electronic Technology, in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated concepts for machine generation of physical objects that would provide a dramatic reduction in circuit design time.\n-  Developed preliminary methods and algorithms for integration of intelligence\/learning into automated electronics design software.\n-  Evaluated available open source hardware IP blocks and began design of critical IP necessary for creation of a sustainable open source hardware ecosystem to significantly increase DoD hardware productivity.\n-  Developed an initial hardware verification architecture for mixed signal circuits and investigated promising approaches to validation of open source IP blocks that would provide a user with high confidence of circuit functionality prior to adoption of the IP block within a large design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Architectures*"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of Beyond Scaling - Architectures and Design\n\nThe Beyond Scaling - Architectures program will demonstrate a new DoD capability to create and utilize specialized hardware by enabling the writing of a common code base on top of customized hardware. The program will explore technologies and techniques such as new domain-specific circuit architectures; co-design of electronics hardware and software; intelligent edge sensors; hardware security architectures; and tight integration of chip-scale processing blocks and artificial intelligence-enabled processing controllers. Basic research for this program is funded within PE 0601101E, Project ES-02.  The Beyond Scaling - Architectures program moves to Project ELT-02, Electronic Technology, in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the ability to construct a system with decomposable pieces that can be rapidly upgraded.\n-  Established and exhibited the capability to manage specialized accelerators for applications.\n-  Began development of software tools to better utilize heterogeneous system-on-chips (SoCs) processors.\n-  Initiated development of programming language and compiler approaches for dynamic data-dependent optimization of hardware configuration.\n-  Initiated workflow analysis and development of application code sets that will drive specialized architecture development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ELT-02"
                    },
                    "ProjectTitle": {
                        "val": "BEYOND SCALING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "233.639"
                        },
                        "BudgetYearOne": {
                            "val": "196.310"
                        },
                        "BudgetYearOneBase": {
                            "val": "196.310"
                        },
                        "BudgetYearTwo": {
                            "val": "192.700"
                        },
                        "BudgetYearThree": {
                            "val": "203.900"
                        },
                        "BudgetYearFour": {
                            "val": "204.210"
                        },
                        "BudgetYearFive": {
                            "val": "204.210"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Beyond Scaling Technology project recognizes that, within the next decade, the continuous pace of improvements in electronics performance will face the fundamental limits of silicon technology. These limits present a barrier that must be overcome in order for progress to continue. This project will therefore pursue potential electronics performance advancements that do not rely on Moore's Law but instead leverage circuit specialization, to include materials, architectures, and designs intended to suit a specific need. In addition, the Beyond Scaling Technology Project recognizes that the envisioned electronics specialization will require proper security safeguards. Electronics advancements must simultaneously make progress in performance and secure the foundation on which our digital infrastructure relies. Programs within the Beyond Scaling project will look at reducing barriers to making specialized circuits in today's silicon hardware and significantly increase the ease with which DoD can design, deliver, and eventually upgrade critical, customized electronics. Programs will also explore alternatives to traditional circuit architectures, for instance by exploiting vertical circuit integration to optimize electronic devices and by incorporating novel materials, and explore techniques for securing DoD and commercial data and hardware. This project aggregates and continues Beyond Scaling programs that were initiated in PEs\/Projects 0602716E\/ELT-01 and 0602303E\/IT-02 and IT-03."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "DARPA Electronics Resurgence Initiative"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "30.000"
                                        },
                                        "Text": {
                                            "val": "-  Initiate or enhance ongoing efforts to demonstrate electronics that can enforce security and privacy protections for electronics components critical to DoD overmatch capabilities.\n-  Confirm, via emulation and physical demonstration, that DARPA-developed hardware security technologies can improve the protection of hardware architectures and national critical infrastructure.\n-  Complete abstractions for the physical design of cryptographic hardware intellectual property for use in critical DoD applications.\n-  Incorporate techniques for the physical isolation of sensitive data processing transactions into an application associated with an ongoing DoD program."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Materials"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Materials program will demonstrate the integration of novel materials into next-generation logic and memory components.  Historically, the DoD had taken the lead in shaping the electronics field through research in semiconductor materials, circuits, and processors.  However, as DoD focuses on military-specific components and commercial investments eschew the semiconductor space, U.S. fundamental electronics research is stagnant just as an inflection point in Moore's Law (silicon scaling) is about to occur.  This program will pursue potential enhancements in electronics that do not rely on Moore's Law, including research not only into new materials but also into the implications of those materials at the device, algorithm, and packaging levels.  Research areas will include heterogeneous integration of multiple materials, \"sticky logic\" devices that combine elements of computation and memory, and leveraging three-dimensional vertical circuit integration to demonstrate dramatic performance improvements with older silicon technologies.  The program aims to demonstrate the manufacturability of functioning switches, memory, and novel computational units in a large-scale system.  Previous DARPA work on unconventional computing, integration, and reprogrammable memory give confidence in this approach.  Basic research for this program is funded within PE 0601101E, Project ES-02.  The Beyond Scaling - Materials program moved from Project ELT-01, Electronic Technology, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "44.349"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate yield of the first complex three dimensional evaluation circuit.\n-  Release initial design tools to be used for design of three dimensional monolithic circuits.\n-  Demonstrate enhanced yield from circuits using alternative materials fabricated in a 90nm foundry and the ability to scale to larger circuits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "46.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "46.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate fabrication of fully integrated monolithic 3D circuits at a commercial fabrication facility.\n-  Release distribution quality design tools to enable external design of monolithic three dimensional circuits. \n-  Demonstrate large-scale fully functional chips using alternative materials fabricated in a 90 nm foundry with capabilities that are competitive with advanced technology nodes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects the program transitioning towards demonstrating the ability to take alternative materials through a full commercial process flow."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Architectures*"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of Beyond Scaling - Architectures and Design\n\nThe Beyond Scaling - Architectures program will demonstrate a new DoD capability to create and utilize specialized hardware by enabling the writing of a common code base on top of customized hardware. The program will explore technologies and techniques such as new domain-specific circuit architectures; co-design of electronics hardware and software; intelligent edge sensors; hardware security architectures; and tight integration of chip-scale processing blocks and artificial intelligence-enabled processing controllers. Basic research for this program is funded within PE 0601101E, Project ES-02.  The Beyond Scaling - Architectures program moved from Project ELT-01, Electronic Technology, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "43.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate that a hardware scheduler will allow for the optimal routing on a specialized integrated circuit in situ of operation.\n-  Initiate design of system-on-chips (SOCs) with heterogeneous mix of processors and algorithm accelerators to solve domain-specific compute problems with good power and performance.\n-  Initiate reconfigurable architecture development and diverse data flow management scheme.\n-  Initiate the definition of a software development environment to enable co-design of reconfigurable hardware."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate ability to emulate a specialized processor capable of efficiently executing two simultaneous applications.\n-  Demonstrate initial reconfigurable architecture simulation and emulation environment that will drive hardware design decisions and definitions.\n-  Advance the software tools, development technologies, and design methodologies for SOCs with heterogeneous components that can be easily reprogrammed for specialized applications. \n-  Develop version two of programming languages and compilers that optimize software and hardware at runtime for reconfigurable processors.\n-  Implement an interconnect architecture for a single common embedded bus with the ability to physically isolate high risk transactions and enforce data security and privacy.\n-  Demonstrate 100Mbps sustained throughput across a two-level security architecture and integrate sensitive data isolation techniques into an application relevant to DoD systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Design*"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of Beyond Scaling - Architectures and Design\n\nThe Beyond Scaling - Design will develop and demonstrate the tools required for rapidly designing and deploying specialized circuits. As Moore's Law slows and the nation loses the benefit of free, exponential improvements in electronics cost, speed, and power derived from silicon scaling, the DoD will need to maximize the benefits of available silicon technologies by using design tools that enable circuit specialization. Research efforts will explore technologies and techniques such as intelligent design tools, automated physical layout generation, open-source circuit designs, and complete hardware emulation prior to manufacturing. Further research will also develop tools to create exact representations of outdated hardware in the field and to rapidly, cheaply, and safely upgrade these systems with next-generation electronics.  The goal of this program is to reduce the barrier to entry for complex system-on-chip (SoC) designs and to provide a secure pathway for the rapid upgrade of electronics. Advances under this program will demonstrate a new DoD capability to create specialized hardware and provide electronics improvements that do not depend on continued, rapid silicon scaling.  Rapid design and deployment techniques developed will also consider the need to incorporate security into DoD hardware.  Basic research for this program is funded within PE 0601101E, Project ES-02.  The Beyond Scaling - Design program moved from Project ELT-01, Electronic Technology, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.000"
                                            },
                                            "Text": {
                                                "val": "-  Determine standards and requirements for interfacing between multiple software modules that will enable the creation of a unified software platform capable of integrating intelligence and learning. \n-  Release an alpha version of the hardware design platform that demonstrates automation within individual software modules, and complete initial evaluation by program collaborators to identify major bugs. \n-  Complete initial design of mixed signal open source Intellectual Property (IP) and gather feedback on IP from government and program users.\n-  Finalize standards required to interface between multiple verification modules and demonstrate initial functionality of verification software against a small set of benchmark mixed signal circuits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "-  Deliver software for physical layout of integrated circuits, packages and boards that is 100% automated and achieves 50% power, performance and area compared to traditional best in class techniques.\n-  Demonstrate fabrication of circuits generated from high-level schematics using a fully automated intelligent design flow. \n-  Publically release open source IP modules developed in the program and demonstrate portability between multiple technology nodes.\n-  Publically release a hardware verification platform with functionality evaluated through simulation and emulation of a comprehensive set of digital and mixed signal circuits\n-  Complete an early software release of an emulation flow capable of emulating a small subsystem. \n-  Create an initial testbed to demonstrate accuracy and performance of digital systems designed through hardware emulation to illustrate the reduction of design time and cost.\n-  Define security levels and metrics and establish on-chip and off-chip security infrastructures based on known chip vulnerabilities.\n-  Identify demonstration platforms and develop interface standards for processors that won't reveal manufacturing vulnerabilities using manufacturing and other techniques to enhance security in a secure design flow."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects the transition from initial design and development to the delivery of functional tools, software, intellectual property, and fabricated hardware."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Common Heterogeneous integration & IP reuse Strategies (CHIPS)"
                                    },
                                    "Description": {
                                        "val": "The Common Heterogeneous integration & IP reuse Strategies (CHIPS) program aims to develop the design tools and integration standards required to better leverage leading-edge commercial sector technologies in DoD systems.  The program aims to realize modular Integrated Circuits (ICs) that integrate designs using different commercial suppliers and silicon technologies.  CHIPS will therefore pursue standardized interfaces for integrating a variety of Intellectual Property (IP) blocks in the form of prefabricated chiplets.  The chiplets could be reused across applications, manufacturers, and transistor types, allowing DoD to amortize IC design costs across programs, better align electronics design and fabrication with military performance goals, and expand beyond its traditional reliance on the proprietary capabilities of a few on-shore manufacturers.  The CHIPS program moved from Project ELT-01, Electronic Technology, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete module design activities to determine performance and program benefits of new processes enabled by the program.\n-  Initiate fabrication of approved modules to determine performance and program benefits of new processes enabled by the program.\n-  Continue the study of the system level impact of IP re-use for the optimal use of digital functional blocks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.800"
                                            },
                                            "Text": {
                                                "val": "-  Complete module fabrication and testing to demonstrate functionality of the CHIPS interface and chiplets in representative applications.\n-  Initiate design of upgraded modules to determine performance and program benefits of new processes enabled by the program.\n-  Complete the study of the system level impact of IP re-use for the optimal use of digital functional blocks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects the program shifting from module design to module fabrication."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Security Integrated Through Hardware and firmware (SSITH)"
                                    },
                                    "Description": {
                                        "val": "The System Security Integrated Through Hardware and firmware (SSITH) program seeks to secure DoD and commercial electronic systems against cybersecurity threats by developing novel hardware\/firmware security architectures and hardware design methodologies.  Current responses to cybersecurity attacks typically consist of developing and deploying software patches to address specific vulnerabilities in a software firewall without addressing potential vulnerabilities in the underlying hardware architecture.  To address this challenge, SSITH will drive new research in electronics hardware security and exploit current research in areas such as cryptographic-based computing and hardware verification.  Implementation of these advanced ideas has been enabled by the extremely capable semiconductor technology driven by Moore's Law.  The program will also investigate flexible hardware architectures that adapt to and limit the impact of new cybersecurity attacks.  Finally, SSITH will seek to mitigate the potential negative impact of new security protection architectures on system performance and power usage.  Once developed, SSITH capabilities will be applicable to both commercial and military electronic systems.  The SSITH program moved from Project IT-03, Information Assurance and Survivability, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.790"
                                            },
                                            "Text": {
                                                "val": "-  Implement new hardware architectures on Field-Programmable Gate Array (FPGA) demonstration platforms that demonstrate scalable, flexible, and robust protection against external attacks on embedded and mobile processing hardware.\n-  Utilize simulation and hardware emulation to confirm the expected improvement in protection of the new hardware architectures relative to current software only protection.\n-  Evaluate SSITH security approaches through independent Red Team attack on the security architectures as implemented on FPGA hardware."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "-  Implement new hardware architectures on FPGA demonstration platforms that demonstrate scalable, flexible, and robust protection against external attacks on high-performance, out-of-order processing hardware.\n-  Develop distribution-ready design tools to implement SSITH hardware protection methods in new hardware.\n-  Utilize simulation and emulation to evaluate the tradeoffs between security, power, and performance of hardware.\n-  Formalize security metrics and establish a clear distribution mechanism for those metrics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects the program transitioning from implementing hardware design to testing hardware."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hierarchical Identify Verify Exploit (HIVE)"
                                    },
                                    "Description": {
                                        "val": "The Hierarchical Identify Verify Exploit (HIVE) program will pursue new hardware architectures and algorithms for improving the efficiency of graph and sparse data analytics.  When developing operationally significant intelligence, human analysts today are forced to reduce the scope of the problems that they can address and the tempo of their analyses due to the limitations of currently deployed hardware.  Because of these limitations the amount of information gathered is quickly outstripping the human ability to review, process, fuse, and interpret.  To resolve this challenge, HIVE seeks to leverage improvements in computational efficiency to augment the analyst's ability to integrate large streams of data.  The program will investigate advances in chip architecture and data analytics algorithms that can allow machines to infer meaning out of data based on the information needs of the warfighter.  Program success would therefore enable the warfighter to understand far more of the battlespace in real time.  The HIVE program moved from Project IT-02, High Productivity, High Performance Responsive Architectures, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.600"
                                            },
                                            "Text": {
                                                "val": "-  Improve the toolsets based on information gathered from previous testing and deliver a beta version of the software.\n-  Expand the code sets and code set analysis for final detailed power and performance analysis.\n-  Develop initial full architectural design and detailed performance analysis to drive final design decisions.\n-  Demonstrate that HIVE can run DoD problem sets on field programmable gate arrays (FPGAs) which emulate the HIVE chip and measure both power and performance improvements of the proposed architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.510"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of the FPGA emulator and porting of government workflows. \n-  Finalize the HIVE chip architecture and deliver design for fabrication.\n-  Complete application programming interface for HIVE runtime environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease is the result of development work on architectural design concluding and focusing on delivering final design for fabrication."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Digital RF Battlespace Emulator (DRBE)"
                                    },
                                    "Description": {
                                        "val": "The Digital RF Battlespace Emulator (DRBE) program aims to develop a large-scale, interactive, emulated radiofrequency (RF) environment, providing the DoD with much needed capability to cost-effectively evaluate adaptive, intelligent, and spatially distributed next-generation RF systems.  Current U.S. test infrastructure is no longer able to successfully exercise RF systems in relevant environments, which should account for hundreds of DoD systems coordinating against hundreds of adversary systems.  Due to the critical dependency of nearly all platforms and missions on the RF spectrum and the increasingly advanced RF capabilities of peer adversaries, current infrastructure limitations represent a critical capability gap.  Existing test approaches are either: 1) small-scale laboratory tests under well controlled but unrealistic conditions or 2) massive training exercises, which occur at most annually due to the required cost and manpower and do not fully collect necessary data.  To overcome these limitations, DRBE will leverage advances in massively multi-core computing hardware and high-bandwidth digital cross connects to emulate realistic RF environments that account for RF platform movement, signal propagation effects and delays, signal interference, and interactions between RF systems.  The electronics architecture which supports these goals is beyond anything that exists today, based on the power and latency requirements that this emulation environment demands.  DRBE will pursue three technical thrust areas: architecture, massively multi-core computing, and scenario modeling.  The resulting test environment should allow plug-and-play connections for hundreds of RF systems in a 100 km battlespace test.  Multi-system exercises could then be quickly executed through many different combat scenarios and variations. DRBE should therefore serve to develop CONOPS, inform battle plans, and fine-tune the performance of both individual and large groups of RF systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct architecture scaling analysis to define a solution supporting hundreds of RF systems.\n-  Demonstrate basic physical building blocks that will be able to handle the immense throughput expected."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete first-generation DRBE system design.\n-  Emulate first-generation DRBE system performance using non-real-time software.\n-  Begin fabrication of a first-generation DRBE system.\n-  Begin development and testing of second-generation DRBE basic physical building blocks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects the program shifting from design to beginning fabrication of the DRBE system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Circuit Realization At Faster Timescales (CRAFT)"
                                    },
                                    "Description": {
                                        "val": "The Circuit Realization At Faster Timescales (CRAFT) program will develop novel integrated circuit (IC) design flows to reduce by ten times the design and verification effort required for high-performance military electronics.  CRAFT will also reduce barriers to the design and fabrication of custom ICs in leading-edge complementary metal oxide semiconductor (CMOS) technology. When selecting electronics for advanced systems, DoD currently must choose between high-performing custom ICs that take years to design and verify or significantly lower-performing general purpose ICs that can be implemented in a few months.  The need to protect sensitive IC information further limits DoD's ability to access certain leading-edge commercial electronics.  To reduce the design and verification effort, CRAFT will investigate and leverage novel design flows that utilize recent advances in electronic design automation and software design methodologies.  These design flows could reduce the manual labor required to develop and verify custom ICs.  CRAFT will also explore increased design reuse and flexibility, which will allow DoD to migrate chip fabrication between different foundries or to more advanced technology nodes.  The CRAFT program moved from Project ELT-01, Electronic Technology, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.400"
                                            },
                                            "Text": {
                                                "val": "-  Complete the fourth multi-project wafer shuttle run utilizing the final CRAFT design flows.\n-  Finalize the design vault to facilitate access to the CRAFT design flow and related IP for DoD use.\n-  Utilize design flow and intellectual property (IP) from CRAFT to complete DoD reference designs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Near Zero Energy RF and Sensor Operations (N-ZERO)"
                                    },
                                    "Description": {
                                        "val": "The Near Zero Power RF and Sensor Operations (N-ZERO) program will develop and demonstrate the technologies required to extend the lifetimes of remotely-deployed sensors from months to years.  Today's state-of-the-art sensors can be pre-placed and remain dormant until awoken by an external trigger or stimulus.  However, the active electronics that monitor for external triggers consume power, limiting sensor lifetimes to between weeks and months.  N-ZERO seeks to replace these electronics with passive or extremely low-power devices that continuously monitor the environment and wake up active electronics upon detection of a specific trigger.  This would eliminate or significantly reduce standby power consumption, ensuring that sensor lifetimes are limited only by the power required to process and communicate confirmed events.  In doing so, N-ZERO could enable wireless sensors with drastically increased mission life and help meet DoD's unfulfilled need for a persistent, event-driven sensing capability.  N-ZERO's applied research component will focus on developing radio frequency (RF) communications and physical sensor systems that use energy from an external trigger to collect, process, and detect useful information while rejecting spurious signals and noise.  A basic research component is budgeted under PE 0601101E, Project ES-01.  The N-ZERO program moved from Project ELT-01, Electronics Technology, in FY 2019."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Design, implement and test signal processing to improve the detection and classification capabilities of N-ZERO sensor systems in the presence of significant background interference.\n-  Facilitate transition opportunities for microsystems enabling passive or near zero energy collection, processing and detection of RF communications and physical sensor signatures at reduced signal strength.\n-  Continue the development of near zero power wireless wake-up sensors for health monitoring of high-value machinery for aerospace applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}