{
    "id": "2020-AirForce-PB-3600-MJBOOK-3-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-26",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305206F"
        },
        "ProgramElementTitle": {
            "val": "Airborne Reconnaissance Systems"
        },
        "R1LineNumber": {
            "val": "255"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.450"
            },
            "CurrentYear": {
                "val": "195.334"
            },
            "BudgetYearOne": {
                "val": "122.909"
            },
            "BudgetYearOneBase": {
                "val": "122.909"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "73.719"
            },
            "BudgetYearThree": {
                "val": "66.459"
            },
            "BudgetYearFour": {
                "val": "67.980"
            },
            "BudgetYearFive": {
                "val": "43.444"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY21 funds\/activities for Agile ISR, Next-Generation Sensors and Sensors Open System Architecture will be in their own BPAC in order to provide greater visibility and transparency into these activities. These transferred efforts (SOSA, Next-Generation Sensors and Agile ISR) will not be new starts."
        },
        "ProgramElementMissionDescription": {
            "val": "The purpose of Airborne Reconnaissance System (ARS) Program is to develop, mature, demonstrate, and rapidly transition next-generation, persistent, wide area surveillance and common imagery reconnaissance sensor capabilities (active and passive systems), including sensor data processing, for multiple airborne platforms, as well as sensor products to aid in rapid targeting (geolocation models, sensor based exploitation tools, sensor networking capabilities). It provides for modeling\/simulation, training and systems engineering. This program also coordinates the development of common collection, processing, and dissemination solutions for near real time Intelligence, Surveillance, and Reconnaissance (ISR). Airborne Sensors for ISR (ASI) efforts are set by the Geospatial Intelligence (GEOINT) Capabilities Working Group (GCWG), for the goal of building a comprehensive GEOINT capability for the USAF. On an annual basis, developmental technologies are reviewed against warfighter capabilities within the Challenging Targets Initial Capabilities Document and requirements based on strategic roadmaps and ASI efforts. Efforts advancing the technological maturity of promising sensors and processing capabilities are reviewed and prioritized into a recommended list for senior executive direction to implement in the coming year. ASARS 2B efforts include, but are not limited to, development, design, fabrication, integration, demonstration, test and transition of high altitude, deep look ISR radar.\n\nActivities also include studies and analysis to support both current program planning and execution and future program planning. \nThis activity also funds Sensors Open Systems Architecture (SOSA), which coordinates the development of advanced technologies open architecture development for sensor modalities such as RADAR, SIGINT, EW, communications and EO\/IR in support of multiple airborne reconnaissance platforms, both manned and unmanned.  Funding in this activity also supports Detection Removal and Characterization Operation (DRACO) and Agile ISR, to develop a robust image quality improvement capability for airborne synthetic aperture radar products supporting multiple platforms at high, medium, and low altitudes. Additionally, funding covers GCWG Secretariat to manage GCWG planning, processes, and establish an Air Force GEOINT architecture. This program element may include necessary civilian pay expenses required to manage, execute, and deliver Airborne Reconnaissance Systems capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.450"
                },
                "CurrentYear": {
                    "val": "175.334"
                },
                "BudgetYearOne": {
                    "val": "184.401"
                },
                "BudgetYearOneBase": {
                    "val": "184.401"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.450"
                },
                "CurrentYear": {
                    "val": "195.334"
                },
                "BudgetYearOne": {
                    "val": "122.909"
                },
                "BudgetYearOneBase": {
                    "val": "122.909"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "15.000"
                },
                "CurrentYear": {
                    "val": "20.000"
                },
                "BudgetYearOne": {
                    "val": "-61.492"
                },
                "BudgetYearOneBase": {
                    "val": "-61.492"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "15.000"
                    },
                    "CurrentYear": {
                        "val": "20.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-61.492"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-61.492"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2018, Gorgon Stare BPAC received a $15.0M Congressional add for Wide-Area Motion Imagery.\nIn FY 2019, Gorgon Stare BPAC received a $10.0M Congressional add for Wide-Area Motion Imagery.\nIn FY 2019, BPAC 674818 received a $10M Congressional add for Sensor Open Systems Architecture.\nIn FY 2020, BPAC 676031, decrease of $95.482M, funds reallocated for higher Air Force priorities.\nIn FY 2020, BPAC 674820, +$33.99M added to cover increased ASARS-2B requirement."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674818"
                    },
                    "ProjectTitle": {
                        "val": "Imaging and Targeting Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.021"
                        },
                        "CurrentYear": {
                            "val": "30.295"
                        },
                        "BudgetYearOne": {
                            "val": "29.729"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.729"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "51.402"
                        },
                        "BudgetYearThree": {
                            "val": "51.092"
                        },
                        "BudgetYearFour": {
                            "val": "51.411"
                        },
                        "BudgetYearFive": {
                            "val": "31.728"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The purpose of the Imaging and Targeting Support (I&TS) \/ Agile ISR is to develop, mature, demonstrate, and rapidly transition next-generation, persistent, wide area surveillance and common imagery reconnaissance sensor capabilities (active and passive systems), including sensor data processing, for multiple airborne platforms, as well as sensor products to aid in rapid targeting (geolocation models, sensor-based exploitation tools, sensor networking capabilities).\n\nDevelopmental efforts pursued include but are not limited to: Radar, Electro-Optical\/Infrared, hyperspectral imagery (HSI), Lidar\/Ladar, and other technologies to improve measurement and signature intelligence, polarimetric imaging, ground moving target indicator (GMTI), maritime search\/track, foliage penetration, nuclear event detection, and other modalities; increased geolocation accuracy; increased dismount detection capability; advanced sensor data correlation; automated target detection; network centric warfare; and other ISR and associated planning and direction; collection; processing and exploitation; analysis and production; and dissemination capabilities. These efforts are intended to reduce both target search and kill chain timelines as well as supporting traditional intelligence activities. This project will also increase interoperability by developing common standards and interfaces.\n\nThe funds in this project are distributed in priority order, as supported by the Challenging Targets Initial Capabilities Document and set by the GCWG, for the goal of building a comprehensive GEOINT capability for the USAF. On an annual basis, developmental technologies are reviewed against warfighter capabilities and requirements based on strategic roadmaps and the results of the ASI AoA as prefaced in the Challenging Targets Initial Capabilities Document. Efforts advancing the technological maturity of promising sensors and processing capabilities are reviewed and prioritized into a recommended list for senior executive direction to implement in the coming year. ASARS-2B efforts include but are not limited to development, design, fabrication, integration, demonstration, test, and transition of high altitude, deep look ISR radar.\n\nInclusive in I&TS is the Distributed Common Ground\/Surface Systems Automated Target Recognition (ATR) effort to further mature a robust capability to detect all classes of targets through camouflage. \n\nThe purpose of DRACO is to create a robust Image Quality improvement capability for Airborne Synthetic Aperture Radar (SAR) products.  All other details are classified.  The software resided in multiple locations on the ground supporting the Air Force, Army, Navy and other customers DRACO efforts include but are not limited to development, design, fabrication, integration, demonstration, test and transition of image quality improvement capabilities and airborne SAR Sensors. \n\nThe Sensor Open System Architecture (SOSA) program coordinates the development of advanced technologies open architecture development for the following modalities of sensors, such as RADAR, SIGINT, EW, Communications and EO\/IR (development of standards and open architecture interfaces for Software, Hardware, and Electrical\/Mechanical interfaces in support of multiple airborne reconnaissance platforms, both manned and unmanned.  Its objectives are to develop, demonstrate, and rapidly upgrade\/iterate advanced interoperable, multi-platform solutions to reduce the find, fix, target, and track kill chain timeline, and to provide safe separation and collision avoidance for remotely piloted aircraft through development of abstraction interfaces for sense (RADAR, ADS-B, TCAS, etc….) and avoid logic. The program also coordinates the development of common collection, processing, and dissemination solutions for near real time intelligence, surveillance, and reconnaissance.  The SOSA program also increases interoperability by developing common standards and interfaces, as well as leveraging industry participation towards creating COTS solutions such as common C4ISR processor, AgilePOD interfaces, Red\/Black separation on the sensor, data at rest, and security\/anti-tamper (AT) with industry partners and other DOD services\n\n\nThe project is designed to support development of next generation of sensors driven by Airborne Sensors for ISR (ASI) Analysis of alternatives (AoA), as prefaced in the Challenging Targets Initial Capabilities Document( Next Generation Sensors), as well as AFLCMC\/WI\/WN\/WW program of record needs.  As part of the development effort SOSA will be funding and supporting first article development of key open architecture solutions to validate\/verify open specifications as well as to prime the COTS vendors development strategies.  SOSA will also stand up AFLCMC SIL for Sensors Open System Architectures to establish a strong conformance\/compliance program with industry partners for COTS products in partnership with other DOD Services. \n\nActivities also include studies and analysis to support both current program planning and execution and future program planning. This program element may include necessary civilian pay expenses required to manage, execute, and deliver technology and sensor capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Sensor Open System Architecture (SOSA)"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "- Continue work with other Services in producing SOSA snapshots based on current set of USAF needs."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Agile ISR"
                                    },
                                    "Description": {
                                        "val": "Mold current and future ISR into a platform agnostic, non-proprietary, autonomous Multi-INT fusion and cross cuing solution that is designed based on mission requirements.  Sensors will have to penetrate up to highly contested domains and survive to operate. This project will also increase interoperability by developing common standards and interfaces for mission and sensor systems. Through the AoA execution, the solution set will improve requirements and the development path for High Altitude SAR (ASARS), Next Generation Sensors, DRACO, SOSA, as well as other GCWG approved projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.021"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.372"
                                            },
                                            "Text": {
                                                "val": "- Continue Section 804 efforts and execute various ATD efforts including, but not limited to Triple Raven which supports Tech Maturation and Risk Reduction (TMRR), and M&S to mold current and future ISR into a platform agnostic, non-proprietary, autonomous Multi-INT fusion and cross cuing solution that is designed based on mission requirements. This includes but not limited to Next Generation Sensors, Detection Removal and Characterization Operation (DRACO), Sensor Open System Architecture (SOSA), and other GCWG approved projects. \n- Increase interoperability by developing common standards and interfaces.\n- Will continue support development of AgilePOD internal electrical\/mechanical interfaces.  \n- Utilize ASI AoA and its prioritized list of current and future sensor combinations multiple CDD development will begin.\n- Continue further work with other Services in producing SOSA V 1.0 snapshots based on current set of USAF needs. \n- Will continue fielding deliveries for DRACO capabilities to the National Air and Space Intelligence Center (NASIC and within the Distributed Common Ground System (DCGS) weapon System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.404"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.404"
                                            },
                                            "Text": {
                                                "val": "- Will continue Section 804 efforts and execute various ATD efforts including, but not limited to Triple Raven which supports Tech Maturation and Risk Reduction (TMRR), and M&S to mold current and future ISR into a platform agnostic, non-proprietary, autonomous Multi-INT fusion and cross cuing solution that is designed based on mission requirements. This includes but not limited to Next Generation Sensors, Detection Removal and Characterization Operation (DRACO), Sensor Open System Architecture (SOSA), and other GCWG approved projects. \n- Will increase interoperability by developing common standards and interfaces.\n- Will continue support of C-ABSAA Technology Maturation and risk reduction phase \n- Will continue first article development of SOSA, SAR\/SIGINT prototype\n- Will continue support development of AgilePOD internal electrical\/mechanical interfaces\n- Will continue further work with other Services in producing SOSA V 1.0 snapshots based on current set of USAF needs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 increased to match estimated costs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ASARS-2B"
                                    },
                                    "Description": {
                                        "val": "Develop\/design\/fabricate\/integrate\/demonstrate\/test and field deep look high altitude ISR radar capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.923"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop\/design\/fabricate\/integrate\/demonstrate\/test and field deep look high altitude ISR radar capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.325"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.325"
                                            },
                                            "Text": {
                                                "val": "- Will continue to develop\/design\/fabricate\/integrate\/demonstrate\/test and field deep look high altitude ISR radar capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased to match estimated costs for ASARS-2B operationalization"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 0305202F"
                                    },
                                    "Title": {
                                        "val": "Dragon U-2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "34.486"
                                        },
                                        "CurrentYear": {
                                            "val": "48.518"
                                        },
                                        "BudgetYearOne": {
                                            "val": "38.939"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "38.939"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.694"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.347"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.849"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.206"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 0305206F"
                                    },
                                    "Title": {
                                        "val": "Airborne Reconnaissance Systems"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "66.443"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "66.443"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "48.204"
                                        },
                                        "BudgetYearThree": {
                                            "val": "72.340"
                                        },
                                        "BudgetYearFour": {
                                            "val": "28.108"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.880"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "230.975"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "A portion of the funding within the U-2 RDT&E line will be used to advance ASARS development \/ design\/fabrication\/integration\/demonstration\/testing and fielding deep look high altitude ISR radar capabilities."
                        },
                        "AcquisitionStrategy": {
                            "val": "Imaging and Targeting Support and Agile ISR efforts are prioritized on an annual basis by the GCWG, in accordance with the validated gaps in the Challenging Targets Initial Capabilities Document. Resulting funded efforts are then contracted for and\/or executed by either various program offices, laboratories, industry, and\/or other government agencies.\n\nASARS \/ High Altitude SAR technology maturation is conducted by Air Force Life Cycle Management Center\/Intelligence, Surveillance, and Reconnaissance and Special Operations Forces (AFLCMC\/WIN), in conjunction and cooperation with AFLCMC\/HBG (Robins AFB) for test support.\n\nAcquisition strategy is to maximize commercial and national development efforts and investment through multiple contracting methods, including the use of engineering change proposals to modify existing contracts and new contracts that were awarded both competitively or on a sole source basis."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SOSA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.523"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.683"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.683"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "DRACO"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "King of Prussisa, PA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.849"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.721"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.721"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ASARS-2B operationalization"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.124"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.256"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.256"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "170.430"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "NGS PMA: Other Govt Cost"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.021"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.799"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.069"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.069"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Imaging and Targeting Support"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Advance Airborne PCPAD Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-SOSA"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- DRACO"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Other Technology Efforts (Prioritized by GCWG)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ASARS-2B"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "ASARS-2B NRE, test, required activities for operationalization"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- NRE Contract Award (Feb 2019)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- PDR (Oct 2019)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- CDR (Jun 2020)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "- Testing (Combined Developmental\/Operational)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "674820"
                    },
                    "ProjectTitle": {
                        "val": "Sensor Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "43.681"
                        },
                        "BudgetYearOne": {
                            "val": "82.724"
                        },
                        "BudgetYearOneBase": {
                            "val": "82.724"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "9.191"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "135.596"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Additional funds for ASARS-2B efforts reside in Project 674818."
                        },
                        "ProjectMissionDescription": {
                            "val": "The purpose of this effort is to complete ASARS-2B Technical Demonstration and continue ASARS design, development, testing and fielding of deep look high altitude ISR radar capabilities based on requirements in the U-2 Operational Requirements Document and approved AF Form 1067s.\n\nActivities also include studies and analysis to support both current program planning and execution as well as future program planning. \nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver Airborne Reconnaissance Systems capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Synthetic Aperture Radar System (ASARS)-2B"
                                    },
                                    "Description": {
                                        "val": "Develop\/design\/fabricate\/integrate\/demonstrate\/test and field deep look high altitude ISR radar capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "43.681"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop\/design\/fabricate\/integrate\/demonstrate\/test and field deep look high altitude ISR radar capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "82.724"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "82.724"
                                            },
                                            "Text": {
                                                "val": "- Will continue to Develop\/design\/fabricate\/integrate\/demonstrate\/test and field deep look high altitude ISR radar capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased to match estimated costs for ASARS-2B operationalization"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 0305202F"
                                    },
                                    "Title": {
                                        "val": "Dragon U-2 (JMIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "34.486"
                                        },
                                        "CurrentYear": {
                                            "val": "48.518"
                                        },
                                        "BudgetYearOne": {
                                            "val": "38.939"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "38.939"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.694"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.347"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.849"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.206"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 0305206F"
                                    },
                                    "Title": {
                                        "val": "Airborne Reconnaissance Systems"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "66.443"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "66.443"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "48.204"
                                        },
                                        "BudgetYearThree": {
                                            "val": "72.340"
                                        },
                                        "BudgetYearFour": {
                                            "val": "28.108"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.880"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "230.975"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "A portion of the funding within the U-2 RDT&E line will be used to advance ASARS development \/ design\/fabrication\/integration\/demonstration\/testing and fielding deep look high altitude ISR radar capabilities."
                        },
                        "AcquisitionStrategy": {
                            "val": "ASARS \/ High Altitude SAR technology maturation is conducted by Air Force Life Cycle Management Center\/Intelligence, Surveillance, and Reconnaissance and Special Operations Forces (AFLCMC\/WIN), in conjunction and cooperation with AFLCMC\/HBG (Robins AFB) for test support.\nAcquisition strategy is to maximize commercial and national development efforts and investment through multiple contracting methods, including the use of engineering change proposals to modify existing contracts and new contracts that were awarded both competitively or on a sole source basis."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ASARS-2B operationalization"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "43.681"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "82.724"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "82.724"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "ASARS-2B"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "ASARS-2B NRE, test, required activities for operationalization"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- NRE Contract Award (Feb 2019)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- PDR (Oct 2019)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- CDR (June 2020)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-- Testing (Combined Developmental\/Operational)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675092"
                    },
                    "ProjectTitle": {
                        "val": "JTC\/SIL MUSE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.429"
                        },
                        "CurrentYear": {
                            "val": "3.454"
                        },
                        "BudgetYearOne": {
                            "val": "3.521"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.521"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.580"
                        },
                        "BudgetYearThree": {
                            "val": "3.653"
                        },
                        "BudgetYearFour": {
                            "val": "3.720"
                        },
                        "BudgetYearFive": {
                            "val": "3.786"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Multiple Unified Simulation Environment (MUSE) is the DoD simulation\/training system of choice for many Unmanned Aircraft Systems (UAS), RPA, and ISR systems. MUSE is also know as the Air Force Synthetic Environment for Reconnaissance and Surveillance (AFSERS) in its Air Force Application. The MUSE\/AFSERS is a software suite that simulates ISE & strike systems, tailored air vehicle & data links, and visualization systems used for payload product outputs-including Full Motion Video (FMV), Still Frame Imagery, or GMTO data. Air vehicles, sensors, datalinks, takeoff and landing systems, and to some degree, surrogate UAS and RPA ground stations, when actual ground stations are unavailable. FMV, still frame imagery, or GMTI data are provided. Outputs are compliant with applicable DoD standards and are continually tested against actual ground ISR processors to ensure interoperability with over 40 systems within DoD.  \n\nThe Services and combatant commanders have a requirement for the capability to train with a system that provides a real-time simulation environment containing multiple intelligence systems that can be integrated with larger force-on-force simulations. The MUSE\/AFSERS creates a realistic operational environment which supports the ability to assess military utility, architecture and concept of employment development, and Tactics, Techniques, and Procedures refinement, conduct emerging concepts experimentation, and optimize C4ISR within warfighting exercises and experiments. It is the preferred simulation system used by the combatant commanders and Joint Services to support command and battle staff C4ISR training.\n\nThe MUSE\/AFSERS also creates a realistic operational environment that supports: an embedded training capability for multiple Program Managers; tools to minimize acquisition and life cycle cost and schedule impacts; ability to conduct emerging concepts experimentation, future systems exploration, systems integration, and technology insertion; applications for Joint and Service-specific warfighting exercises; and C4ISR optimization.\n\nMUSE\/AFSERS is currently in use within all Services and most unified commands simulating MQ-1, MQ-9, RQ-4, MQ-1C, M\/RQ-5, RQ-7, national and commercial satellite collectors, P-3, E-8, and the U-2. During warfighting exercises, the AFSERS provides imagery simulations with associated C4ISR systems to support the execution of critical imagery processes. The MUSE\/AFSERS is also used as a mission rehearsal tool for current, on-going military combat operations.\n\nThe Joint Technology Center\/Systems Integration Laboratory (JTC\/SIL) is the center of excellence that supports the UAS and RPA programs within the services by providing the system engineering, test and integration, interoperability, rapid technology insertion and training to address MUSE\/AFSERS requirements. For those assets normally not available for training, the JTC\/SIL provides surrogate systems and interfaces. The JTC\/SIL contributes to the distributed training environments, virtually linking participants from various locations worldwide, and are routinely supported within the MUSE architecture.\n\nActivities also include studies and analysis supporting current and future program planning and project execution. This program element may include necessary civilian pay expenses required to manage, execute, and deliver Airborne Reconnaissance Systems capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Force Synthetic Environment for Reconnaissance and Surveillance (AFSERS) Development"
                                    },
                                    "Description": {
                                        "val": "DoD's simulation\/training system of choice for Intelligence Surveillance and Reconnaissance systems, sensors, and platforms. Includes AFSERS, Common Ground Station Interface, and infrastructure support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.429"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.454"
                                            },
                                            "Text": {
                                                "val": "- Continue integration of NVIG into the Modeling & Simulation domain as it pertains to unmanned aircraft systems simulation. Terrain, and model development for NVIG and Virtual Reality Scene Generator to increase fidelity. \n- Continue support of theater level exercises: Ulchi Freedom Guardian, Key Resolve and Pacific Sentry-mods from exercises.\n- Continue to support improvement of mapping capability that facilitates 64 Bit, RMF accredited execution. \n- Continue redesign Windows Entity Server and NetLink to improve network routing, thus lessening bandwidth consumption. \n- Continue incorporate Common Image Generator Interface to provide an Image Generator (IG) agnostic solution to allow other IGs to be supported. \n- Continue to implement tactical protocols into the simulation domain to enhance interoperability. \n- Continue to refine the implementation of Hands on Throttle and Stick joystick.\n- Continue to analyze the redesign of VIPRS editor to fit current architecture.\n- Continue to address DoD standards and compliance to keep current with real world systems.\n- Continue to address ongoing modifications, test and integration for use in federation environment \n- Continue to address ongoing requirements from AFSERS User Working group based on available funding and time frame."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.521"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.521"
                                            },
                                            "Text": {
                                                "val": "- Will continue integration of Moving Target Indicator\/Synthetic Aperture Radar payload models and the Vehicle and Dismount Exploitation Radar into MUSE \n- Will continue development\/integration of multi-sensor payload simulations to support training missions \n- Will continue development of realistic simulated aircraft & payload behavior in a jamming\/electronic warfare environment \n- Will continue integration of Night Vision Image Generator and Virtual Reality Scene Generator into the Modeling & Simulation domain as it pertains to UAS simulation, terrain and model development\n- Will continue to support theater level exercises and events to include but not limited to Ulchi Freedom Guardian, Yama Sakura, Key Resolve, Talisman Saber, Pacific Sentry, integration\/validation events, and government acceptance tests\n- Will continue redesign of Connect and Netlink routing software to improve network routing and large data feeds\n- Will continue work on Vignette Planning & Rehearsal Software to include improved user interface, Semi-Automated Forces capability, and vignette building tools \n- Will continue work on architecture optimization, to facilitate extensibility and scalability.\n- Will continue movement towards standards based Unmanned Aerial System (UAS) simulation support\n- Will continue integration and improvement of Link 16 capabilities \n- Will continue to address ongoing requirements from AFSERS User Working group based on available funding and time frame"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Small inflation related increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 PE 0305204A"
                                    },
                                    "Title": {
                                        "val": "Tactical Unmanned Aerial Vehicles"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.712"
                                        },
                                        "CurrentYear": {
                                            "val": "4.748"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.954"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.954"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.833"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.327"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.244"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.099"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is an enterprise services effort, jointly funded and centrally managed by the US Army.   AFLCMC\/WIN MIPRs funds in support of Unmanned Aircraft Systems modeling and simulation efforts."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AFSERS Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Redstone Arsenal"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.429"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.454"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.521"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.521"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "JTC\/SIL MUSE"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "AFSERS Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675291"
                    },
                    "ProjectTitle": {
                        "val": "Gorgon Stare"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.000"
                        },
                        "CurrentYear": {
                            "val": "10.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Gorgon Stare system is a podded airborne sensor suite that provides city-sized wide area airborne surveillance and is integrated on specially-modified MQ-9 Reaper Remotely Piloted Aircraft (RPA).  The Air Force Requirements Oversight Council (AFROC) approved Air Combat Command's recommendation to transition Gorgon Stare from a Quick Reaction Capability (QRC) to an Air Force Enduring Capability in November 2014.  Gorgon Stare's requirements are documented in the Gorgon Stare Wide Area Airborne Sensor Capabilities Development Document (draft).  The acquisition strategy for this Air Force podded sensor suite solution is sustainment of the currently fielded capabilities with any upgrades implemented via validated -1067s or Urgent Operational Needs.\n\nDevelopment efforts conducted with FY 2015 Congressionally added funds included efforts focused primarily on the development of a Beyond Line of Sight (BLOS) capability in support of an Urgent Operational Need.  Development efforts conducted with FY 2016 Congressionally added RDT&E funds included further development and system integration lab testing of Near Vertical Direction Finding (NVDF) with Gorgon Stare Increment 2 Wide Area Motion Imagery (WAMI) sensors.  Funds spent on NVDF will provide a ramp for future airborne integration efforts as required.  Development efforts conducted with FY 2017 Congressionally added funds further progressed efforts associated with BLOS, to include first article testing for phase 1 and a limited BLOS capability expected to deliver to the field in FY 2019. Development efforts conducted with FY 2018 Congressionally added funds include but are not limited to efforts to further develop the design and implementation of the next BLOS phase to enable freedom of maneuverability and initial development of system imagery improvements in support of a MAJCOM validated -1067.  Development efforts conducted with FY 2019 Congressional added funds include but are not limited to; completing BLOS Phase II system design and aircraft certification to enable full freedom of maneuverability; completing imagery improvements in support of a MAJCOM validated -1067 and continuation of data automation through Area of Interest (AOI) tagging and tracking efforts.\n\nActivities also include studies and analysis to support both current program planning and execution as well as future program planning.  \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver Gorgon Stare capabilities.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F and 0605833F."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Gorgon Stare"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "- Completed fielding of a limited BLOS capability.\n- Began initial development of system imagery improvements in support of a MAJCOM validated -1067.\n- Began initial development of the next phase of BLOS capability."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "- Completes development of a BLOS Phase II capability.\n- Completes system imagery improvements in support of a MAJCOM validated -1067.\n- Ensures continuation of data automation through Area of Interest (AOI) tagging and tracking efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 05 PRDTB3"
                                    },
                                    "Title": {
                                        "val": "MQ-9 UAS Payloads"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "16.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.800"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "19.800"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "35.800"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 DARP01"
                                    },
                                    "Title": {
                                        "val": "Airborne Reconnaissance Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "7.500"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.500"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "1.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "9.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The wide area airborne surveillance requirement is being delivered via the Gorgon Stare podded WAMI sensor suite integrated on dedicated, specially modified MQ-9 Reaper RPA.  Gorgon Stare transitioned from a QRC to an Air Force Enduring Capability under AFROC authority in November 2014. The program is executed by the 645th Aeronautical Systems Group, Intelligence, Surveillance, and Reconnaissance and Special Operations Forces Directorate as a post-MS C program.  The sensor suite will be sustained in its current configuration. Any future capability upgrades will be fielded as a result of validated -1067s or Urgent Operational Needs."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Gorgon Stare System Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sierra Nevada Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sparks, NV"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "15.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "25.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Gorgon Stare"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Area of Interest Tagging"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Beyond Line of Sight Phase 1 Fielding"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Beyond Line of Sight Phase 2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Image Quality Enhancements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Gorgon Stare will continue operations as required using sustainment funding."
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "675382"
                    },
                    "ProjectTitle": {
                        "val": "Wide Area Motion Imagery (WAMI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.001"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.001"
                        },
                        "BudgetYearFive": {
                            "val": "0.001"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "676025"
                    },
                    "ProjectTitle": {
                        "val": "Data Compression"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.879"
                        },
                        "BudgetYearOne": {
                            "val": "6.935"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.935"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "9.545"
                        },
                        "BudgetYearThree": {
                            "val": "11.714"
                        },
                        "BudgetYearFour": {
                            "val": "12.848"
                        },
                        "BudgetYearFive": {
                            "val": "7.929"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "RDUCE provides the warfighter a capability to efficiently compress and decompress airborne Intelligence, Surveillance, and Reconnaissance  ISR sensor data and transmit near real time to tactical users through current and future bandwidth limited commercial satellite communications (SATCOM) or military SATCOM. The effort is developing, testing and will implement new sensor data compression and decompression algorithms for current and emerging airborne ISR sensors. Additionally, the program develops compression and decompression capabilities for manned and unmanned airborne platforms, associated ground stations, and Distributed Common Ground System (DCGS). Outputs will meet standard certification for use within the Department of Defense and Intelligence Community (IC) Geospatial Intelligence (GEOINT) and Measurement and Signatures Intelligence architectures.  \n\nActivities also include studies and analysis to support both current and future program planning and execution. This program element may include necessary civilian pay expenses required to manage, execute, and deliver Data Compression sensor capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Data Compression"
                                    },
                                    "Description": {
                                        "val": "The Data Compression effort provides the warfighter a capability to efficiently compress and decompress airborne Intelligence, Surveillance and Reconnaissance (ISR) sensor data and transmit near real time to tactical users through current and future bandwidth limited commercial Satellite Communications (SATCOM) or military SATCOM. The effort will develop, test and implement new sensor data compression and decompression algorithms for current and emerging airborne ISR sensors. Additionally, the program develops compression and decompression capabilities for manned and unmanned airborne platforms, associated ground stations, and the Distributed Common Ground System (DCGS). Outputs will meet standard certification for use within the Department of Defense Geospatial Intelligence and Measurement and Signatures Intelligence architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.879"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop and test our existing data compression capabilities including SAR, Phase History SAR and HSI\/MSI.\n- Develop compression capabilities for other phenomenologies, including, but not limited to, SIGINT, LIDAR, and EO\/IR.\n- Support integration of compression capabilities into operational sensors including, but not limited to, the U2\/ASARS, Global Hawk MP-RTIP\/EISS, and Reaper\/LynxSAR.\n- Continue to develop and test compression and decompression algorithms for other sensor modalities.\n- Continue to develop documentation for DoD and international standards acceptance of our compression capabilities.\n- Continue to provide engineering services for algorithm familiarization, assessment, and improvement.\n- Continue to participate in SOSA (and other open standards) planning and integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.935"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.935"
                                            },
                                            "Text": {
                                                "val": "- Will continue to develop and test our existing data compression capabilities including SAR, Phase History SAR and HSI\/MSI.\n- Will continue to develop compression capabilities for other phenomenologies, including, but not limited to, SIGINT, LIDAR, and EO\/IR.\n- Will continue to support integration of compression capabilities into operational sensors including, but not limited to, the U2\/ASARS, Global Hawk MP-RTIP\/EISS, and Reaper\/LynxSAR.\n- Will continue to develop and test compression and decompression algorithms for other sensor modalities.\n- Will continue to develop documentation for DoD and international standards acceptance of our compression capabilities.\n- Will continue to provide engineering services for algorithm familiarization, assessment, and improvement.\n- Will continue to participate in SOSA (and other open standards) planning and integration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 increased funding supports additional ISR modalities moving to sustainment (e.g. SAR Phase History), as well as development on other modalities such as SIGINT, EO\/IR, and LIDAR."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Date Compression program is conducted by Air Force Life Cycle Management Center\/ Intelligence, Surveillance, and Reconnaissance and Special Operations Forces (AFLCMC\/WIN).  Acquisition strategy is to develop data compression hardware\/software, and data compression standards for various Intelligence, Surveillance, and Reconnaissance platforms to include airborne, ground stations, data storage facilities, and exploitation tools.  RDUCE will utilize existing contracts with full and open competition where appropriate. Integration will be accomplished by the requisite program offices."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LIDAR"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SIGzip Phase II"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.033"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.033"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "New Mode Phase I"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Standardization Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.427"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ADDA Lab"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "COMPASE Lab"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Govt. Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Govt\/Cont: Dayton, OH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various, OH"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.852"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.902"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.902"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "RDUCE"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "-LIDAR"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-New Mode Phase I"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-SIGzip Phase II"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "-COMPASE Lab"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "ADDA Lab"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Standardization Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676031"
                    },
                    "ProjectTitle": {
                        "val": "Dismount Radar"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "103.025"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "103.025"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Dismount Radar (DR) project designs, develops, integrates, tests, fields, and sustains Moving Target Indicator (MTI) capability for improved dismount and moving target detection, identification, tracking, and classification. This sensor will be employed on airborne platforms, such as the MQ-9 Reaper. These efforts will accelerate development of technologies and concept of operations (CONOPS) for Advance Battle Management System (ABMS) battle management command, and ground missions across the range of contested environments.\n\nActivities also include studies, analysis, and technology development, maturation, and demonstration to support current and future program planning and execution. This program element may include necessary civilian pay expenses required to manage, execute, and deliver Airborne Reconnaissance Systems capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DR"
                                    },
                                    "Description": {
                                        "val": "Design, develop, integrate, test, field, and sustain a persistent capability in theater for employment on airborne platforms and various technical studies\/analysis to support future advanced radar development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "103.025"
                                            },
                                            "Text": {
                                                "val": "Award contract to begin design, development, integration, and testing of MTI capability on medium altitude airborne platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds decreased to zero."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DR Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "102.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Govt Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "DR"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Imaging and Targeting Support- Other Technology Efforts (Prioritized by GCWG)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}