{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-4",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602141A"
        },
        "ProgramElementTitle": {
            "val": "Lethality Technology"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "26.961"
            },
            "BudgetYearOneBase": {
                "val": "26.961"
            },
            "BudgetYearTwo": {
                "val": "30.215"
            },
            "BudgetYearThree": {
                "val": "35.294"
            },
            "BudgetYearFour": {
                "val": "36.309"
            },
            "BudgetYearFive": {
                "val": "36.155"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "164.934"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, funding in this Program Element (PE) is being realigned with continuity of effort from the following PEs:\n* 0602105A Materials Technology\n* 0602618A Ballistics Technology\n* 0602624A Weapons and Munitions Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "Work done in this PE researches technologies, methodologies, and models required to enable next generation lethality. The effort focuses on: lethal mechanism technologies for projectiles and warheads that provide revolutionary capability to defeat Tier 1 adversary vehicle and body armors; selection of propulsion and energetic materials and technology to validate novel energetic materials concepts to exploit controllable energy release for future gun\/missile systems; scalable effects for mixed target defeat while simultaneously decreasing warhead mass; development of materials solutions for improvement of weight and volume efficiency, lethal effects and sustainability for the warfighter in the Army of today and beyond; and multiple pathways to enhance lethal effects by investigating synergistic effects of novel micro warheads using advanced materials.  Funding in this PE is a continuation of work done in PEs 0602105A (Materials Technology), 0602618A (Ballistics Technology), and 0602624A (Weapons and Munitions Technology). \n\nWork in this effort complements PEs 0602143A (Soldier Lethality Technology), 0602144A (Ground Technology), 0602145A (Next Generation Combat Vehicle Technology), and 0602147A (Long Range Precision Fires Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States (US) Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "26.961"
                },
                "BudgetYearOneBase": {
                    "val": "26.961"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "26.961"
                },
                "BudgetYearOneBase": {
                    "val": "26.961"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "26.961"
                                },
                                "BudgetYearOneBase": {
                                    "val": "26.961"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 increase related to Science and Technology financial restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AH5"
                    },
                    "ProjectTitle": {
                        "val": "Projectile and Multi-Function Warhead Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.446"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.446"
                        },
                        "BudgetYearTwo": {
                            "val": "3.515"
                        },
                        "BudgetYearThree": {
                            "val": "3.585"
                        },
                        "BudgetYearFour": {
                            "val": "3.657"
                        },
                        "BudgetYearFive": {
                            "val": "3.698"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.901"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned from:\nProgram Element (PE) 0602618A Ballistics Technology\n* Project H80 Survivability and Lethality Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and validates novel lethal mechanism technologies to reduce energy or mass required to defeat emerging armor threats and provide multipurpose options for revolutionary capability to include defeat of advanced Tier 1 adversary vehicle and body armors.\n\nThis research is coordinated with PE 0602141A (Lethality Technology) \/ Project AH7 (Lethal and Scalable Effects Technologies), PE 0602143A (Soldier Lethality Technology \/ Project AY6 (Soldier Squad Small Arms Armaments Technology), and PE 0603462A (Next Generation Combat Vehicle Advanced Technology) \/ Project BF5 (Adv. Lethality & Accuracy System for Med Cal (ALAS-MC) Advanced Technology) and builds upon weapon target interaction research in PE 0601102A Defense Research Sciences \/ Project AA7 (Mechanics and Ballistics).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas  and the Army Modernization Strategy. \n\nWork in this Project is performed by the United States (US) Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defeat of Adversary Vehicle Armors"
                                    },
                                    "Description": {
                                        "val": "This effort designs, models and evaluates longer range, higher velocity munitions though reduction of parasitic mass required to launch and deliver lethality via new composite materials and architecture; Develops higher energy, more lethal cannon (1.5X M256) through modification of blast field. This effort provides testing and modeling and simulation of Lightweight 50mm Armor Piercing round for advanced, direct-fire medium caliber weapons."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.297"
                                            },
                                            "Text": {
                                                "val": "Will develop projectiles that resist ricochet and maintain fragmentation lethality. Demonstrate robust penetrator concept versus threat Tier 1 armor. Demonstrate full scale tank gun muzzle blast mitigation to enable defeat of threat Tier 1 armor."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funds realigned from PE\/Project 0602618A (Ballistics Technology) \/ H80 (Survivability and Lethality Technology) as part of financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defeat of Adversary Body Armor"
                                    },
                                    "Description": {
                                        "val": "This effort designs, models and evaluates defeat mechanisms for adversary body armor through time-resolved penetration mechanics and energy efficient munitions. This effort supports the development of small caliber lethal mechanisms for PE 0602143A (Soldier Lethality Technology) \/ Project AY6 (Soldier Squad Small Arms Armaments Technology)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.149"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.149"
                                            },
                                            "Text": {
                                                "val": "Will develop high fidelity computer models to predict the performance of novel penetrators versus body armors and metallic targets; Perform high spatial and temporal resolution radiographic and phase contrast imaging during ballistic impact of conventional and advanced penetrator systems to assist in computational model calibration, parameterization and validation; Develop and apply new diagnostic techniques to highly transient dynamic impact problems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funds realigned from PE\/Project 0602618A (Ballistics Technology) \/ H80 (Survivability and Lethality Technology) as part of financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AH6"
                    },
                    "ProjectTitle": {
                        "val": "Disruptive Energetics and Propulsion Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "8.275"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.275"
                        },
                        "BudgetYearTwo": {
                            "val": "8.441"
                        },
                        "BudgetYearThree": {
                            "val": "8.61"
                        },
                        "BudgetYearFour": {
                            "val": "8.783"
                        },
                        "BudgetYearFive": {
                            "val": "8.882"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "42.991"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602618A Ballistics Technology:\n* Project H80 Survivability and Lethality Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, models and evaluates energetic material and propulsion technologies to validate novel concepts such as maximizing total energy density and power delivered on target. This Project also optimizes propellant grains for increased range, and altering gun configurations to increase energy on target in order to exploit the controllable\/scalable energy release required for improving effectiveness and reducing vulnerability of future gun\/missile systems. This Project builds upon disruptive energetic materials discovery efforts to synthesize new materials with energy content from 50% to up to five times that of Research Department Explosive (RDX) in PE 0601102A (Defense Research Sciences) \/ Project AA7 (Mechanics and Ballistics).  This Project also leverages the advanced additive manufacture efforts of PE 0602144A (Ground Technology) \/ Project BL1 (Materials and Manufacturing Research Technology).  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas  and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States (US) Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Synthesis, Formulation and Diagnostics of Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "This effort pursues novel approaches to synthesize and scale up disruptive and traditional energetic materials with increased performance as well as design new formulation avenues in order to discover new materials and formulations to extend range and increase effect on target. This effort also investigates and develops revolutionary ways to release energy and characterize energetic behavior at early time and small length scales for rapid determination of detonation and propellant performance parameters to enable a ?fail early, fail often? strategy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.953"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.953"
                                            },
                                            "Text": {
                                                "val": "Will develop new materials and formulations with 50% better performance than current state of the art. Potential molecules for transition as melt cast \/ eutectics formulations are (go\/no-go depending on passing safety, scale-up, and performance parameters). Will utilize previous or currently under development micro-scale diagnostic techniques to characterize and evaluate traditional and disruptive energetic candidates for use as high performing rocket \/ gun propellants or explosive formulations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funds realigned from PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability and Lethality Technology) as part of financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation of Energetics and Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort develops, codes and subsequently employs advanced models to predict multiscale response of energetic materials for both propellant and explosive purposes. Develops new simulation methods for understanding and design of advanced concepts and energetic formulations to rapidly iterate and optimize towards increased range and enhanced lethality"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.752"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.752"
                                            },
                                            "Text": {
                                                "val": "Will incorporate 1) improved predictive software capability for gun interior ballistics design and 2) equation of state and reactivity from first principles into the warhead design continuum software suite. Simulation results will be transitioned to formulators and advanced concept designers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funds realigned from PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability and Lethality Technology) as part of financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Weapon Concepts"
                                    },
                                    "Description": {
                                        "val": "This effort investigates new propellants and grain designs, burn rate\/combustion modifier ingredients, as well as new gun and munition designs for extended range."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.57"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.57"
                                            },
                                            "Text": {
                                                "val": "Will develop and evaluate advanced additively manufactured propellant designs and geometries to produce higher muzzle energy, longer range gun launched munitions. Will evaluate novel nanocrystalline gun barrel coatings for increased temperature\/pressure tolerance produced from Project AH8 Lethality Materials and Processes Technologies"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funds realigned from PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability and Lethality Technology) as part of financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AH7"
                    },
                    "ProjectTitle": {
                        "val": "Lethal and Scalable Effects Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.869"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.869"
                        },
                        "BudgetYearTwo": {
                            "val": "1.058"
                        },
                        "BudgetYearThree": {
                            "val": "1.956"
                        },
                        "BudgetYearFour": {
                            "val": "2.005"
                        },
                        "BudgetYearFive": {
                            "val": "2.037"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.925"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602618A Ballistics Technology:\n* Project H80 Survivability and Lethality"
                        },
                        "ProjectMissionDescription": {
                            "val": "Work in this Project designs, fabricates and evaluates technology options for scaling warhead lethality and providing extreme efficiency for highly effective, simultaneous mixed\/multi target defeat and collateral damage. This Project will also design and evaluate scalable structure defeat to mitigate collateral damage for disruptive urban Warfighting. This research is coordinated with Project AH5 Projectile and Multi-Function Warhead Technologies and Project AH6 Disruptive Energetics and Propulsion Technologies and builds upon disruptive energetic and ballistic sciences research in PE 06011102A Defense Research Sciences \/ Project AA7 Mechanics and Ballistics.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States (US) Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Munition Efficiency and Scalability"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, models and evaluates technologies to produce blast-fragment warheads with tailored fragment geometries to optimize target defeat;  Identifies and develops warhead impact patterns to optimize target defeat with reduced collateral damage; Designs, codes and evaluates technologies for the cost effective, preprogrammed delivery of multiple scalable warheads capable of simultaneously engaging multiple targets. This effort leverages guidance technologies from PE 0602147A (Long Range Precision Fires) \/ Project AH4 (Precision and Coop Weapons in a Denied Env Tech), and metal additive manufacturing from PE 0602144A (Ground Technology) \/ Project BL1 (Materials and Manufacturing Research Technology)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.869"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.869"
                                            },
                                            "Text": {
                                                "val": "Will develop warhead impact patterns to optimize target defeat with minimum energy, reduced number of warheads and minimum collateral damage;  Will additively manufacture and evaluate tailored fragment geometries for optimal target defeat;  Will build upon FY19 progress to evaluate methodologies for tailored warhead delivery. Demonstrate preprogrammed, predefined pattern delivery of three warheads."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funds realigned from PE\/Project 0602618A (Ballistics Technology) \/ Project H80 (Survivability and Lethality Technology) as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AH8"
                    },
                    "ProjectTitle": {
                        "val": "Lethality Materials and Processes Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.954"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.954"
                        },
                        "BudgetYearTwo": {
                            "val": "4.05"
                        },
                        "BudgetYearThree": {
                            "val": "4.113"
                        },
                        "BudgetYearFour": {
                            "val": "4.03"
                        },
                        "BudgetYearFive": {
                            "val": "4.075"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.222"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602105A Materials Technology:\n* Project H84 Material"
                        },
                        "ProjectMissionDescription": {
                            "val": "Work in this Project designs, fabricates, and evaluates, innovative materials solutions aimed at achieving leap ahead increases in lethality and weapons effectiveness through improvements in weight and volume efficiency, lethal effects, and sustainability of military systems. This research is coordinated with Project AH6 (Disruptive Energetics and Propulsion Technology), Project AH7 (Lethal and Scalable Effects Technologies), PE 0602147A (Long Range Precision Fires technology) \/ AH4 (Precision and Cooperative Weapons in a Denied Environment), and builds upon and ballistic sciences research in PE 0601102A (Defense Research Sciences) \/ Project AA7 (Mechanics and Ballistics).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States (US) Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materials for Advanced Lethality"
                                    },
                                    "Description": {
                                        "val": "This effort researches innovative materials aimed at achieving leap-ahead increases in lethality and weapons effectiveness through improvements in weight and volume efficiency, lethal effects, and sustainability of military systems that can only be achieved through advances in materials technology."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.954"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.954"
                                            },
                                            "Text": {
                                                "val": "Will develop three-dimensional woven carbon-carbon (C-C) composite preform and new resins, guided by modeling and simulation, to create low defect C-C composite structures for hypervelocity missile components; will develop 3-dimensional (3D) printable energetic polymers for gun and rocket propellant applications, along with computational capabilities to optimize burn rates and temperature profiles of printed propellant architectures and transition to Project AH6 (Disruptive Energetics and Propulsion Technologies); will create novel materials and processing methods to enable printing of integrated conductive and dielectric structures onto highly maneuverable flight bodies for PE 0602147A (Long Range Precision Fires Technology) \/ AH4 (Precision and Coop Weapons in a Denied Env Tech); will finalize optimal copper-tantalum alloy design and scale-up processing to enable performance demonstrations and for Project AH5 (Projectile and Multi-Function Warhead Technologies)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funds realigned from PE\/Project 0602105A (Materials Technology) \/ H84 (Materials) as part of financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AH9"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Warheads Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "9.417"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.417"
                        },
                        "BudgetYearTwo": {
                            "val": "10.918"
                        },
                        "BudgetYearThree": {
                            "val": "12.37"
                        },
                        "BudgetYearFour": {
                            "val": "12.617"
                        },
                        "BudgetYearFive": {
                            "val": "12.757"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "58.079"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602624A Weapons and Munitions Technology:\n* Project H28 Warheads \/ Energetics Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This effort explores multiple pathways to enhance lethal efforts for future warheads against emerging peer\/near peer target sets. Investigates synergistic effects of novel micro warheads using advance materials.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas  and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States (US) Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materials for Advanced Lethality"
                                    },
                                    "Description": {
                                        "val": "This effort explores multiple pathways to enhance lethal effects for future warheads against emerging peer\/near peer target sets; Investigates synergistic effects of novel micro warheads using advance materials."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.417"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.417"
                                            },
                                            "Text": {
                                                "val": "Will explore multiple pathways to enhance lethal effects and mission kills on a variety of anti-personnel and anti-materiel targets to ensure lethality overmatch in peer\/near-peer engagements.  Directional and adaptive warhead technologies will be designed using modeling, simulation and experimentation to reduce collateral damage, enhance soldier survivability and augment effect on target.  The use of advanced materials and novel warhead designs, in conjunction with the development of novel initiation schemes, will be validated through experimentation to determine their efficacy in providing lethality overmatch and multi-domain capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funds realigned from PE 0602624A (Weapons and Munition Technology) \/ H28 (Warheads \/ Energetics Technologies) as part of financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AI1"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Terrain Shaping Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "3.06"
                        },
                        "BudgetYearFour": {
                            "val": "3.121"
                        },
                        "BudgetYearFive": {
                            "val": "3.155"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.336"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AI2"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Risk Analysis of Fires Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "2.233"
                        },
                        "BudgetYearThree": {
                            "val": "1.6"
                        },
                        "BudgetYearFour": {
                            "val": "2.096"
                        },
                        "BudgetYearFive": {
                            "val": "1.551"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.480"
                        }
                    },
                    "R2aExhibit": []
                }
            ]
        }
    }
}