{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-30",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603772A"
        },
        "ProgramElementTitle": {
            "val": "Advanced Tactical Computer Science and Sensor Technology"
        },
        "R1LineNumber": {
            "val": "71"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "50.637"
            },
            "CurrentYear": {
                "val": "43.856"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "94.493"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being eliminated, with continuity of effort realigned to the following PEs:\n* PE 0603462A Next Generation Combat Vehicle Advanced Technology \n* PE 0603463A Network C3I Advanced Technology\n* PE 0603466A Air and Missile Defense Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures and demonstrates technologies that allow the Warfighter to effectively collect, analyze, transfer and display situational awareness information in a network-centric battlefield environment, and the technologies that enable the integration of Robotics and Autonomous Systems (RAS) through Mission Command. It matures and demonstrates architectures, hardware, software and techniques that enable synchronized mission command (MC) during rapid, mobile, dispersed and Joint operations. Project 101 matures software, algorithms, services and devices to more effectively integrate MC across all echelons and enable more effective utilization of Warfighter resources including intelligent power management and distribution through accelerated information to decisions and rapid MC on the move. Project 243 matures and demonstrates signal processing and information\/intelligence fusion software, algorithms, services and systems for Army sensors; radio frequency (RF) systems to track and identify enemy forces and personnel; and multi-sensor control and correlation software and algorithms to improve reconnaissance, surveillance, tracking, and target acquisition.\n\nWork in this PE complements PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602303A (Missile Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602782A (Command, Control, Communications Technology), and PE 0603270A (Electronic Warfare Technology), and is coordinated with PE 0602783A (Computer and Software Technology).\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Research, Development, and Engineering Command, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "52.206"
                },
                "CurrentYear": {
                    "val": "34.883"
                },
                "BudgetYearOne": {
                    "val": "39.847"
                },
                "BudgetYearOneBase": {
                    "val": "39.847"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "50.637"
                },
                "CurrentYear": {
                    "val": "43.856"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.569"
                },
                "CurrentYear": {
                    "val": "8.973"
                },
                "BudgetYearOne": {
                    "val": "-39.847"
                },
                "BudgetYearOneBase": {
                    "val": "-39.847"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.032"
                    },
                    "CurrentYear": {
                        "val": "-0.027"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "9"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.537"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-39.847"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-39.847"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19 congressional add for assured position, navigation, and timing.\nFY20 reduction --  PE eliminated due to S&T Financial Restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "101"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Command and Control"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.707"
                        },
                        "CurrentYear": {
                            "val": "17.588"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "39.295"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603462A Next Generation Ground Combat Vehicle Advanced Technology, Project:\n* BH3 C4ISR Modular Autonomy Advanced Technology\nPE 0603463A Network C3I Advanced Technology, Project \n* AQ8 High Tempo Data Driven Decision Tools Adv Tech\n* AV8 Navigation Warfare (NAVWAR) Advanced Technology\n* AW2 Autonomous Navigation Advanced Technology\n* AW4 DoD PNT M&S Collaborative Initiative (CI) Adv Tech\n* AW6 Modular GPS Independent Sensors Advanced Tech\n* AR2 Energy Informed Operations  Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates software, algorithms, services and devices that move and display timely and relevant information across the battlefield to provide Commanders at all echelons with situational awareness (SA) that allows them to understand, decide and act faster than their adversaries. This project also matures and demonstrates software, algorithms and devices supporting information storage and retrieval; digital transfer and display of battlefield SA, with an emphasis on positioning, navigation, and timing (PNT) and power and energy resource information while keeping in mind the cognitive limit of the Soldier's use of software, algorithms and services optimized for expeditionary and uninterrupted mission command.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Mission Command (MC)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies to simplify mission command (MC) software and data architectures and reduce complexity in all battlefield environments, to include command post (CP), mounted, and dismounted operations. Work accomplished under Program Element (PE) 0602782A\/Project 779 complements this effort. Beginning in Fiscal Year (FY) 18, work supporting expeditionary mission command is moved to an ?Expeditionary MC? program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.904"
                                            },
                                            "Text": {
                                                "val": "Integrated and demonstrated software that provides the commander with information regardless of the commander's location, (e.g., command post (CP), mounted vehicle, or dismounted); demonstrated enhanced collaboration software tools that enable a mobile force to use voice, gestures, and text to interact with MC systems and services on the move; completed and demonstrated a collaborative, flexible environment that distributes data to the point of need, and supports rapid and effective decision support tools; matured and demonstrated a human computer interface that provides a common user experience and adapts to differing screen sizes and device capabilities (phones, tablets, laptops, and computers) to enable enhanced situational understanding and decision making in CP, mounted and dismounted environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.398"
                                            },
                                            "Text": {
                                                "val": "Develop and mature software demonstrators that implement artificial intelligence techniques including intelligent agents to assess mission objectives against the current situation to facilitate situational understanding; optimize software to visualize when the current situation is deviating from the commander's intent with continuous running estimates and an on-going analysis of risks and opportunities; mature software and algorithms to integrate Robotics and Autonomous Systems (RAS) with MC information systems to better allow Commanders the ability to plan, monitor and incorporate RAS into unit formations and missions and assist the development of doctrine."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20 this effort is realigned to PE 0603462A \/ Project BH3 and PE 0603463A \/ Project AQ8"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expeditionary Mission Command (MC)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware and software command post (CP) enabling technologies to support expeditionary maneuver and effective, uninterrupted MC operations. Work accomplished under PE 0602782A\/project 779 complements this effort. In FY19, effort is realigned in support of the Army science and technology (S&T) Modernization priorities for Network\/Command, Control, Communications and Intelligence (C3I)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.147"
                                            },
                                            "Text": {
                                                "val": "Completed development and integration of innovative Army CP concept technology demonstrators to enable expeditionary maneuver and effective uninterrupted MC operations; demonstrated integrated CPs and configuration standards that can be customized to meet unique mission needs and enable rapid deployment and remote operations; completed and demonstrated tactical server hardware to minimize CP network setup time and lessen task burden on administrators while simplifying CP computing environment architecture and applications; completed and demonstrated a CP display system capability that reduces clutter; demonstrated expeditionary CP components that improve collaboration, decrease complexity, size, weight, and power (SWaP) - cost; demonstrated CP nodes to inform and validate CP requirements that explore new concepts for minimalistic solutions for Initial Entry Operations, Forcible Entry Operations, and agile solutions for Main CP and Tactical CP pairings; conducted field based demonstrations focused on risk reduction and informing future CP requirements and Army Concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured Positioning, Navigation and Timing (A-PNT)"
                                    },
                                    "Description": {
                                        "val": "This effort matures, demonstrates and performs modeling and simulation (M&S) of positioning, navigation, and timing (PNT) technologies to provide access to trusted PNT information in global positioning system (GPS)-denied or degraded environments. Work being accomplished under PE 0602782A\/Project 779 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.651"
                                            },
                                            "Text": {
                                                "val": "Integrated M-Code GPS into mounted and dismounted PNT systems including systems utilizing Multi Global Navigation Satellite Systems (multi-GNSS) signals (signals from foreign nation navigation satellite systems); matured and integrated enhanced pseudolite capabilities to improve system performance and reduce reliance on GPS signals; improved upon the system performance of the Mounted Assured PNT System by integrating additional aiding sensors such as vision navigation and reduced SWAP inertial measurement units; assessed technologies for PNT applications for autonomous systems to improve their navigation capabilities and reduce the overall cost of the platform sensor package; evaluated autonomous systems to integrate PNT technologies such as radio frequency (RF) ranging beacons for in-building navigation to augment PNT solutions for mounted and dismounted platforms; optimized improved atomic clocks and two way time transfer methods  as solutions that will provide accurate time to tactical users and systems in the absence of GPS;  matured and coded advanced modeling and simulation (M&S) of PNT sensors, systems, and platforms to support Joint analysis of effects of PNT and PNT based attacks to Joint United States (U.S.) forces; began integration of vision navigation systems into dismounted and mounted PNT systems; integrated radio frequency ranging and motion characterization algorithms into dismounted PNT system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.884"
                                            },
                                            "Text": {
                                                "val": "Improve the performance of a Navigation Warfare (NAVWAR) breadboard that will enable continued operations in hostile, GPS denied environments by integrating electronic attack, electronic protection and electronic support hardware and software; incorporate the new Military Code (M-Code) GPS signal for offensive and defensive NAVWAR operations into the breadboard; mature and code a PNT situational awareness software tool utilizing existing sensors and GPS receivers; mature and demonstrate a hardware solution using multi-GNSS signals for integrity monitoring; integrate PNT technologies such as radio frequency (RF) ranging beacons for in-building navigation to augment PNT solutions for mounted and dismounted platforms; mature and demonstrate two way time transfer hardware that will provide accurate time to users and systems in the absence of GPS; and conduct advanced modeling and simulation (M&S) of PNT sensors, systems, and platforms to validate M&S environment to support Joint analysis of effects of PNT and PNT based attacks to Joint United States (U.S.) forces."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this effort realigns to PE0603463A\/Project AV8 (Navigation Warfare Advanced Technology), AW2 (Autonomous Navigation Advanced Technology), AW4 (DoD PNT M&S Collaborative Initiative Adv Tech), and AW6 (Modular GPS Independent Sensors Advanced Tech)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Intelligent Power Management & Distribution"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced power and thermal management and distribution technologies for command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) applications as well as validates and integrates designs in power generation, hybrid energy storage, and assessments Work accomplished under PE 0602705A\/Project H11 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.005"
                                            },
                                            "Text": {
                                                "val": "Matured, demonstrated and validated advanced renewable, alternative or high fuel-efficiency power systems such as optimizing the performance of a hybrid (generator, plus batteries, plus solar) power trailer as part of a microgrid to improve performance of base power systems while reducing logistics footprint; matured, coded and demonstrated optimized software and algorithms to provide power situational awareness to unit commander and staff with the ability to identify faults and errors in power generation and assess timely mission power and energy status; validated predictive-analysis modeling of energy sources, to be used during the planning and execution mission phases, to determine if they are efficient and integrated systems for managing operational power attached to a tactical power grid system; integrated new hybrid power trailer with Joint and supporting systems (legacy generator based microgrids)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.96"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate alternating current power source self-tuning protocols to manage synchronization in multi-power source configurations in support of ad-hoc arrangements of power equipment for emerging Command, Control, Communications, computers, Intelligence, Surveillance and Reconnaissance (C4ISR) systems; validate tuning protocols to ensure stability and robustness of intelligent power systems to support unique load profiles generated by directed energy, high power sensors, and electromagnetic weapon systems; integrate multiple-master control methodologies into intelligent power system software controllers to allow power sharing on C4ISR platforms like vehicles, airframes or other platforms with intelligent power loads that must join together in an ad-hoc power network with competing prioritizations; validate single-bus vs. multiple-bus implementation of multiple-master control strategy hardware configurations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this effort realigns to PE 0603463A \/ Project AR2 (Energy Informed Operations Advanced Technology)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.346"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1AA"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Computer Science Demonstrations (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "9"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Tactical Computer Science and Sensor advanced technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Assured Positioning, Navigation and Timing"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "9"
                                        },
                                        "Text": {
                                            "val": "Assured Positioning, Navigation and Timing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "243"
                    },
                    "ProjectTitle": {
                        "val": "Sensors And Signals Processing"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.93"
                        },
                        "CurrentYear": {
                            "val": "17.268"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "46.198"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603463A Network C3I Advanced Technology, Projects: \n* AO1 UNT - Every Receiver is a Sensor Advanced Tech\n* AV4 Foundational S&T for Network C3I Advanced Tech\nPE 0603466A Air and Missile Defense Advanced Technology, Project:\n* AD6 Next Generation Fires Radar Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates improved radar, sensor fusion, and correlation software, services, devices and systems for wide area reconnaissance, surveillance, tracking and targeting of ground and aerial platforms and individuals, including complex and urban environments. Sensor fusion efforts mature and demonstrate software, algorithms and services for sensor management, data correlation, and relationship discovery for a multi-intelligence fusion system. Sensor and simulated sensor candidates may include moving-target-indicator\/synthetic aperture radar, electro-optical\/infrared (EO\/IR), signals intelligence (SIGINT), measurements and signatures intelligence (MASINT), human intelligence (HUMINT), multiple intelligence (Multi-Int) and biometrics.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Collaborative Intelligence, Surveillance and Reconnaissance (ISR) Sensor processing and analytics"
                                    },
                                    "Description": {
                                        "val": "This effort develops software that gathers data from multi-function Airborne ISR sensor sources into a single common operating environment to streamline analysts processing, exploitation and dissemination (PED) workflows.  The focus centers on developing scalable software that provides a near real time PED capability on board the platform with applicability at the ground stations and reach back for forensics and pattern analysis. It will increase the utility of moving target indicator (MTI) radar to the greater multiple intelligence (multi-INT) picture for better origin-to-destination tracking, which is crucial to understanding the higher-level threat picture and increases the effectiveness and action-ability of battlespace awareness\/intelligence data throughout an area of operations. This effort implements an open architecture extensible throughout the tactical enterprise, allowing for growth to include future ISR sensors. Work being accomplished under PE 0602270\/Project 906 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.698"
                                            },
                                            "Text": {
                                                "val": "Evaluated, and integrated advanced processing modules and modify\/mature existing on platform activity detection algorithms using spatial and temporal correlation of full motion video, electronic warfare (EW), and MTI data that trigger operator and analyst alerts to be executable at ground station and reach-back to operations centers for forensics and pattern analysis; assessed fusion algorithms against baseline analyst workflows to document performance improvements; matured and coded algorithms for alerting, analytics, time and position correlation and correlation with data collected through EW to enhance existing Distributed Common Ground Station-Army (DCGS-A) program of record capabilities; began integration activities to generically align all developed algorithms (i.e., platform, ground station and reach-back for use in the PED framework for utilization throughout the tactical enterprise to support distributed fusion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.55"
                                            },
                                            "Text": {
                                                "val": "Evaluate, and mature advanced exploitation and activity detection algorithms against real and operational datasets of full motion video and electronic support data; demonstrate advanced exploitation and activity detection algorithms, including route avoidance, co-traveler, and convoy detection, in a laboratory environment; optimize processing, exploitation and dissemination (PED) workflow development to reduce operator workload and time to develop intelligence products; complete integration into existing PED Army Tactical systems to align algorithms across platforms and ground stations to support distributed processing and intelligence exploitation; complete and transition processing and exploitation algorithms to intelligence collection platforms  programs of record (POR) and PED frameworks to ground station POR."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this effort realigns to PE 0602150A \/ Project AE4 and PE 0603463A \/ Project AO1."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Omni-directional Situational Awareness (SA) Airborne radar technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates multi-function SA sensors for small unmanned air systems and other aircraft to improve sensing and detection capabilities in support of wide-area persistent surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.753"
                                            },
                                            "Text": {
                                                "val": "Completed final subsystem and system level radar hardware and software designs and brassboard demonstrator; analyzed radar modes and operations and conducted detailed system design review; performed modeling and simulation (M&S) of the radar?s full processing chain; performed laboratory and field assessments of technical performance; refined human, vehicle, animal and clutter (HVAC) identification techniques and algorithms for feature-aided discrimination and tracking within the integrated radar system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-concealment Moving Target Indicator (MTI) Airborne Radar Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort will mature antenna design and signal processing and define the architecture to ensure simplified integration on a Multi-Int platform to deliver an advanced generation of airborne MTI radars. This will allow for third party mode development and exploitation techniques, with emphasis on automated target declaration and tracking. Efforts focus on antenna and signal processing advancements that allow the detection\/tracking of targets despite camouflage, concealment and deception and a well-defined systems architecture to cover large areas and persistently scan named areas of interest. This effort leverages work being completed under the Omni-directional situational awareness (SA) Airborne radar technologies effort in Fiscal Year (FY) 18."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.355"
                                            },
                                            "Text": {
                                                "val": "Matured and implemented a well-defined system processing architecture; conducted radar system derived requirements review and developmental system preliminary design review; developed detailed specifications and drawings for critical radar components and interfaces, including transmitter, receiver, advanced scalable robust polarimetric synthetic aperture radar (SAR)\/MTI antenna, beam former, and processor; integrated human, vehicle, animal and clutter (HVAC) discrimination and tracking techniques into the system processor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.908"
                                            },
                                            "Text": {
                                                "val": "Begin development of a Multi-Intelligence airborne ISR\/RSTA and targeting radar capability, capitalizing on investments in wide band MTI\/SAR radar antennas capable of Electronic Warfare, Electronic Support and Targeting. Develop scalable apertures and processing suitable for both airborne manned and unmanned platforms addressing open architecture, modularity, and scalability of the payloads. Further develop existing active electronically scanned array (AESA) antenna technology investments partnered with modeling and simulation and software development tools compatible with third party mode development within a well-defined Multi-Intelligence architectures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realigned to support the Army?s Modernization Priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced All Source Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort develops software technologies for intelligence\/mission command (MC) mission collaboration to provide faster and higher quality decision making support for the commander and his key staff. Specific efforts focus on integrating intelligence, surveillance and reconnaissance (ISR) planning and execution at the Task Force\/Battalion through troop-level, as well as efforts that provide the capability to identify, fuse, and trace\/track specific targets in an asymmetric environment. Work accomplished under Program Element (PE) 0602270A\/Project 906 complements this effort. In FY 2019, funds from this effort are realigned outside of this project to support the Army science and technology (S&T) Modernization priorities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.953"
                                            },
                                            "Text": {
                                                "val": "Integrated Multi-Int tracking, data fusion and analysis software capabilities into the processing, exploitation and dissemination (PED) framework; matured and demonstrated the architectures? scalability, ability to move data across the enterprise, to include air sensors and platforms, ground stations and the Distributed Common Ground Station-Army (DCGS-A), and cloud\/reach-back PED sites, to create an ISR common operational picture (COP) from the distributed fusion process; developed and evaluated the software interfaces that provide a ?virtual analyst? for collaboration, visualization, alerting and dissemination capabilities across multiple nodes within the enterprise COP."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-mode Air Defense Radar Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures the architectures, processing and components necessary to deliver next generation capability, flexibility and supportability to the fires family of radar systems. Efforts focus on development of a modular and scalable open architecture that is extensible to multiple radar systems technologies in support of air defense and area\/base camp protection. Work being accomplished under PE 0602270A\/Project 906, 0602120A\/Project H16, 0602705A\/Projects EM8 and H94, 0602303A\/Project 214 and 0603270A\/Project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.967"
                                            },
                                            "Text": {
                                                "val": "Completed an open radar architecture processing environment for algorithm\/mode design, and demonstrated capability to implement third party modes (e.g., including multi-mission and electronic protection); designed interface definitions and demonstrated integration of radar antenna and processor hardware using the basic counter-fire target acquisition (CTA) mode to assess integration of software at the signal processor level; developed architecture definitions to reduce software dependence on processing hardware (not tied to speed\/performance) to increased portability and upgradability; performed advanced radar concept modeling and simulation (M&S) to refine concepts and requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.396"
                                            },
                                            "Text": {
                                                "val": "Leverage the previously developed open radar architecture processing environment for algorithm\/mode design, and demonstrate capability to implement additional third party modes, including multi-mission, target identification, and with a large focus on multi-static modes leveraging multiple radars for improved capabilities; complete design of interface definitions and demonstrate integration of radar antenna and processor hardware using multi-mission and multi-function modes to assess integration of software at the signal processor level; develop multi-static data alignment and fusion algorithms to leverage multiple radars for improved performance; develop concepts for advanced multi-function, multi-system resource management and proactive radar capabilities that allow systems to adapt to changes in threat scenarios, the environment, or concept of operations changes on the fly;"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this effort realigns to PE 0603466A \/ Project AD6."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Degraded Visual Environment (DVE) ? Air"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates software and hardware for a millimeter wave radar system (conformal phased array radar) to provide obscurant penetration for terrain and object awareness while providing pilotage aids in all degraded visual environments. Work accomplished under PE 0603710A\/Project K86 and 0603003A\/Project 313 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.204"
                                            },
                                            "Text": {
                                                "val": "Completed integrated software mode development for high resolution SAR, DVE mapping (real beam imaging) and Moving Target Indicator (MTI)\/dismount detection; completed integration and laboratory\/tower assessments and data collection; integrated radar onto surrogate aircraft platform and conducted initial flight testing and data collection; co-located radar with additional imaging sensors for integrated sensor data collection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.903"
                                            },
                                            "Text": {
                                                "val": "Integrate forward looking millimeter wave radar, small low-cost situational awareness (SA) radars, Light Detection and Ranging (LIDAR), and light detection sensors into the ground systems integration lab to support radar assessments for ground and follow-on flight testing activities; demonstrate integrated sensor data collection and fusion of the data in a multi-sensor environment to provide obscurant penetration for terrain and object awareness using the various sensors; integrate the radar collocated with SA radar, LIDAR and light detection sensors onto aircraft."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Work ends in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.511"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}