{
    "id": "2020-AirForce-PB-3600-MJBOOK-1-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-58",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0605030F"
        },
        "ProgramElementTitle": {
            "val": "Joint Tactical Network Center (JTNC)"
        },
        "R1LineNumber": {
            "val": "89"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.404"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "2.414"
            },
            "BudgetYearOneBase": {
                "val": "2.414"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "8.182"
            },
            "BudgetYearThree": {
                "val": "8.353"
            },
            "BudgetYearFour": {
                "val": "8.504"
            },
            "BudgetYearFive": {
                "val": "8.357"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.736"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "8.038"
                },
                "BudgetYearOneBase": {
                    "val": "8.038"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.404"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.414"
                },
                "BudgetYearOneBase": {
                    "val": "2.414"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-12.332"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.624"
                },
                "BudgetYearOneBase": {
                    "val": "-5.624"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-12.332"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.624"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.624"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 reduction due to funds RMD'd to other service and residual returned back to AF."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "655068"
                    },
                    "ProjectTitle": {
                        "val": "Joint Tactical Radio System (JTRS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.404"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.414"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.414"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.182"
                        },
                        "BudgetYearThree": {
                            "val": "8.353"
                        },
                        "BudgetYearFour": {
                            "val": "8.504"
                        },
                        "BudgetYearFive": {
                            "val": "8.357"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The JTNC is responsible for ensuring interoperable, secure, and affordable waveform and wireless communications by recommending standards, conducting compliance and certification analyses in accordance with Department of Defense (DoD) policies, and maintaining a DoD Waveform Information Repository (IR). The JTNC provides: (1) DoD Waveform IR management and configuration control, (2) DoD waveform standards and Software Communications Architecture (SCA), (3) technical analyses of DoD and industry Waveform IR products, and (4) serves as Technical Advisor to the JTNC Board of Directors (BoD).\n\nThis mission is executed in conjunction with other government agencies to include the National Security Agency (NSA), the Joint Interoperability Test Command (JITC), National Telecommunication and Information Administration (NTIA), the Services, as well as industry partners. Particular attention is paid to ensuring that interagency work is collaborative and eliminates duplicative capability. The JTNC enables a common software baseline that is hardware agnostic leading to increased competition for Software Defined Radios (SDR).\n\nThe Joint Enterprise Network Manager (JENM) software provides a single network management tool for the Warfighter to plan, configure, load, and manage the Joint Services' Software Defined Radios (SDRs) and networks in the field, a capability not available in legacy planning systems. JENM configures numerous Tactical radios such as the ManPack and Rifleman, enabling them to utilize the Mobile Ad Hoc Networking (MANET) waveforms such as the Soldier Radio Waveform (SRW), Mobile User Objective System (MUOS), Satellite Communications (SATCOM) Demand Assigned Multiple Access (DAMA), Integrated Waveform (IW), and Single Channel Ground and Airborne Radio System (SINCGARS) waveforms. Furthermore, JENM provides the Commander the ability to quickly reconfigure critical networks using its' Over the Air Management (OTAM) functionality. JENM enhances the S6's ability to conduct Course of Action (COA) Analysis and the Military Decision Making Process (MDMP) providing commanders critical information regarding their ability to effectively communicate. JENM is deployed on the Joint Tactical Networking Environment NetOps Toolkit (J-TNT) from Division to the Company level based upon the Basis of Issue Plan.\n\n\nAs part of the joint program budget strategy for JTNC and JENM, each Military Department (MILDEP) budgets for approximately one-third of the total program RDT&E funds for joint efforts. Joint funding is held at the Navy PE 0605030N and Air Force PE 0605030F. Prior to the year of execution, the funding is consolidated in the Army PE (0605031A) for execution.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Tactical Networking Center (JTNC)"
                                    },
                                    "Description": {
                                        "val": "Joint Tactical Networking Center (JTNC) aligns with the JTNC BoD, USD(AT&L), DoD Chief Information Officer (CIO), Joint Staff, the Services, and other key stakeholders for those JTNC chartered processes that ensure interoperable, secure, and cost effective waveform and wireless communications. The JTNC: (1) Facilitates the reuse of waveform and wireless communications and fosters product capability improvements by making government owned waveform and wireless communications products available to developers, (2) provides open architecture DoD Waveform Standards in support of service, multiservice, and coalition forces, (3) provides compliance and certification recommendations on wireless communications"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.404"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The JTNC will conduct waveform analyses of the following waveforms (based on waveform software and related technical artifact availability) to include: Commercial (Harris) - Advanced Networking Wideband Waveform (ANW2); DoD (Navy) - Mobile User Objective System (MUOS) v3.1.5.2, Link 16 Engineering Release 0G (ER0G), Second-Generation Anti-Jam Tactical UHF Radio for North Atlantic Treaty Organization (NATO) (SATURN) and the Joint Waveform (formally Uniform MEECN Mode). The JTNC will continue collecting relevant software, technical documentation, cataloging and inducting other DoD Communication Waveforms listed in the DoD Communication Waveform Inventory. The JTNC will continue to enhance the Department of Defense (DoD) Waveform Information Repository (IR) capability and Software Communications Architecture (SCA) evolution and promulgation. The JTNC will continue to evolve DoD Waveform Standards to facilitate common development, interoperability and re-use. The JTNC will support export requests and analyses of products for exportability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.414"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.414"
                                            },
                                            "Text": {
                                                "val": "Will continue analysis of Board of Directors approved waveforms in accordance Service priorities and the FY20 JTNC Management Plan. Continue collecting relevant software, technical documentation, cataloging and inducting other DoD Communication Waveforms listed in the DoD Communication Waveform Inventory. Continue to enhance DoD Waveform IR capability and approved Standards promulgation.\n\nWill continue the development of the tactical communications vendor product capability characterization process for commercial off-the-shelf (COTS) and non-developmental item (NDI) tactical communication products. Continue to evolve DoD Waveform Standards to facilitate common development, interoperability and re-use, reducing product development time and facilitating faster delivery of capabilities to warfighters. Continue to conduct technical waveform and software artifact analyses against published standards. Continue to support export requests and analyses of products for exportability. Continue to certify secure, reusable software waveforms based on government controlled open architecture to encourage a competitive, cost effective, interoperable networking environment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 reduction to $0 is the result of Resource Management Decision (RMD) to consolidate funding within the Army PE 0605030A, as per the Joint Budget Strategy. FY20 outlay is the Air Force portion of funding subject to RMD before official PB20 locks."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The Joint Tactical Networking Center is funded by all the Services. The Joint Funding Strategy requires each of the three Service Military Departments (MILDEPs) to budget for one-third of the total program approved requirement.  Army funding in FY21 and beyond reflects only approximately one-third of total funding.  Other funding is as follows (PB20 locked positions):\n\nNavy RDTE: 0605030N, 3077. FY21 = 4,644 \/\/ FY22 = 4,741 \/\/ FY23 = 4,835 \/\/ FY24 = 4,932\nArmy RDTE:  0605030A, 655030. FY21 = 5,833 \/\/ FY22 = 5,835 \/\/ FY 23 = 5,490 \/\/ FY24 = 6,847\n\nDue to Joint Funding Strategy, there is no prior year funding for JTNC in the other Service lines. Prior to the year of execution, the JTNC funding is consolidated in Army PE 0605030A for execution. In accordance with the Joint Tactical Networking Center Charter updated and re-validated on 29 March 2016, the JTNC will remain under a Joint Budget Strategy funded by the three MILDEPs."
                        },
                        "AcquisitionStrategy": {
                            "val": "Joint Tactical Networking Center is classified as a Joint Support Program to Acquisition, Technology & Logistics (AT&L), DoD Chief Information Officer (CIO), and the Services. JTNC core functions as defined in the JTNC Acquisition Decision Memorandum and Charter signed on 20 January 2014 and revalidated on 29 March 2016 include: Department of Defense (DoD) Waveform Information Repository (IR) management and configuration control, DoD Waveform Standards and Software Communications Architecture (SCA), technical analyses of Government Program of Record (POR) and Industry COTS and NDI Waveform products. The services derived from these core functions reinforce an acquisition environment which ensures that interoperable, secure, and affordable joint tactical waveforms and wireless communications applications can operate in a variety of hardware transport solutions.\n\nThe FY2020 Budget supports continued development\/maturation of the DoD Waveform IR, analysis of directed software and artifacts, support of the National Security Agency (NSA) Commercial Communications Security (COMSEC) Evaluation Program (CCEP), JTNC Standards Interface Control Working Group (ICWG), and continue development of the Capabilities Characterization and Tactical Communications Marketplace (CC & TCM)."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JTNC & JENM Engineering\/Technical Support, Test and Evaluation, Product Development Support and Program Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "G2SS, SSC PAC, JITC, APG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.404"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.414"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.414"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "JTNC - Compliance and Certification"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Waveform and Wireless Product Compliance and Certification"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JTNC - Information Repository"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "DoD Waveform Information Repository"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JTNC - Standards"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Evolve Waveform Standards and SCA"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JTNC - Analysis"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Analyze Waveforms and Associated Artifacts"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JENM"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "JENM Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}