{
    "id": "2020-WashingtonHeadquartersService-PB-0400-MJBOOK-0-0-6b9799afd47864d6a637c4d3073dece247d38fb378987ed36fdb1c607d24a3fa-1",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-WHS-U_RDTE_MasterJustificationBook_Washington_Headquarters_Service_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Washington_Headquarters_Service_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Washington Headquarters Service",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606589D8W"
        },
        "ProgramElementTitle": {
            "val": "Defense Digital Service (DDS)"
        },
        "R1LineNumber": {
            "val": "176"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Washington Headquarters Service"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "1.000"
            },
            "BudgetYearOne": {
                "val": "1.000"
            },
            "BudgetYearOneBase": {
                "val": "1.000"
            },
            "BudgetYearTwo": {
                "val": "1.000"
            },
            "BudgetYearThree": {
                "val": "1.000"
            },
            "BudgetYearFour": {
                "val": "1.000"
            },
            "BudgetYearFive": {
                "val": "1.020"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Defense Digital Service (DDS) was launched in November 2015 and was formally chartered under DoD Directive 5105.87 in January 2017 in the Office of the Secretary of Defense (OSD) of the Department of Defense (DoD).  Since that time, OSD has presented over 100 potential projects to DDS, some of which would benefit significantly from the enhanced prototyping capabilities of DDS. With appropriate funding, DDS leverage, its private sector expertise to fully support the build of a system prototype \/ proof-of-concept. RDT&E funding is required to support the DDS mission, which includes the ability to build software prototypes to prove out concepts for mission critical projects identified by the Department.\n\nEnsuring that DDS has RDT&E capabilities will increase DoD’s ability to leverage DDS’s unique technical expertise to determine which private sector software development best practices and\/or technology work best for the Department. Furthermore, the development and testing of DDS prototypes, and the insight gained, would significantly lower development costs and delivery times through traditional DoD methods."
        },
        "ProgramElementMissionDescription": {
            "val": "DDS was created to bring private sector software development best practices, talent, and technology to the Department’s hardest software and technology problems. Since its launch in November 2015, DDS has project demands from OSD that have increased exponentially; some of those requests would benefit from robust prototyping \/ proof-of-concept capabilities by DDS teams. The former is dependent on RDT&E funding that supports the ability to acquire the most current technological solution and\/or support from vendors well versed in the most advanced technological solutions.  \n\nThe requested RDT&E funds will enable DDS to build prototypes and implement proof-of-concept tests for some key OSD projects. These projects will support missions in and out of theater, as well as long term goals of the department to modernize its offensive and defensive technological capabilities.  DoD interest in leveraging DDS to operate in this area to solve hard and impossible problems is persistent.  With appropriate funding, DDS can use the superior technical expertise of its staff, as well as ability to quickly deliver usable products to meet demand."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "1.000"
                },
                "BudgetYearOne": {
                    "val": "1.000"
                },
                "BudgetYearOneBase": {
                    "val": "1.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "1.000"
                },
                "BudgetYearOne": {
                    "val": "1.000"
                },
                "BudgetYearOneBase": {
                    "val": "1.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "281"
                    },
                    "ProjectTitle": {
                        "val": "DDS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.000"
                        },
                        "BudgetYearThree": {
                            "val": "1.000"
                        },
                        "BudgetYearFour": {
                            "val": "1.000"
                        },
                        "BudgetYearFive": {
                            "val": "1.020"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Defense Digital Service (DDS) requests $1 million in RDT&E,DW funding in FY2020 to build prototypes \/ proof-of-concepts for software and hardware development efforts.  DDS will leverage its expertise in private industry best practices to develop prototypes that can be scaled to production to support the overall mission of DoD.  This funding will help to ensure that DDS can capitalize on its unique ability to build, and\/or advise customers on how to build, prototypes and proof-of-concepts using private sector best practices."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Digital Service (DDS)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "The U.S. Department of Defense (DoD) relies on innovation to maintain our nation's ability to deter, and if necessary, defeat its adversaries, whether in conventional or unconventional environments. With a team firmly rooted in the heart of the Pentagon, Defense Digital Service (DDS) serves as a nimble unit with the ability to quickly mobilize and tackle some the DoDs toughest technological challenges.  DDS's approach leverages industry best practices to efficiently navigate policy, contracts, and tech blockers to reach working and scalable solutions to hardware and software problems.  The ultimate goal of the team is to support DoD in finding and implementing relevant tech solutions to hard and\/or impossible problems that when solved, increase the efficiency and effectiveness of the department in carrying out its mission to defend the United States and its domestic and overseas interests.  Ultimately, the purpose and goal of the team is to ensure that solutions reach the hands of end users, including warfighters, in short timelines, so that compound problems from the existing problem sets do not persist."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "The U.S. Department of Defense (DoD) needs on innovation to maintain our nation's ability to deter, and if need be, prevail in physical and technological conflict. With a team firmly rooted in the heart of the Pentagon, Defense Digital Service (DDS) serves as a nimble unit with the ability to quickly mobilize and tackle some the DoDs toughest technological challenges.  DDS's approach leverages industry best practices to efficiently navigate policy, contracts, and tech blockers to reach working and scalable solutions to hardware and software problems.  The ultimate goal of the team is to support DoD in finding and implementing relevant tech solutions to hard and\/or impossible problems that when solved, increase the efficiency and effectiveness of the department in carrying out its mission to defend the United States and its domestic and overseas interests.  Ultimately, the purpose and goal of the team is to ensure that solutions reach the hands of end users, including warfighters, in short timelines, so that compound problems from the existing problem sets do not persist."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "DDS Research and Development is one of the Secretary of Defense's top priorities with the intent of advancing and modernizing technology, especially software systems, critical to the successful implementation of a variety of department and warfighter missions.  DDS requirements are driven by challenging technical problems identified by the Secretary of Defense where technology is failing the Department of Defense mission and could impede the lethality and effectiveness of the warfighter.  These problems vary in scope and complexity, but at a minimum, when resolved, have a positive impact on the warfighter’s mission and capabilities.  The DDS involvement may be in the development of new code, product management, advising on code development processes and releases, and hacking or re-writing existing policies or processes that are antiquated or otherwise unnecessary.  The DDS engages on highly troubled projects to quickly implement fixes that ultimately reduce schedule slip, increase security, lower costs, improve user experiences, and accelerate performance.    \nSome examples of current projects include: replacing the MEPCOM Integrated Resources System; reimagining the user interface and associated databases for the Defense Property System; devising a hard and software solution to counter Unmanned Aircraft Systems (UAS) that attack warfighters in theater; and developing a novel, modern approach to network defense.  The DDS team is comprised of digital experts with backgrounds in policy, contracts, design, and engineering who collectively use their private industry and federal government experience to identify solutions to problems and rapidly devise and implement solutions."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M"
                                    },
                                    "Title": {
                                        "val": "BA4, PE 0901589D8W"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.246"
                                        },
                                        "CurrentYear": {
                                            "val": "4.569"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.549"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.549"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.544"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.542"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.541"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.635"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "O&M (OCO)"
                                    },
                                    "Title": {
                                        "val": "BA4, PE 0901589D8W"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.300"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Defense Digital Service will build, or manage the build, of prototypes and proof-of-concepts that will solve hard and impossible technological problems in DoD."
                        },
                        "PerformanceMetrics": {
                            "val": "NA"
                        }
                    }
                }
            ]
        }
    }
}