{
    "id": "2020-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-1fdb0f1c66d0ab6447cfd3048415933b63f540457bcabf86723831bdf6128b20-13",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603767E"
        },
        "ProgramElementTitle": {
            "val": "SENSOR TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "57"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "202.189"
            },
            "CurrentYear": {
                "val": "183.101"
            },
            "BudgetYearOne": {
                "val": "163.903"
            },
            "BudgetYearOneBase": {
                "val": "163.903"
            },
            "BudgetYearTwo": {
                "val": "269.619"
            },
            "BudgetYearThree": {
                "val": "238.758"
            },
            "BudgetYearFour": {
                "val": "263.964"
            },
            "BudgetYearFive": {
                "val": "269.964"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Sensor Technology program element is budgeted in the Advanced Technology Development Budget Activity because it funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability and battle damage assessment.  \n\nThe Surveillance and Countermeasures Technology project funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability, and battle damage assessment.  Timely surveillance of enemy territory under all weather conditions is critical to providing our forces with the tactical information needed to succeed in future wars.  This operational surveillance capability must continue to perform during enemy efforts to deny and deceive the sensor systems, and operate, at times, in a clandestine manner.  This project will exploit recent advances in multispectral target phenomenology, signal processing, low-power high-performance computing, and low-cost microelectronics to develop advanced surveillance and targeting systems.  In addition, this project encompasses several advanced technologies related to the development of techniques to counter advanced battlefield threats.\n\nThe Sensors and Processing Systems project develops and demonstrates the advanced sensor and processing technologies and systems necessary for Intelligence, Surveillance, and Reconnaissance (ISR) missions.  Future battlefields will continue to be populated with targets that use mobility and concealment as key survival tactics, and high-value targets will range from specific individual insurgents and vehicles to groups of individuals and large platforms such as mobile missile launchers and artillery.  The Sensors and Processing Systems project is primarily driven by four needs: (a) providing day-night ISR capabilities against the entire range of potential targets; (b) countering camouflage, concealment, and deception of mobile ground targets; (c) detecting and identifying objects of interest\/targets across wide geographic areas in near-real-time; and (d) enabling reliable identification, precision fire control tracking, timely engagement, and accurate battle damage assessment of ground targets."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "210.123"
                },
                "CurrentYear": {
                    "val": "190.128"
                },
                "BudgetYearOne": {
                    "val": "272.997"
                },
                "BudgetYearOneBase": {
                    "val": "272.997"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "202.189"
                },
                "CurrentYear": {
                    "val": "183.101"
                },
                "BudgetYearOne": {
                    "val": "163.903"
                },
                "BudgetYearOneBase": {
                    "val": "163.903"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.934"
                },
                "CurrentYear": {
                    "val": "-7.027"
                },
                "BudgetYearOne": {
                    "val": "-109.094"
                },
                "BudgetYearOneBase": {
                    "val": "-109.094"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-7.027"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.839"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.095"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-109.094"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-109.094"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018:  Decrease reflects SBIR\/STTR transfer and reprogrammings.\nFY 2019:  Decrease reflects Congressional reduction.\nFY 2020:  Decrease reflects rephasing of several programs in the Surveillance and Countermeasures Technology and Sensors and Processing Systems projects and classified program reduction."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SEN-01"
                    },
                    "ProjectTitle": {
                        "val": "SURVEILLANCE AND COUNTERMEASURES TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.964"
                        },
                        "CurrentYear": {
                            "val": "47.422"
                        },
                        "BudgetYearOne": {
                            "val": "40.551"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.551"
                        },
                        "BudgetYearTwo": {
                            "val": "31.281"
                        },
                        "BudgetYearThree": {
                            "val": "22.208"
                        },
                        "BudgetYearFour": {
                            "val": "8.401"
                        },
                        "BudgetYearFive": {
                            "val": "8.401"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Surveillance and Countermeasures Technology project funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability, and battle damage assessment.  Timely surveillance of enemy territory under all weather conditions is critical to providing our forces with the tactical information needed to succeed in future wars.  This operational surveillance capability must continue to perform during enemy efforts to deny and deceive the sensor systems, and operate, at times, in a clandestine manner.  This project will exploit recent advances in multispectral target phenomenology, signal processing, low-power high-performance computing, and low-cost microelectronics to develop advanced surveillance and targeting systems.  In addition, this project encompasses several advanced technologies related to the development of techniques to counter advanced battlefield threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aerial Dragnet"
                                    },
                                    "Description": {
                                        "val": "Aerial Dragnet seeks to detect multiple small Unmanned Aerial Systems (UAS) in complex and\/or urban terrain before they are within Line-Of-Sight (LOS) of friendly assets.  Unlike traditional air targets, small UASs pose a special threat in urban terrain for several reasons: they can fly at low altitudes between buildings, they are small making them difficult to sense, and they move at slow speeds making them difficult to differentiate from other moving objects.  Moreover, the development of small UASs is driven by commercial technologies, which make them rapidly adaptable and very easy to use.  Building upon research conducted in the System of Systems Integration Technology and Experimentation (SoSITE) program (budgeted in PE 0603766E, Project NET-01), Aerial Dragnet will perform surveillance using an architecture consisting of networked sensors mounted on distributed aerial platforms.  The ability to see over and into urban terrain allows an Aerial Dragnet to detect, track, and classify UAS incursions rapidly, thus enabling multiple defeat options.  This program focuses on the development of payloads to be hosted on unmanned aerial platforms, comprising of signal processing software, sensor hardware, and networking for distributed, autonomous operation.  The system will be scalable to provide cost-effective surveillance coverage from neighborhood to city-sized areas.  Aerial Dragnet technologies are expected to transition to the Army, Marine Corps, and Department of Homeland Security."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.501"
                                            },
                                            "Text": {
                                                "val": "-  Conducted engineering subsystem tests to assess small UAS detection performance in an instrumented urban test area.\n-  Completed development of initial hardware sensor payloads.\n-  Evaluated software for UAS tracking and classification.\n-  Demonstrated and tested system performance over a neighborhood-sized urban area.\n-  Networked multiple aerial surveillance platforms to increase coverage"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.508"
                                            },
                                            "Text": {
                                                "val": "-  Update hardware sensor payloads to reduce size, weight, power, and cost.\n-  Extend software to enable target tracking non-line-of-sight from sensor platform.  \n-  Develop autonomy algorithms to allow surveillance platforms to adapt to urban terrain.\n-  Demonstrate and test the performance of the system in a multi-neighborhood-sized urban area."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.856"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.856"
                                            },
                                            "Text": {
                                                "val": "-  Develop software interfaces relating to existing transition partners command and control architectures and Programs of Record.\n-  Develop algorithms and software interfaces to integrate with existing and fielded sensor systems for transition cooperation.\n-  Demonstrate and test the performance of the system in a robust urban environment with input on transition partner challenges."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects the focus on integration with fielded systems and finalizing of sensor development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Shosty"
                                    },
                                    "Description": {
                                        "val": "Shosty seeks to develop and demonstrate enhanced capabilities for high frequency (HF) over-the-horizon-radar (OTHR) systems.  This program will develop techniques to characterize distributed skywave HF radar propagation channels and measure radar backscatter from the surface.  System signal processing, modeling, analysis, and over-the-air experimentation will be conducted to assess performance.  Technologies developed under the Shosty program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.774"
                                            },
                                            "Text": {
                                                "val": "FY 2018 Accomplishments:\n- Developed baseline signal processing algorithm for quick-look signal analysis.\n- Commenced integration of HF transmit system and control software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.500"
                                            },
                                            "Text": {
                                                "val": "-  Begin design and integration of multi-channel receive systems.\n-  Begin development of waveforms and signal processing for distributed geometries. \n-  Perform system modeling to assess target detection performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.268"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.268"
                                            },
                                            "Text": {
                                                "val": "-  Complete HF transmit system integration.  \n-  Conduct over-the-air field tests to assess propagation and backscatter characteristics.\n-  Confirm physical modeling and analysis using measured experimental data.\n-  Compare performance of distributed geometries through modeling and experimentation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2020 reflects the shift from system development to field testing and demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "All Source Combat Operations and Targeting (ASCOT)"
                                    },
                                    "Description": {
                                        "val": "The All Source Combat Operations and Targeting (ASCOT) program will allow maritime platforms to maintain robust battlespace awareness and survivability by combining data and coordinating operations using all available sensors.  The program will create methods for optimal balancing of battlespace awareness and survivability by leveraging existing networked sensor and local platform sensors.  The program builds upon technology developed as a part of the Resilient Synchronized Planning & Assessment Contested Environment (RSPACE) program, budgeted in PE 0603766E\/Project NET-01. Key attributes of this program are survivability, information latency, reliability, and endurance.  Demonstrations on relevant platforms in relevant environments will be used to validate the technology.  Technologies from this program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.414"
                                            },
                                            "Text": {
                                                "val": "-  Initiate the development of sensor fusion and data analysis tools.\n-  Initiate the development of payloads for networked sensor testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.427"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.427"
                                            },
                                            "Text": {
                                                "val": "-  Conduct testing of sensor fusion and data analysis tools in simulation and test environment.\n-  Analyze collected data to identify system performance and examine robustness.\n-  Conduct lab testing of payload designs.\n-  Initiate the development of adaptive combat control techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects the initiation of system integration and major testing and demonstration efforts in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Optical Sensing (MOS)"
                                    },
                                    "Description": {
                                        "val": "The proliferation of Radio Frequency (RF)-based countermeasures, such as Digital Radio Frequency Memory (DRFM), has presented challenges to the effectiveness of data sensors.  The Multi-Optical Sensing (MOS) program enabled an alternative approach to detecting, tracking, and performing non-cooperative target identification, as well as providing fire control for fighter-class and long-range strike aircraft.  This program leveraged emerging high-sensitivity Focal Plane Array (FPA) and compact, multi-band laser systems technology in the near\/mid\/long-wave infrared bands to enable the development of a multi-optical sensing system.  Technical challenges included the demonstration of inexpensive, multi-band, large-format, photon-counting, high-bandwidth receivers and their integration into a multi-optical sensor suite compatible with airborne assets.  The MOS program advanced the state of the art of components and technology to support an all-optical airborne system that can detect, geolocate, and identify targets at standoff ranges.  Technologies from this program transitioned to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.689"
                                            },
                                            "Text": {
                                                "val": "-  Performed analysis of flight data to demonstrate the impact of a multi-mode airborne laser radar system.\n-  Completed development of high-power laser system.\n-  Transferred technology and hardware to Air Force."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SEN-02"
                    },
                    "ProjectTitle": {
                        "val": "SENSORS AND PROCESSING SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "85.347"
                        },
                        "CurrentYear": {
                            "val": "63.562"
                        },
                        "BudgetYearOne": {
                            "val": "69.452"
                        },
                        "BudgetYearOneBase": {
                            "val": "69.452"
                        },
                        "BudgetYearTwo": {
                            "val": "206.978"
                        },
                        "BudgetYearThree": {
                            "val": "202.357"
                        },
                        "BudgetYearFour": {
                            "val": "251.599"
                        },
                        "BudgetYearFive": {
                            "val": "261.563"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Sensors and Processing Systems project develops and demonstrates the advanced sensor and processing technologies and systems necessary for Intelligence, Surveillance, and Reconnaissance (ISR) missions.  Future battlefields will continue to be populated with targets that use mobility and concealment as key survival tactics, and high-value targets will range from specific individual insurgents and vehicles to groups of individuals and large platforms such as mobile missile launchers and artillery.  The Sensors and Processing Systems project is primarily driven by four needs: (a) providing day-night ISR capabilities against the entire range of potential targets; (b) countering camouflage, concealment, and deception of mobile ground targets; (c) detecting and identifying objects of interest\/targets across wide geographic areas in near-real-time; and (d) enabling reliable identification, precision fire control tracking, timely engagement, and accurate battle damage assessment of ground targets.  The Sensors and Processing Systems project develops and demonstrates technologies and system concepts that combine novel approaches to sensing with emerging sensor technologies and advanced sensor and image processing algorithms, software, and hardware to enable comprehensive knowledge of the battlespace and detection, identification, tracking, engagement, and battle damage assessment for high-value targets in all weather conditions and combat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Seeker Cost Transformation (SECTR)"
                                    },
                                    "Description": {
                                        "val": "The Seeker Cost Transformation (SECTR) program will develop novel weapon terminal sensing and guidance technologies and systems for air-launched and air-delivered weapons that can: (1) find and acquire fixed and moving targets with only minimal external support, (2) achieve high navigation accuracy in a GPS-denied environment, and (3) be very small size and weight and potentially low cost.  SECTR-developed systems and technologies will be small size, weight and power (SWaP), low recurring cost, and be applicable to a wide range of weapons and missions, such as small unit lethality, suppression of enemy air defenses, precision strike, and strike of time-sensitive targets.  Hardware technology will leverage passive Electro-Optical Infrared (EO\/IR) sensors, which have evolved into very small and inexpensive devices in the commercial market, and a reconfigurable processing architecture.  SECTR will also develop a Government-owned open architecture for the seeker with standardized interfaces between components (both hardware and software).  The technical approach to target recognition will start from \"deep learning\" and machine vision algorithms pioneered for facial recognition and the identification of critical image features.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.064"
                                            },
                                            "Text": {
                                                "val": "-  Integrated prototype SECTR seeker, including all GPS-free navigation and novel target recognition subsystems, into the seeker system.\n-  Conducted prototype SECTR seeker performance laboratory tests.\n-  Performed integration of prototype SECTR seeker with multiple Precision Guided Munition (PGM) platforms.\n-  Demonstrated prototype SECTR seeker performance in hardware-in-the-loop (HWIL) tests simulating flight with integrated PGM platforms.\n- Collected realistic imagery and navigation sensor data to support algorithm development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.133"
                                            },
                                            "Text": {
                                                "val": "-  Conduct prototype SECTR seeker and precision guided munition (PGM) captive-carry flight tests and hardware-in-the-loop (HWIL) tests.\n-  Complete HWIL algorithm assessment.\n-  Conduct free-flight test of integrated prototype SECTR seeker-guided PGM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.195"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.195"
                                            },
                                            "Text": {
                                                "val": "-  Conduct additional free-flight tests of SECTR prototype seeker.\n-  Assess seeker performance and update HWIL models and assumptions as needed."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects a shift from prototype development and captive carry to free-flight testing and performance verification."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Satellite Sensors"
                                    },
                                    "Description": {
                                        "val": "The Small Satellite Sensors program will develop and space-qualify Electro-Optical Infrared (EO\/IR) sensor and inter-satellite communications technologies and establish feasibility for new DoD tactical capabilities to be implemented on small (< 100 kg) satellites.  Experimental payloads will be flown on small satellites, and data will be collected to validate new operational concepts.  Small satellites provide a low-cost and quick-turnaround capability for testing new technologies and experimental payloads.  Operationally, small and low-cost satellites enable the deployment of larger constellations, which can provide greater coverage, persistence, and survivability compared to a small number of more expensive satellites, as well as the possibility for launch-on-demand.  This program seeks to leverage rapid progress being made by the commercial sector on small satellite bus technology, as well as investments being made by DoD and industry on low-cost launch and launch-on-demand capabilities for small satellites.  The program will focus on developing, demonstrating, and validating key payload technologies needed by DoD that are not currently being developed for commercial space applications.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.651"
                                            },
                                            "Text": {
                                                "val": "-  Completed construction, integration, and ground testing of all experimental satellites.\n-  Implemented development of direct-to-user data link hardware and software on at least one satellite.\n-  Demonstrated on-board image processing technology.\n-  Developed ground-segment receivers and experimentation plan for real-time demonstrations.\n-  Delivered first EO\/IR satellite for launch into low earth orbit."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.456"
                                            },
                                            "Text": {
                                                "val": "-  Launch satellites and conduct on-orbit operations, including mission planning, payload testing, and image collection.\n-  Downlink raw imagery for ground processing and pre-processed imagery for comparative analysis.\n-  Perform data collection campaigns and analyze experimental data from satellites.\n-  Perform inter-satellite communications link tests and coordinate multi-satellite operations.\n-  Demonstrate feasibility of novel real-time tactical operational concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.058"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.058"
                                            },
                                            "Text": {
                                                "val": "-  Complete space-based data collections.\n-  Complete user demonstration and field activities.\n-  Develop models and reports which quantify effectiveness of the sensor technology and the suite of processing algorithms.\n-  Transition key results and technologies to military users for use in operational constellations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects changes in the on-orbit operations plans to align better with available launch dates."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamically Composed RF Systems"
                                    },
                                    "Description": {
                                        "val": "Dominance of the Radio Frequency (RF) spectrum is critical to successful U.S. military operations.  Radar systems, electronic warfare (EW) systems, and communication systems require custom software and hardware that is costly and time-consuming to build and integrate onto platforms.  The Dynamically Composed RF Systems program addresses these challenges by developing adaptive, converged RF array systems.  This enables enhanced operational capability by dynamically adapting the system for tasks to support radar, communications, and EW in a converged manner.  This program will design and develop: (1) a modular architecture for collaborative, agile RF systems; (2) advanced techniques for RF apertures and airframe integration and the associated wide-band agile electronics to support converged missions over those apertures; (3) a heterogeneous signal processing complex implementing hardware-agnostic RF operating modes (the RF Virtual Machine); (4) software tools for the control, coordination, and scheduling of RF functions and payloads at the element level to maximize overall task performance (a System and Sensor Resource Manager (SSRM)).  This capability can be adapted to address diverse missions.  Technology developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.356"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated prototype SSRM algorithms and software approach for controlling and scheduling RF hardware to execute converged RF functions.\n-  Developed prototype system architectures and associated interfaces for converged RF payload.\n-  Designed and tested RF Virtual Machine performing RF processing on heterogeneous processing complexes.\n-  Designed converged RF front end and apertures to address bandwidth, field of view, and sensitivity goals commensurate with the prototype system architecture and the limitations of compact platforms \/ Unmanned Aerial Vehicles (UAV)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.067"
                                            },
                                            "Text": {
                                                "val": "-  Initiate collaboration to support transition opportunities and develop approaches for integrating SSRM onto existing RF payloads. \n-  Complete interface control documents defining interfaces between the SSRM, the payload, and off-board controllers.\n-  Design and begin implementation of initial version of objective system SSRM software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.892"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.892"
                                            },
                                            "Text": {
                                                "val": "-  Complete initial version of objective system SSRM software and payload interfaces.\n-  Integrate SSRM software onto third-party payload and conduct integration testing to validate ability of SSRM to control the third party payload."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects increased program focus on SSRM application to existing RF payloads."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "All-Signal Tactical Real-Time Analyzer (ASTRAL)"
                                    },
                                    "Description": {
                                        "val": "The All-Signal Tactical Real-time Analyzer (ASTRAL) program will develop and demonstrate a system for radio frequency and optical electromagnetic signal surveillance and environment understanding.  Building on technologies explored under the Dynamically Composed RF Systems program, also budgeted in this PE\/Project, the objective of ASTRAL is to provide a factor of at least 1000 times improvement over current signal awareness processing speed over broad spectral coverage.  The program will use technology that supports a development path leading to a mobile, tactical capability.  The development objectives of the ASTRAL program are to (1) develop a hybrid processor that provides real-time processing of the most challenging Low-Probability-of-Intercept (LPI) threat signals across a wide bandwidth, and (2) identify exploitation algorithms for military applications that are well-suited to this type of hybrid processor.  Several strategic and tactical spectrum awareness applications that may be addressed include but are not limited to (a) real-time exploitation of optical communications, (b) city-wide wireless device geo-location, (c) broadband LPI radar warning, and (d) theater-wide spread-spectrum LPI radio geo-location.  ASTRAL will transition to the Services and Intelligence Community."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.680"
                                            },
                                            "Text": {
                                                "val": "-  Completed conceptual design of ultra-wide-band and high-speed signal processing approaches.\n-  Designed a brassboard hybrid signal processor capable of discovering LPI signals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.190"
                                            },
                                            "Text": {
                                                "val": "-  Identify hybrid processor architectures suited for a wide range of tactical military signal awareness applications.\n-  Integrate the brassboard hybrid signal processor system.\n-  Demonstrate LPI signal processing at broad bandwidth in a laboratory environment with simulated and real signal inputs.\n-  Select hybrid processor architectures for specific tactical military application development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.832"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.832"
                                            },
                                            "Text": {
                                                "val": "-  Begin hybrid processor architecture development, identifying risks and risk mitigation approaches.\n-  Demonstrate execution of algorithms suitable for tactical applications with brassboard system in the laboratory environment.\n-  Define concept of operations plans for tactical applications of the hybrid processor architectures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collection and Monitoring via Planning for Active Situational Scenarios (COMPASS)*"
                                    },
                                    "Description": {
                                        "val": "*formerly Cognitive Maneuver\n\nThe Collection and Monitoring via Planning for Active Situational Scenarios (COMPASS) program will build decision aids for gray zone scenarios, where adversaries attempt to manipulate a U.S.-allied nation through the use of both kinetic and non-kinetic means.  Based on research performed under the Resilient Synchronized Planning & Assessment Contested Environment (RSPACE) program, budgeted in PE 0603766E, Project NET-01, the purpose of the COMPASS program is to reduce ambiguity and reveal intent of gray zone actors who use techniques such as misinformation and intimidation to destabilize host nations and possibly produce advantageous conditions for military engagements. The tools produced by COMPASS will automate gray zone information operations and help U.S. forces adapt to changing conditions and adversary responses. Instead of relying on passive collection of sensory data, COMPASS will employ active sensing and recommend actions that U.S. Forces and allied partners can take to stimulate the environment and reveal any hostile strategies. To achieve this goal, COMPASS will build and demonstrate tools to 1) develop a dynamic model of hostile activities in a gray zone environment, 2) assess the decision space to recommend which actions may provide the highest value information, and 3) monitor execution of these actions to assess incremental progress toward reducing the ambiguity of the operating environment and suggest adjustments.  COMPASS will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.458"
                                            },
                                            "Text": {
                                                "val": "-  Develop a taxonomy for COMPASS operations.\n-  Design gray zone modeling, initial algorithms for action generation, and initial development of monitor and assessment tools.\n-  Build a library of real and synthetic data and a laboratory simulation test environment.\n-  Commence development of technology to create a situational awareness picture when critical services of the operating environment are disrupted."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.153"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.153"
                                            },
                                            "Text": {
                                                "val": "-  Increase complexity of the gray zone environment and improve the effectiveness of the algorithms for action generation.\n-  Expand situational awareness to include social activities such as economic, political, and influence campaigns.\n-  Improve the functionality of the tool to account for adversaries that adapt their behavior.\n-  Conduct demonstrations for operational users to assess utility and explore transition."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects increased modeling efforts and increased demonstrations with operational users."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross-Domain Multi-Modality Sensing & Targeting"
                                    },
                                    "Description": {
                                        "val": "The Cross-Domain Multi-Modality Sensing & Targeting program will develop sensors and exploitation techniques capable of performing wide-area search to detect high-value targets in order to task engagement systems to close effects-chains.  Finding and prosecuting targets with distributed effects chains requires the ability to detect, track, and maintain custody of targets across sensors with different modalities residing in various domains.  Building upon technologies from the Automatic Target Recognition (ATR) program, budgeted in this PE\/Project, this program will examine both the sensors and the exploitation needed to perform this wide area search for missions in denied territories and maintain positive chain of custody hand-offs to one or more targeting sensors.  The sensors developed under this program will concentrate on sensor modalities that are mostly geometry-invariant and have the potential to be used in highly proliferated systems, such as small satellite constellations and small terrestrial platforms (e.g. class-I or II unmanned aerial system).  The exploitation portion of this program will develop algorithms to ensure consistency when passing chain of custody between sensors in different domains with possibly different sensing modalities and will also be designed to increase confidence and accuracy as targets are passed between sensors.  Technology developed by this program will transition to the Services and other government agencies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.322"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.322"
                                            },
                                            "Text": {
                                                "val": "-  Begin development of exploitation algorithms suitable for abstracted target characterization to enable consistent chain of custody.\n-  Begin development of multi-mode sensor modules."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spatial, Temporal and Orientation Information for Contested Environments (STOIC)"
                                    },
                                    "Description": {
                                        "val": "The Spatial, Temporal and Orientation Information for Contested Environments (STOIC) program will enable precision cooperative effects by developing global time transfer and synchronization systems independent of GPS.  As a corollary to time synchronization, this program will also enable GPS-independent positioning to maintain precise time synchronization between collaborating mobile users.  Key attributes of this program are global availability, minimal and low cost infrastructure, anti-jamming capability, and performance equal to or better than GPS, achieved through recent advances in optical clocks and time transfer.  Demonstrations on relevant platforms in relevant environments will be used to validate the technology.  This program will transition to the Services, emphasizing platforms that operate in GPS-denied environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.457"
                                            },
                                            "Text": {
                                                "val": "-  Conducted real-time demonstrations of jam-proof Very Low Frequency (VLF)-based positioning system.\n-  Completed validation of optical clock components for long-term stability performance.\n-  Conducted real-time demonstration of precision time transfer using tactical data link signals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.189"
                                            },
                                            "Text": {
                                                "val": "-  Conduct field demonstrations of Very Low Frequency (VLF)-based positioning system with ionospheric modeling correction to validate performance in a relevant environment.\n-  Conduct evaluation and analysis of field test results.\n-  Transition VLF-based positioning system to Army and Navy acquisition programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automatic Target Recognition (ATR) Technology"
                                    },
                                    "Description": {
                                        "val": "Automatic Target Recognition (ATR) systems provide the capability to detect, identify, and track high value targets from collected sensor data.  Current ATRs are typically designed for specific sensors and provide only limited, static mission support due to pre-programmed target lists and operating modes.  Extending ATR technology to accommodate sensor upgrades or include new emerging targets can be costly and time-consuming.  The objective of the ATR Technology program is to develop technologies that reduce operational limitations while also providing significant performance improvements, dramatically reduced development times, and reduced life-cycle maintenance costs.  Recent breakthroughs in deep learning algorithms and embedded computing systems offer promise for dramatic improvements in ATR utility.  The program will focus on three core areas: (1) development of on-line adaptive algorithms that enable performance-driven sensing and ATR utility; (2) algorithm training technology that enables rapid incorporation of new targets; and (3) technologies that dramatically reduce required data rates, processing times, and the overall hardware and software demands of ATR systems.  ATR technology developed under the program is planned for transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.639"
                                            },
                                            "Text": {
                                                "val": "-  Achieved improved ATR algorithm performance, focusing on reducing processing times and system size and power requirements.\n-  Developed flightworthy, low-power prototype ATR processing hardware that executes the ATR algorithm in real-time.\n-  Demonstrated Open Mission System (OMS)-enabled ATR operation in a tactical radar System Integration Laboratory (SIL).\n-  Completed preparations for a flight demonstration of ATR algorithms running on an airborne platform, including flight verification of ATR hardware and software.\n- Performed flight demonstration of ATR algorithms operating on an airborne platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.069"
                                            },
                                            "Text": {
                                                "val": "-  Continue ATR algorithm development with the focus on significantly reducing training data requirements.\n-  Conduct additional flight demonstrations of ATR algorithms operating on an airborne platform to facilitate transition to the Services.\n-  Extend ATR applications to the National Geospatial Intelligence Agency (NGA) Scale cloud computing environment and other Intelligence Surveillance Reconnaissance (ISR) systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Video-rate Synthetic Aperture Radar (ViSAR)"
                                    },
                                    "Description": {
                                        "val": "Recent conflicts have demonstrated the need for close air support by precision attack platforms, such as the AC-130J aircraft, in support of ground forces.  Under clear conditions, targets are easily identified and engaged quite effectively, but in degraded environments, the atmosphere can inhibit traditional optical sensors.  The AC-130J must fly above cloud decks in order to avoid anti-aircraft fire, negating optical targeting sensors.  Similarly, rotary\/wing blades in urban operations generate copious amounts of dust that prevent circling assets from supplying cover fire for ground forces.  The Video-rate Synthetic Aperture Radar (ViSAR) program developed a real-time spotlight Synthetic Aperture Radar (SAR) imaging sensor that provides imagery of a region to allow high-resolution fire direction in conditions where optical sensors do not function.  Technology from this program transitioned to the Special Operations Command (SOCOM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "-  Commenced development of video SAR image processing technology.\n-  Completed trade study for design of follow-on system for engaging maneuvering targets through clouds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Radar Countermeasures (ARC)"
                                    },
                                    "Description": {
                                        "val": "The Adaptive Radar Countermeasures (ARC) program developed new algorithms for rapidly protecting DoD systems against new or unknown radar-based threats.  Protecting these systems currently relies on uniquely identifying an enemy radar and applying an appropriate, pre-programmed Electronic Countermeasure (ECM), which can take years to develop.  The emergence of digitally-programmed radars that exhibit novel behaviors and agile waveform characteristics, however, has made this approach to countering radar-based threats increasingly challenging.  Developing new ECM over several years is no longer sufficient.  ARC developed new processing techniques and algorithms that adapt in real-time to generate suitable countermeasures.  The program transitioned to Air Force, Navy, and Marine Corps airborne electronic warfare systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "-  Conducted testing of ARC against advanced, complex radar signals in static and open-air testing environments.\n-  Delivered ARC technology to Service transition partners for inclusion into identified airborne platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SEN-06"
                    },
                    "ProjectTitle": {
                        "val": "SENSOR TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "83.878"
                        },
                        "CurrentYear": {
                            "val": "72.117"
                        },
                        "BudgetYearOne": {
                            "val": "53.900"
                        },
                        "BudgetYearOneBase": {
                            "val": "53.900"
                        },
                        "BudgetYearTwo": {
                            "val": "31.360"
                        },
                        "BudgetYearThree": {
                            "val": "14.193"
                        },
                        "BudgetYearFour": {
                            "val": "3.964"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "83.878"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "72.117"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "53.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "53.900"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Details will be provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}