{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-71",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605161D8Z"
        },
        "ProgramElementTitle": {
            "val": "Nuclear Matters"
        },
        "R1LineNumber": {
            "val": "154"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "27.410"
            },
            "PriorYear": {
                "val": "5.031"
            },
            "CurrentYear": {
                "val": "5.039"
            },
            "BudgetYearOne": {
                "val": "8.307"
            },
            "BudgetYearOneBase": {
                "val": "8.307"
            },
            "BudgetYearTwo": {
                "val": "8.869"
            },
            "BudgetYearThree": {
                "val": "9.219"
            },
            "BudgetYearFour": {
                "val": "9.595"
            },
            "BudgetYearFive": {
                "val": "9.936"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FYDP funding increases are addressing the need for technical experts to assist with standing up the Security Incident Response Council (SIRC) and the Nuclear Deterrent Enterprise Review Group (NDERG)."
        },
        "ProgramElementMissionDescription": {
            "val": "The purpose of the Nuclear Matters program is to sustain the U.S. nuclear deterrent posture, counter nuclear threats, and to develop nuclear and conventional physical security equipment. The funds for this program are used to support research, development, test and evaluation efforts as well as studies and analyses for nuclear weapons security; use control; nuclear weapons stockpile safety, survivability and performance; countering nuclear threats and office management.  Funds are also used to develop and implement plans for stockpile transformation; infrastructure analyses and assessments; DoD-NNSA Nuclear Weapons Council activities, as mandated by Title 10 USC, section 179; radiological and nuclear emergency response efforts; and management of international programs of nuclear cooperation, particularly with respect to enhancing international nuclear safety and security and office management.  Nuclear Matters is also responsible for policy development and implementation for personnel reliability; nuclear weapons, nuclear command and control, and special nuclear materials security; use control; nuclear weapons transportation; physical security equipment; countering nuclear threats; and nuclear and radiological incident response.\n\nFunds address the need for technical experts to assist with standing up the Security Incident Response Council (SIRC) and the Nuclear Deterrent Enterprise Review Group (NDERG).  The SIRC is an interagency council established by Presidential Policy Directive-35, \"United States Nuclear Weapons Command and Control, Safety, and Security,\" to provide oversight over nuclear weapons security, incident response capabilities, transportation of U.S. nuclear weapons, and to exercise oversight and coordination with sub-working group.  The NDERG is a senior DoD oversight body, chaired by the Deputy Secretary of Defense to oversee and make decisions regarding implementation of recommendations from internal and external DoD nuclear enterprise reviews.\n\nAdditionally, OASD(NCB\/NM) serves as the focal point for DoD activities and initiatives related to the dual missions of sustaining a safe, secure, and effective nuclear deterrent and countering the threat from nuclear terrorism and nuclear proliferation.  Funding will be sent to Sandia National Laboratories to lead a team comprised of Sandia, Los Alamos and Lawrence Livermore National Laboratories to develop a nuclear deterrence model.  The modeling and analysis results will support the Nuclear Weapons Council strategic planning to include modernization strategies and stockpile composition assessments and investment tradeoffs.\n\nThis Program Element can fund travel to support the requirements of this program.\n\nThis appropriation will finance work, including manpower, performed by a government agency or by private individuals or organizations under a contractual or grant arrangement with the government who conduct research (systematic study directed toward fuller scientific knowledge or understanding of the subject studied), development (systematic use of the knowledge and understanding gained from research, for the production of useful materials, devices, systems, or methods, including the design and development of prototypes and processes) and test and evaluation efforts."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.232"
                },
                "CurrentYear": {
                    "val": "5.050"
                },
                "BudgetYearOne": {
                    "val": "8.619"
                },
                "BudgetYearOneBase": {
                    "val": "8.619"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.031"
                },
                "CurrentYear": {
                    "val": "5.039"
                },
                "BudgetYearOne": {
                    "val": "8.307"
                },
                "BudgetYearOneBase": {
                    "val": "8.307"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.201"
                },
                "CurrentYear": {
                    "val": "-0.011"
                },
                "BudgetYearOne": {
                    "val": "-0.312"
                },
                "BudgetYearOneBase": {
                    "val": "-0.312"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.191"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.010"
                                },
                                "CurrentYear": {
                                    "val": "-0.011"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "INV-D-032 CBDP Bio-Chem Threats Preparedness Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.312"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.312"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding was increased in FY20 to address the need for technical experts to assist with standing up the Security Incident Response Council (SIRC) and the Nuclear Deterrent Enterprise Review Group (NDERG).  Additional funds are also to support Nuclear Matters Analysis, requiring technical expertise to consolidate disparate threat assessments, capability modeling, engineering analysis and physics-based performance assessment to provide decision analytics for nuclear deterrence planning and modernization."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "161"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Matters"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "27.410"
                        },
                        "PriorYear": {
                            "val": "5.031"
                        },
                        "CurrentYear": {
                            "val": "5.039"
                        },
                        "BudgetYearOne": {
                            "val": "8.307"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.307"
                        },
                        "BudgetYearTwo": {
                            "val": "8.869"
                        },
                        "BudgetYearThree": {
                            "val": "9.219"
                        },
                        "BudgetYearFour": {
                            "val": "9.595"
                        },
                        "BudgetYearFive": {
                            "val": "9.936"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The purpose of the Nuclear Matters program is to sustain the U.S. nuclear deterrent posture, counter nuclear threats, and to develop nuclear and conventional physical security equipment. The funds for this program are used to support developmental and test and evaluation efforts as well as studies and analyses for nuclear weapons security; use control; nuclear weapons stockpile safety, survivability and performance; nuclear threat reduction and office management.  \n\nFunds are also used to develop and implement plans for stockpile transformation; infrastructure analyses, assessments and models; Nuclear Weapons Council activities, as mandated by Title 10 USC, section 179; radiological and nuclear emergency response efforts; and management of international programs of nuclear cooperation, particularly with respect to enhancing international nuclear safety and security.  \n\nNuclear Matters is also responsible for policy development and implementation for personnel reliability; nuclear weapons, nuclear command and control, and special nuclear materials security; use control; nuclear weapons transportation; physical security equipment; countering nuclear threats; and nuclear and radiological incident response.\n\nThis appropriation will finance work, including manpower, performed by a government agency or by private individuals or organizations under a contractual or grant arrangement with the government who conduct research (systematic study directed toward fuller scientific knowledge or understanding of the subject studied), development (systematic use of the knowledge and understanding gained from research, for the production of useful materials, devices, systems, or methods, including the design and development of prototypes and processes) and test and evaluation efforts.\n\nThis Program Element can fund travel to support the requirements of this program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nuclear Weapons Council (NWC)"
                                    },
                                    "Description": {
                                        "val": "The Nuclear Weapons Council (NWC) is a joint Department of Defense (DoD) and Department of Energy (DOE)\/National Nuclear Security Administration (NNSA) organization established by Congress to facilitate cooperation and coordination between the two Departments as they fulfill their dual agency responsibilities for U.S. nuclear weapons stockpile management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "- Oversee the activities on the Congressionally mandated Joint DoD-DOE Nuclear Weapons Council and its support committees to include the Nuclear Weapons Council Standing and Safety Committee, the Compartmented Advisory Committee and the Action Officer group"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.559"
                                            },
                                            "Text": {
                                                "val": "- Oversee the activities on the Congressionally mandated Joint DoD-DOE Nuclear Weapons Council and its support committees to include the Nuclear Weapons Council Standing and Safety Committee, the Compartmented Advisory Committee and the Action Officer group"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.475"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.475"
                                            },
                                            "Text": {
                                                "val": "- Oversee the activities on the Congressionally mandated Joint DoD-DOE Nuclear Weapons Council and its support committees to include the Nuclear Weapons Council Standing and Safety Committee, the Compartmented Advisory Committee and the Action Officer group"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding fluctuates based on funding availability"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "International Programs"
                                    },
                                    "Description": {
                                        "val": "The United States also participates in several international programs of cooperation regarding nuclear weapons with foreign governments and regional defense organizations that involve unclassified and classified information exchanges.  In general, these agreements are designed to promote safety and security, advance stockpile stewardship and collaborate in counter-proliferation efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.197"
                                            },
                                            "Text": {
                                                "val": "- Execute confidence building programs of cooperation with international partners.\n- Sponsor international partners at national-level nuclear weapons accident\/incident exercises."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.191"
                                            },
                                            "Text": {
                                                "val": "- Execute confidence building programs of cooperation with international partners.\n- Sponsor international partners at national-level nuclear weapons accident\/incident exercises."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "- Execute confidence building programs of cooperation with international partners.\n- Sponsor international partners at national-level nuclear weapons accident\/incident exercises."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding fluctuates based on funding availability"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear Surety"
                                    },
                                    "Description": {
                                        "val": "Because of their political and military importance, destructive power, and the potential consequences of an accident or unauthorized act, nuclear weapons and nuclear weapon systems require special consideration and must be protected against risks and threats inherent in their peacetime and wartime environments. Oversight of the DoD nuclear surety program is provided by Deputy Assistant Secretary of Defense for Nuclear Matters (DASD(NM))."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.822"
                                            },
                                            "Text": {
                                                "val": "- Conduct OSD oversight and provide direction for actions taken under DoDD 4540.5, \"Transportation of Nuclear Weapons\"; DoDD S-5210.81, \"United States Nuclear Weapons Command and Control, Safety, and Security\"; DoDD S-3150.7, \"Controlling the Use of Nuclear Weapons\"; DoDD 5210.42 and 5210.42-R, \"The DoD Personnel Reliability Program'; and DoDD 5210.41 and S-5210.41-M, \"Physical Security of Nuclear Weapons.\"\n- Support activities that support nuclear surety policy and provide OSD oversight of the Nuclear Surety program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.745"
                                            },
                                            "Text": {
                                                "val": "- Conduct OSD oversight and provide direction for actions taken under DoDD 4540.5, \"Transportation of Nuclear Weapons\"; DoDD S-5210.81, \"United States Nuclear Weapons Command and Control, Safety, and Security\"; DoDD S-3150.7, \"Controlling the Use of Nuclear Weapons\"; DoDD 5210.42 and 5210.42-R, \"The DoD Personnel Reliability Program'; and DoDD 5210.41 and S-5210.41-M, \"Physical Security of Nuclear Weapons.\"\n- Support activities that support nuclear surety policy and provide OSD oversight of the Nuclear Surety program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.745"
                                            },
                                            "Text": {
                                                "val": "- Conduct OSD oversight and provide direction for actions taken under DoDD 4540.5, \"Transportation of Nuclear Weapons\"; DoDD S-5210.81, \"United States Nuclear Weapons Command and Control, Safety, and Security\"; DoDD S-3150.7, \"Controlling the Use of Nuclear Weapons\"; DoDD 5210.42 and 5210.42-R, \"The DoD Personnel Reliability Program'; and DoDD 5210.41 and S-5210.41-M, \"Physical Security of Nuclear Weapons.\"\n- Support activities that support nuclear surety policy and provide OSD oversight of the Nuclear Surety program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding fluctuates based on funding availability"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stockpile Transformation"
                                    },
                                    "Description": {
                                        "val": "To meets its security needs and those of its allies, the U.S. will need a safe, secure, and reliable nuclear deterrent for the foreseeable future.  There's increased risk, absent nuclear testing, in assuring long-term safety and reliability of today’s aging stockpile—the legacy warheads left over from the Cold War.  Today’s nuclear weapons complex is not sufficiently “responsive” to technical problems in the stockpile, or to potential emerging threats.  The task is to ensure the U.S. nuclear weapons stockpile and supporting infrastructure, meets long-term national security needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.832"
                                            },
                                            "Text": {
                                                "val": "- Conduct life cycle activities in support of the nuclear weapons stockpile under DoDD 3150.1, \"Nuclear Weapons Life Cycle\" and DoDI 5030.55, \"DoD Procedures for Joint DoD-DOE Nuclear Weapons Life Cycle Activities.\n- Manage DoD RDT&E activities for nuclear warheads to include B61, W76, W78, W80(0,1), B83, W87, W88 Weapons.\n- Support studies for warhead replacement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.223"
                                            },
                                            "Text": {
                                                "val": "- Conduct life cycle activities in support of the nuclear weapons stockpile under DoDD 3150.1, \"Nuclear Weapons Life Cycle\" and DoDI 5030.55, \"DoD Procedures for Joint DoD-DOE Nuclear Weapons Life Cycle Activities.\n- Manage DoD RDT&E activities for nuclear warheads to include B61, W76, W78, W80(0,1), B83, W87, W88 Weapons.\n- Support studies for warhead replacement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.126"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.126"
                                            },
                                            "Text": {
                                                "val": "- Conduct life cycle activities in support of the nuclear weapons stockpile under DoDD 3150.1, \"Nuclear Weapons Life Cycle\" and DoDI 5030.55, \"DoD Procedures for Joint DoD-DOE Nuclear Weapons Life Cycle Activities.\n- Manage DoD RDT&E activities for nuclear warheads to include B61, W76, W78, W80(0,1), B83, W87, W88 Weapons.\n- Support studies for warhead replacement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding fluctuates based on funding availability"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability and Weapons of Mass Destruction (WMD)"
                                    },
                                    "Description": {
                                        "val": "In the 2010 Quadrennial Defense Review (QDR), the SECDEF directed the Department to rebalance its policy, doctrine, and capabilities to better support six key missions.  The fifth on the list of key missions is to prevent proliferation and counter weapons of mass destruction.  This project directly supports the nation’s defense strategy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.724"
                                            },
                                            "Text": {
                                                "val": "Continue to:\n- Oversee the Nuclear Defense Portfolio.\n- Plan and coordinate the activities of the National Nuclear Forensics Steering Committee and Working Group.\n- Develop OSD-wide approach to overseeing Global Nuclear Defense missions within DoD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.711"
                                            },
                                            "Text": {
                                                "val": "Continue to:\n- Oversee the Nuclear Defense Portfolio.\n- Plan and coordinate the activities of the National Nuclear Forensics Steering Committee and Working Group.\n- Develop OSD-wide approach to overseeing Global Nuclear Defense missions within DoD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.711"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.711"
                                            },
                                            "Text": {
                                                "val": "Continue to:\n- Oversee the Nuclear Defense Portfolio.\n- Plan and coordinate the activities of the National Nuclear Forensics Steering Committee and Working Group.\n- Develop OSD-wide approach to overseeing Global Nuclear Defense missions within DoD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding fluctuates based on funding availability"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear Matters Support Program"
                                    },
                                    "Description": {
                                        "val": "The Nuclear Matters support program conducts studies \/ analyses; DoD-NNSA Nuclear Weapons Council activities; and provides funding for analytical support functions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.709"
                                            },
                                            "Text": {
                                                "val": "- Submit annual reports to the President and the Congress.\n- Continue to oversee DoD\/DOE relationship regarding the survivability and surety of the national nuclear stockpile.\n- Continue as DoD Sigma 15 Approval Authority (Interface with DOE\/NNSA).\n- Continue to address Freedom of Information Act and Mandatory Declassification Requests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.723"
                                            },
                                            "Text": {
                                                "val": "- Submit annual reports to the President and the Congress.\n- Continue to oversee DoD\/DOE relationship regarding the survivability and surety of the national nuclear stockpile.\n- Continue as DoD Sigma 15 Approval Authority (Interface with DOE\/NNSA).\n- Continue to address Freedom of Information Act and Mandatory Declassification Requests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.675"
                                            },
                                            "Text": {
                                                "val": "- Submit annual reports to the President and the Congress.\n- Continue to oversee DoD\/DOE relationship regarding the survivability and surety of the national nuclear stockpile.\n- Continue as DoD Sigma 15 Approval Authority (Interface with DOE\/NNSA).\n- Continue to address Freedom of Information Act and Mandatory Declassification Requests."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding fluctuates based on funding availability"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Security and PPBE Support"
                                    },
                                    "Description": {
                                        "val": "Provides contract support services that support the Physical Security Enterprise & Analysis Group, the Security Policy Verification Committee and all Planning, Programming, Budgeting and Execution needs for the Office of the Assistant Secretary of Defense for Nuclear, Chemical and Biological Defense Programs \/ Nuclear Matters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.147"
                                            },
                                            "Text": {
                                                "val": "- Support the Physical Security Enterprise & Analysis Group\n- Support the Security Policy Verification Committee \n- Provide all Planning, Programming, budgeting and Execution support for the Nuclear Matters' portfolio"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.887"
                                            },
                                            "Text": {
                                                "val": "- Support the Physical Security Enterprise & Analysis Group\n- Support the Security Policy Verification Committee \n- Provide all Planning, Programming, budgeting and Execution support for the Nuclear Matters' portfolio"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.875"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.875"
                                            },
                                            "Text": {
                                                "val": "- Support the Physical Security Enterprise & Analysis Group\n- Support the Security Policy Verification Committee \n- Provide all Planning, Programming, budgeting and Execution support for the Nuclear Matters' portfolio"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding fluctuates based on funding availability"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nuclear Deterrent Enterprise Review Group (NDERG)"
                                    },
                                    "Description": {
                                        "val": "The NDERG is a senior Department of Defense oversight body, chaired by the Deputy Secretary of Defense and including the Vice Chairman of the Joint Chiefs of Staff and other senior leaders across the Department of Defense nuclear enterprise, created to oversee and make decisions\nregarding implementation of recommendations from both the internal and external DoD nuclear enterprise reviews. The NDERG meets on a biennial basis and provides a forum for senior Defense leaders to assure accountability in following and tracking the long-term effectiveness of actions taken to improve the health of the nuclear enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "The NDERG will oversee and synchronize all actions across the nuclear enterprise, including those from the Nuclear Posture Review and any future reviews and\/or assessments of any portion of the nuclear enterprise and is supported in its responsibilities by a next level down committee which meets on a quarterly basis and the action officer’s group, which meets monthly."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The NDERG mission was transferred from OSD CAPE to Nuclear Matters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Security and Incident Response Council (SIRC)"
                                    },
                                    "Description": {
                                        "val": "The SIRC is an interagency council established, as prescribed by Presidential Policy Directive-35 (PPD-35), \"United States Nuclear Weapons Command and Control, Safety, and Security,\" to provide oversight over nuclear weapon security (excluding weapon designs), incident response capabilities, transportation of U.S. nuclear weapons, and to exercise oversight and coordination of the Nuclear Weapons Accident and Incident Response Subcommittee, the Security Policy Verification Committee, and the Nuclear Transportation Working Group and other activities as may from time to time arise that are directly related to Annex B of PPD-35. The SIRC membership includes senior officials from the Department of Defense, the Department of Justice\/Federal Bureau of Investigation, the Departments of Homeland Security, State and Energy and the Office of the Director of National Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Assist in coordinating the functions of the SIRC and its supporting subordinate groups; conducting research and analysis to determine compliance and\/or deficiency of remediation; provide studies and analyses in the conduct of SIRC support activities; assist with various requirements to develop materials and facilitate liaisons and information exchange with the Services, combatant commands and other agencies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The SIRC was established as prescribed by Presidential Policy Directive-35 (PPD-35)."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Success in this area is measured by compliance with various statutes and DoD directives that govern the conduct of the affairs within the Office of DASD(Nuclear Matters).  Success is also measured by the currency of information and usability of the website, timeliness and responsiveness of reports due to Congress, performance in various response exercises, and feedback from a number of senior-level government organizations that DASD(Nuclear Matters) supports."
                        }
                    }
                }
            ]
        }
    }
}