{
    "id": "2020-TheJointStaff-PB-0400-JBOOK-4ba8da937ea15da5e229c077d6882054aed484024eab909c61902b7ab09d32d5-3",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-TJS-U_RDTE_JustificationBook_The_Joint_Staff_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_The_Joint_Staff_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0204571J"
        },
        "ProgramElementTitle": {
            "val": "Joint Staff Analytical Support"
        },
        "R1LineNumber": {
            "val": "180"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "15.855"
            },
            "PriorYear": {
                "val": "22.712"
            },
            "CurrentYear": {
                "val": "16.658"
            },
            "BudgetYearOne": {
                "val": "9.216"
            },
            "BudgetYearOneBase": {
                "val": "9.216"
            },
            "BudgetYearTwo": {
                "val": "4.216"
            },
            "BudgetYearThree": {
                "val": "4.216"
            },
            "BudgetYearFour": {
                "val": "4.214"
            },
            "BudgetYearFive": {
                "val": "4.214"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Staff Analytical Support (JSAS) family of programs provide defense analytical support capabilities for the Joint Staff and Combatant Commands (CCMDs).  JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulate results to assist the Chairman in fulfilling his statutory responsibilities.  Key deliverables provided by JSAS include development and implementation of Joint Concepts, wide-ranging force structure assessments, course of action development for the joint force environment, analyses and studies to aid in decision-making, and other analysis efforts to implement timely, low-cost joint force development initiatives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.712"
                },
                "CurrentYear": {
                    "val": "6.658"
                },
                "BudgetYearOne": {
                    "val": "4.959"
                },
                "BudgetYearOneBase": {
                    "val": "4.959"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "22.712"
                },
                "CurrentYear": {
                    "val": "16.658"
                },
                "BudgetYearOne": {
                    "val": "9.216"
                },
                "BudgetYearOneBase": {
                    "val": "9.216"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "10.000"
                },
                "BudgetYearOne": {
                    "val": "4.257"
                },
                "BudgetYearOneBase": {
                    "val": "4.257"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.257"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.257"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 Congressional add of $10,000K to Global Force Management (GFM) for advanced wargaming. \nFY 2020 is a combonation of an increase of $5,000K to GFM DI to reflect CJCS requirement to execute global force management, and a decrease of $743K from Joint Force Development to maintain balance at the program level."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Future Joint Force Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.955"
                        },
                        "PriorYear": {
                            "val": "5.712"
                        },
                        "CurrentYear": {
                            "val": "5.301"
                        },
                        "BudgetYearOne": {
                            "val": "4.216"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.216"
                        },
                        "BudgetYearTwo": {
                            "val": "4.216"
                        },
                        "BudgetYearThree": {
                            "val": "4.216"
                        },
                        "BudgetYearFour": {
                            "val": "4.214"
                        },
                        "BudgetYearFive": {
                            "val": "4.214"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Staff Analytical Support (JSAS) program supports the Chairman of the Joint Chiefs of Staff Title 10, Section 153 statutory responsibilities for the analytical support, management, development, evaluation, and implementation of joint concepts in order to advance the operational effectiveness of the future Joint Force and enable the introduction of new capabilities. The Joint Concepts program supports the Chairman's statutory responsibility to provide “best military advice” to the SECDEF and POTUS by expressing his vision for the future joint force; addressing operational problems on a 20 year horizon; identifying joint force development implications; and identifying capabilities required to mitigate and solve future joint warfighting gaps. The overarching goal is to enable investment decisions between near and far term. Concepts drive horizontal integration for force development across the Services, Combatant Commands, Defense agencies, OSD and Joint Staff. An intent of the Joint Concepts program is to support senior leader decisions in balancing today’s requirements and future force requirements. Key deliverables include:  \n\nCapstone Concept for Joint Operations (CCJO) that provides the Chairman's vision for the future joint operations and establishes aim points for the development of the future Joint Force. The key theme is globally integrated operations. \n\nFamily of Joint Concepts, based on National Military Strategy (NMS), provides operational approaches to future challenges or opportunities with respect to Russia, China, Iran, North Korea, and Countering Violent Extremist Organizations in order to guide current and future Joint Force development. \n\nJoint Concept Transition Plans, developed for each joint concept, document approaches for Doctrine, Organization, Training, Material, Leadership, Personnel and Facilities (DOTMLPF) changes in the future Joint Force and identifies conceptual ideas that may require further exploration.  \n\nJoint Operating Environment (JOE) describes the future security environment and projects the implications of change for the Joint Force so it can anticipate and prepare for potential conflicts. The JOE articulates the circumstances that are likely to alter the security environment and explores how the intersection and interaction of these changes might impact the character of war in the future. Finally, the JOE provides a framework to think about the full range of Joint Force missions and how they may evolve over time.\n\nThe International Force Development Division’s (IFDD) mission is to ensure collaboration and integration throughout the spectrum of joint force development.  This ensures both the Joint Staff, its allies, and partners can invest in initiatives and conduct interoperable and seamless operations to meet the objectives in the NMS. The Multinational Capability Development Campaign (MCDC) is an initiative led by the United States Joint Staff, J-7, and partners with 22 countries and international organizations.  It is designed to develop and assess non-materiel force development solutions and close capability gaps within multi-national operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Joint Force Development"
                                    },
                                    "Description": {
                                        "val": "Current efforts focus is on updating the Capstone Concept for Joint Operations (CCJO) so it extends the strategic approach developed in the 2016 NMS out to 2035. The CCJO revision will provide a common view of the future operating environment and a vision for how the future joint force will conduct globally integrated operations.  Also, the revised CCJO will identify force development implications and required capabilities to maintain U.S. competitive advantage against emerging threats out to 2035. In partnership with selected Combatant Commands and the Services, development of the Joint Operating Concepts to address strategic challenges has begun. Prospectuses were developed to initiate Supporting Joint Concepts in the areas of space, intelligence, deterrence, and operating in a CBRN environment. Study of the 2035 operating environment continues and informs understanding of military challenges associated with the common view of the future operating environment.  Work with Five Eyes (FVEY) countries is focused on developing a FVEY common view of the future operating environment culminating in a report due by the end of 2018.  Joint Concept for Integrated Campaigning and the Joint Concept for Operating in the Information Environment completed development and were approved by the VCJCS.  Concept implementation is underway for both concepts as well as the Joint Concepts for Rapid Aggregation, Robotic and Autonomous Systems, Human Aspects of Military Operations, Access and Maneuver in the Global Commons, Preventing the Transfer and Use of Weapons of Mass Destruction, and Operational Contract Support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.712"
                                            },
                                            "Text": {
                                                "val": "Execute the Chairman's Joint Concept Program.  Continue support for the NMS and execution of senior leader direction to develop a Capstone Concept for Joint Operations. In partnership with selected CCMDs, the Services and other Joint Staff directorates, obtain Vice CJCS approval of the JOC for China and Russia.  Begin final official staffing of JOC – North Korea and complete the prospectus and initial draft of JOC – Iran. Support the development of JOC – Counter Violent Extremist Organizations.  Continue futures study to inform our understanding of the challenges of the future operating environment. Continue implementing approved Joint Concepts in accordance with CJCS Instruction 3010.  Continue multinational partnerships in futures and concept development.  Continue integrating Joint Concepts across the Joint Staff to inform DOTMLPF capability development decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.301"
                                            },
                                            "Text": {
                                                "val": "Execute the Chairman's Joint Concept program.  Complete the Capstone Concept for Joint Operations: Joint Force 2030 approved by the CJCS.  Support development of the Joint Military Net Assessment in terms of how the joint force is achieving Joint Force 2030 as input to the Chairman’s Program Recommendation to the Secretary of Defense.  In partnership with CCMDs, the Services and other Joint Staff directorates, complete development and obtain Vice CJCS approval of the Joint Operating Concepts for China and Iran.  Provide support to U.S. Special Operations Command to develop JOC – Counter Violent Extremist Organizations and the associated transition plan.  Provide support for concept sponsors developing Supporting Joint Concepts in the areas of space, intelligence, deterrence, and operating in a CBRN environment. Continue futures study to inform our understanding of the challenges of the future operating environment.  Continue implementing approved Joint Concepts as described in CJCS Instruction 3010.  Maintain and enhance multinational partnerships in concept development.  Integrate Joint Concepts across the Joint Staff to inform DOTMLPF capability development decisions and explore new joint force adaptations and innovations posited by Joint Concepts in exercises, wargames, and experimentation.  \n\nMajor events and projects in 2019 will include the International Concept Development and Experimentation Conference, a U.S. \/ NATO co-led event that is the annual forum of Supreme Allied Command Transformation and Joint Staff to provide a unique opportunity for the international concept development and experimentation community and stakeholders to discuss the most current issues of concept development and experimentation in the capability development process. Additional projects and events include travel to the MCDC Executive Steering Group (ESG) and National Directors’ meetings to provide governance for the MCDC program as well as travel in support of U.S. led projects in the areas of logistics, personnel recovery, cyber, command and control and information sharing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.216"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.216"
                                            },
                                            "Text": {
                                                "val": "Execute the Chairman's Joint Concept program.  Publish an update of the Joint Operating Environment 2035.  Support development of the Joint Military Net Assessment in terms of how the joint force is achieving the CJCS’s Capstone Concept for Joint Operations.  Joint Force 2030 as input to the chairman’s program recommendation to the Secretary of Defense.  In partnership with the concept sponsors, CCMDs, the services and other Joint Staff directorates, complete development and obtain Vice CJCS approval of supporting Joint Concepts in the areas of space, intelligence, deterrence, and operating in a CBRN environment. Continue futures study to inform our understanding of the challenges of the future operating environment.  Continue implementing approved Joint Concepts as described in CJCS Instruction 3010.  Maintain and enhance multi-national partnerships in concept development.  Integrate Joint Concepts across the Joint Staff to inform DOTMLPF capability development decisions and explore new joint force adaptations and innovations posited by Joint Concepts in exercises, war games, and experimentation. \n\nMCDC major events and projects in 2020 will include travel associated with:  Identification of multi-national force development capability gaps; developing and evaluating corresponding non-material solutions; managing plans for the transition, implementation and integration of the resulting multi-national and international force development capabilities to meet present and future operational needs of the warfighter; conducting stakeholder analysis and engagements with senior civilian and military officers within the Joint Staff, Combatant Commands, Services, NATO Allied Command Transformation (ACT), other DoD activities, and multi-national partners.  Additional travel to the MCDC Executive Steering Group (ESG) and National Directors’ meetings is required to provide governance for the MCDC program to include:  Cyber\/cyber defense, mil\/civ info sharing, logistics, joint personnel recovery, combined operational fires, and lethal\/non-lethal actions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding for FY 2019 thru FY 2022 is a result of mandated 25% Management Headquarters Activities (MHA) reductions prescribed by the 2016 NDAA."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Concept development performance metrics are derived from the Chairman’s Title 10 responsibilities and guidance for developing and implementing Joint Concepts. These measures and metrics inform the Department’s senior leadership by providing an azimuth for future joint force development. \n\nPerformance measure 1 – Joint Concepts were developed to examine military challenges and propose innovative joint solutions and associated capabilities in support of defense needs and priorities.\nMetric: Joint Concepts align and inform the National Military Strategy, informed by rigorous futures analysis. The Joint Concepts Program resulted in relevant and timely advocacy among operations, plans, and force development communities.  \n\nPerformance measure 2 – Joint Staff provided leadership for the development of Joint Concepts in collaboration with joint and multi-national partners.  \nMetric:  Joint Concepts governance system supports joint force development recommendations to the CJCS to support his provision of “best military advice” to the President and other national leaders.  Ideas and solutions are rigorously and objectively evaluated within a joint and multinational context.  Joint Concepts are continually monitored to ensure consistency, relevancy, and utility throughout their life cycle.  \n\nPerformance measure 3 – Implement Joint Concepts. \nMetric:  Transition plans promote informed decisions for joint force development that leverage, integrate or inform related net assessments, DOTMPLF capability development programs, and innovative ideas for exploration for maximum efficiency and effectiveness."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "GFM DI Enterprise Force Structure (EFS) Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.900"
                        },
                        "PriorYear": {
                            "val": "17.000"
                        },
                        "CurrentYear": {
                            "val": "11.357"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Global Force Management (GFM) data initiative Enterprise Force Structure (EFS) effort provides the next steps for GFM mission application enhancements required to balance global force demand against available military force. This complex task requires technologies that provide integrated information obtained by linking force structure quantitative data (derived from the GFM organizational servers) to qualitative data of Capability, Readiness, Availability and Employment\/Location data (C.R.A.E.) resident in GFM mission applications and associated data bases. The Joint Staff is responsible for GFM allocation and will employ a strategy for efficiently providing Enterprise Force Structure (EFS) data utility.\n\nDoD must meet national military objectives that range from large force scenarios to small-scale activities. Our adversaries demonstrate the ability to readily transition from non-kinetic to kinetic effects. Consequently, Information Technology (IT) superiority, capabilities, and recognition of associated vulnerabilities are an operational imperative. Yet, warfighters, strategic planners and GFM decision makers are unable to exchange information in a manner that rapidly and accurately enables force sourcing activities to support SecDef decisions. The Joint Staff is mandated to utilize the Service’s organizational server EFS data to enhance managing, assessing, and displaying the health and worldwide disposition of U.S. Forces. Key deliverables include incrementally developed, operationally realistic capability enhancements focused on resource-informed planning and GFM sourcing functionality required by numerous Joint Staff requirements documents.\n\nThe Joint Staff Analytical Support (JSAS) enterprise force structure data integration efforts enables Project ORION: a Global Laydown Server and a Joint Force Capabilities Catalog along with functional applications that support a global visibility capability. This capability enhances resource-informed planning, global force management and joint deployment. Global visibility capability also supports future force integration and concept implementation needed to support timely and dynamic response to Combatant Commanders’ contingency requirements. Project ORION creates a technical environment that enables rapid integration of the JOPES replacement with remaining GFM data that supports planning and execution of U.S. Military Operations. Project Orion provides operational force structure and the means to allocate and attach units. This capability is the cornerstone for fulfilling the CJCS-directed requirement to integrate force planning, support planning, and deployment planning and execution of military operations. The ORION environment supports all variants of planning and execution processes by providing portal access to authoritative data aggregated in the Global Laydown Servers and associated display of force capabilities, readiness, employment, and availability of the force. This is a cost-effective yet full spectrum approach to support and assist the Chairman in fulfilling his statutory responsibilities while improving current and future joint force management."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GFM Data Initiative (GFM DI) Enterprise Force Structure Integration (EFS)"
                                    },
                                    "Description": {
                                        "val": "The GFM DI EFS integration effort requires RDT&E funds to operationalize force structure data from the service's Organizational Servers to actual forces for employment within the purview of allocation and Joint command and control. This GFM DI effort within the Joint Staff Analytical Support (JSAS) family of programs will immediately streamline the SECDEFs \"Forces for Unified Commands\" memorandum Assignment Tables. RDT&E efforts for assignment and apportionment functions ended in FY 2015 with the declaration of Full Operation Capability (FOC) for the Automated Global Force Management Tool. GFM DI planned milestones must be met to enable a global visibility capability. GFM applications managed by the Joint Staff are used by the JSAS family of programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "RDT&E work will focus on the continued incremental development of the Joint Force Capabilities Catalog (JFCC) to operationalize the GFM DI by linking DoD Service force structure to dynamic GFM factors (capabilities, readiness, availability, employment and location) within the Global Laydown Server (GLS). This capability will provide a dynamic representation of military force disposition. GLS algorithms will enable the GFM mission applications to present meaningful information required for timely and accurate decision making to assist the Chairman in providing military advice. The JFCC will serve as a user interface that uses the GLS algorithms to streamline operations planning and GFM execution in support of Combatant Commander requirements. \n\nThe FY 2018 strategy will focus on a unit type capabilities registration functionality within the JFCC that will unify the unit-based readiness and unit type reporting process by obtaining on-hand forces (personnel and equipment) via the EFS (GFM DI) standard format. The FY 2018 incremental development of the JFCC virtual application and associated dynamic force visibility will provide the true inventory of force availability based on Service employable entities (unit types) and sustainability factors, to enable the use of on-hand Service force capabilities identified down to the Service-defined lowest deployable entities for executive decision making and GFM mission execution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.357"
                                            },
                                            "Text": {
                                                "val": "Specific RDT&E work will focus on efforts to implement timely, low-cost initiatives and Global Force Management (GFM) focused tools delivering a global visibility of the disposition of DoD forces on an operational enterprise. This supports the preferred munitions and engineering and cross-servicing arrangements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Specific RDT&E work will focus on the development and fielding of specific functional capability applications resident in the ORION environment, and riding on the Global Laydown Server, to meet the CJCS decision support requirements for full operating capability. These include: Force Element Inventory – Predictive Analysis Tool, Preferred Munitions Synchronization Tool, Readiness Synchronization Tool, Constellation Tool, and the TPFDD Visualization Tool."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Net funding decrease from FY19 to FY20 reflects project nearing full operational capability."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Success of the JSAS enterprise force integration and ultimate global visibility capability provided by Project ORION and are measured by the following: \n\n(1) Meet initial operational capability providing decision-making information for policy-makers and Combatant Commanders.\n\n(2) Reduce the manual process of assembling Capability, Readiness, Availability, Employment (CRAE) data.\n\n(3) Services, CCMDs, Joint Staff and OSD are be able to efficiently manage (collect and analyze) force generation data supporting joint planning and GFM in far less time than the current process, and with an authoritative common view of the sourcing-to-employment tracking of forces.\n\n(4) Enables rapid information generation when making time-sensitive decisions and allows Joint Planners to inculcate force structure data into the GFM sourcing solution generation and deployment planning, execution, and distribution processes.\n\n(5) Meet full operating capability by the end of FY 2020 for GFM Allocation and senior-level decision support functionality."
                        }
                    }
                }
            ]
        }
    }
}