{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-83",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305245D8Z"
        },
        "ProgramElementTitle": {
            "val": "Intelligence Capabilities and Innovation"
        },
        "R1LineNumber": {
            "val": "187"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "15.255"
            },
            "CurrentYear": {
                "val": "189.529"
            },
            "BudgetYearOne": {
                "val": "21.081"
            },
            "BudgetYearOneBase": {
                "val": "21.081"
            },
            "BudgetYearTwo": {
                "val": "20.640"
            },
            "BudgetYearThree": {
                "val": "19.851"
            },
            "BudgetYearFour": {
                "val": "20.167"
            },
            "BudgetYearFive": {
                "val": "20.597"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Intelligence Capabilities and Innovation (ICI) funds intelligence problem curation processes, commercial technology piloting, and the development, testing, prototyping and demonstration of innovative intelligence capabilities to integrate intelligence and counterintelligence activities across numerous domains and technical areas including Signals Intelligence (SIGINT), Measurements and Signature Intelligence (MASINT), electronic warfare, cyber, Geospatial Intelligence (GEOINT), multi-sensor integration, biometrics, identity management, collection management, special communications, clandestine operations, and tagging, tracking and locating.  Innovation is the rapid experimentation and development of existing technologies (hardware, software, licenses, databases, analytics, etc.) to create new capabilities and demonstrate their intelligence value in support of warfighter operations.\n\nICI also funds Project Maven a rapid fielding Artificial Intelligence (AI) program to augment and automate Processing, Exploitation and Dissemination (PED)  for full motion video Tactical Unmanned Aerial Vehicles (TUAVs), Medium Altitude, High Altitude, and Wide Area Motion Imagery (WAMI) ISR platforms in support of defeat-ISIS and National Defense Strategy (NDS) peer\/near peer competitor strategy. Maven also brings AI to Captured Enemy Material (CEM), Acoustical Intelligence (ACINT), Overhead Persistent Infrared program (OPIR) and Public Available Information (PAI) exploitation.   Maven uses AI, deep learning, and computer vision algorithms to detect, classify, and track objects within Full Motion Video (FMV) images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. Maven algorithms increase the intelligence value of Intelligence, Surveillance and Reconnaissance (ISR), reduce the human burden of screening so analysts can multi-task increasing productivity, and seeds the generation of insight from GEOINT. Project Maven is a commercial technology initiative that inserts commercial AI into existing programs of records. Most military intelligence exploitation systems were designed pre-AI and require specialized integration to enable the insertion of algorithms into their software baseline. Project Maven is the pathfinder AI initiative for the DoD and is investing in critical AI architecture to support the rapid expansion of AI to other mission areas besides GEOINT. As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform).  The MAVEN funding will move to the newly created Algorithmic Warfare Cross Functional Team, Program Element (PE) 0307588D8Z beginning in FY 2020."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.992"
                },
                "CurrentYear": {
                    "val": "109.529"
                },
                "BudgetYearOne": {
                    "val": "71.551"
                },
                "BudgetYearOneBase": {
                    "val": "71.551"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.255"
                },
                "CurrentYear": {
                    "val": "189.529"
                },
                "BudgetYearOne": {
                    "val": "21.081"
                },
                "BudgetYearOneBase": {
                    "val": "21.081"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.737"
                },
                "CurrentYear": {
                    "val": "80.000"
                },
                "BudgetYearOne": {
                    "val": "-50.470"
                },
                "BudgetYearOneBase": {
                    "val": "-50.470"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.037"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "80.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.700"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Departmental Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-50.470"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-50.470"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "MAVEN funding will move to the newly created Algorithmic Warfare Cross Functional Team PE 0307588D8Z beginning in FY 2020.\n."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "245"
                    },
                    "ProjectTitle": {
                        "val": "Innovation and MAVEN"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "15.255"
                        },
                        "CurrentYear": {
                            "val": "189.529"
                        },
                        "BudgetYearOne": {
                            "val": "21.081"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.081"
                        },
                        "BudgetYearTwo": {
                            "val": "20.640"
                        },
                        "BudgetYearThree": {
                            "val": "19.851"
                        },
                        "BudgetYearFour": {
                            "val": "20.167"
                        },
                        "BudgetYearFive": {
                            "val": "20.597"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Intelligence Capabilities and Innovation funds the development, testing, prototyping and demonstration of innovative intelligence capabilities to integrate intelligence and counterintelligence activities across numerous domains and technical areas including SIGINT, MASINT, electronic warfare, cyber, GEOINT, multi-sensor integration, biometrics, identity management, collection management, special communications, clandestine operations, and tagging, tracking and locating.\n\nICI also funds Project Maven which fields increasing amounts of automation to FMV ground exploitation stations for TUAVs, Medium Altitude, High Altitude ISR platforms and accelerates the development and deployment of AI capabilities across the Defense Intelligence Enterprise, including exploitation of CEM, ACINT, OPIR and PAI exploitation. Maven uses artificial intelligence, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon) and other AI algorithms for CEM and text based projects. Maven algorithms increase the intelligence value of ISR, reduce the human burden of screening so analysts can multi-task increasing productivity, and seeds the generation of insight from GEOINT. Project Maven is a commercial technology initiative that inserts commercial AI into existing programs of records. Most military intelligence exploitation systems were designed pre-AI and require specialized integration to enable the insertion of algorithms into their software baseline. Project Maven is the pathfinder AI initiative for the DoD and is investing in critical AI architecture to support the rapid expansion of AI to other mission areas besides GEOINT.  As Maven algorithms increase in capability, the algorithms will move to the edge (on the sensor platform)."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Project Maven"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "80.000"
                                        },
                                        "Text": {
                                            "val": "Project Maven uses Rapid prototype sprints to field increasing amounts of automation to FMV ground exploitation stations for TUAVs, Medium Altitude and High Altitude ISR platforms. Maven uses artificial intelligence, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon). Project Maven develops algorithms focused on tactical UAV FMV ATR and an operational PED environment for platforms and ground stations. Maven builds capabilities, integrate AI and ML to provide actionable intelligence and enhance military decision-making by providing algorithms for object detection, classification and user alerts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ICI"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.255"
                                            },
                                            "Text": {
                                                "val": "Develops Intelligence Capabilities and Innovation capabilities and capacity to support Combatant Commands, Combat Support Agencies, and Services to execute cyber and asymmetric operations activities.  This includes critical and emerging intelligence capabilities and innovation as well as emerging technology solutions in support of Defense Intelligence Enterprise cyber and technical collection requirements and gaps."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "109.529"
                                            },
                                            "Text": {
                                                "val": "Project ICI, develops Intelligence Capabilities and Innovation capabilities and capacity to support Combatant Commands, Combat Support Agencies, and Services to develop and prototype critical and emerging intelligence capabilities and innovation as well as emerging technology solutions in support of Defense Intelligence Enterprise gaps to include cyber, security and technical collection requirements.\n\nProject Maven uses Rapid prototype sprints to field increasing amounts of automation to FMV ground exploitation stations for TUAVs, Medium Altitude and High Altitude ISR platforms. Maven uses artificial intelligence, deep learning, and computer vision algorithms to detect, classify, and track objects within FMV images (e.g., person, vehicle, and weapon). This initiative brings artificial intelligence, deep learning, and computer vision into the process of object detection, identification, and tracking at computer process speed versus human speed. Incorporating computer vision and algorithms will reduce the human burden and provide efficient and effective exploration of data. Project Maven develops algorithms focused on tactical UAV FMV Automatic Target Recognition (ATR) and an operational PED environment for platforms and ground stations. AW builds capabilities,  integrate AI and machine learning (ML) to provide actionable intelligence and enhance military decision-making by providing algorithms for object detection, classification and user alerts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.081"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.081"
                                            },
                                            "Text": {
                                                "val": "Project ICI, continues to develop Intelligence Capabilities and Innovation capabilities and capacity to support Combatant Commands, Combat Support Agencies, and Services. New focus areas are aligned to the National Defense Strategy and meeting the Secretary of Defense goals to increase lethality for Department."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease between FY 2019 and FY 2020 is due to the MAVEN funding moving to the newly created Algorithmic Warfare Cross Functional Team PE 0307588D8Z beginning in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Intelligence Capabilities and Innovation acquisition, management, and contracting strategy follows guidance outlined in the DoD 5000 series directives, Federal Acquisition Regulation (FAR) and FAR supplement policies and procedures.  Management uses project management tools and meetings to ensure delivery of stated capabilities and performance criteria."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance Metrics are measured through internal management controls and external assessments.  Performance metrics include, but are not limited to, time, money, realism, fidelity, and transition as defined below:\n•\tTime – Enable the warfighter to speed up processes faster than current capabilities allow.\n•\tMoney – Enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities allow.\n•\tRealism – Enable the warfighter to create an environment that is close to the real world environment that current capabilities allow.\n•\tFidelity – Ensure unity of efforts throughout the Intelligence Capabilities and Innovation communities.\n•\tTransition – Select projects that have the greatest likelihood of adoption and transition to operational capabilities."
                        }
                    }
                }
            ]
        }
    }
}