{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-23",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603699D8Z"
        },
        "ProgramElementTitle": {
            "val": "Emerging Capabilities Technology Development"
        },
        "R1LineNumber": {
            "val": "49"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "298.656"
            },
            "PriorYear": {
                "val": "79.469"
            },
            "CurrentYear": {
                "val": "60.700"
            },
            "BudgetYearOne": {
                "val": "80.911"
            },
            "BudgetYearOneBase": {
                "val": "80.911"
            },
            "BudgetYearTwo": {
                "val": "75.284"
            },
            "BudgetYearThree": {
                "val": "76.368"
            },
            "BudgetYearFour": {
                "val": "77.379"
            },
            "BudgetYearFive": {
                "val": "78.990"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Emerging Capabilities Technology Development (ECTD) Program Element (PE) will be augmented in FY 2020 to increase the Program’s ability to conduct risk-reducing joint prototyping; joint red teaming for validation of emerging technologies; and, joint experimentation, demonstration, and concepts of operation (CONOPs) development.  In FY 2020 all funding and appropriate project investment areas from the Quick Reaction Fund (project-code 826 within Program Element (PE) 0603826D8Z) will be incorporated into ECTD.  Additionally, in FY 2020, funding and activities for the Silent Hammer project will be incorporated into the ECTD program.  \n\nECTD funding enables project selection in the year of execution and provides leadership within the Office of the Under Secretary of Defense for Research and Engineering (OUSD (R&E)) with the flexibility and agility to anticipate and quickly respond to emergent DoD issues, time-sensitive threats, and innovation opportunities.  The program collaborates with and leverages government labs, academia, and industry to execute its mission in support of the National Defense Strategy, Joint Staff, and DoD modernization priorities.  Completed ECTD projects transition to joint programs through fielded operationally relevant prototypes; technology adoption into programs of record; integration into system level, multi-year joint demonstrations; and through advanced research and engineering efforts like the Warfighting Lab Incentive Fund for further development of tactics, techniques, procedures, and concepts of operations."
        },
        "ProgramElementMissionDescription": {
            "val": "In alignment with the National Defense Strategy (NDS), the Emerging Capabilities Technology Development (ECTD) Program Element supports the USD(R&E) with experimentation and mid-term, mission-focused capability development that crosses functional domains and enhances warfighter lethality, technical superiority, adaptability, and resilience.  ECTD funding supports joint prototype development, joint experimentation for CONOPs development, and red teaming validations that enable disruptive innovation to sustain the United States' operational superiority.  Joint demonstrations and ECTD-sponsored venues of defense-wide experiments provide opportunities for emerging technologies to succeed, or fail fast.  The demonstration venues include: Stiletto, a maritime experimentation and demonstration platform; Thunderstorm, a multi-domain venue focused on small and non-traditional businesses; Silent Hammer, an advanced electronic warfare venue that transfers to ECTD in FY 2020; and, other tailored experimentation and demonstration events.  The red teaming funding line explores vulnerabilities in emerging technologies and enables USD(R&E), and the broader defense science and technology community, to make informed decisions before investing in new capabilities.  Red teaming enables adaptation to unforeseen vulnerabilities or opportunities early in capability development when design changes are cost effective and programs can be re-directed if developmental dead ends are discovered.  ECTD prototypes, demonstrations, experimentations, and red teaming validations enable developers to showcase new and maturing capabilities in realistic environments and against realistic threats with operational user involvement.\n\nECTD prototyping projects increase the speed of technology innovation by reducing technology risk for emerging capabilities.  With an emphasis on joint and interagency partnerships, ECTD matures capability options to anticipate and inform new acquisition pathways in addition to formal requirements and acquisition processes.  Although projects are selected in the year of execution, anticipated FY 2020 technology areas include employment of directed energy from aircraft; multi-domain, autonomous learning systems; enabling technologies for missile defense; and, increased soldier lethality systems.  Project selection is guided by Department-level strategies and priorities, such as the National Defense Strategy, the Chairman’s Capability Gap Assessment, and DoD modernization priorities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "57.876"
                },
                "CurrentYear": {
                    "val": "48.338"
                },
                "BudgetYearOne": {
                    "val": "51.162"
                },
                "BudgetYearOneBase": {
                    "val": "51.162"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "79.469"
                },
                "CurrentYear": {
                    "val": "60.700"
                },
                "BudgetYearOne": {
                    "val": "80.911"
                },
                "BudgetYearOneBase": {
                    "val": "80.911"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "21.593"
                },
                "CurrentYear": {
                    "val": "12.362"
                },
                "BudgetYearOne": {
                    "val": "29.749"
                },
                "BudgetYearOneBase": {
                    "val": "29.749"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "27.500"
                    },
                    "CurrentYear": {
                        "val": "17.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.795"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.112"
                                },
                                "CurrentYear": {
                                    "val": "-0.138"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Realignment for Higher Priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "29.749"
                                },
                                "BudgetYearOneBase": {
                                    "val": "29.749"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2020 baseline increase is the result of the transfer in of funds from the Quick Reaction Fund in Program Element 0603826D8Z (Quick Reaction Special Projects) for additional risk-reducing joint prototyping, joint red teaming for validation of emerging technologies, and funding for experimentation venues."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "795"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "298.656"
                        },
                        "PriorYear": {
                            "val": "65.488"
                        },
                        "CurrentYear": {
                            "val": "52.718"
                        },
                        "BudgetYearOne": {
                            "val": "70.940"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.940"
                        },
                        "BudgetYearTwo": {
                            "val": "65.316"
                        },
                        "BudgetYearThree": {
                            "val": "66.402"
                        },
                        "BudgetYearFour": {
                            "val": "67.416"
                        },
                        "BudgetYearFive": {
                            "val": "68.040"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "ECTD funding supports projects that reduce technology risk; create capabilities across functional domains; and, deliver increased lethality, resiliency, and adaptability through prototyping, demonstrations, experimentation, and red teaming.  Individual projects typically cost less than $6.000 million and focus on rapid prototyping, experimentation, and demonstration of emerging technologies.  ECTD funding also supports complementary demonstration venues that develop and mature emerging technologies."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Technical Support and Operational Analysis (TSOA)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "The Technical Support and Operational Analysis is an FY 2018 program increase to provide Joint and Service developers with realistic, relevant, operator driven, and scenario based assessments that challenge technologies in complex environments against emerging threats.  The program provides feedback from engineers, scientists, operators, and technical threat emulation experts early in the development of a technology to enable rapid innovation or shifts in technology investments.  In FY 2018, TSOA partnered with the Defense Threat Reduction Agency to execute a network-security and chemical\/biological detection red team assessment.  Using FY 2018 funds, work continues in FY 2019 to conduct red teaming on remote advise and assist technologies, augmented reality systems, and force protection in large urban areas.  TSOA informs industry on Department of Defense potential vulnerabilities and identifies the tactics, techniques, and procedures that lead to the discovery and exploitation of vulnerabilities.  TSOA also identifies possible mitigation pathways and shares these discoveries with the DoD RDT&E community, acquisition community, and Combatant Commands.  This technology area is a congressional interest item and additional resources were provided above the President’s budget request."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-Collateral Damage Warhead (LCDW)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "This project is an FY 2018 program increase to rapidly prototype, integrate, and test a carbon-fiber composite, fragmentation-less warhead onto the GBU-69 small glide munition to enable precision strike with extremely low collateral damage in urban environments.  The LCDW design was completed and tested to validate the focused lethality footprint in static arena tests.  Using FY 2018 funding, work continues in FY 2019 to validate and certify the LCDW capability through static arena testing, with follow-on flight testing planned for third quarter FY 2019.  Upon successful completion of all testing, USSOCOM will field the LCDW for an operational assessment in late FY 2019.  This technology area is a congressional interest item and additional resources were provided above the President’s budget request."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Base Resilience Sensor"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "7.500"
                                        },
                                        "Text": {
                                            "val": "The Air Base Resilience Sensor directly supports the National Defense Strategy’s priority for increased lethality through rapidly prototyping and integrating an advanced sensor system concept to enhance detection and tracking of threat systems.  Previous funding in FY 2016 and FY 2017 developed an advanced sensor chip assembly (SCA) prototype to validate the expected performance in an operationally-relevant environment.  In FY 2018, the project fabricated multiple prototype test units which incorporate the SCA, and developed the software to network multiple prototype test units into a sensor system architecture.  This technology area is a congressional interest item and additional resources were provided above the President's budget.  Details of this project are classified."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.500"
                                        },
                                        "Text": {
                                            "val": "Building on the FY 2018 activities, Air Base Resilience Sensor will execute a series of tests against targets in an operationally relevant environment to evaluate the performance of the networked sensor system prototype and make refinements to the system prior to a system demonstration anticipated to occur in late FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-Altitude Optical Reconnaissance Unit and Sensor (HORUS)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "The HORUS project is a Congressional program increase to design, build, and evaluate a prototype capability for a high-altitude sensor system with military utility for the joint warfighter.  HORUS will mature an electro-optical prototype system to support pattern of life analysis at extreme distance that is adaptable to multiple manned or unmanned aircraft.  The HORUS prototype will support day or night operations by providing multi-spectral, high definition full motion video from extreme slant ranges.  In FY 2018, activities focused on completing the sensor design, fabrication, and testing of two prototype HORUS units."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Building on FY 2018 accomplishments, FY 2019 funds will be used to refine the HORUS prototypes and complete additional testing required prior to conducting an initial operational assessment in the U.S. Central Command area of responsibility.  This project will transition to U.S. Special Operations Command."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Raven Flash"
                                    },
                                    "Description": {
                                        "val": "The Raven Flash project directly supports the Secretary of Defense's priority for increased lethality through the development and demonstration of an adaptable, agile, electronic warfare capability.  This previously funded prototyping effort uses integrated source system components and associated high performance materials to enable targeted electronic warfare effects.  FY 2018 efforts included development and integration of component sub-systems culminating in a “brass-board” system demonstrator and experimentation that included a functional assessment of the Raven Flash architecture in a laboratory environment against challenging classes of surrogate electronic systems.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.563"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.240"
                                            },
                                            "Text": {
                                                "val": "Raven Flash will develop a fully integrated, functionally-relevant prototype system.  Activities to design, fabricate, assemble, and test the Raven Flash prototype will be conducted.  The relative performance of the system will be characterized, assessed, and validated against a selected high-fidelity, relevant electronic system in a laboratory environment.  Using FY 2019 funding, Raven Flash will complete prototype integration on a representative platform and subsequent demonstrations before transition to a classified customer."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This project will be completed in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Silent Hammer"
                                    },
                                    "Description": {
                                        "val": "Starting in FY 2020, the Silent Hammer (SH) demonstration venue will transfer to the Emerging Capabilities Technology Development (ECTD) Program Element in support of the Secretary of Defense's priority to increase the rate of innovation and deliver performance at the speed of relevance.  Leveraging the Joint Electronic Advanced Technology (PE 0603618D8Z) program's history of conducting highly successful experimentation venues, SH is a multi-year, multi-agency, series of field experimentation activities.  SH explores and demonstrates new electronic warfare (EW) technologies and approaches through the use of large-scale, dynamic field experiments.  SH focuses on advancing the state-of-the-art for detecting, classifying, and geo-locating electromagnetic signals of interest through novel technologies such as multi-platform, multi-aperture, multi-domain (M3) passive\/active sensing in complex and congested electromagnetic spectrum (EMS) environments.  SH includes both scripted and dynamic scenarios to experiment with the efficacy of both existing and new capabilities and approaches to engage emerging EMS threats.  The EW Community of Interest, Executive Committees, and warfighters are involved in the selection of follow-on experimentation topics, technology demonstrations, and scoping of these efforts to ensure their maximum relevance and value."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "SH will complete a debut venue in late FY 2019.  To better leverage other OSD demonstration efforts SH will transition from Joint Electronic Advanced Technology (PE 0603618D8Z) to ECTD in FY 2020.  The FY 2020 SH venue will focus on the most pressing EW challenges for M3 passive\/active sensing and command, control, communications, and computing architectures.  Selection of FY 2020 demonstrations will occur in the year of execution and involve the EW Community of Interest and other key stakeholders to ensure maximum relevance and benefits to joint Services' and Defense Agencies' efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Silent Hammer is a new effort within ECTD starting in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quartz Disk Resonator Gyroscope (QDRG)"
                                    },
                                    "Description": {
                                        "val": "The QDRG project directly supports increased lethality for dismounted soldiers and the objectives of the National Defense Strategy.  Building on FY 2017 accomplishments, QDRG prototyped and demonstrated a next-generation low size, weight, power, and cost (SWaP-C), navigation-grade gyroscope for position, navigation, and timing applications.  This micro-electromechanical systems (MEMS) technology enables precision targeting, navigation, and tracking with reduced error in Global Positioning System denied environments.  The reduced SWaP-C enables the technology to be incorporated into hand-held and small autonomous systems across the Services.  FY 2018 efforts focused on etching optimized quartz disks, design and fabrication of control electronics, and vacuum packaging for laboratory test and validation.  Transition partner funding supports package design modifications to enable a final prototype that can be leveraged as a north-finding system or integrated with MEMS accelerometers into an internal navigation system.  In FY 2019 QDRG prototype components will transition to the Joint Effects Targeting System, the Lightweight Laser Designator Rangefinder, and the Long Range Advanced Scout Surveillance System programs of record."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2017 accomplishments, Raven Flash will continue the development and integration of component sub-systems culminating in a “brass-board” system demonstrator.  A functional assessment of the Raven Flash architecture in a laboratory environment against challenging classes of surrogate electronic systems will be conducted."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectral Exploitation Camera for Targeting and Reconnaissance (SPECTRE)"
                                    },
                                    "Description": {
                                        "val": "The SPECTRE project demonstrated a hyperspectral imaging (HSI) prototype to support battlespace awareness and the National Defense Strategy’s objective to field a more lethal force.  The SPECTRE project completed an FY 2017 initiated effort to develop and demonstrate a greatly reduced size, weight, and power (SWaP) HSI capability that is compatible with multiple manned and unmanned platforms across the DoD.  The SPECTRE prototype provided the ability to perform stand-off detection of materials or targets of interest, enabling rapid target identification and shortening the kill-chain.  In FY 2018, SPECTRE developed a first-in-its-class, dual-field-of-view telescope with the ability to change optical path and field-of-view to adjust for off-nadir imaging.  The project also designed a robust pointing and stabilization optical path within a customized pod to enable integration with unmanned platforms.  In FY 2019 the project will complete pod construction, integration, and lab testing, leading to a SPECTRE flight test with remaining FY 2018 funds.  Leveraging partner funding in FY 2019, SPECTRE will transition to a deployed unmanned aerial system.  This effort also informs Program Objective Memorandum efforts for two U.S. Army program of record aerial systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "This project will complete final integration of the hardware subsystems and acceptance testing of the integrated AEWL.  Once operational, the initial instantiation of AEWL will be transitioned to the U.S. Army for evaluation and use.  Technical data packages will also be available to the other Services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Collaborative Electronic Warfare & Radar (DISCOVER)"
                                    },
                                    "Description": {
                                        "val": "The previously funded DISCOVER project supports the National Defense Strategy’s priority for increased lethality and the Department of Defense’s modernization priority for fully networked command and control.  DISCOVER will develop and demonstrate a fully networked, integrated, multi-function prototype to support multiple radio frequency (RF) concepts of operation (CONOPs) in a small form factor prototype.  DISCOVER activities in FY 2018 included development and demonstration of electronic warfare (EW) and radar algorithms using commercial off the shelf hardware.  The project also designed and prototyped RF subsystem hardware, implemented EW and radar algorithms, and assessed the field performance of prototype hardware against CONOPs in development for the FY 2019 prototype demonstration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.814"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.450"
                                            },
                                            "Text": {
                                                "val": "To support a FY 2019 field demonstration, DISCOVER will complete algorithm development then integrate and test final RF hardware and antennas.  Subsequent FY 2019 field experimentation will explore the DISCOVER prototype and impacts on squad level operations.  DISCOVER will transition to the U.S. Marine Corps for continued CONOPS experimentation followed by further maturation by the U.S. Army."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "DISCOVER efforts conclude at the end of FY 2019 with a demonstration of an integrated, multi-function, net-centric capability."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Compact Adaptable Ballistic Technology (CAB-T)"
                                    },
                                    "Description": {
                                        "val": "The CAB-T prototype will significantly increase dismounted soldier lethality and directly supports the National Defense Strategy focus to develop a more lethal force.  The previously funded CAB-T project integrated lightweight materials and simplified cycling to enhance warfighter lethality through compact kinematic performance in an adaptable design.  CAB-T assessments included the effects of material properties, mechanical interaction, operating pressure, and cartridge-mechanism interactions.  The demonstrated prototype will achieve a modular ballistic system in a compact form factor to enable users to rapidly adapt to mission requirements.  CAB-T activities in FY 2018 included the development and integration of custom components, assessment of user interfaces, and initial validation of compact ballistic technology modeling via subsystem laboratory testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, CAB-T will demonstrate compact ballistic technology in parallel with refinement of the CAB-T user interface.  The project will also incorporate adaptable design elements into a modular plug-and-play prototype.  Final integration of compact ballistic technology with CAB-T user interface will be completed with FY 2019 funding followed by experimentation leveraging transition partner expertise.  The CAB-T prototype and final assessment with technical data package will transition to a classified user."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "CAB-T efforts will be completed at the end of FY 2019 and the prototype will transition for further maturation and sustainment by the user."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-Cost Precision Intercept"
                                    },
                                    "Description": {
                                        "val": "Low-Cost Precision Intercept supports the National Defense Strategy’s priority to develop a more lethal force.  Initially funded in FY 2017, the project will demonstrate the viability of an ultra-low size, weight, power, and cost terminal guidance seeker paired with a small unmanned aerial system (sUAS) to provide a low-cost, long-range platform capable of close range intercept of sUAS threats.  In FY 2018, this project integrated the prototype sensor onto a sUAS platform interceptor vehicle.  Testing and experimentation demonstrated a tactically relevant autonomous encounter with a sUAS threat and explored various concepts of operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.050"
                                            },
                                            "Text": {
                                                "val": "After demonstrating concept feasibility in FY 2018, FY 2019 funds and transition partner support enables adaption to the form, fit, and function of the terminal guidance sensor at a relevant military radar band.  The final prototype sensor will be integrated onto a sUAS platform specified by the Special Operations transition partner."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Low-Cost Precision Intercept efforts will be completed at the end of FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Response Integrated and Collaborative (JRICO) Decision Support Tool"
                                    },
                                    "Description": {
                                        "val": "The JRICO project supports the National Defense Strategy objective of delivering performance at speed while creating a more lethal force.  JRICO demonstrates the use of machine learning, a Department of Defense technology modernization priority, to interpret unstructured data resulting in an interoperable and collaborative framework to improve time-critical decision making.  JRICO improves operational planning through big data analytics to perform rapid analysis and seamless information sharing with increased speed and fidelity.  JRICO will mature a prototype capability and demonstrate a secure, multi-domain, decision-support cloud capability for U.S. Indo-Pacific Command by integrating, sharing, and visualizing structured and unstructured data from disparate systems.  An icon-based drag and drop interface informed with big data analytics allows JRICO to support deliberate strategic planning and rapid crisis response, integrated situational awareness, and tailored visualization.  In FY 2018, JRICO completed the technical architecture development and initial design packages for the final prototype.  FY 2018 activities also finalized the data tagging strategy and began planning work for FY 2019 assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.850"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "The JRICO prototype will demonstrate an application registry and big data analytics that includes building a visualization registry for applications and publishing across a cloud computing-based, collaborative, multi-domain environment.  JRICO will also conduct a military utility assessment with U.S. Indo-Pacific Command before transitioning to the Joint Capability Requirements Manager, the Preferred Force Generation, and the Joint Capability Support to National Emergencies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JRICO efforts conclude at the end of FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Software-Defined Radar (SDRadar)"
                                    },
                                    "Description": {
                                        "val": "SDRadar leverages machine learning to help support the Department of Defense modernization priority for missile defense.  This project demonstrates a prototype cognitive SDRadar to inform the development and demonstration of joint solutions for a resilient radar capability in congested and contested electromagnetic environments (EMEs).  The SDRadar prototype will demonstrate enhanced target detection and tracking in a variety of scenarios of interest to the U.S. Army and U.S. Air Force.  In FY 2018, improvements to prototype SDRadar hardware and software were implemented."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2017 accomplishments, QDRG will etch optimized quartz disks, design and fabricate control electronics, and vacuum package the resonator for laboratory test and validation.  FY 2018 development and testing will allow for package design modifications before integration into an internal navigation system (INS).  With FY 2018 funds, QDRG will complete package design and integration to demonstration critical performance parameters.  The final prototype can be leveraged as a north-finding system or integrated with a MEMS accelerometer to demonstrate a navigation-grade INS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "SDRadar prototype maturation will continue in FY 2019 focusing on innovations to the hardware and software to enhance target tracking in congested EMEs.  Using FY 2019 funds, SDRadar will culminate in an early FY 2020 demonstration transitioning into multiple Service programs of record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Using FY 2019 funds, SDRadar will be completed in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Situational Awareness Data Link (SADL) for Stand-Off Precision Guided Munitions (SOPGM)"
                                    },
                                    "Description": {
                                        "val": "SOPGM directly supports the National Defense Strategy’s priority for increased lethality and delivering performance at speed, by rapidly prototyping and integrating a miniaturized SADL radio into stand-off precision guided munitions (SOPGMs).  The resulting prototype system will enable enhanced surgical strikes against high value and irregular warfare targets in multiple environments, including urban, GPS-denied, and adverse weather.  Integration of the data link radio into SOPGMs will significantly enhance lethality, shorten kill-chains, and reduce collateral damage for the AC-130W\/J gunship, Special Operations Forces (SOF) MQ-9 Reaper, and SOF MQ-1C Gray Eagle by enabling command and control of SOPGMs following launch.  In FY 2018, the preliminary design review and prototype fabrication was completed for follow-on integration and fielding in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, the project will complete integration of the SADL-SOPGM prototype system onto a platform.  Subsequent SADL-SOPGM demonstrations will culminate in live fire testing and evaluation.  The SADL SOPGM capability will transition to U.S. Special Operations Command (USSOCOM) with an expected initial operational capability in FY 2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "SADL-SOPGM efforts will be completed at the end of FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Software Defined Soldier"
                                    },
                                    "Description": {
                                        "val": "The SDS project supports the Department of Defense modernization priority for fully networked command and control by developing an agile software-defined radio and application based user interface (UI).  SDS provides the dismounted warfighter with a multi-function radio frequency capability, including communications, electronic warfare, and passive radar in a modular, plug-and-play package.  Through the application based UI, the SDS device is reconfigurable on demand and can be upgraded through tailored software packages.  In FY 2018, this project upgraded the SDS prototype hardware and matured the UI to enable a variety of applications.  Using FY 2018 funds, work continues in FY 2019 on development of the firmware and finalizing the application software.  After successful testing, the SDS prototype will transition in FY 2019 to the U.S. Special Operations Command for evaluation and operational use."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.760"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, designs will continue and the telescope and the pod will begin construction, integration, and lab testing.  FY 2018 will complete the development and build efforts for SPECTRE leading to a flight test in FY 2019 and planned transition to a deployed unmanned aerial system.  This effort also informs Program Objective Memorandum (POM) efforts for two Army program of record aerial systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Polar Skywave"
                                    },
                                    "Description": {
                                        "val": "Polar Skywave directly supports the National Defense Strategy’s priority for increased lethality through persistent long range sensors to address the limitations of the current North Warning Systems and emerging threats.  The Polar Skywave project will mature and experiment with RF hardware and advanced radar processing algorithms to validate that over-the-horizon skywave radar is viable for a future surveillance system in the polar region.  Beginning in FY 2018, the Polar Skywave prototype sensor focused on ten major tasks to extend skywave radar to polar regions including deployment of HF radar hardware for a scaled model and refinement of signal processing techniques that leverage machine learning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Building on initial design and hardware installations, FY 2019 activities will collect data and refine signal processing algorithms.  The project will use results from the first bi-directional transmission of radar signals to further develop and expand transmit and receive arrays."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "FY 2020 tasks will include continued data measurement, algorithm refinement, and HF communication experimentation.  Leveraging MDA funding, Polar Skywave will culminate in a real-time operational demonstration with targets of opportunity before hardware and algorithms transition to Air Force Life Cycle Management Center (LCMC)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Tactical Power Generation (ATPG)"
                                    },
                                    "Description": {
                                        "val": "ATPG directly supports the National Defense Strategy’s priority for increased lethality by prototyping a vehicle centric, mobile, fast forming, secure, intelligent microgrid.  The ATPG prototype will provide ad hoc, resilient power for next generation electronic warfare, directed energy, and missile defense technologies and will enable: (1) on the move power generation to supply advanced protection system for maneuver forces; (2) improved logistics through reduced fuel consumption; and, (3) reduction in time required to setup, transport, and redeploy power generation systems.  In FY 2018, subcomponent requirements and initial prototype designs were matured for critical design reviews scheduled for FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.801"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.503"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, the project will complete subsystem component fabrication and testing.  Using FY 2019 funds, on-vehicle integration activities will be followed by integrated system testing in FY 2020.  The initial prototype will transition to U.S. Army Product Manager Terminal High Attitude Area Defense (THAAD) for operational testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Advanced Tactical Power Generation efforts will be completed at the end of FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Printable Flexible Electronics with Nanomaterials Heterostructures (PFLEX)"
                                    },
                                    "Description": {
                                        "val": "PFLEX supports the National Defense Strategy’s priority to deepen defense cooperation between the U.S. and partner nations.  This project, conducted in partnership with India’s Defense Research and Development Organization, will prototype a wearable microelectronic sensor system for environmental monitoring of potentially hazardous confined spaces.  The PFLEX project will demonstrate prototype units implementing a flexible electronic system architecture combined with oxygen and broad band volatile organic compound (VOC) sensors.  In FY 2018, activities focused on modeling and simulation of electrical, thermal, and mechanical properties of materials printed on the flexible substrate."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Building on the FY 2018 activities, PFLEX will package, calibrate, and test the oxygen and VOC sensors prior to integration into the advanced flexible sensor platform.  The prototype units will transition to the U.S. Air Force for testing and follow on development activities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PFLEX efforts will be completed at the end of FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid 3D (R3D) Data Generation"
                                    },
                                    "Description": {
                                        "val": "R3D directly supports the National Defense Strategy’s priority for increased lethality through advanced simulations, synthetic training environments, and by providing superior knowledge of the battlespace during mission preparation and execution.  The R3D prototype will provide critical battlespace awareness to the warfighter, enabling rapid and accurate decision making at the tactical edge by closing the gap in terrain data for detailed tactical planning.  Incorporating machine learning enabled algorithms for geospatial intelligence processing and exploitation, R3D will create a national repository of open standard, globally correlated, 3D terrain data for operations, intelligence, and training.  This repository will enable interoperability required for short notice, joint mission rehearsal in addition to a creating a common domain for rapid experimentation with future operational concepts.  In FY 2018, R3D replicated 3D terrain data across the DoD enterprise and tested compatibility of 3D data with applications supporting tactical mission planning and execution for USSOCOM and U.S. Army missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Building on the FY 2018 activities, R3D continues technical risk reduction activities and capability gap assessment for Services, Combatant Commands, and the National Geospatial-Intelligence Agency (NGA).  R3D will also mature algorithms and the system architecture to deliver 3D terrain data across the DoD and intelligence community enterprise.  End user assessments, joint exercises, and iterative test and evaluation activities are incorporated to refine the prototype system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020, R3D will undergo final operational test and evaluation prior to transitioning to the NGA, USSOCOM, and Services."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "R3D efforts will be completed at the end of FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project 18"
                                    },
                                    "Description": {
                                        "val": "Project 18 directly supports the National Defense Strategy's priority for increased lethality by demonstrating an organic counter unmanned aircraft system (CUAS) capability for use by small units.  The project will integrate a novel non-kinetic capability to defeat adversary UAS onto existing operational platforms and experiment with the resulting prototype to inform CONOPS.  Additional details are classified.  In FY 2018, the preliminary design review was completed resulting in a design for a novel prototype payload.  Fabrication and initial effects testing was also completed with FY 2018 funding to support system integration in testing in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Building on the FY 2018 maturation, the initial prototype will complete fabrication and undergo test and experimentation to characterize combat performance.  In FY 2019 Project 18 will transition to the U.S. Special Operations Command (USSOCOM) for final evaluation and operational use."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project 18 efforts will be completed at the end of FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-domain Experimentation and Demonstration Venues"
                                    },
                                    "Description": {
                                        "val": "These complementary, agile, and flexible experimentation and demonstration capabilities and venues support the National Defense Strategy’s priority to increase the rate of innovation and enable Service, Combatant Command, and Agency user evaluation of emerging novel technologies in relevant environments.  Demonstration venues include the Thunderstorm venue for small and non-traditional businesses; the Stiletto maritime technology platform; and, other tailored multi-domain venues and ad-hoc demonstrations.  These experimentation and demonstration venues support the rapid discovery and transition of emerging technologies across the range of military operations.  The venues provide the DoD and interagency partners with an opportunity to identify and evaluate new and emerging technologies both from commercial and government sectors through a series of technology demonstrations, experiments, vignettes, and related activities.  The venues also offer a streamlined experimentation and demonstration process that encourages system developers to engage directly with the warfighter.  These engagements enable rapid innovation and adoption of new technologies to meet operational needs through the exploration of military utility, and identification of potential risks of emerging technologies. \n\nIn FY 2018, Thunderstorm, Stiletto, and other venues conducted 20 demonstration and experimentation events which featured 124 innovative technologies from focus areas including dense urban and subterranean warfare; enhanced lethality for small unit operations; tactical ISR; and, resilience for collaborative systems of networked sensors.  Seventeen of these technologies transitioned directly to DoD operational users or were leveraged by formal programs of record, including an autonomous maritime landing system for unmanned autonomous vehicles (UAVs); a long-range geolocation capability; and, a long-range vertical takeoff and landing fixed-wing UAV.  In FY 2018, these demonstration and experimentation venues also provided 75 small businesses and non-traditional innovators with the warfighter feedback critical to rapidly mature their technologies into viable prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, DISCOVER will develop demonstration CONOPs and system-level specifications for the FY 2019 demonstration.  The project will also design and prototype RF subsystem hardware, develop EW and radar algorithms, and assess hardware performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Building on previous experience, six to eight demonstrations to accelerate innovation are planned for FY 2019.  These demonstrations will focus on operations in megacities, security for fully-networked command and control, building partnerships, and machine learning enabled sensors for detection of rare events.  Capabilities evaluated will include multi-domain operations, ubiquitous sensors and technologies for increased small unit lethality, diver detection in harbors, and other priorities identified through engagement with stakeholders."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Multi-domain venues will continue to focus on the most pressing challenges to DoD and provide agile venues to explore new and innovative technological solutions.  Focus areas will be based on needs and priorities identified through engagement with stakeholders in the Military Services, the Combatant Commands, the Intelligence Community, and other operational users."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Conceptual Prototyping to Support DoD Modernization Priorities"
                                    },
                                    "Description": {
                                        "val": "This effort prototypes cutting-edge land, sea, undersea, air, and space capabilities critical to the National Defense Strategy and modernization priorities and objectives of the Department of Defense (DoD).  This effort matures and experiments with key component technologies and representative prototypes of fully networked command, control, and communications; space; autonomy; hypersonics; microelectronics; cyber; quantum science; directed energy; and machine learning systems to accelerate development and adoption of cost effective and interoperable solutions for defense challenges.  Selected limited-duration projects design, mature, and deliver conceptual prototypes to reduce the time from idea to demonstrated capability; mitigate risk in DoD programs; and, help characterize potential concepts of operations.  Conceptual prototyping activities seek to rapidly develop and demonstrate capabilities that can help maintain the U.S. technological edge.  These prototypes will be delivered to joint Service users to evaluate operational capabilities and inform requirements and technical feasibility of future acquisition programs.  Potential venues for prototype assessment include the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises, and multi-domain demonstration venues across the DoD.  Demonstration of advanced prototypes will involve partnerships with the Services, industry, academia, and non-traditional DoD partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "Plans for FY 2018 include pursuing development of concepts and designs for low cost distributed sensing initiatives that will result in innovative prototype systems in one to three years.  FY 2018 projects will include data mining for indications and warnings of a WMD or missile attack and unattended measurement and signature intelligence (MASINT) sensors to provide situational awareness of WMD activities in denied areas.  One to two prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.825"
                                            },
                                            "Text": {
                                                "val": "This focus area will mature concepts and designs through conceptual prototyping that result in interoperable solutions.  While project determinations are generally made in the year of execution, projects to be considered will address challenges within the DoD modernization priorities.  Potential areas to investigate through conceptual prototyping include quantum sensing and processing; machine learning to gain a competitive military advantage; novel microelectronics and microelectromechanical systems; dismounted electromagnetic spectrum technologies for communications and distributed electronic warfare; implementation of directed energy on small, low-cost autonomous platforms; and component technologies with the potential to enable disruptive space capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.940"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.940"
                                            },
                                            "Text": {
                                                "val": "Projects will be selected in the year of execution to support National Defense Strategy priorities, DoD modernization priorities, and gaps in the joint Services’ investments.  Projects will focus on cost-effective, mission-focused efforts to design, mature, and deliver new concepts and technology prototypes aimed at supporting the Joint Force.  15 to 20 prototype efforts are anticipated in FY 2020 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2018 and FY 2019 funding levels are lower than the baseline for this focus area, which is listed under FY 2020.  This is because once projects are selected and funded during the years of execution (FY 2018\/2019), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "India Science and Technology Partnerships Focus Area"
                                    },
                                    "Description": {
                                        "val": "The India Science and Technology (S&T) Focus Area is a Secretary of Defense directed program designed to deepen defense cooperation between the United States and India.  By sharing research resources, capabilities, and expertise, the United States and India can jointly develop the technological innovations needed to enable our defense industrial bases to support our militaries now and in the future.  Further, development of vibrant S&T cooperation is a key step in building an enduring partnership.  In FY 2018, funding was transferred from Joint Capability Technology Demonstration (JCTD) (Program Element 0603648D8Z) to better enable alignment and execution of the allocated funds.  This funding supported printable flexible electronics with nanomaterials and autonomous mission control algorithms for small, swarming UAVs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "The India Science and Technology Focus Area and related funding will continue to develop and execute cooperative S&T projects.  Additional cooperative S&T areas targeted include: munitions development, advanced manufacturing, micro-power grids, and other identified project areas.  Project selection is made during the year of execution in coordination with military representatives from India."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "FY 2020 projects will be selected in the year of execution and will continue to focus on India and other nations to support the Secretary of Defense’s priorities for multi-national collaboration.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities that can be jointly developed through cooperative S&T projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Building on FY 2018 accomplishments, FY 2019 funds will be used to refine the HORUS prototypes and complete additional testing required prior to conducting an initial operational assessment in the U.S. Central Command area of responsibility.  This project will transition to U.S. Special Operations Command."
                        },
                        "PerformanceMetrics": {
                            "val": "Emerging Capabilities Technology Development (ECTD) supports the FY 2020 performance metrics to transition projects that address Joint Force and Combatant Command capability gaps.  In FY 2018, ECTD transitioned six projects with an overall transition rate of 86 percent.  All ECTD projects are monitored for schedule deviation, transition outcome, and deliverables such as hardware, software, and other components."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "713"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "13.981"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This initiative supports the U.S. Special Operations Command’s (USSOCOM) effort to explore the operational capability for an AC-130 modified with a high energy laser (HEL).  This funding enables analysis and risk reduction efforts to accelerate development of an HEL weapon system for USSOCOM missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AC-130 High Energy Laser (HEL)"
                                    },
                                    "Description": {
                                        "val": "This project executed risk-reduction activities that informed the development and planned FY 2022 airborne demonstration of the USSOCOM Airborne High Energy Laser tactical prototype.  Funded risk reduction activities included modernization of existing laser control equipment, development of diagnostic assemblies, design and fabrication of an isolation structure, measuring laser performance while in a simulated aircraft environment, aircraft optical window mount and fairing development, and modifications to existing AC-130 Battle Management System (BMS) to support laser operations.  These activities informed the Airborne HEL tactical prototype design and enable early identification of required engineering design changes for major HEL subsystems.  Using FY 2018 funds, work continues in FY 2019 including optical window mounting, laser diagnostics, BMS modifications, and development of aircraft isolation systems.  After successful ground risk reduction testing, the risk reduction effort will transition in FY 2019 to USSOCOM to continue prototype development and airborne testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.981"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2018 include modeling, simulation, system design, and subsystem testing.  Risk reduction efforts will include characterization of aircraft window optical effects and mitigation for optimal beam quality, validation of coelostat inertial stabilization and pointing (anti-jitter), and characterization of the bio-effects and hazards necessary to support program planning for the HEL system.  After this initial risk reduction work the AC-130 HEL project will transition to the U.S. Special Operations Command for further development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A – USSOCOM will support subsequent development and acquisition strategy."
                        },
                        "PerformanceMetrics": {
                            "val": "USSOCOM defines specific performance metrics to evaluate the risk reduction effort and determine future investments.  The project results are reviewed by a senior review group comprised of representatives from the Office of the Secretary of Defense, USSOCOM, Combatant Commands, and outside subject matter experts.  The ultimate measure of success is transition to the USSOCOM operational user."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "717"
                    },
                    "ProjectTitle": {
                        "val": "Red Teaming"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "7.982"
                        },
                        "BudgetYearOne": {
                            "val": "9.971"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.971"
                        },
                        "BudgetYearTwo": {
                            "val": "9.968"
                        },
                        "BudgetYearThree": {
                            "val": "9.966"
                        },
                        "BudgetYearFour": {
                            "val": "9.963"
                        },
                        "BudgetYearFive": {
                            "val": "10.950"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Red Teaming project assesses the susceptibility and vulnerability of emerging technologies and newly developed systems.  Red teaming helps identify unanticipated disruptive opportunities and technological dead ends.  The project supports red teaming demonstrations to stress and assess emerging systems in key areas for gaining or maintaining overmatch earlier in the life-cycle.  This project improves systems by reducing vulnerabilities and providing a holistic understanding of employment risks in operationally-representative environments and against potential threats prior to full funding commitments.  Red teaming informs requirements and helps accelerate acquisition pathways for joint missions.  The Red Teaming project supports three broad types of red teaming: 1) Red Teaming for Technology Surprise supports early stage horizon scanning and assessments of weaknesses and opportunities of pre-development technologies from an adversary perspective; 2) Prototype Development for Demonstrations and Red Teaming supports targeted, low-fidelity prototypes to assess utility and inform design choices prior to funding commitments; and 3) Red Teaming to Support Innovation in Concepts of Operations including comprehensive red teams, war games, and field experiments with maturing technology to understand how to implement new technologies and adapt to adversary responses.  This effort leverages the innovative capabilities of other defense red teaming organizations within the Department, the Federally Funded Research and Development Centers (FFRDCs), government laboratories, and academia.  Deliverables will inform technology acquisition and new concepts of operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Red Teaming to Support DoD Modernization Priorities"
                                    },
                                    "Description": {
                                        "val": "This project funds red teaming efforts to explore new capabilities in a competitive environment.  Efforts include 1.) Early investigations and red teaming to identify and understand potential vulnerabilities and opportunities from emerging and conceptual technologies.  Projects will help define and anticipate impacts from new technologies to understand operational utility and identify threats from tangentially related sectors that can have significant negative impacts on current DoD investments.  2.) Maturation of Service and Defense Agency identified prototypes to enable red teaming, demonstration, experiments, and concepts of operations earlier in the development cycle.  These prototypes increase agility and rate of innovation for emerging capabilities, while reducing cost and risk.  3.) Exploring unconventional approaches to counter current Department of Defense and adversary technologies through red teams, war games, simulation exercises, and studies that employ government laboratory scientists; subject matter experts; and, students of science, technology, engineering, and math disciplines.  Red teaming events range from distributed table-top games to simulated and live field exercises with non-traditional and operationally experienced participants.  Deliverables include characterization of future prototypes, requirement definition, recommendations on system operational employment, potential vulnerabilities, and likely countermeasures taken by the threat as well as potential counter-countermeasures to increase functionality or operational effectiveness of the system.  The Under Secretary of Defense for Research and Engineering will leverage these products to inform how technologies and integrated systems can perform in hostile environments and develop new concepts of operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.982"
                                            },
                                            "Text": {
                                                "val": "The investment decisions for red teaming are made during the execution years in response to Department, Combatant Command, Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  This project anticipates funding five to ten efforts to investigate red and blue impacts to force structure and operations with the adoption of new technologies.  Potential projects include experimentation with multi-payload electric vehicles and impacts on SOF operations; squad distributed EW capabilities and weakness; fleet operations with high-bandwidth over-the-horizon networked communications; emerging near-peer counters in the areas of fully networked, smart devices; quantum sensors; weakness in integrated air defense and missile defeat; and other potential counters to future U.S. technology investments.  Project selection will be guided by the National Defense Strategy, priorities and gaps identified by the Department, Combatant Commands, Services, other government organizations, FFRDCs, academia, and industry as new threats emerge or new opportunities are presented."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.971"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.971"
                                            },
                                            "Text": {
                                                "val": "The investment decisions for red teaming are made during the execution years in response to Department, Combatant Command, Service, and other government organization priorities, and as new threats emerge or new opportunities are presented."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 represents an increase in the overall efforts covered in this project line."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance metrics for FY 2020 will include specific details to each effort and include measures identified in individual project plans.  Project completions and successes are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target milestone dates, specific performance measures, fielding dates, and demonstration goals."
                        }
                    }
                }
            ]
        }
    }
}