{
    "id": "2020-Navy-PB-1319-MJBOOK-3-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-1",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258N"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineNumber": {
            "val": "175"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "18.737"
            },
            "CurrentYear": {
                "val": "10.981"
            },
            "BudgetYearOne": {
                "val": "12.027"
            },
            "BudgetYearOneBase": {
                "val": "12.027"
            },
            "BudgetYearTwo": {
                "val": "8.569"
            },
            "BudgetYearThree": {
                "val": "8.791"
            },
            "BudgetYearFour": {
                "val": "8.993"
            },
            "BudgetYearFive": {
                "val": "9.173"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds the development of Aerial Target Systems, Unmanned Aerial Vehicle targets, Sea Surface Target Systems, Target Control systems, and associated Target Mission Support Systems, Target Threat Simulation Program and Target Augmentation and Auxiliary Systems required to simulate real world threats.  These capabilities are required to execute developmental\/operational test and evaluation of naval combat weapon systems and to satisfy advanced fleet training requirements while ensuring the Navy continues to develop threat simulations of emerging threat requirements. \n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST AND EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.053"
                },
                "CurrentYear": {
                    "val": "10.981"
                },
                "BudgetYearOne": {
                    "val": "9.227"
                },
                "BudgetYearOneBase": {
                    "val": "9.227"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.737"
                },
                "CurrentYear": {
                    "val": "10.981"
                },
                "BudgetYearOne": {
                    "val": "12.027"
                },
                "BudgetYearOneBase": {
                    "val": "12.027"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.316"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.800"
                },
                "BudgetYearOneBase": {
                    "val": "2.800"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-4.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.316"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "2.800"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.800"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY20 Program Element Budget increased by $2.8M in support of Project 2159 ASW Targets."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0609"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Target System Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.201"
                        },
                        "CurrentYear": {
                            "val": "9.658"
                        },
                        "BudgetYearOne": {
                            "val": "7.874"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.874"
                        },
                        "BudgetYearTwo": {
                            "val": "7.184"
                        },
                        "BudgetYearThree": {
                            "val": "7.377"
                        },
                        "BudgetYearFour": {
                            "val": "7.551"
                        },
                        "BudgetYearFive": {
                            "val": "7.702"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of the Aerial Target Systems Development program is the design and development of threat representative subsonic and supersonic aerial targets that simulate threat weapon systems, threat aircraft or threat Unmanned Aerial Vehicles.  In addition to representative air vehicles, this includes development of Target Control (TC) systems, and associated Target Augmentation and Auxiliary Systems (TA\/AS) which are used to replicate specific threats.  Targets and auxiliary payloads are developed to support test and evaluation of combat systems required to defend fleet surface and air units in a hostile environment.  As to specific hardware development, this project includes:\n\n - Supersonic Targets: Portfolio includes GQM-163A Supersonic Sea-Skimming Target (SSST), GQM-173A Multi-Stage Supersonic Target (MSST), AQM-37, and Fleet Supersonic Training Target programs. Supersonic targets represent supersonic anti-ship cruise missile threats. The design and development of GQM-163A capabilities provide threat representative targets that are used in direct support of Developmental Test and Evaluation, Operational Test and Evaluation, and Live Fire Test and Evaluation of major combat weapons programs and to a lesser degree, support fleet training. Critical live-fire Test and Evaluation events are supported for AEGIS, DDG-1000, LHA-6, CVN-78, LCS, and LSD-41\/49 (SM-6, SM-2, RAM, SSDS, and ESSM). The GQM-163A is a non-recoverable supersonic sea skimming aerial target, capable of speeds in excess of Mach 2.5 and cruise altitudes from 13.0 to 66 ft. The GQM-163A has also demonstrated  higher altitude diving threat profiles. MSST was a supersonic development effort that was terminated on September 25, 2015. Once the contract termination costs have been determined by DCMA, funds may be required to cover settlement costs. However, the requirement still exists to provide a multi-stage vehicle presentation. New supersonic target development efforts include the Fleet Supersonic Training Target and a replacement target for AQM-37.\n\n - Subsonic Targets: Portfolio includes BQM-177A, and BQM-34 & BQM-74 subsonic target programs. The BQM-177A SSAT development primarily represents subsonic anti-ship cruise missile threats, replacing legacy BQM-74E targets with a modernized subsonic target with increased capabilities.  The BQM-177A SSAT provides threat representation for developmental and operational test & evaluation events of major combat weapons systems programs and in support of fleet training events.  Specifically, the BQM-177A SSAT provides critical live-fire test and evaluation events for AEGIS, SM-6, SM-2, RAM, and ESSM.  BQM-74s are undergoing product improvement program efforts to increase their current performance envelope to meet evolving Fleet requirements and increase operational readiness needs and other subsonic targets, such as the BQM-34, are being considered for similar efforts.   \n\n - Target Threat Simulation Program (TTSP), Target Mission Support Systems (TMSS), and Target Control and Target Augmentation and Auxiliary Systems (TC\/TA\/AS) development: the TTSP portfolio provides the payload equipment required to electronically enhance aerial targets to provide threat representative radio frequency signatures, specifically the electronic attack and threat radar emissions (active emitters). Development of threat representative simulation components is on-going and required to keep pace with evolving threats and ensure that the Navy's threat simulation capabilities maintain warfighter readiness in the current environment. TC provides command and control of targets to enable the execution of threat-representative mission profiles.  The mission also includes the design, development and qualification of various TMSS projects including but not limited to: Target RF datalink hardware, ground control hardware and software, scorer transponders, scoring ground stations, telemetry antennas, radar and locator beacons, identification, friend or foe transponders, and associated test sets. TA\/AS enables each target to be uniquely configured for specific mission profiles and provide for high fidelity simulation of foreign threats. TA\/AS-configured targets are used for radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement and testing, radar cross section evaluation, decoy-effectiveness testing, maneuver analysis, electronic warfare evaluation, warhead-effectiveness testing and evaluation of fleet tactics. TA\/AS scoring capabilities include both surface and airborne scalar and vector scoring systems. \n\nIn addition to the design and development of target hardware and software, funding supports studies performed by a University Affiliated Research Center (UARC) to specify and verify needed target performance for future target development.  For the design and validation of targets under development, the UARC will provide engineering studies in areas such as structures, controls, guidance, and propulsion.  For those hardware and software items presently under development by commercial vendors, the UARC will provide oversight and validation of vendor design and development approach."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supersonic Targets - Development & Upgrades of Supersonic targets"
                                    },
                                    "Description": {
                                        "val": "Provides funding for the development of GQM-163A upgrades\/evolutionary development to keep pace with evolving threat characteristics. Efforts include continued development of performance envelope characteristics to include flight termination performance, enhanced speed and distance capabilities, and multiple target launch capability.  Funding will also support the development of other unique supersonic targets as required, and the close out of the GQM-173 development effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.629"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Made significant progress in the development of the GQM-163A \"Quad launch\" capability, which provides improvement to the infrastructure required to simultaneously launch four targets in a single test event. Continued Radome, and Radar Altimeter design and development efforts and integration of Joint Advanced Missile Instrumentation (JAMI), Time-Space-Position Information (TSPI) Integrated Module (JTIM), Modeling and Simulation (M&S) and Front End System space allocation studies for SSST. Commenced the development of deployable chaff dispensing capability. Initiated design and development of EW payloads and enhanced flight performance capabilities. Continued the development and test of other unique supersonic targets as required."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.229"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the GQM-163A Supersonic Sea Skimming Targets improvement and increased capability efforts including deployable chaff, EW payloads, enhanced flight performance and Orbital Front End System space allocation studies and redesign for SSST. Complete Radome and Radar Altimeter design and development efforts, integration of JTIM and M&S.  Commence the development for required improvements in the current infrastructure of the launch capability to accommodate the increased number of targets to as many as six. Continue to support the development and test of other unique supersonic targets as required."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.237"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.237"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete the Orbital Front End System Space Allocation study. Continue the development of GQM-163A Supersonic Sea Skimming Targets (SSST) improvements and increased capability efforts including deployable chaff, EW payloads, enhanced flight performance. Continue SSST redesign and development efforts as required for improvements and infrastructure upgrades to include those required to accommodate increased simultaneous launches. Continue to support the development and test of other unique supersonic targets as required."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of 0.008 from FY 2019 to FY 2020 to account for potential future supersonic developments and inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Subsonic Targets - Development & Upgrades of subsonic aerial targets with increased capabilities"
                                    },
                                    "Description": {
                                        "val": "A Subsonic Aerial Target (SSAT)  replacement air vehicle, for the currently fielded BQM-74E target no longer in production, is required. The BQM-177A is a modernized subsonic target with increased capabilities providing realistic threat representation in support of critical live-fire Test and Evaluation events for major weapons systems and Fleet combat training.  The target features increased capabilities to include higher speed, longer range, lower cruise altitudes and greater maneuverability. Other subsonic target alternatives are being explored, including the BQM-74G."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.128"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed Navy led flight testing. Continued to fund OEM EMD & NRE support. Supported additional RATO\/JATO qualification efforts as required for safety of operations. Continued engineering, and manufacturing, training, logistics and test efforts of the BQM-177A SSAT for transition to LRIP 2, LRIP 3 and FRP and Full Operational Capability (FOC) including shipboard qualification and operations. Conducted initial shipboard suitability testing and qualification efforts. Completed system validation and verification efforts and conducted production verification flight tests. Conducted Physical Configuration Audit for baseline configuration and supported initial efforts for incorporating Engineering Change Proposals in the baseline design configuration. Continued studies & development efforts on other subsonic target alternatives including the BQM-74G."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "BQM-177A schedule delays were experienced in FY18 due to technical issues which resulted in design modifications being incorporated to address the technical challenges. Subsequently, the entire schedule shifted to the right (FY19) to include but not limited to qualification tests, payload integrations tests, and shipboard suitability tests.\nContinue to prepare for a Full Rate Production (FRP) contract award and obtain support of a FRP decision. Continue the Weapon System Explosive Safety Review Board (WSESRB) approval of shipboard operations. Continue engineering, manufacturing, training, logistics and test efforts of the BQM-177A SSAT for transition to FRP including shipboard qualification and operations. Incorporate Engineering Change Proposals and modernizations in the baseline design configuration as mission and threats evolve.  Continue studies & development efforts on other subsonic target alternatives, including the BQM-74G."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.020"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.020"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete WSESRB approval of shipboard operations. Complete required shipboard suitability testing in preparation of FOC.  Continue engineering, manufacturing, training, logistics and test efforts of the BQM-177A SSAT towards FOC including shipboard qualification and operations. Incorporate Engineering Change Proposals and modernizations in the baseline design configuration as mission and threats evolve. Continue studies & development efforts on other subsonic target alternatives, including the BQM-74G."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of 0.02 from FY 2019 to FY 2020 to account for potential future subsonic developments and inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Threat Simulation Program (TTSP), Target Mission Support Systems (TMSS), Target Control (TC) and Target Augmentation and Auxiliary Systems (TA\/AS)"
                                    },
                                    "Description": {
                                        "val": "Provides funding for the development of Target Control (TC) systems and Target Augmentation and Auxiliary Systems (TA\/AS) capable of supporting Test and Evaluation (T&E) and fleet training activities to ensure emerging threat simulation requirements are met.  Target Control Systems (TCS) involve the improved command and control systems capable of controlling multiple targets simultaneously while delivering adequate fidelity of T&E telemetry data.  The TMSS program portfolio provides target control, scoring, location, and navigation of air, land and seaborne targets for fleet training and weapons systems test and evaluation.  Funding also supports the design, development and qualification of TMSS including but not limited to the current and next generation TC systems, scalar scorers, scoring ground station, telemetry antennas, radar and locator beacons, identification friend or foe and associated test sets.  Augmentation and auxiliary systems must be capable of augmenting targets in support of radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement\/test, radar cross section evaluation, decoy effectiveness, maneuver analysis, electronic warfare, warhead effectiveness and evaluation of fleet tactics, readiness, and training. The Target Threat Simulation Program (TTSP) provides the payload equipment required to electronically enhance aerial\/surface targets to provide threat representative Radio Frequency signatures, specifically the Electronic Attack and Threat Radar Emissions (Active Emitters).  The TTSP accomplishes this by providing a collection of modules which are integrated into individual targets in various configurations to provide the ability to simulate the RF environment.  TTSP equipment in various configurations is certified for carriage in aerial\/surface targets. Funding supports the continued development of the TTSP portfolio so that the Navy can keep pace with emerging enemy threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.444"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development, prototyping and integration of threat electronic attack & active emitter simulators to ensure the fleet meets emerging threat requirements.  Developed threat electronic attack simulation capabilities to address shortfalls identified in the FY 2017 Top 20 threat listing.  Developed improved high peak power pulsed and pulsed Doppler emitter simulation capabilities. Gathered and exploited threat intelligence. Continued to support the design, development and qualification of various TMSS equipment, such as the TCS Radio Frequency Subsystem (SNTC BLK 3). Began development of the SNTC BLK 4 Ground Control Station with associated hardware and software upgrades. Produced the replacement DSQ-50A Scalar Scorer and its associated Ground Telemetry Station."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.429"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototyping and integration of threat electronic attack& active emitter simulators to ensure the Fleet meets emerging threat requirements. Gather and exploit threat intelligence. Begin fielding of the TCS Radio Frequency Subsystem (SNTC BLK 3) upgrade hardware which is a two to three year process. Continue development and qualification of the SNTC BLK 4 Ground Control Station with associated hardware and software upgrades. Commence fielding the DSQ-50A Scalar Scorer and its associated Ground Telemetry Station which is a two to three year process. Begin development AN\/DPN-88 Identify, Friend or Foe (IFF) replacement for fielding in FY 2020. Begin acquisition planning for a replacement TDU-32 Tow Banner in support of Fleet Aerial Gunner Training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.617"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.617"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototyping and integration of threat electronic attack& active emitter simulators to ensure the Fleet meets emerging threat requirements. Gather and exploit threat intelligence.  Continue development and qualification of the SNTC BLK 4 Ground Control Station with associated hardware and software upgrades. Commence development of the DSQ-50B Vector Scorer. Begin fielding the replacement AN\/DPN-90 Radar Beacon and the AN\/DPN-88 IFF replacement. Continue fielding the DSQ-50A Scalar Scorer and its associated Ground Telemetry Station and the TCS Radio Frequency Subsystem (SNTC BLK 3) upgrade hardware, both two to three year processes."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $1.812M from FY 2019 to FY 2020 due to Payload and Mission Support System Development contracts being delayed to further in the FYDP."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN 2280"
                                    },
                                    "Title": {
                                        "val": "Aerial Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "122.173"
                                        },
                                        "CurrentYear": {
                                            "val": "133.937"
                                        },
                                        "BudgetYearOne": {
                                            "val": "152.380"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "145.880"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "6.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "181.653"
                                        },
                                        "BudgetYearThree": {
                                            "val": "180.067"
                                        },
                                        "BudgetYearFour": {
                                            "val": "186.010"
                                        },
                                        "BudgetYearFive": {
                                            "val": "185.481"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Supersonics: The GQM-163A Supersonic Sea-Skimming Target (SSST) is an Acquisition Category II program. The acquisition  strategy includes the continued development of Quad Launch, design efforts for integration of new Radome and Radar Altimeter, Electronic Warfare (EW) systems and other Engineering Change Proposals as required to emulate emerging threat systems. These development efforts will continue to be rolled into the production baseline. Production efforts are expected to continue at higher quantities in order to meet projected MDAP T&E requirements. Additionally, development of alternative supersonic targets is being explored. \n\nCongress was notified on September 25, 2015 that the Department of the Navy made the decision to terminate the Multi-Stage Supersonic Target (MSST) development program. Termination settlement efforts are ongoing with DCMA.\n\nSubsonics: The Subsonic Aerial Target (SSAT) program is an ACAT-IV program. The EMD contract is ongoing and a follow-on Low Rate Initial Production (LRIP) 3 contract will be awarded in 3rd Quarter of FY19 with Full Rate Production (FRP) Contracts to follow. Engineering Change Proposals will be contracted as required via IDIQ contract vehicles to keep pace with emerging threat systems and changes rolled into the production baseline. Development efforts for other subsonic targets will be resourced via other contracting efforts as required.\n\nTarget Threat Simulation Program (TTSP), Target Mission Support Systems (TMSS), Target Control, and Target Augmentation and Auxiliary Systems: The acquisition strategy for these components vary, depending on industry responses to government issued Requests for Information, but most are acquired via Firm Fixed Price IDIQ contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT         PERFORMANCE REQUIREMENT               OBJECTIVE                       THRESHOLD                  TEST RESULT\n\n BQM-177           Maximum Speed at Low Altitude              0.95 M @ 6.6 ft @              0.90 M @ 10.0 ft @           TBD\n EMD               [Mach(M) at feet (ft) above wave           Sea State 5                    Sea State 3                                                                                                                                                                                                              crest at WMO Sea State conditions]"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0610"
                    },
                    "ProjectTitle": {
                        "val": "Wpn Sys T&E Trng Dev\/Proc"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.248"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.248"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "5"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development and procurement of aerial targets and associated systems. These systems are used exclusively for test and evaluation of naval weapons systems, which closely represent current and projected threats to fleet units in the joint strike and the littoral warfare environments. These threat representations must include characteristics in relation to size, performance envelope, and electromagnetic and infrared signatures. As threats evolve, changes must be made to keep the targets threat representative in response to increased complexity  in the test requirements from the developers of naval weapons systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "QF-16 Full-Scale Aerial Target (FSAT)"
                                    },
                                    "Description": {
                                        "val": "The QF-16 FSAT has been developed as a 4th generation, full scale, threat representative target providing a replacement for the FSAT\/QF-4 and are maintained and operated by the Air Force.  The QF-16 FSAT is a converted F-16 aircraft that provides a supersonic, high altitude, remote-controlled aerial target.  This target will have full command and control capability through normal flight envelopes.  The QF-16 FSAT target presentations will support aircraft and weapons systems testing and development, including that of the Joint Strike Fighter, AIM-9X Sidewinder missile, AIM-120 Advanced Medium Range Air-to-Air Missile, and Standard Missile-6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.248"
                                            },
                                            "Articles": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "Worked with the Air Force to develop the Memorandum of Agreement for QF-16 Lot 6-8 procurement. Provided incremental funding to complete the procurement of the five (5) Lot five (5) QF-16 FSAT test assets scheduled to be delivered 3rd Quarter FY21. Conducted regeneration of engines and airframes and drone conversion of QF-16 FSAT aircraft retrieved from Davis Monthan AFB storage. Conducted a FSAT Gulf Range Drone Control Station (GRDCS) demonstration at NAS Pt. Mugu"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2019 funds were reprogrammed to the Weapons Procurement, Navy (WPN) appropriation (BLI 2280)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN 2280"
                                    },
                                    "Title": {
                                        "val": "Aerial Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "122.173"
                                        },
                                        "CurrentYear": {
                                            "val": "143.637"
                                        },
                                        "BudgetYearOne": {
                                            "val": "152.380"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "152.380"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "181.653"
                                        },
                                        "BudgetYearThree": {
                                            "val": "180.067"
                                        },
                                        "BudgetYearFour": {
                                            "val": "186.010"
                                        },
                                        "BudgetYearFive": {
                                            "val": "185.481"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A Memorandum of Agreement (MOA) for Lots 6-8 is being developed between the United States Navy (USN) and the United States Air Force (USAF) for the QF-16 Full-Scale Aerial Target Program (FSAT). Milestone C was achieved in 1st Quarter FY14 and Initial Operating Capability was achieved 4th Quarter FY 2016. FOC is planned for FY 2018. Commencing in FY 2019, the QF-16 program will be reprogrammed to a WPN program."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT          PERFORMANCE REQUIREMENT                OBJECTIVE                 THRESHOLD             TEST RESULT\n\nQF-16                Drone Mission Performance                           Achieve requirement         Threshold=objective       TBD          \nFSAT                    Payload Integration                                       Achieve requirement    Threshold=objective      TBD \nSuperiority            carry, operation & monitoring TEMS,\nTarget                  ALE-47, AIM-9, ALQ-188, ALQ-167 ALE-56 & 300 Gallon Fuel Tank"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0612"
                    },
                    "ProjectTitle": {
                        "val": "Surface Targets Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.288"
                        },
                        "CurrentYear": {
                            "val": "1.323"
                        },
                        "BudgetYearOne": {
                            "val": "1.353"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.353"
                        },
                        "BudgetYearTwo": {
                            "val": "1.385"
                        },
                        "BudgetYearThree": {
                            "val": "1.414"
                        },
                        "BudgetYearFour": {
                            "val": "1.442"
                        },
                        "BudgetYearFive": {
                            "val": "1.471"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops seaborne targets and their related target augmentation systems in support of air-to-surface and surface-to-surface weapons test and evaluation and fleet training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Surface Targets Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.288"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Tested new Fast Attack Craft Target (FACT) platform performance. Developed high fidelity control and feedback for target emitters and cameras. Developed improved Seaborne Target steering systems to increase precision under remote control. Developed improvements to target swarm formation control. Researched new scoring grid for Humannequin target augmentation system and conducted testing. Developed advanced radar and infrared signature enhancement for powered Seaborne Targets. Researched cost-effective methods of producing towed Seaborne Targets in lower quantities to support customization and exercises with short lead times. Monitored developments in Command and Control and supported developments for System for Naval Target Control (SNTC) applicable to Seaborne Targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.323"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop specifications and initiate design concepts for Mobile Ship Target Replacement - MST(X). Analyze and develop control concepts for MST(X). Research improved system for over-the-horizon command and control for Seaborne Targets including satellite links. Integrate Ship Deployable Seaborne Target (SDST) with formation algorithms in Portable Command and Control Unit (PCCU). Perform testing on new platform for High Speed Maneuvering Surface Target - Streamlined Variant (HSMST-s). Measure radar cross section of HSMST-s. Develop advanced radar and infrared signature enhancement for towed Seaborne Targets. Develop configurations of Low Cost Modular Target (LCMT) to support test and evaluation of new weapon systems. Review emerging threats and developing weapon systems and analyze requirements for new targets or improvements\/alterations to existing targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop new hardware for Portable Command and Control Unit (PCCU) with reduced footprint to enhance portability. Develop post-exercise analysis system for target swarm exercises. Develop chaff countermeasure launch controller for seaborne targets. Research large-scale electronic scoring systems for application to seaborne target exercises. Develop improvements to SeaCAN data bus and signal processing. Develop encryption method for SeaCAN data. Develop improvements to SeaCAN system to reduce potential for Electro-Magnetic Interference (EMI) and perform testing on new system components. Research and develop station-keeping capability for towed target platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Number and complexity of RDT&E projects has increased due to increased weapon system Test and Evaluation and Fleet training requirements."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/5429"
                                    },
                                    "Title": {
                                        "val": "ASW SE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.571"
                                        },
                                        "CurrentYear": {
                                            "val": "7.753"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.790"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.790"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.581"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.214"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.675"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.909"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "115.405"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Review capability of inventory with respect to threat, weapons test schedules and fleet training requirements.  OBJECTIVE:  Available inventory of seaborne targets meets fleet requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2159"
                    },
                    "ProjectTitle": {
                        "val": "ASW TARGET"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.800"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.800"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.800"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This project is a new start in FY2020."
                        },
                        "ProjectMissionDescription": {
                            "val": "RDT&E,N Budget provides funding for Small Business Innovation Research (SBIR) Phase 2.5 for sprint speed and frequency expansion to improve performance capability for the Mk39 Mod 3 Expendable Mobile ASW Training Target (EMATT).  This effort supports the transition of the Sprint Speed and Low Frequency Improvement Phase 2.5 efforts into MK 39 Mod 3 EMATT production and starts to investigate Continuous Active Sonar (CAS) capability to provide better detection performance and provide operators with a continuous track. Sprint Speed and Frequency Expansion upgrade allows EMATT to more closely represent submarine tactics for evasion and will make it compatible with new ASW sensors like the LCS ASW mission package."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Accomplishment\/Planned Program Entry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "RDT&E,N funding in FY20 will be used to continue to address performance shortfalls in the current fleet of MK39 Mod 3 EMATTs to add Sprint Speed and Frequency Expansion upgrades to be more compatible with New ASW Sensors."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY20 Program Element Budget increased by $2.8M to provide for SBIR Phase 2.5 for sprint speed and frequency expansion to improve performance capability for the Mk39 Mod 3 Expendable Mobile ASW Training Target (EMATT)."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Frequent IPT meetings with contract and government technical program personnel.\n- Rigorous acoustic, environmental and in-water dynamic test program.\n- Award SBIR Phase 2.5 Sprint Speed and Frequency Expansion Contractor efforts"
                        }
                    }
                }
            ]
        }
    }
}