{
    "id": "2020-Navy-PB-1319-JBOOK-70424d53d505ad36f58958e9097dbb4e960ff5c07915d7e5672a15384a45783b-21",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606942N"
        },
        "ProgramElementTitle": {
            "val": "(U)Assessments and Evals Cyber Vulnerabilities"
        },
        "R1LineNumber": {
            "val": "195"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "48.800"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "2.000"
            },
            "BudgetYearFour": {
                "val": "2.000"
            },
            "BudgetYearFive": {
                "val": "2.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Cyber Vulnerability Assessments and Evaluations program funds for cyber vulnerability assessments of major Navy weapons systems and cyber vulnerability assessments of critical shore infrastructure as directed by Sec. 1647 of the FY16 National Defense Authorization Act (NDAA) and Sec. 1650 of the FY17 NDAA, respectively.  Funding will be used for assessments and non-recurring engineering for mitigations related to the  Navy's major weapons systems identified in Joint Requirements Oversight Committee Memorandum (JROCM) 039-16 and on prioritized critical shore infrastructure prioritized.\n\nSec. 1647 of the FY16 NDAA directs the Secretary of Defense to complete an evaluation of the cyber vulnerabilities of each major weapon system of the Department of Defense by not later than December 31, 2019. Funded vulnerability assessments will build upon existing efforts regarding the identification and mitigation of cyber vulnerabilities of major weapons systems, and shall not duplicate similar ongoing efforts such as Task Force Cyber Awakening or conduct redundant assessment on systems that have already been evaluated. \n\nSec. 1647 assessment will be formalized in Vulnerability Assessment Reports (VARs), Cyber Table Top Exercises (CTTXs), Cyber Risk Analysis (CRAs) and other reporting. \n\nSec. 1650 of the FY17 NDAA directs the Secretary of Defense to submit a plan for assessing the cyber vulnerability of critical defense infrastructure and begin assessment of this infrastructure during a preliminary pilot program that will assess no fewer than two installations by December, 31 2019. Funded vulnerability assessments will end by calendar year 2020 and will build upon existing mission assurance, blue team, and red team capabilities.  As instructed by the Congressional language, the assessments will utilize Department of Energy (DoE) and Department of Defense (DoD) national laboratory partnerships.  Assessments will end with the submission of a final report to Congress. Strategies and procedures for mitigating the risk of cyber vulnerabilities should be identified during the course of evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "48.800"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "48.800"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                }
            },
            "SummaryExplanation": {
                "val": "The funding decrease from FY 2019 to FY 2020 is due to the completion of the one year Cyber Vulnerability assessments of major Navy weapon systems and critical infrastructure.  \n\nTechnical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "4038"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Vulnerability Evaluation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "48.800"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "2.000"
                        },
                        "BudgetYearFour": {
                            "val": "2.000"
                        },
                        "BudgetYearFive": {
                            "val": "2.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Cyber Vulnerability Assessments and Evaluations program funds for cyber vulnerability assessments of major Navy weapons systems and cyber vulnerability assessments of critical shore infrastructure as directed by Sec. 1647 of the FY16 National Defense Authorization Act (NDAA) and Sec. 1650 of the FY17 NDAA, respectively.  Funding will be used for assessments and non-recurring engineering for mitigations related to the  Navy's major weapons systems  identified in Joint Requirements Oversight Committee Memorandum (JROCM) 039-16 and on prioritized critical shore infrastructure.\n\nSec. 1647 of the FY16 NDAA directs the Secretary of Defense to complete an evaluation of the cyber vulnerabilities of each major weapon system of the Department of Defense by not later than December 31, 2019. Funded vulnerability assessments will build upon existing efforts regarding the identification and mitigation of cyber vulnerabilities of major weapons systems, and shall not duplicate similar ongoing efforts such as Task Force Cyber Awakening or conduct redundant assessment on systems that have already been evaluated. \n\nSec. 1647 assessment will be formalized in Vulnerability Assessment Reports (VARs), Cyber Table Top Exercises (CTTXs), Cyber Risk Analysis (CRAs) and other reporting. \n\nSec. 1650 of the FY17 NDAA directs the Secretary of Defense to submit a plan for assessing the cyber vulnerability of critical defense infrastructure and begin assessment of this infrastructure during a preliminary pilot program that will assess no fewer than two installations by December, 31 2019. Funded vulnerability assessments will end by calendar year 2020 and will build upon existing mission assurance, blue team, and red team capabilities.  As instructed by the Congressional language, the assessments will utilize DoE and DoD national laboratory partnerships.  Assessments will end with the submission of a final report to Congress. Strategies and procedures for mitigating the risk of cyber vulnerabilities should be identified during the course of evaluation.\nProgram is to support Cyber Vulnerability Evaluations Assessments of E6B and Other Aviation Platforms.\nThe Cyber Vulnerability Assessments and Evaluations program funds for cyber vulnerability assessments of major Navy weapons systems and cyber vulnerability assessments of critical shore infrastructure as directed by Sec. 1647 of the FY16 National Defense Authorization Act (NDAA) and Sec. 1650 of the FY17 NDAA, respectively. Funding will be used for assessments and non-recurring engineering for mitigations related to the Navy's major weapons systems identified in Joint Requirements Oversight Committee Memorandum (JROCM) 039-16 and on prioritized critical shore infrastructure.\n\nSec. 1647 of the FY16 NDAA directs the Secretary of Defense to complete an evaluation of the cyber vulnerabilities of each major weapon system of the Department of Defense (DoD) by no later than December 31, 2019. Funded vulnerability assessments will build upon existing efforts regarding the identification and mitigation of cyber vulnerabilities of major weapons systems, and shall not duplicate similar ongoing efforts such as Task Force Cyber Awakening or conduct redundant assessment on systems that have already been evaluated. \n\nSec. 1647 assessment will be formalized in Vulnerability Assessment Reports (VARs), Cyber Table Top Exercises (CTTXs), Cyber Risk Analysis (CRAs) and other reporting. \n\nSec. 1650 of the FY17 NDAA directs the Secretary of Defense to submit a plan for assessing the cyber vulnerability of critical defense infrastructure and begin assessment of this infrastructure during a preliminary pilot program that will assess no fewer than two installations by December, 31 2019. Funded vulnerability assessments will end by calendar year 2020 and will build upon existing mission assurance, blue team, and red team capabilities. As instructed by the Congressional language, the assessments will utilize Department of Energy (DoE) and DoD national laboratory partnerships. Assessments will end with the submission of a final report to Congress. Strategies and procedures for mitigating the risk of cyber vulnerabilities should be identified during the course of evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Vulnerability Evaluation for Ship Weapons Systems:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "CVN 78\n- Analyze cybersecurity vulnerabilities using a system of systems approach and conduct system-of-systems cyber vulnerability assessments on CVN 78.\n- Utilize CVN 78 analysis to assess the vulnerability of the platform's vast control system networks. This assessment will play an integral role in identifying the most efficient and effective incremental improvements in CVN 78's cybersecurity, holistically maximizing cybersecurity of the platform's interconnected control system networks with the limited modernization budget available.\n-Execute modeling, simulation and analysis to capture system impacts of cyber vulnerabilities and identified mitigations, specifically situational awareness (SA) tools and continuous monitoring (CM) tools. \n- Leverage the model and analysis of CVN 78 as evidence of the platforms cyber survivability in a contested cybersecurity environment.\n\nThe Cooperative Engagement Capability (CEC) and Navigation systems interface with multiple combat system and  sensor types.  Extensive and complex analysis is required to characterize and address cybersecurity and cyber vulnerability aspects of network operations over multiple interfaces.\n\n- Conduct a tabletop cyber assessment of critical hardware\/software components and platform interfaces that could result in degradation of a mission enabling system.\n- Analyze cyber assessment results to determine the cyber resilience methods that could be further incorporated into modernization efforts.\n- Execute modeling, simulation and analysis to develop war fighting metrics to capture cyber vulnerabilities and identified mitigations to provide increased mission assurance. \n\nShip Self Defense System (SSDS) \n-Conduct system-of-systems cyber vulnerability assessments on the SSDS Weapon System.\n- Identify elements within the Secure Combat System Domain, define threat scenarios, analyze risk through engineering assessments and table tops and prioritize development of  cybersecurity capabilities to apply cyber controls and introduce resilience.\n- Ensure Combat System Enclave and networks successfully operate in adversarial cyber contested environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the completion of the one year effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Vulnerability Assessments of Other Aviation Platforms"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct system-of-systems cyber vulnerability assessments on Other Aviation Platforms aircraft and associated support systems.\n- Execute modeling, simulation and analysis to capture the mission impacts of the cyber vulnerabilities.\n- Enhance emulation lab penetration testing capabilities to improve Other Aviation Platforms cyber risk assessment capacity and expand to include additional  systems.\n- Conduct collaborative cyber security assessments and exercises with fleet operational community to assess vulnerability operational impacts and identify potential mitigations.\n- Align the cyber vulnerability assessments and findings to future Fleet or COCOM exercise(s).\n- Execute analysis and prototyping activities to mitigate identified cyber vulnerabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the completion of the one year effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "E6B"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct system-of-systems cyber vulnerability assessments on E-6B aircraft and associated support systems.\n- Execute modeling, simulation and analysis to capture the mission impacts of the cyber vulnerabilities.\n- Enhance emulation lab penetration testing capabilities to improve E-6B cyber risk assessment capacity and expand to include additional E-6B systems.\n- Conduct collaborative cyber security assessments and exercises with fleet operational community to assess vulnerability operational impacts and identify potential mitigations.\n- Align the cyber vulnerability assessments and findings to future Fleet or COCOM exercise(s).\n- Execute analysis and prototyping activities to mitigate identified cyber vulnerabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the completion of the one year effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SWS Cyber Evaluations"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct Trident system and sub-system cyber testing during Strategic Systems Programs (SSP) Development and Operational Testing.\nConduct additional cyber testing to establish a cyber baseline for the current Strategic Weapon System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is associated with the SWS Cyber Evaluations completing in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trident System Cyber Hardening"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct a tabletop cyber assessment of critical hardware\/software components and platform interfaces that could result in a mission degrade.\nAnalyze cyber assessment results to determine  the cyber resilience methods that could be further incorporated into \nStrategic Weapon System modernization efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is attributed to the Trident System Cyber Hardening completing in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Vulnerability Assessments of Information Warfare Weapons Systems"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Conduct system-of-systems cyber vulnerability assessments on Information Warfare Weapons Systems.\n-Execute modeling, simulation and analysis to develop warfighting metrics to capture the mission impacts of the cyber vulnerabilities and identified mitigations.\n-Overlay the cyber vulnerability assessment construct and findings during a major Fleet or Combatant Command (COCOM) exercise.  \n-Enhance red teaming and penetration testing capabilities to improve Navy cyber risk assessment capacity and proficiency.\n-Increase red teaming and penetration testing activities and conduct Navy Information Warfare cyber risk assessments.\n-Conduct cyber penetration testing to confirm\/deny the presence of vulnerabilities and assess the effectiveness of mitigations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the completion of the one year effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Vulnerability Assessments of Critical Infrastructure"
                                    },
                                    "Description": {
                                        "val": "The Cyber Vulnerability Assessments and Evaluations program funds cyber vulnerability assessments of critical shore infrastructure as directed by Section 1650 of the FY17 National Defense Authorization Act (NDAA).  Funding will be used for assessments of prioritized critical shore infrastructure.  Sec. 1650 of the FY17 NDAA directs the Secretary of Defense to submit a plan for assessing the cyber vulnerability of critical defense infrastructure and begin assessment of this infrastructure during a preliminary pilot program that will assess no fewer than two installations by December, 31 2019. Funded vulnerability assessments will end by calendar year 2020 and will build upon existing mission assurance, blue team, and red team capabilities.  As instructed by the Congressional language, the assessments will utilize DoE and DoD national laboratory partnerships.  Assessments will end with the submission of a final report to Congress. Strategies and procedures for mitigating the risk of cyber vulnerabilities should be identified during the course of evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct comprehensive red (penetration-level), blue team assessments, and non-recurring engineering for mitigations identified related to facility related control systems.  This includes those systems integrated into, as well as supporting, critical infrastructure for the Navy. As directed by Congressional language, these all-inclusive vulnerability assessments will require the development of multifaceted testing capabilities within the Navy shore domain while leveraging existing resources across the Fleet in addition to strategies and competencies from our national laboratory partners. Supporting these vulnerability assessments will be the identification and development of mission modeling artifacts outlining the relationship between those identified facility related control systems and the relevant DoD and Navy mission and operational plans. These efforts will provide increased survivability and cyber resiliency of the Naval shore domain."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease from FY 2019 to FY 2020 is due to the completion of assessments of cyber vulnerability of critical defense infrastructure as directed by Section 1650 of the FY17 National Defense Authorization Act (NDAA)."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Deliverable of appropriate Cyber Vulnerability reports\nPerformance will be measured by Cyber Assessments completed.\nDeliverable of appropriate Cyber Vulnerability reports."
                        }
                    }
                }
            ]
        }
    }
}