{
    "id": "2020-Army-PB-2040-JBOOK-637b9179439d133187084d0d58542f7e073fb0df2918c7dd6e5b31158e975014-46",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708045A"
        },
        "ProgramElementTitle": {
            "val": "End Item Industrial Preparedness Activities"
        },
        "R1LineNumber": {
            "val": "251"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "118.41"
            },
            "CurrentYear": {
                "val": "108.696"
            },
            "BudgetYearOne": {
                "val": "59.848"
            },
            "BudgetYearOneBase": {
                "val": "59.848"
            },
            "BudgetYearTwo": {
                "val": "61.071"
            },
            "BudgetYearThree": {
                "val": "62.543"
            },
            "BudgetYearFour": {
                "val": "63.749"
            },
            "BudgetYearFive": {
                "val": "64.386"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "538.703"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) develops, demonstrates, and transitions manufacturing processes that enable improvements in producibility and affordability of emerging and enabling components and subsystems of Army ground and air platforms, Soldier systems, weapons systems, air & missile defense systems, and sensors and electronics. Initiatives within the PE result in cost savings and reduced risk of transitioning military-unique manufacturing processes into production. Project E25 fosters the transfer of new\/improved manufacturing technologies to the industrial base, including manufacturing efforts that have potential for high payoff across the spectrum of Army systems.\n\nThe cited work is consistent with the Under Secretary of Defense, Research and Engineering science and technology focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by: the U.S. Army Futures Command; The U.S. Army Medical Research and Materiel Command (MRMC), Ft. Detrick, MD; and the Army Space and Missile Defense Command\/Army Forces Strategic Command (SMDC\/ARSTRAT), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.877"
                },
                "CurrentYear": {
                    "val": "53.958"
                },
                "BudgetYearOne": {
                    "val": "59.848"
                },
                "BudgetYearOneBase": {
                    "val": "59.848"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "118.41"
                },
                "CurrentYear": {
                    "val": "108.696"
                },
                "BudgetYearOne": {
                    "val": "59.848"
                },
                "BudgetYearOneBase": {
                    "val": "59.848"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "57.533"
                },
                "CurrentYear": {
                    "val": "54.738"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.046"
                    },
                    "CurrentYear": {
                        "val": "-0.062"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "59.8"
                    },
                    "CurrentYear": {
                        "val": "54.8"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.221"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 congressional add of $59.8M for Additive manufacturing technology insertion and supply chain, Army inventory management and demand planning software, nanoscale materials, advanced development of asset protection technologies, and manufacturing for novel lightweight transparent armor.\nFY 2019 congressional add of $54,800 for additive manufacturing technology insertion, nanoscale materials, lightweight transparent armor, engineering data synchronization, and power take-off hybridization."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "E25"
                    },
                    "ProjectTitle": {
                        "val": "Mfg Science & Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "58.61"
                        },
                        "CurrentYear": {
                            "val": "53.896"
                        },
                        "BudgetYearOne": {
                            "val": "59.848"
                        },
                        "BudgetYearOneBase": {
                            "val": "59.848"
                        },
                        "BudgetYearTwo": {
                            "val": "61.071"
                        },
                        "BudgetYearThree": {
                            "val": "62.543"
                        },
                        "BudgetYearFour": {
                            "val": "63.749"
                        },
                        "BudgetYearFive": {
                            "val": "64.386"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "424.103"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project develops and demonstrates manufacturing processes that enable improvements in producibility and affordability of emerging and enabling components and subsystems of Army ground and air platforms, Soldier systems, weapons systems, air & missile defense systems, and sensors and electronics. Focus is on components and subsystems such as advanced armor, lightweight structural components, sensors, propellants, and gun tubes. Additionally, work is performed to advance the state of the art in manufacturing processing and fabrication techniques for coatings, multifunctional materials, and structural elements for Army specific applications.  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Long Range Precision Fires"
                                    },
                                    "Description": {
                                        "val": "The effort funds manufacturing improvements to support areas such as Advanced Weapon Systems, Fire Control, and Advanced Energetics and Warheads. Work focuses on addressing challenges in areas such as enhanced missile seekers; fuses and initiators for munitions; and boring, honing, and rifling cannon and mortar barrels."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.956"
                                            },
                                            "Text": {
                                                "val": "Complete development of manufacturing processes for battery free initiators for scatterable munitions; and development of manufacturing technologies for complex missile seekers. Develop safer and more cost effective methods for mixing and packing of propellants; enhanced processes to fabricate large-caliber cannon and mortar tubes with longer range and higher durability than existing systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.235"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.235"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate advanced materials, processing techniques, and tools to fabricate, bore, and rifle large caliber mortar and cannon tubes that enable long range fires; demonstrate more efficient propellant mixing and packing processes for rocket motors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The Manufacturing Technology selection process supports planned completions in FY19 and planned new start efforts in FY20 to support the Army's modernization priority of Army Long Range Precision Fires."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Combat Vehicle"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for tactical and combat vehicles and weapons systems. Work focuses on addressing challenges in areas such as advanced armor, lighter weight components, insensitive propellants, precision munitions, and vehicle power devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.454"
                                            },
                                            "Text": {
                                                "val": "Fabricated hatch and ramps for demonstration on selected vehicles, documented and transitioned magnesium alloy ballistic specifications; demonstrated a cathode coating process and enhanced production of high energy density safe 5 volt lithium-ion batteries for use in Army ground vehicle systems; proved out and delivered a manufacturing line and associated processes for adaptive protection modules; continued development of an improved rocket nozzle insulation processes to PM Precision Fires; constructed an agile manufacturing cell and sensor suite to demonstrate efficient welding of thicker plate materials used for armored multi-purpose and other vehicles; continued development of a lithium-ion battery pilot line leveraging multiple battery form factors leading to reduced cost and increased throughput; researched novel joining technology processes that will replace existing steel components leading to lighter heavy combat vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.529"
                                            },
                                            "Text": {
                                                "val": "Develop manufacturing technology to reduce the cost and improve the performance of weight sensitive armor protection systems against future threats; demonstrate manufacturing technologies to reduce cost and improve performance when joining dissimilar materials for ground platform structural components; develop manufacturing techniques for ground vehicle powertrain components with improved efficiency and power density."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.211"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.211"
                                            },
                                            "Text": {
                                                "val": "Will mature processing of weight sensitive armor and protection systems that meet size, weight and power requirements; demonstrate manufacturing processes and non-destructive evaluation techniques to enable advanced welding for vehicle structures; develop manufacturing technologies that address unit cost and enable lower life cycle costs as compared to currently available modern combat powertrain components; develop manufacturing processes required to produce composite rubber track systems applicable to heavy ground combat systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The Manufacturing Technology selection process supports planned completions in FY19 and planned new start efforts in FY20 to support the Army's modernization priority of Next Generation Combat Vehicle."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Vertical Lift"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable manned and unmanned aircraft components and subsystems. Work focuses on addressing challenges in areas such as engine performance and life, reliable component integration\/attachment, structural durability at low weight, sensors for aircraft protection and pilotage, and reduced corrosion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.932"
                                            },
                                            "Text": {
                                                "val": "Transitioned to Utility Helicopters Project Office for qualification testing direct digitally manufactured helicopter engine components of additively manufactured articles resulting in increased performance and reduced weight of the T700 platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.17"
                                            },
                                            "Text": {
                                                "val": "Investigate novel manufacturing methods for fabrication of composite material air platform components with reduced weight and improved fatigue resistance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.058"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.058"
                                            },
                                            "Text": {
                                                "val": "Will develop novel automated manufacturing methods for composite air platform components which are lighter weight and more maintainable; develop manufacturing of targeting sensors for airborne applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The Manufacturing Technology selection process supports planned completions in FY19 and planned new start efforts in FY20 to support the Army's modernization priority of Future Vertical Lift."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networks and Command, Control, Communications and Intelligence"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for intelligence, surveillance, reconnaissance and targeting systems, mission command systems, electronic warfare and improved explosive device detect\/defeat systems. Work focuses on addressing challenges in areas such as large format multi-color focal plane arrays, flexible displays, night vision sensors, target detectors, advanced antennas and sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.452"
                                            },
                                            "Text": {
                                                "val": "Transitioned improved processes for 12um focal plane arrays used in high definition cameras to Project Manager (PM) Soldier Sensors and Lasers; delivered to PM Aircraft Survivability Equipment millimeter wave packaging improvements to include module development and antenna\/module interface advancements of devices used in radio frequency threat warning applications in air combat platforms; continued optimization of a manufacturing process to produce ultra-thin, lightweight, wide-band conformal antennas; continued refining and validating a 3D, read-only integrated circuit manufacturing process resulting in sensors with improved sensitivity and dynamic range; improved assembly processes utilizing epoxies that resist high shocks & temperature cycling for weapon boresight systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.819"
                                            },
                                            "Text": {
                                                "val": "Complete optimization of manufacturing process to produce ultra-thin, wide-band, conformal antennas for Army platforms; investigate process improvements for digital imagers and sensors for aviation protection and pilotage."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.363"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.363"
                                            },
                                            "Text": {
                                                "val": "Will improve process maturation and material growth and yield of dual band digital imagers for aviation protection and pilotage; demonstrate optics coating deposition techniques for 3rd generation sensor platforms; develop Micro Electro Mechanical Systems (MEMS)-based navigation-grade inertial measurement units."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The Manufacturing Technology selection process supports planned completions in FY19 and planned new start efforts in FY20 to support the Army's modernization priority of Networks and Command, Control, Communications and Intelligence."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air & Missile Defense"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing improvements to support areas such as High Energy Laser system components (e.g. diodes, optics), interceptor components, and armament systems for counter-unmanned aerial systems and counter-rocket, artillery, and mortar systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.588"
                                            },
                                            "Text": {
                                                "val": "Develop processes to improve manufacturing yield for high energy laser diodes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.734"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.734"
                                            },
                                            "Text": {
                                                "val": "Will develop prototype tooling, test, and evaluation processes to improve manufacturing yield for high energy laser diodes; optimize manufacturing techniques for High Energy Laser (HEL) optics through manufacturing improvements to reduce lead time; develop improvements to the manufacturing process for electromagnetic mitigation devices to eliminate co-site, jamming, and other threats to radar and other communication systems; design and develop a manufacturing process for critical gyroscope components."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Efforts for AMD were realigned from Lethality beginning in FY19 with continued progression in FY20.  This effort builds in FY20 for developing an automated means of manufacturing fiber-coupled Pump Diode Processes for High Energy Lasers resulting in reduced production costs.  Such efforts will benefit future Army rotary-wing hard-kill aircraft survivability equipment development and other service fiber laser system development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Lethality"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems in areas such as aerial delivery of supplies, expeditionary basing, Soldier-borne sensors, clothing, and protective equipment. Work focuses on addressing challenges in areas such as multifunctional fabrics for shelters, uniforms and portage equipment; lightweight materials for body armor; and medical technologies such as biotechnology and vaccine production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.83"
                                            },
                                            "Text": {
                                                "val": "Transitioned to Soldier protection systems programs of record a full scale manufacturing pilot line developed for polyethylene films; built a continuous reactor to demonstrate high yield manufacturing processes for gallium arsenide based solar arrays for portable Soldier power sources; refined manufacturing processes in the production of low cost augmented reality eyepieces that provide the Soldier with high resolution imagery across a wide field of view for increased situational awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.174"
                                            },
                                            "Text": {
                                                "val": "Develop manufacturing techniques for low cost freeform prism eyepieces and components for Infantry sighting systems; develop manufacturing process improvement techniques for optical coatings and optical components to reduce cost and improve performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.319"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.319"
                                            },
                                            "Text": {
                                                "val": "Will develop manufacturing scale up for advanced metal organic materials to enable better integrated warfighter protection systems; advance manufacturing processes low light level imagers for night time situational awareness for Soldiers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decreases in program results from planned transitions and\/or completions of programmable initiators for scatterable munitions, freeform prism eyepieces, and power and energy for medium caliber liquid reserve batteries."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross-cutting"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances with impact across processes or platforms of Army interest. Work focuses on addressing challenges in areas such as advanced additive manufacturing technologies for fabrication of weapons systems, platforms, and munitions; and novel manufacturing techniques for expedient and cost effective repair of worn or damaged platform components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.042"
                                            },
                                            "Text": {
                                                "val": "Completed delivery to Project Manager Maneuver Ammunition Systems (PM MAS) processes and tooling requirements of 2D and 3D additively manufactured energetics and electronics for use in 40mm grenades; demonstrated a laser enhanced net shaping repair process at Anniston Army Depot for the qualification and reclamation of Army components; performed modeling and simulation for cold spray repair processes to reduce the sustainment cost of Army weapon systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.811"
                                            },
                                            "Text": {
                                                "val": "Demonstrate advanced additive manufacturing capabilities for the build, remanufacture, and life extension of critical weapon systems components to improve performance, allow fabrication of structures not possible thorough subtractive methods, and\/or improve component affordability; demonstrate an integrated augmented reality solution for advanced machining."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.928"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.928"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate advanced machining solutions for large caliber weapons."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The Manufacturing Technology selection process supports planned completions in FY19 and continued efforts in FY20 for Cross Cutting technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethality"
                                    },
                                    "Description": {
                                        "val": "The effort funds manufacturing improvements to support areas such as Advanced Weapon Systems, Fire Control, Logistics, Emerging Technologies, and Advanced Energetics and Warheads. Work focuses on addressing challenges in areas such as enhanced missile seekers; fuses and initiators for munitions; and boring, honing, and rifling cannon and mortar barrels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.4"
                                            },
                                            "Text": {
                                                "val": "Improved manufacturing methods, conducted materials analysis and demonstrated more efficient production processes that enable multi-mode missile seekers; built and tested prototype programmable initiators of with an automated, scaled-up manufacturing process addressing requirements for Family of Scatterable Munitions (FASCAM); developed smart tooling and process models of for a software- based module capable of aiding production engineers across the organic industrial base and S&T community to verify and implement best value part manufacturing programs; fabricated disk components and tested components to demonstrate spark plasma sintering process to reduce costs and lead times for large caliber cannon broach cutting tools; demonstrated processes on internal components that validate suitable energetic inks in the production of next generation hand grenades and small munitions; matured the manufacturing processes for the fabrication of small format liquid reserve batteries which support small to medium caliber munitions and hand emplaced munitions; matured waterjet milling to produce the rifling in large caliber cannon tubes in order to replace the expensive broaching process; investigated advanced manufacturing techniques for small caliber lightweight cartridge cases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable process methods in areas such as manufacturing of lighter weight multi-functional materials, biotechnology, vaccines, medical equipment power sources, and component ruggedization that directly address Soldier rehabilitation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.5"
                                            },
                                            "Text": {
                                                "val": "Produced test batches in the development of a modernized, scaled-up production process addressing spray drying and encapsulation methods of the Adenovirus vaccine."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.849"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Not applicable for this item."
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "291.812"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "58.61"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "52.047"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "59.848"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "59.848"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "462.317"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.849"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.849"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443332_E25.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "N\/A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EA2"
                    },
                    "ProjectTitle": {
                        "val": "MANTECH INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.8"
                        },
                        "CurrentYear": {
                            "val": "54.8"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "114.600"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This effort accelerates manufacturing technology for more affordable electronic warfare, communications and sensors systems components and subsystems to include radio frequency amplifiers, antennas, and focal plane arrays.  This effort accelerates and supplements manufacturing technology for more affordable components and subsystems for tactical and combat vehicles and weapon systems. Work focuses benefit from working to develop and scale up the manufacturing process for nano-tungsten carbide powders and high-volume single-crystal tungsten rod manufacturing processes.  This effort accelerates and supplements manufacturing technology for more advanced manufacturing and enterprise solutions. Work focuses on accelerating model based manufacturing to specific organic Army facilities and novel ways of applying additive manufacturing and monitoring material powder beds and process controls during additive manufacturing part build for weapon system components."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing Technology Insertion"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Additive Manufacturing Technology Insertion"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Additive Manufacturing Technology Insertion"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing Supply Chain"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Additive Manufacturing Supply Chain"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Inventory Management and Demand Planning Software"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.8"
                                        },
                                        "Text": {
                                            "val": "Inventory Management and Demand Planning Software"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nanoscale Materials"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "Nanoscale Materials"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Nanoscale Materials"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Development of Asset Protection Technologies"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Advanced Development of Asset Protection Technologies"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight Transparent Armor"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Lightweight Transparent Armor"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Lightweight Transparent Armor"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering Data Synchronization"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "9.8"
                                        },
                                        "Text": {
                                            "val": "Engineering Data Synchronization"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Take-Off Hybridization"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Power Take-Off Hybridization"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "12"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "59.8"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "54.8"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "126.600"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "N\/A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}