{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-3",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603004A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Advanced Technology"
        },
        "R1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "195.345"
            },
            "CurrentYear": {
                "val": "241.581"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "436.926"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is being eliminated, with continuity of effort realigned to the following PEs:\n?\t0603118A Soldier Lethality Advanced Technology \n?\t0603119A Ground Advanced Technology\n?\t0603462A Next Generation Combat Vehicle Advanced Technology\n?\t0603464A Long Range Precision Fires Advanced Technology\n?\t0603465A Future Vertical Lift Advanced Technology\n?\t0603466A High Energy Laser Tactical Vehicle Demonstrator Advanced Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures weapons and munitions components\/subsystems and demonstrates lethal weapons systems with potential to increase force application and force protection capabilities across the spectrum of operations. Project 232 focuses on affordable delivery of scalable effects for kinetic weapons and munitions including: artillery, mortars, medium caliber, tank fired, Soldier weapons and shoulder fired weapons. Project L96 matures and integrates critical high energy laser subsystems into mobile demonstrators to explore and validate system performance in relevant environments. Project L97 demonstrates performance of advanced obscurants and delivery of mechanisms and conducts forensic analysis of explosives and hazardous materials to enable detection.  \n\nIn FY 2018\/FY 2019 work in this PE is related to, and fully coordinated with, PE 0602120A (Sensors and Electronic Survivability), PE 0602307A (Advanced Weapons Technology), PE 0602618A (Ballistics Technology), PE 0602622A (Chemical, Smoke, and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), and PE 0603313A (Missile and Rocket Advanced Technology).  \n\nBeginning in FY 2020, work in this PE is related to and fully coordinated with PE 0603118 (Soldier Lethality Advanced Technology), 0603462A (Next Generation Combat Vehicle Advanced Technology), 0603464A (Long Range Precision Fires Advanced Technology), 0603465A (Future Vertical Lift Advanced Technology), PE 0603466A (High Energy Laser Tactical Vehicle Demonstrator Advanced Technology), and PE 0603119A (Ground Advanced Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. All FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe work in this PE is performed by the U.S. Army Futures Command (AFC) and the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "84.079"
                },
                "CurrentYear": {
                    "val": "102.686"
                },
                "BudgetYearOne": {
                    "val": "112.213"
                },
                "BudgetYearOneBase": {
                    "val": "112.213"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "195.345"
                },
                "CurrentYear": {
                    "val": "241.581"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "111.266"
                },
                "CurrentYear": {
                    "val": "138.895"
                },
                "BudgetYearOne": {
                    "val": "-112.213"
                },
                "BudgetYearOneBase": {
                    "val": "-112.213"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.056"
                    },
                    "CurrentYear": {
                        "val": "-0.105"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "68"
                    },
                    "CurrentYear": {
                        "val": "139"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "46"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.678"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-112.213"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-112.213"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 congressional adds for Program increase ($42.000 million), Gun-launched unmanned aerial system ($3.000 million), High energy laser research ($15.000 million), and High energy laser rotorcraft integration ($8.000 million).\nFY19 congressional adds for Program increase ($42.000 million), advanced development of asset protection technologies ($5.000 million), accelerate ERCA gun ($12.000 million), high energy laser ($20.000 million), long range precision fires ($35.000 million), and hypersonic capability ($25.000 million).\nThis Program Element (PE) is eliminated in FY20 as part of the Science and Technology (S&T) financial restructure initiative; however, continuity of effort is preserved through transition to new Program Elements (PE ) \/ Projects."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "232"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Lethality & Survivability Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "99.265"
                        },
                        "CurrentYear": {
                            "val": "70.34"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "169.605"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nPE 0603118A Soldier Lethality Advanced Technology, Projects:\n*\tAY7 Small Arms Fire Control Advanced Technology\nPE 0603462A Next Generation Combat Vehicle Advanced Technology, Projects:\n*\tBF5 Adv Lethality & Accuracy Sys for Med Cal Adv Tech\n*\tBG5 Extended Line of Sight (ELOS) Advanced Technology\n*\tBI1 Protection for Autonomous Systems Adv Tech\n*\tBK4 Next Gen Intelligent Fire Control(NG-IFC) Adv Tech\n*\tBK6 Adv Direct InDirect Armament Sys (ADIDAS) Adv Tech\nPE 0603464A Long Range Precision Fires Advanced Technology, Projects:\n*\tAE6 Strategic Long Range Cannon Advanced Technology\n*\tAG3 Extended Range Cannon Artillery (ERCA) Adv Tech\n*\tAG5 Extended Range Artillery Munition Suite Adv Tech\n*\tAG7 Energetic Materials and Adv Processing Adv Tech\n*       BS3 Strategic Missile Advanced Technology\nPE 0603465A Future Vertical Lift Advanced Technology, Projects:\n*\tAK7 Adv Rotorcraft Armaments Protection Sys Adv Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for affordable precision munitions including advanced energetic materials and munitions, novel fuze designs, penetrators, and scalable effects. \n\nEfforts in this Project support the Lethality and Ground Maneuver portfolios.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cluster Munitions Replacement Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates ultra-high reliability fuzing, advanced kill mechanisms, and alternative dispensing technologies for 155mm artillery to provide increased battlefield lethality with reduced unexploded ordnance (UXO) compliant with the Department of Defense (DoD) cluster munitions policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.657"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated various materiel cluster munition components at the system and component level; Evaluated effectiveness of materiel solutions; and optimized solutions to address desired target sets. Submunition concepts underwent extensive laboratory testing to ensure arming in proper environments and ensure fuzing reliability growth."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.748"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct ballistic testing with the objective of a TRL6 demonstration at the end of FY 2019 to validate performance of critical components such as fuzing and warheads; will optimize tests to capture as much pertinent data as possible to inform requirements generation; will mature and demonstrate the performance of integrated components through ballistic testing to show improvements over legacy systems and serve as a down-select to a tactical design; will generate documentation capturing the cluster munition effort relevant data to facilitate transition to PEO\/PM in support of the Cannon-Delivered Area Effects Munitions (C-DAEM) Program of Record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY 2020, this effort realigns to PE 0603462A\/Project BF5 (Next Generation Combat Vehicle Advanced Technology) as part of the financial restructure and the Army Modernization Strategy.\n\n\nThis effort matures and demonstrates advanced medium caliber ammunition, weapon, fire control, and Ammunition Handling Systems (AHS) optimized for remote operation. This effort demonstrates cannon-super high elevation engagement, high performance stabilization, remote ammunition loading, weapon safety and reliability, improved lethality, accuracy, ability to fire a suite of ammunition from non-lethal to lethal, and escalation of force capability in one system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18"
                                            },
                                            "Text": {
                                                "val": "Validated weapon system integration with AHS and conduct fixed hardstand integration to support initial weapon system demonstration to optimize and improve weapon\/ammo performance prior to test bed turret integration; matured test bed turret designs to support weapon system integration; exploited data from initial weapon demonstration to improve fire control software performance that provides increased system accuracy; improved effectiveness and performance of PABM and AP munition against personnel and materiel targets; and continued to mature combat load AHS to support integration into test bed turret for TRL 6 integrated system demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.7"
                                            },
                                            "Text": {
                                                "val": "Will mature fire control software to support 50mm weapon system integration; will integrate complete weapon system into a test bed turret to mature and demonstrate test bed turret control systems and fire control ballistic solutions for optimized lethal performance; will validate simulated system analysis data against various target sets and provide feedback into fire control solutions for integrated system optimization; will complete an integrated (TRL 6) 50mm demonstration to validate the integrated system accuracy and lethal performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY 2020, this effort realigns to PE 0603462A\/Project BF5 as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scale-up of Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY 2020, this effort realigns to PE 0603464A\/Project AG7 (Long Range Precision Fires Advanced Technology) as part of the financial restructure and the Army Modernization Strategy.\n\nThis effort matures and demonstrates the performance and insensitivity of energetic materials ranging from 25mm medium caliber (direct fire) through 155mm large caliber (indirect fire) weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.4"
                                            },
                                            "Text": {
                                                "val": "Qualified energetic materials to provide complete material characterization to reduce technical risk when transitioning to end-item; continued to mature the advancement of nano-energetic formulations to validate nano-materials characteristics to provide substantially less shock sensitivity than current formulations while maintaining optimal performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.937"
                                            },
                                            "Text": {
                                                "val": "Continue to qualify energetic materials for complete material characterization; will demonstrate high-energy, reduced sensitivity melt-pour formulations for enhanced fragmentation representative munitions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY 2020, this effort realigns to PE 0603464A\/Project AG7 as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection Armament Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Army's Active Protection System (APS) program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. This effort is done in coordination with efforts in Program Element (PE) 0602601A, PE 0602618A, PE 0603004A, PE 0603005A, PE 0603270A, and PE 0603313A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.811"
                                            },
                                            "Text": {
                                                "val": "Modified Hard Kill Counter Measure (HKCM) subsystems to be compliant to MAPS standards; integrated, simulated and demonstrated Modular APS performance capability given mission scenario sets. Performance measures included: threat detection, tracking, signal processing (Fire Control\/Modular APS Controller (MAC)) and threat defeat of rocket propelled grenades (RPGs) and recoilless rifles.  Optimized interface specifications to support layered demonstrator of MAPS compliant hard kill component."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.358"
                                            },
                                            "Text": {
                                                "val": "Conduct demonstrations of mature Modular APS Framework (MAF)-compliant HKCM subsystems to validate modularity and performance optimization; provide mature technologies for integration in a MAF-compliant HKCM subsystem for a layered demonstration of combined Soft Kill and Hard Kill component technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY 2019"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Gun Technology"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY 2020, this effort realigns to PE 0603464A\/Project AG3 (Long Range Precision Fires Advanced Technology) as part of the financial restructure and the Army Modernization Strategy.\n\nThis effort matures and demonstrates extended range artillery weapon system and projectile technologies that increase the range by 25% without an increase in platform weight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.7"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and optimized integrated long range artillery subsystems including the armament and lightweight trunnion support bracket and mature component designs of secondary weapon subsystems such as scavenge systems, elevation, equilibration, automated breech operation, and thermal warning; matured and demonstrated armament with emerging charge and projectile technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.628"
                                            },
                                            "Text": {
                                                "val": "Optimize the design of secondary weapon subsystems such as scavenge systems, elevation, equilibration, automated breech operation, and thermal warning technologies; will demonstrate compact automatic ammunition handling and loading systems with armaments using emerging charge and projectile technologies for improved range and rate of fire performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY 2020, this effort realigns to PE 0603464A\/Project AG3 as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort integrates complementing navigation sensors, actuators and subsystems in order to demonstrate precision delivery capability on an indirect fire munition system in a global positioning system (GPS) denied environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Demonstrated the integrated image based terminal guidance system on an indirect fire platform. The system demonstration showed the end to end functionality of the Guidance, Navigation, and Control (GNC) system?s ability to maintain <10m precision capability in a GPS denied environment. After this demonstration series, a Technical Readiness Assessment (TRA) was conducted to verify system at TRL-6."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Unmanned Aviation System (C-UAS) Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates C-UAS technologies designed to encompass the entire kill chain including detection, tracking, classification, and kinetic defeat of UAS for point defense and mobile applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.7"
                                            },
                                            "Text": {
                                                "val": "Integrated matured C-UAS technologies, to include precision fire control radar and small caliber munitions, onto a common weapons platform to form a system of systems for UAS detection, tracking, and defeat; performed system integration evaluations and validate the fire control radar and software for the UAS kill chain; updated modeling and simulation tools based on collected data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.622"
                                            },
                                            "Text": {
                                                "val": "Demonstrate integrated small (0.50) caliber counter UAS technologies at a live fire event; will demonstrate the ability to track outgoing rounds and incorporate data into fire control solution; will mature and demonstrate guided medium caliber armament system initially created through DARPA effort to search, identify, track and intercept maneuvering threats; will improve fire control and guidance algorithms for C-UAS\/Air Defense scenarios; will optimize kinetic armament system components design for integration on a ground vehicle platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completes in FY 2019"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerated Extended Range Munition Suite"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY 2020, this effort realigns to PE 0603464A\/Project AG5 (Long Range Precision Fires Advanced Technology) as part of the financial restructure and the Army Modernization Strategy.\n\nThis effort matures and demonstrates extended range artillery technologies including rocket and base bleed propulsion, hybrid lifting surfaces and guidance technologies which increase range and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Continued to exploit, mature, and demonstrate enhanced lethality from rocket assisted projectiles using technology enablers to optimize extended range vs. lethality; demonstrated integration of lifting surfaces, advanced navigation, flight control, and guidance technologies to enable precision at greatly extended ranges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.152"
                                            },
                                            "Text": {
                                                "val": "Mature and evaluate long range unitary artillery projectile components in the areas of precision, counter-measure, and payload technologies; will conduct system modeling and simulation to assess improved projectile performance by these technologies when fired from Extended Range Cannon Artillery (ERCA) cannon tube; will develop and test integration concepts and algorithms and refine guidance and navigation system design concepts at extended ranges in GPS-denied environments; will mature component development for cargo and effects munition compatible with legacy and ERCA in the following areas:   1) dispensing techniques and sensor for area effects to service precisely located targets ; 2) optimal formulations and characteristics for smoke and illumination payloads that maximize effectiveness ; and 3) survivability of cannon-launched terrain shaping munition for maximum area denial effects; will conduct critical design review of component technologies; will perform test and evaluation of key enabling component technologies; refine concepts for system integration; and will mature modeling and simulation concepts for subsequent validation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY 2020, this effort realigns to PE 0603464A\/Project AG5 as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze and Power Technology for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates innovative fuze and power technologies for enhanced environment and target sensing\/classification, warhead initiation schemes, and advanced fuze setting. These technologies will provide enhanced lethality combined effects on targets and advanced initiation schemes for the next generation munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.86"
                                            },
                                            "Text": {
                                                "val": "Optimized and demonstrated reduced range error for increased accuracy in multi-mode medium caliber rounds; demonstrated advanced large caliber fuze setting technologies; and demonstrated advanced multi-point initiation systems and optimize advanced power systems for both fuze and munition systems. These technologies continued to support the Joint Munitions Program TCG-5 and TCG-10 and the Joint Fuze Technology Program (JFTP)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.36"
                                            },
                                            "Text": {
                                                "val": "Conduct live fire (Mann Barrel) demonstration of several 30x173mm or Light Weight 50mm airburst rounds that demonstrate an increase in range accuracy when rounds are corrected; will conduct live fire demonstration of a 40mm round using a pre-timed airburst function and low cost Electronic Safe and Arming (ESAD); will conduct demo of the Precision Guided Kit in a 155mm projectile using the Next Gen Large Cal Setter; and will conduct demo of the extended run time thermal battery."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Efforts completes in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Tactical Multi-Purpose (ETMP) Hand Grenade"
                                    },
                                    "Description": {
                                        "val": "This effort develops a multi-purpose selectable lethal hand grenade that produces either fragmentation or blast overpressure effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Developed and qualified the power source, which powers the electronic fuze system, at extreme temperature; designed and qualified dual printed detonators; integrated power source and dual printed detonators into the system; conducted final TRL 5 demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Armament and Fire Control Integration"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY 2020, this effort realigns to PE 0603464A\/Project AG3 (Long Range Precision Fires Advanced Technology) as part of the financial restructure and the Army Modernization Strategy.\n\nThis effort matures and demonstrates extended range Armament technologies including light weight Cannon and Mount structures, high efficiency recoil cylinders, common lower power fire control hardware, improved fire control software, and improved sensor to shooter communications which will increase range and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Began to exploit, mature, and demonstrate enhanced light weight structures for cannon and mount components; matured and demonstrated common fire control hardware with improved software to improve accuracy at extended and current ranges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.447"
                                            },
                                            "Text": {
                                                "val": "Optimize enhanced light weight structures for cannon and mount components, will integrated controls and ammunition handling system; will exploit projectile tracking and guidance technologies to provide accuracy at extended ranges in global positioning system (GPS)-denied environments; will continue to mature and demonstrate advanced and common fire control hardware and software to increase accuracy and reduce logistic burden."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY 2020, this effort realigns to PE 0603464A\/Project AG3 as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation Armament System Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates armament solutions adaptable to current aviation and future vertical lift applications in small caliber, medium caliber, counter measure technologies with a focus on light lethal aerodynamic systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.237"
                                            },
                                            "Text": {
                                                "val": "Matured and integrated technology for a multi-role armaments solution on Future Vertical Lift aircraft system; improved fire control algorithms for holistic offensive and defensive fires for aviation; optimized weapon system for stowed and deployed operability and munitions with hard kill lethality at range for conventional and more challenging threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.433"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate a Technology Readiness Level (TRL) 6 airburst munition with a selectable proximity airburst - point detonation fuze for the Apache AH-64E; will optimize critical ammunition technologies in areas of power generation, proximity sensor, and smart multi-mode fuzing to support the Apache AH-64E."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completes in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Leader-Soldier Effects Tool Suite"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates fires and effects planning, coordination and execution tool suite for sensor to shooter and tactical application. Provides enhanced collaborative engagement capability of fielded and emerging battle command systems supporting PM Soldier Warrior and PM Mission Command Program of Record (POR) architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.7"
                                            },
                                            "Text": {
                                                "val": "Demonstrated advance fires planning capabilities, specifically develop commander guidance matrix, battery defense application, and echelonment of fires capability that provides digitized tools for the commanders at various echelons; enhanced current fires and effects planning tools such as howitzer platforms and dismounted units range cards as well as sector sketches, optimal weapon emplacement tools, and three-dimensional (3D) de-conflictions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Small Arms Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort will mature and demonstrate advanced small arms ballistic calculations from advanced sensor input and optimized architecture for the precision-optical wind system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.2"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated optimized architecture for the precision-optical wind system; matured technologies to improve and increase probability of hit, exploiting advanced sensor data including down-range wind sensing, to provide ballistic corrections supporting PM Individual-Weapons platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Line of Site Munition (ELOS)"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY 2020, this effort realigns to PE 0603462A\/Project BG5 (Next Generation Combat Vehicle Advanced Technology) as part of the financial restructure and the Army Modernization Strategy.\n\nThis effort demonstrates a 120mm Tank fired ELOS Munition that counters the growing Anti-Tank Guided Missile (ATGM) threat at extended line of sight ranges beyond current capability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.811"
                                            },
                                            "Text": {
                                                "val": "Will optimize an ELOS Munition Air Frame (projectile) design to include fin stabilization element, Seeker Unit, Guidance Electronics Unit (GEU), Canard Actuation System (CAS), Warhead, GNC (Guidance, Navigation, and Control) Software, Target Acquisition and Tracking Software, and Propulsion system; will integrate these components to validate their performance through a preprogram maneuver cannon fired experiment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY 2020, this effort realigns to PE 0603462A\/Project BG5 (Next Generation Combat Vehicle Advanced Technology) as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Long Range Cannon (SLRC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "46"
                                            },
                                            "Text": {
                                                "val": "Initiated effort to extend the range of conventional cannon artillery to deliver effects at strategic ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.144"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "43A"
                    },
                    "ProjectTitle": {
                        "val": "ADV WEAPONRY TECH DEMO (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "68"
                        },
                        "CurrentYear": {
                            "val": "139"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "207.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Advanced Weaponry Technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "42"
                                        },
                                        "Text": {
                                            "val": "Program Increase"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gun-launched unmanned aerial system"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "Gun-launched unmanned aerial system"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High energy laser research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "High energy laser research"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High energy rotorcraft integration"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "High energy rotorcraft integration"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase FY19 Appropriations Act"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "42"
                                        },
                                        "Text": {
                                            "val": "Program Increase FY19 Appropriations Act"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - advanced development of asset protection technologies"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "Program increase - advanced development of asset protection technologies"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - accelerate ERCA gun"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "12"
                                        },
                                        "Text": {
                                            "val": "Program increase - accelerate ERCA gun"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - high energy laser"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "Program increase - high energy laser"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program increase - long range precision fires"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "35"
                                        },
                                        "Text": {
                                            "val": "Program increase - long range precision fires"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "hypersonic capability - transfer from line 71"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "25"
                                        },
                                        "Text": {
                                            "val": "hypersonic capability - transfer from line 71"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L96"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.274"
                        },
                        "CurrentYear": {
                            "val": "26.225"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "49.499"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603466A Air and Missile Defense Advanced Technology, Projects:\n*\tAD1 High Energy Laser Tactical Vehicle Demonstrator Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced technologies for future High Energy Laser (HEL) weapons technology. The major effort under this Project is the phased approach for mobile high power solid state laser (SSL) technology demonstrations that are traceable to the form, fit, and function requirements for a HEL weapon. SSL technology has demonstrated the potential to engage and defeat rockets, artillery and mortars (RAM), UAVs, cruise missiles, sensors, and optics at tactically relevant ranges. HELs are expected to complement conventional offensive and defensive weapons at a lower cost-per-shot than current systems and without the need to strategically, operationally, or tactically stockpile ordnance. This effort utilizes a modular building block approach with open systems architecture to ensure growth, interoperability, and opportunity for technology insertions for maturation of laser, beam control, sensor\/radar, integration of power and thermal management subsystems, as well as Battle Management Command, Control, and Computers (BMC3). \n \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork is performed by the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (SMDC\/ARSTRAT)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Laser System Ruggedization"
                                    },
                                    "Description": {
                                        "val": "This effort ruggedizes laser systems for integration on Army platforms.  Ruggedization includes modifications of the laser system to withstand vibration, temperature, and contamination environments expected on various Army platforms, while ensuring platform volume, weight, and interface specifications are met. The laser system consists of laser devices, such as the laboratory laser devices developed under Program Element (PE) 0602307A, Project 042, and the prime power (PE 0603005A, Project 441), command and control and thermal management subsystems required for the laser device operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.55"
                                            },
                                            "Text": {
                                                "val": "Completed ruggedization and modification of the High Energy Laser Mobile Test Truck (HELMTT) Beam Control System (BCS) and ruggedization of the Robust Electric Laser Initiative (RELI) 60 kW laser to enable integration; Completed the Demonstrator Initial Design Review (IDR) of the next generation pre-prototype HEL weapon system. This IDR matured the design of the HEL system as part of the HEL Tactical Vehicle Demonstrator effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.494"
                                            },
                                            "Text": {
                                                "val": "Complete Critical Design Review (CDR) for the High Energy Laser Tactical Vehicle Demonstrator (HEL TVD). This review will complete the design of the system and includes details of the laser subsystems interfaces with the platform, a Family of Medium Tactical Vehicles (FMTV). Will begin ruggedizing and assembling thermal management, electrical power, and battle management subsystems for the HEL TVD based on designs of the laser and beam control system designs developed under PE 0602307A, Project 042."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this work is being realigned to PE 0603466A\/Project AD1 as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Systems Integration and Mobile Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort integrates a 50 kW-class laser from Project 042 into the existing mobile laser demonstrator platform that includes the ruggedized Beam Control System (BCS) built under the HEL Technical Demonstration effort and other required subsystems to demonstrate weapon system performance. The goal is to demonstrate and evaluate performance of a complete mobile high energy laser system in a relevant environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.724"
                                            },
                                            "Text": {
                                                "val": "Completed planning for the 50 kW-class High Energy Laser Mobile Test Truck (HELMTT) system demonstration in FY 2018; Initiated risk reduction demonstration of the 50 kW-class integrated laser system on the HELMTT to validate system design and interfaces; Collected data to be used to verify lethality models on atmospheric propagation data. This was part of the HEL Tactical Vehicle Demonstrator Army S&T effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.876"
                                            },
                                            "Text": {
                                                "val": "Complete analysis of the FY18 HELMTT 50 kW-class system risk reduction demonstration; consolidate lessons learned from HELMTT demonstration to apply to High Energy Laser Tactical Vehicle Demonstrator (HEL TVD); begin preliminary planning for HEL TVD demonstration and define target requirements for FY22 demonstration; initiate system demonstration performance prediction analysis based on HEL TVD predicted performance parameters."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, this work is being realigned to PE 0603466A\/Project AD1 as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.855"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L97"
                    },
                    "ProjectTitle": {
                        "val": "Smoke And Obscurants Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.806"
                        },
                        "CurrentYear": {
                            "val": "6.016"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.822"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603119A Ground Advanced Technology, Projects:\n*\tBL3 Explosives Forensics Advanced Technology\nPE 0603462A Next Generation Combat Vehicle Advanced Technology, Projects:\n*\tBG7 Ground Systems Active Defense (GSAD) Advanced Tech\n*\tBG9 Obscuration Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Project matures and demonstrates obscurant technologies with potential to enhance personnel\/platform survivability by degrading threat force surveillance sensors and defeating the enemy's target acquisition devices, missile guidance, and directed energy weapons. Dissemination systems for new and improved obscurants are developed with the goal of providing efficient and safe screening of deployed forces. This Project also matures and demonstrates improved detection of explosives and hazardous materials by Soldiers and Small Units.\n\nWork in this Project is related to, and fully coordinated with, PE 0602622A (Chemical, Smoke and Equipment Defeating Technology) and PE 0603606A, Project 608 (Countermine & Barrier Development).   \n\nThis Project sustains Army Science and Technology efforts supporting the Ground Maneuver portfolio.\n   \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. FY20 realignments are due to financial restructuring in support of Army Modernization Priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Obscurant Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the dissemination of new and advanced obscurants. This effort will support Modular Active Protection System (MAPS) in 0603005\/221."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.866"
                                            },
                                            "Text": {
                                                "val": "Redesigned and improved vehicle protection grenade cloud characteristics; initiated particulate materials dissemination studies for the Screening Obscuration Module generator system; explored obscurants? ability to defeat anti-tank guided missiles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.802"
                                            },
                                            "Text": {
                                                "val": "Assess existing and emerging obscurants and their dissemination in vehicle protection grenades; initiate design efforts to integrate with MAPS system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20 funding is realigned to PE 0603462A\/Projects BG7 and BG9 as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Analysis of Explosives"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and stand-off detection of explosives and homemade explosive (HME) precursors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.034"
                                            },
                                            "Text": {
                                                "val": "Refined prototype Chemical Fingerprint Imaging System (CFIS) standalone instrument and compare with commercial off the shelf alternative on their ability meet the fingerprinting and chemical identification requirements for the Common Analytical Lab System (CALS); evaluated spatially offset Raman prototype for the forensic analysis of explosive materials in opaque containers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.071"
                                            },
                                            "Text": {
                                                "val": "Revise and develop 2nd Generation Chemical Fingerprint Imaging System (CFIS) prototype showing optimized detection performance including improved detection of trace explosive residues and other molecules on curved surfaces and detection algorithm for discrimination of target materials on complex backgrounds."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, funding is realigned to PE63270A\/Project BG9 (Obscuration Advanced Technology) as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection Mechanisms for Contaminants"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and standoff detection of a wide range of hazardous materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.906"
                                            },
                                            "Text": {
                                                "val": "Improved standoff detection capabilities for homemade and military explosives by developing advanced Raman detection algorithm emphasizing detection of trace explosives on surfaces; conducted analysis of alternative solutions for solid state laser sources and spectrometer designs to enhance detection sensitivity; integrated hardware and software improvements into existing commercial system for subsequent testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.923"
                                            },
                                            "Text": {
                                                "val": "Investigate UV laser alternatives and spectrometer for trace explosives standoff detection system; conduct technology assessment of trace explosives sensors through a field trial to evaluate sensor sensitivity and technical performance analysis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, funding is realigned to PE 0603119A\/Project BL3 as part of the financial restructure and the Army Modernization Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.22"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}