{
    "id": "2020-DefenseThreatReductionAgency-PB-0400-MJBOOK-0-8-20c9efcf6d605b32d3d5f083f831185effe1f78c53559fcdc9809c2a22add379-4",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603160BR"
        },
        "ProgramElementTitle": {
            "val": "*Counter Weapons of Mass Destruction Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1957.505"
            },
            "PriorYear": {
                "val": "292.846"
            },
            "CurrentYear": {
                "val": "280.858"
            },
            "BudgetYearOne": {
                "val": "340.065"
            },
            "BudgetYearOneBase": {
                "val": "340.065"
            },
            "BudgetYearTwo": {
                "val": "333.624"
            },
            "BudgetYearThree": {
                "val": "336.004"
            },
            "BudgetYearFour": {
                "val": "344.360"
            },
            "BudgetYearFive": {
                "val": "349.004"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In program element 0603160BR, Defense Threat Reduction Agency's (DTRA) consolidated projects RF-Forensics Technologies, RI-Nuclear Survivability, and RL-Nuclear and Radiological Effects into the renamed RD-Nuclear Technologies and Capabilities Development beginning in FY 2020.  Additionally, DTRA consolidated projects RE-Counter-Terrorism Technologies, RM-WMD Counterforce Technologies, RR-CWMD Test and Evaluation, and RT-Target Assessment Technologies, into the renamed project RG-Counter WMD Technologies and Capabilities Development.\n\n*Project RA title changes from Information Sciences and Applications to CWMD Cross-Cutting Technical and Information Sciences in FY 2020.\n**Project RD title changes from Detection Technologies to Nuclear Technologies and Capabilities Development in FY 2020.\n***Project RG title changes from Defeat Technologies to Counter WMD Technologies and Capabilities Development in FY 2020."
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Technology Development portfolio is aligned with strategic planning objectives as well as with Science and Technology (S&T) investment direction which is established annually by DTRA. The objectives directly support policy and planning guidance from the Office of the President, the Department of Defense (DoD), and the broader WMD threat reduction community.\n\nThe portfolio advances the Countering Weapons of Mass Destruction (CWMD) mission by selecting advanced technology development initiatives that meet the following criteria: (1) Efforts are clearly defined and directly linked to mission-specific capability requirements of DTRA, the Military Departments, Combatant Commanders, other DoD and federal agencies, and international partners; (2) preliminary assessments of subsystems and components offer the highest potential for technological feasibility, operability and producibility upon transition out of S&T research; (3) activities demonstrate cost effectiveness or cost reduction potential of technologies during field testing or simulation at scale."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "268.607"
                },
                "CurrentYear": {
                    "val": "299.858"
                },
                "BudgetYearOne": {
                    "val": "278.093"
                },
                "BudgetYearOneBase": {
                    "val": "278.093"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "292.846"
                },
                "CurrentYear": {
                    "val": "280.858"
                },
                "BudgetYearOne": {
                    "val": "340.065"
                },
                "BudgetYearOneBase": {
                    "val": "340.065"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "24.239"
                },
                "CurrentYear": {
                    "val": "-19.000"
                },
                "BudgetYearOne": {
                    "val": "61.972"
                },
                "BudgetYearOneBase": {
                    "val": "61.972"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-29.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "30.000"
                    },
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.761"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "61.972"
                                },
                                "BudgetYearOneBase": {
                                    "val": "61.972"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in FY 2020 from the previous President's Budget submission is due to increased investment for the improvement of technical reachback capacity to grow operational support as current demand outpaces capacity, quick reaction capabilities to rapidly transition both material and non-material solutions to the field, increased investment in the development of classified and unclassified United States Central Command (USCENTCOM) and United States Special Operations Command (USSOCOM)  efforts to counter threat networks by assessing, identifying, and providing capabilities to maintain technological superiority, the development of technological applications to operate in a nuclear contaminated environment, and development of battlefield tools necessary to support time-sensitive decision-making during nuclear warfare.  There is 20% real growth in this program element from the previous President's Budget submission."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RA"
                    },
                    "ProjectTitle": {
                        "val": "*CWMD Cross-Cutting Technical and Information Sciences"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "51.128"
                        },
                        "PriorYear": {
                            "val": "17.732"
                        },
                        "CurrentYear": {
                            "val": "11.286"
                        },
                        "BudgetYearOne": {
                            "val": "34.825"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.825"
                        },
                        "BudgetYearTwo": {
                            "val": "30.722"
                        },
                        "BudgetYearThree": {
                            "val": "32.739"
                        },
                        "BudgetYearFour": {
                            "val": "35.660"
                        },
                        "BudgetYearFive": {
                            "val": "37.254"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*Project RA title changes from Information Sciences and Applications to CWMD Cross-Cutting Technical and Information Sciences in FY 2020."
                        },
                        "ProjectMissionDescription": {
                            "val": "The CWMD Cross-Cutting Technical and Information Sciences project provides technical expertise through continuous reach-back and quick reaction support to the United States and its allies across the Countering Weapons of Mass Destruction (CWMD) mission space. The project performs continuous modeling of ad hoc computational analyses on the consequences of Weapons of Mass Destruction (WMD) in consultation with military and civilian planners, warfighters, and first responders, and leverages research performed by the Project on Advanced Systems and Concepts for CWMD at the Naval Postgraduate School. The project also supports international CWMD cooperation by developing technologies and concepts suitable for foreign release."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RA: CWMD Cross-Cutting Technical and Information Sciences"
                                    },
                                    "Description": {
                                        "val": "Project RA develops modeling and simulation capabilities and provides technical reachback support to maintain and increase decision advantage for the United States and its allies through improved situational understanding across the complete CWMD mission space."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.732"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop the global synthetic population and activity database for modeling infectious disease propagation and impacts of population behaviors and movement after a WMD event in support of Combatant Command force health protection and consequence management planning.\n- Continue to develop detailed models of specified nuclear facilities to analyze vulnerabilities and estimate hazards in support of target and consequence management planning.\n- Continue to develop processes, capabilities, and expertise in Chemical, Biological, Radiological, Nuclear, and High-yield Explosives (CBRNE) in order to provide tailored support to the Department of Defense (DoD) with 24\/7 Technical Reachback."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.286"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide tailored support to DoD with 24\/7 technical reachback via processes, capabilities, and expertise in CBRNE.  Leverage this support for partner stakeholders, providing scientific modeling support to Department of Health and Human Services and serving as the Federal Emergency Management Agency’s Interagency Modeling and Atmospheric Assessment Center (IMAAC) Technical Operations Hub.\n- Research and develop capabilities to predict\/simulate Higher Order Effects, including spread of infectious disease and protection from WMD, and other required capabilities to support U.S. Strategic Command (USSTRATCOM)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.825"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.825"
                                            },
                                            "Text": {
                                                "val": "- Develop a robust quick reaction to rapidly transition both material and non-material developmental technologies to fielded solutions.  Develop acquisition expertise, innovation tools, and agile contract solutions to more effectively deliver capabilities to the warfighter as urgent operational requirements emerge.\n- Continue to provide tailored support to DoD with Technical Reachback via processes, capabilities, and expertise in WMD and explosives modeling and simulation. Leverage this support for partner stakeholders, providing scientific modeling support to Department of Health and Human Services and serving as the Federal Emergency Management Agency’s IMAAC Technical Operations Hub.\n- Continue to develop capabilities in support of USSTRATCOM and United States Northern Command (USNORTHCOM) that predict and simulate Higher Order Effects, including the spread of infectious diseases, WMD protection measures, DoD response efforts, and force health protection measures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 is due to increased investment for the improvement of technical reachback capacity to grow operational support in technical reachback as current demand outpaces capacity.  This is a critical resource that provides 24\/7 support to CCMDs, fulfilling direct warfighter requests.  Additionally, increased investment supports the quick reaction capability to rapidly transition both material and non-material developmental capabilities to fielded solutions, enhancing DTRA’s ability to meet emergent needs that require short order response by providing the acquisition innovation tools, operational and acquisition experts, and flexible contract solutions designed to speed capability to the warfighter."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR\/RA"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "40.189"
                                        },
                                        "CurrentYear": {
                                            "val": "30.603"
                                        },
                                        "BudgetYearOne": {
                                            "val": "46.317"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "46.317"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "48.032"
                                        },
                                        "BudgetYearThree": {
                                            "val": "49.312"
                                        },
                                        "BudgetYearFour": {
                                            "val": "49.896"
                                        },
                                        "BudgetYearFive": {
                                            "val": "58.703"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "105\/0604775BR\/RA"
                                    },
                                    "Title": {
                                        "val": "Advanced Component Development and Prototypes"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.021"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.021"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.564"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.800"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.800"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.700"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "159\/0605502BR\/RA"
                                    },
                                    "Title": {
                                        "val": "Small Business Innovation Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.311"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Number of successful assessments resulting from technical reachback responses. Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RD"
                    },
                    "ProjectTitle": {
                        "val": "**Nuclear Technologies and Capabilities Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "43.023"
                        },
                        "PriorYear": {
                            "val": "21.923"
                        },
                        "CurrentYear": {
                            "val": "26.021"
                        },
                        "BudgetYearOne": {
                            "val": "70.153"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.153"
                        },
                        "BudgetYearTwo": {
                            "val": "64.234"
                        },
                        "BudgetYearThree": {
                            "val": "60.840"
                        },
                        "BudgetYearFour": {
                            "val": "62.070"
                        },
                        "BudgetYearFive": {
                            "val": "61.168"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In program element 0603160BR, Defense Threat Reduction Agency's (DTRA) consolidated projects RF-Forensics Technologies, RI-Nuclear Survivability, and RL-Nuclear and Radiological Effects into the renamed RD-Nuclear Technologies and Capabilities Development beginning in FY 2020.  There is zero real growth in this project.\n\n**Project RD title changes from Detection Technologies to Nuclear Technologies and Capabilities Development in FY 2020."
                        },
                        "ProjectMissionDescription": {
                            "val": "1.  Research, development, test, and evaluation to identify, develop, and exploit signatures associated with nuclear threats in support of U.S. capabilities that detect and interdict such threats; and locate, identify, and track special nuclear material and improve detection factors such as range, time, sensitivity, and accuracy to enhance Service and Special Mission Unit capabilities. These efforts support DoD requirements for countering terrorism, counterproliferation, nonproliferation, countering rogue states, and homeland defense.\n\n2.  Research, development, test, and evaluation (RDT&E) to systematically study signatures associated with adversary nuclear programs and nuclear detonations gain knowledge or understanding necessary to determine technical capabilities needed to improve Department of Defense (DoD) contingency planning activities; gain knowledge or understanding necessary to improve DoD situational awareness on the nuclear battlefield; gain knowledge or understanding necessary to improve capabilities to attribute the source of a nuclear.\n\n3.  Research and develop innovative technologies for the protection of mission-essential personnel, critical military and national defense capabilities, and associated control and support systems during a nuclear event. Research under this project supports the mission critical systems identified under Department of Defense Instruction 3150.09, Chemical, Biological, Radiological, and Nuclear Survivability Policy. System vulnerability research develops nuclear assessment capabilities to support operational planning, weapons effects predictions, and strategic system design. This activity also provides the DoD’s nuclear design and protection standards for new and existing systems, e.g., command and control facilities and aircraft. Key systems include the Nuclear Command and Control System, the net-centric thin-line, and both military and civilian satellites and associated support systems. Experimental capabilities research provides the warfighter with unique x-ray, gamma ray, and EMP test capabilities in support of system survivability development, certification, and sustainment. These efforts also support international collaboration, user groups, case study reviews, and the Joint Atomic Information Exchange Group. The human survivability effort conducts research to develop and validate mortality and morbidity models associated with radiological and nuclear weapon effects.\n\n4.  Research and development modeling tools to support military operational planning, weapons effects predictions, and strategic system design decisions; consolidate validated modeling tools for integrated functionality; predict system responses to nuclear and radiological weapons producing electromagnetic, thermal, blast, shock, and radiation environments; provide detailed adversary nuclear infrastructure characterization to enhance counterforce operations and hazard effects; and, develop foreign nuclear weapon outputs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RD:  Nuclear Technologies and Capabilities Development"
                                    },
                                    "Description": {
                                        "val": "Project RD develops, integrates and transitions radiation detection technologies, as well as systems, tools, techniques, and procedures that take advantage of non-radiation based signatures, in order to advance warfighter capabilities to rapidly detect, localize, characterize, and interdict nuclear and radiological threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.923"
                                            },
                                            "Text": {
                                                "val": "- Transition sensor capabilities to replace Nuclear Biological Chemical Reconnaissance Vehicle (NBCRV) and Stryker obsolete radiological\/nuclear equipment.\n- Continue to develop, test, and evaluate a handheld radiation monitor replacement that provides radioisotope identification capability and real-time information feed.\n- Continue to develop and deploy devices to enable low-cost operational testing and evaluation of radiation and nuclear threat signature detectors against simulated special nuclear material sources of interest, high-fidelity radiation test objects, and realistic threat mockups.\n- Continue to integrate interoperable systems enabling a true common operating picture among nuclear and radiological search teams, across platforms, and within shared or distributed areas.\n- Continue to test and evaluate new radiation and nuclear threat detection technologies in an operationally relevant environment to validate capabilities, improve prototypes, and provide required performance data.\n- Complete testing and evaluation of an operational high resolution gamma-ray imager suited for multiple mission sets to support integration with next generation nuclear imaging systems.\n- Design, fabricate, test, and characterize prototype passive roadside detection systems to determine the location and signature of nuclear material.\n- Transition near-term technologies, such as helium-3 alternatives and automated particle identification, to generate prototypes and design packages that will meet operational needs.\n- Conduct advanced, operational testing and evaluation of radiation and nuclear threat detection systems to assess their performance.\n- Integrate back-end unit capabilities such as internal electronics and communications capabilities, nuclear and radiological signature collections, and non-radiation nuclear threat signature collections into new sensor systems.\n- Continue to integrate radiation and nuclear threat analysis algorithms into existing systems to evaluate accuracy and effectiveness in reducing process time and form factors. \n- Continue to demonstrate, test, and transition systems that remotely monitor nuclear and radiological threat signatures in local and wide area searches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.021"
                                            },
                                            "Text": {
                                                "val": "- Test the Modular Airborne Gaseous Isotope Collection System (MAGICS) gas collection system in the field in support of closer, sooner, site-specific monitoring.  Novel technologies are necessary to conduct gas monitoring in support of nuclear detection missions, as timing, signature strength and complex analysis present challenges.\n- Develop unattended sensor networks for autonomous detection and analysis.\n- Catalog relevant seismic signatures, and develop algorithms for signature detection.\n- Continue to conduct targeted research on component-level technologies, such as low-power electronics, solid-state photodetectors, search and ID algorithms, and helium-3 replacement technologies, which will improve existing detection technology subsystem components.\n- Develop and integrate nuclear and radiological signature collections into new sensor systems.\n- Further the development of nuclear threat analysis algorithms to be implemented in existing systems in order to increase accuracy and reduce processing time.\n- Demonstrate, test, and transition systems that remotely monitor nuclear and radiological threat signatures in small and wide areas.\n- Improve the setup, maintenance, and peer-to-peer collaboration provided by systems shared among nuclear and radiological search teams.\n- Test and evaluate new radiation detection technologies in order to validate capabilities, improve prototypes, and provide required performance data to support follow-on development.\n- Improve capabilities to effectively monitor and control networked systems of sensors, and expand the use of augmented reality to increase situational awareness.\n- Improve low-visibility, high-precision gamma spectroscopy, particularly for indoor or concealed operation.\n- Develop and integrate nuclear and radiological signature collections into new sensor systems.\n- Further the development of nuclear threat analysis algorithms to be implemented in existing systems in order to increase accuracy and reduce processing time.\n- Demonstrate, test, and transition systems that remotely monitor nuclear and radiological threat signatures in small and wide areas.\n- Improve the setup, maintenance, and peer-to-peer collaboration provided by systems shared among nuclear and radiological search teams.\n- Test and evaluate new radiation detection technologies in order to validate capabilities, improve prototypes, and provide required performance data to support follow-on development.\n- Develop new capabilities to emplace detectors into previously denied areas.\n- Improve capabilities to effectively monitor and control networked systems of sensors, and expand the use of augmented reality to increase situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "70.153"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "70.153"
                                            },
                                            "Text": {
                                                "val": "- Improve DoD decision-making by adapting, integrating, and conducting field test of nuclear sensor capabilities to quickly characterize nuclear events (e.g. tests, explosions on the battlefield) in order to inform tactical, operational, and strategic military action.\n- Develop and test techniques to improve the ability of nuclear modeling codes to support tactical DoD operations.\n- Develop and improve nuclear technologies for application to DoD, international, and other government agency missions.\n- Develop, integrate and field test technologies and techniques for “field analysis of nuclear event to provide rapid answers in support of nuclear threat, attribution processes, and\ncounterproliferation activities, and improved situational awareness on the nuclear battlefield in order to inform tactical and strategic military action.\n- Continue to test and develop MAGICS gas collection system in the field in support of closer, sooner, site-specific monitoring. Novel technologies are necessary to conduct gas monitoring in support of nuclear detection missions, as timing, signature strength and complex analysis present challenges.\n- Continue to develop unattended sensor networks for autonomous detection and analysis.\n- Continue to conduct targeted research on component-level technologies, such as low-power electronics, solid-state photodetectors, search and ID algorithms, and helium-3 replacement technologies, which will improve existing detection technology subsystem components.\n- Continue to develop, demonstrate, test, and transition systems that remotely monitor nuclear and radiological threat signatures in small and wide areas.\n- Continue to lead a DoD and interagency, end-to-end nuclear technology demonstration and evaluation of DTRA-developed technologies\/methodologies to assess NTNF process improvements and identify potential capability gaps in confidence, timeliness, and accuracy, and assist in assessing contribution to interagency attribution process and decisions.\n- Continue to develop new or update existing standards and handbooks to capture critical information for DoD to verify and validate mission critical systems.\n- Continue to develop and collaborate on Satellite System Natural and Nuclear Environment Protection Standard with DoD Stakeholders and the DoD Standardization Program Office.\n- Continue producing technical reports addressing DoD radiogenic disease concerns; which address Congressional interest in historical veteran radiation exposure and present day radiological exposures of the DoD-affiliated population.\n- Continue to maintain Defense Integration and Management of Nuclear Data Services (DIAMONDS) while developing DIAMONDS Next Generation testing for functional and data validation. Maintain current reporting on both systems to allow for data verification and validation in preparation for initial operating capability release.\n- Continue to develop natural gas and water\/seawater effects models in support of USSTRATCOM Consequences of Execution efforts, linking higher order effects to PMESII analyses.\n- Continue to integrate, demonstrate, and deliver a suite of consistent and enhanced models, tools, references, and data to US and Allied nuclear weapon effects stakeholders."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 is due to the realignment of Projects RF-Forensics Technology, RI-Nuclear Survivability, and RL-Nuclear and Radiological Effects into Project RD-Nuclear Technologies and Capabilities Development as part of the Agency's RDT&E portfolio restructuring to bring greater agility and efficiency to programmatic and financial operations and better integrate refreshed organizational roles.  Real growth in this project is zero."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR\/RD"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.745"
                                        },
                                        "CurrentYear": {
                                            "val": "16.860"
                                        },
                                        "BudgetYearOne": {
                                            "val": "92.710"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "92.710"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "93.612"
                                        },
                                        "BudgetYearThree": {
                                            "val": "95.541"
                                        },
                                        "BudgetYearFour": {
                                            "val": "97.485"
                                        },
                                        "BudgetYearFive": {
                                            "val": "99.433"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "127\/0605000BR\/RD"
                                    },
                                    "Title": {
                                        "val": "*Counter Weapons of Mass Destruction Systems Development"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "7.500"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.650"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.803"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.959"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.118"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RE"
                    },
                    "ProjectTitle": {
                        "val": "Counter-Terrorism Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "757.112"
                        },
                        "PriorYear": {
                            "val": "101.737"
                        },
                        "CurrentYear": {
                            "val": "108.978"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "967.827"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RG-Counter WMD Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Counter-Terrorism Technologies project develops and transitions a full spectrum of new technologies to counter emergent weapons of mass destruction (WMD) threats.  This project supports the U.S. Special Operations Command (USSOCOM) in two research areas:  (1) Countering WMD-Terrorism (CWMD-T) Counterproliferation Research and Development is a collaborative effort to develop advanced, warfighter-unique technologies to defeat terrorist WMD development\/acquisition pathways, to include defeat of the devices themselves, while minimizing risks to U.S. forces; (2) USSOCOM CWMD-T Support develops concepts and technologies to integrate and synchronize operations and activities that prevent terrorists and rogue nation states from developing, acquiring, proliferating, or using WMD.  This effort supports Commander, USSOCOM responsibilities under the Chairman, Joint Chiefs of Staff Unified Command Plan."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RE: Counter-Terrorism Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RE supports Joint U.S. Military Forces, specifically USSOCOM, in the research areas of warfighter-unique, mission-specific WMD defeat, denial, counterproliferation, and interdiction technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "101.737"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop offensive counter proliferation,  and counter-WMD technologies.\n- Continue to develop threat specific test articles and analyses for Tiered Threat Modeling Archive.\n- Continue to develop technologies that defeat unintended radio emissions.\n- Continue to develop lighter, smaller, more effective breaching capabilities.\n- Continue to develop next generation flexible x-ray technology applications.\n- Continue to develop WMD facility breaching technology applications.\n- Continue to develop Nuclear, Biological, and Chemical (NBC) defense technologies.\n- Continue to develop WMD render safe technologies.\n- Continue to develop technologies to maneuver in a WMD environment.\n- Continue to develop WMD pathway (process and facility) defeat technologies.\n- Perform prototype testing of machine learning tools for integration with the USSOCOM CWMD Support Program's (SCSP) Next Generation Joint Worldwide Intelligence Communications System (JWICS) Portal.\n- Integrate High Performance Computing (HPC) into the JWICS operating environment to provide more robust data analytics and improve accuracy of emerging WMD threat forecasts.\n- Develop and test technologies for evaluating large quantities of data and intelligence information to improve smart discovery, data inferencing, and system-generated cueing and alerting capabilities.\n- Develop Graphic Analytics and Knowledge-Base Reasoning HPC applications.\n- Initiate development of models to enhance Discover and Search components of the Anticipatory WMD Analyst Reasoning Environment (AWARE) tool.\n- Continue to develop Dynamic Picture of the Operating Environment (DPOE) Knowledge Graphic and Predictive Analytics for Unknown Unknowns.\n- Develop Course of Action models for anticipatory adversarial actions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "108.978"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop offensive counterproliferation, counter-WMD technologies in support of combatant command requirements.  \n- Continue development of WMD and pathway defeat technologies, as well as threat-specific test articles and analyses necessary to support the modeling archive used to support such developmental efforts.\n- Continue to develop lighter, smaller, more effective breaching capabilities.\n- Continue to develop next generation WMD detection technology applications.\n- Deploy Analyzer for Wide-Area Restoration Effectiveness (AWARE) V1.0 in Dynamic Picture of the Operating Environment (DPOE) 4.0, the next generation of DPOE that will incorporate research advances in High Performance Computing (HPC), analytics, and natural language processing.  AWARE v1.0 will improve users' ability to identify emerging threat entities with existing personnel resources and reduce missed opportunities.\n- Integrate HPC software tools into DPOE, leveraging capabilities of high performance computing to improve automated analytics to more accurately or quickly identify events, actors and threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the realignment of Project RE-Counter-Terrorism Technologies into Project RG-Counter WMD Technologies and Capabilities Development as part of the Agency's RDT&E portfolio restructuring to bring greater agility and efficiency to programmatic and financial operations and better integrate refreshed organizational roles."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR\/RE"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.693"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Prior year funds are related to this project in program element 0602718BR."
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RF"
                    },
                    "ProjectTitle": {
                        "val": "Forensics Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "433.928"
                        },
                        "PriorYear": {
                            "val": "25.535"
                        },
                        "CurrentYear": {
                            "val": "33.578"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "493.041"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RD-Nuclear Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Forensics Technologies project develops, integrates, tests, and demonstrates post-detonation nuclear forensics systems providing accurate, rapid, and reliable means to collect, analyze, and evaluate prompt data and debris from a nuclear or radiological event in support of exploitation and attribution efforts. These forensic capabilities enable the Defense Threat Reduction Agency (DTRA) and its trusted partners to detect, locate, identify, track, and interdict nuclear and radiological threats, including weapons and material, and enablers to their acquisition and development. In accordance with DoD Directive S-2060.04, DTRA serves as the U.S.\n\nGovernment lead for post-detonation National Technical Nuclear Forensics (NTNF) research and development (R&D). As the central NTNF R&D coordinator, DTRA works in consultation with interagency partners to develop and improve ground-based capabilities supporting exploitation and attribution missions. NTNF R&D supports advanced research in the following areas: (1) Prompt nuclear effects exploitation for attribution; (2) nuclear device characterization for forensics; (3) nuclear forensic materials exploitation for attribution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF:  Forensics Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RF supports nuclear forensics by developing: (1) technologies, systems and procedures for post detonation nuclear forensics; (2) on\/off-site analysis to meet forensic, verification, monitoring and confidence-building requirements; (3) technologies to detect, locate, identify, track, and interdict nuclear and radiological threats, including enablers to their acquisition and development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.535"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop, test, and demonstrate enhanced prototype technologies for prompt diagnostics, debris collection, analysis and diagnostics, and device and modeling to support nuclear device reconstruction and attribution, as well as to decrease timeline, lower uncertainty, and increase confidence in technical nuclear forensics conclusions supporting attribution.\n- Complete preparations and conduct an interagency technology demonstration and evaluation of end-to-end post-detonation nuclear forensics capabilities.\n- Evaluate surrogate debris materials as part of a demonstration and evaluation of field\/fixed laboratory analysis and debris diagnostics processes.\n- Develop, evaluate, and demonstrate surrogate debris materials to validate and verify newly developed capabilities, and to realistically exercise field and fixed laboratory analytic and diagnostic processes.\n- Continue to develop, test, and demonstrate prototype ground-based prompt diagnostic technologies that improve sensor portability, with emphasis on size, weight, and power consumption reduction, and expand operational capability.\n- Initiate transition of advanced prompt diagnostics sensor prototype systems to the U.S. Prompt Diagnostics System.\n- Expand identification and documentation of improvised nuclear device (IND) signatures through modeling, simulation, and experiments, and develop tools and capabilities to support the attribution of IND detonations. \n- Evaluate capability to rapidly rule-in\/rule-out known foreign devices using prompt and radiochemical signatures in a simulated realistic technology demonstration.\n- Continue to coordinate with partner nations to enhance and improve global U.S. nuclear forensics and attribution capabilities, under appropriate international agreements.\n- Initiate simulation of and assess source and propagation data for site-specific signatures from evasive and low-yield underground nuclear explosions.\n- Continue to develop algorithms and tools for collection and high-fidelity modeling and analysis of local seismic signatures of evasive and low-yield nuclear tests.\n- Collect and analyze physical response data from natural and man-made events that provide signals similar to those from low-yield, evasive underground nuclear explosions.  Compare these data with results produced by computer simulation of the events.\n- Continue to develop advanced, modular radionuclide gas collection technologies in support of counterproliferation goals and compliance verification for the Non-Proliferation Treaty and the Comprehensive Test Ban Treaty.\n- Continue to develop advanced technologies to detect and monitor low-yield nuclear tests, including novel techniques for collecting and observing material and electromagnetic emissions and source-region seismic signatures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.578"
                                            },
                                            "Text": {
                                                "val": "- Lead a DoD and interagency, end-to-end nuclear forensics process technology demonstration and evaluation of DTRA-developed technologies\/methodologies to assess NTNF process improvements and identify potential capability gaps in forensic conclusion confidence, timeliness, and accuracy, and assist in assessing contribution to interagency attribution process and decisions.\n- Demonstrate 50% decrease in the material nuclear forensics fixed lab process timeline, with increased confidence and decreased technical uncertainties, improving capacity to make conclusions with low uncertainty and high confidence in a relevant timeframe.\n- Support Discreet Oculus ground-based prompt diagnostics sensor system in support of transfer\/transition to USAF U.S. Prompt Diagnostics System (USPDS) program of record.\n- Complete design, build and installation of regional array, in preparation for transition of array to partner organization.\n- Modify Forensics Inversion Tool Suite (FITS) and Design Signature Database (DSD) forensic tools to better meet stakeholder needs for forensic devices.  Los Alamos National Lab FITS tool modifications are being done in conjunction with the Stockpile program.\n- Prepare to transition recently developed device assessment research and development capabilities to partners at the National Nuclear Security Administration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the realignment of Project RF-Forensics Technologies into Project RD-Nuclear Technologies and Capabilities Development as part of the Agency's RDT&E portfolio restructuring to bring greater agility and efficiency to programmatic and financial operations and better integrate refreshed organizational roles."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR\/RF"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.803"
                                        },
                                        "CurrentYear": {
                                            "val": "10.257"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "127\/0605000BR\/RF"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Systems Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.199"
                                        },
                                        "CurrentYear": {
                                            "val": "6.163"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RG"
                    },
                    "ProjectTitle": {
                        "val": "***Counter WMD Technologies and Capabilities Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "134.888"
                        },
                        "PriorYear": {
                            "val": "40.688"
                        },
                        "CurrentYear": {
                            "val": "20.277"
                        },
                        "BudgetYearOne": {
                            "val": "235.087"
                        },
                        "BudgetYearOneBase": {
                            "val": "235.087"
                        },
                        "BudgetYearTwo": {
                            "val": "238.668"
                        },
                        "BudgetYearThree": {
                            "val": "242.425"
                        },
                        "BudgetYearFour": {
                            "val": "246.630"
                        },
                        "BudgetYearFive": {
                            "val": "250.582"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Defense Threat Reduction Agency's (DTRA) consolidated projects RE-Counter-Terrorism Technologies, RM-WMD Counterforce Technologies, RR-CWMD Test and Evaluation, and RT-Target Assessment Technologies, into the renamed project RG-Counter WMD Technologies and Capabilities Development.  There is 15.1% real growth in this project.\n\n***Project RG title changes from Defeat Technologies to Counter WMD Technologies and Capabilities Development in FY 2020."
                        },
                        "ProjectMissionDescription": {
                            "val": "Counter WMD Technologies and Capabilities Development encompasses the following areas.\n\n1.  Defeat Technologies develops, integrates, demonstrates, and transitions innovative kinetic and non-kinetic weapon capabilities to expand traditional and asymmetric options available to Combatant Commanders to deny, disrupt, and defeat Weapons of Mass Destruction (WMD) while minimizing collateral effects.\n\n2.  Technology development focuses on the physical or functional defeat of (1) chemical, biological, nuclear, and radiological threat materials, (2) an adversary's ability to deliver the same, as well as (3) the physical and non-physical support networks enabling both. This program achieves these goals through the systematic identification and maturation of technologies capable of defeating WMD agents or agent-based processes, then integrating them into weapons, delivery systems, or rapid WMD elimination capabilities. This effort includes developing specific WMD agent\/agent-based process simulants, test infrastructure, and sampling capability required for effective development, testing, and evaluation of next generation capabilities to ensure optimum weapon solutions are achieved. Requirements are delineated in Agency Priority Lists for lethal and non-lethal Countering WMD (CWMD) capability. Based on specified requirements, weapons and capabilities are transitioned to a Service program of record for system acquisition.\n\n3.  Counter-terrorism technologies research develops and transitions a full spectrum of new technologies to counter emergent WMD threats. This research supports the U.S. Special Operations Command (USSOCOM) in two areas: (1) counter proliferation research is a collaborative effort to develop advanced, warfighter-unique technologies to defeat terrorist WMD development and acquisition pathways, to include defeat of the devices themselves, while minimizing risks to U.S. forces; (2) counterterrorism concepts and technologies to integrate and synchronize activities that prevent terrorists and rogue nation states from developing, acquiring, proliferating, or using WMD. This effort supports Commander, USSOCOM responsibilities under the Chairman, Joint Chiefs of Staff Unified Command Plan.\n\n4.  Counterforce technologies research develops, integrates, demonstrates, and transitions capabilities to find, characterize, assess, and plan for the defeat of WMD threats. This research is focused in three areas: (1) WMD battlespace awareness provides warfighters with tools to find, characterize, and assess WMD threats; (2) The weapons effects research provides modernized, fast-running, validated CWMD planning tools and integrates modeling and simulation software to optimize the execution of WMD and associated hard target defeat operations; (3) innovative engineering of select promising technologies discovered under fundamental and basic research to increase the effectiveness of weapons against blast doors and other underground structures for functional defeat of Underground Facilities (UGFs), WMD, and their delivery systems.\n\n5.  DTRA provides a unique national test bed capability for simulated weapons of mass destruction (WMD) facility characterization, weapon-target interaction, and WMD facility defeat testing. This test bed is capable of responding to operational needs outside of DTRA’s research portfolio and is used by the DoD, Military Services, Combatant Commanders, and other Federal Agencies to evaluate the implications of WMD, conventional weapons, and other special weapons used against U.S. military or civilian systems and targets.\n\n6.  Target assessment technologies research develops, integrates, tests, demonstrates, and transitions processes and technologies providing advanced capabilities in the areas of WMD target assessment, automated advanced targeting development (A2TD) and full dimensional defeat. This research develops analytical tools and processes required to: (1) find and characterize WMD targets and associated hard and deeply buried targets (HDBTs); and (2) assess the results of physical and functional defeat mechanisms (such as direct attack). The A2TD initiative seeks to apply emerging computer assisted technologies to automate target characterization for hard targets and WMD targets.  The end result will be faster and more efficient characterization of important hard targets and WMD targets. The full dimensional defeat project aims to develop an enterprise capability for finding and identifying a facility, characterizing its function and physical layout, determining current or future vulnerabilities to available defeat mechanisms, planning and executing an attack, assessing damage, and denying reconstitution efforts. The dynamic capabilities encompassed in this effort provide Combatant Commands and the intelligence community tools and processes needed to hold at risk high value hard targets and WMD targets possessed by adversaries."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Target Sensing Technologies"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "- Completed software spiral development for five prototypes for target sensing technologies. Details classified.\n- Completed algorithm development and integration with mission performance capabilities, resulting in software configuration control board system recommendations and analysis. Details classified.\n- Initiated development and fabrication of additional prototype systems. Details classified."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "- Funds pre-award requirement for follow-on contract vehicle for transition of program and systems development to Service\/Warfighter.  Procurement sensitive.\n- Purchases up to 20 test prototypes systems in existing and new form factors for target sensing technologies. Details classified.\n- Funds further development of additional algorithm development and integration with mission performance capabilities, resulting in software configuration control board system recommendations and analysis.  Details classified."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RG:  Counter WMD Technologies and Capabilities Development"
                                    },
                                    "Description": {
                                        "val": "Project RG develops advanced technologies and weapon concepts and validates their applicability to CWMD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.688"
                                            },
                                            "Text": {
                                                "val": "- Conduct dynamic sled tests of full-scale Heated And Mobile Munition Employing Rockets (HAMMER) weapon system and prepare for technology transition starting in FY 2019.\n- Conduct full-scale demonstration of access denial and denial-of-use technologies against WMD representative targets.\n- Accomplish static testing of a full-scale Agent Defeat Penetrator weapon system against a representative WMD target.\n- Continue development and testing of a new access denial weapon concept.\n- Continue to develop technologies in support of agent defeat and associated facilities.\n- Continue to develop and test diagnostic capability to meet emerging needs for agent defeat.\n- Conduct Modular Autonomous Counter-WMD System (MACS) follow-on incremental component\/system demonstration.\n- Conduct functional defeat system demonstration.\n- Develop and integrate (MACS) Family of Systems Enabling Technologies in preparation for a system demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.277"
                                            },
                                            "Text": {
                                                "val": "- Complete full scale development and testing of Agent Defeat Penetrator weapon in preparation for its consideration in a United States Air Force (USAF) analysis of alternatives.\n- Continue full scale prototype demonstration of novel access denial technology in an operational environment.\n- Build-out prototype of second version of autonomous system and demonstrate system and payload in a relevant environment.\n- Collect signatures on IED\/sUAS in a predictive environments using modeling & simulation.\n- Provide advanced infrastructure to improve collection of signatures including sensors, lab and field equipment, collection software, and collection tools.\n- Provide advanced IED\/sUAS library analytics to improve database management (including entry, creation of information and vetting of information), search functionality, and 3rd party database queries.\n- Provide curation, dissemination, and access to collected data.\n- Develop and establish standardized data collection protocols.\n- Build, procure, and validate advanced and improvised threats to assist in threat risk analysis.\n- Develop IED\/sUAS Identify Friend or Foe (IFF) low cost solutions to support U.S. forces and improve sensor detection while decreasing false alarm rates and reporting.\n- Identify and develop passive threat detections for IED\/sUAS systems as the technology continues to develop in private industry.\n- Develop counter-measures to detect and defeat multi-agent enemy IED\/sUAS.\n- Develop acoustic disrupters to defeat enemy IED\/sUAS.\n- Improve sensor integration of C-IED\/C-sUAS systems to improve detection and defeat capabilities and reduce the human in the loop.\n- Develop capability for manned aircraft to detect IED\/sUAS in order to protect manned aircraft from potential threat IED\/sUAS effects.\n- Provide Testing site\/location, personnel and Data collection\/Analysis and Test reporting for DTRA Counter-Small Unmanned Aircraft Unmanned Aerial Systems (C-sUAS) Defeat One (CD-I) testing event. This test event is formerly known as Hard Kill II which also took place at White Sands Missile Range (WSMR), MNNM.\n- Provide RED Team personnel oversight for UAS threat device operations during test scenarios. Inventory and maintain threat UAS documentation and ensure accurate records are maintained as required.\n- Coordinate and maintain Vendor and Visitor personnel roster, range access request, safety briefings and communications plan as required during the duration of CD-I."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "235.087"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "235.087"
                                            },
                                            "Text": {
                                                "val": "- Finalize full scale testing of the Agent Defeat Penetrator fill.\n- Continue full-scale prototype demonstration of novel access denial technology in an operational environment.\n- Continue to develop offensive counterproliferation, counter-WMD technologies in support of combatant command requirements.\n- Continue to develop WMD pathway defeat technologies, as well as threat-specific test articles and analyses.\n- Continue to develop lighter, smaller, more effective breaching capabilities.\n- Continue to develop next generation WMD detection technology applications.\n- Continue to integrate HPC software tools into Dynamic Picture of the Operating Environment (DPOE), leveraging capabilities of high performance computing to improve automated analytics to more accurately or quickly identify events, actors and threats.\n- Develop and integrate advanced algorithms and refine an operational framework for a mission planning tool to enhance warfighter capabilities to search for, detect, and identify chemical threats prior to release.\n- Demonstrate a miniaturized chemical warfare agent collection and detection capability for trace-level and remote CWMD search missions.\n- Initiate development of remote sensing and characterization capabilities to aid in the detection and identification of biological weapons production facilities.  \n- Continue to develop, integrate and demonstrate advanced CWMD sensing payloads for both unmanned and remote sensing missions.\n- Initiate development of a Chemical Intelligence, Surveillance, and Reconnaissance area search mission planning tool to enhance capabilities to search for, detect, and identify chemical threats prior to release.\n- Continue to conduct mission-oriented experiments to model, simulate, analyze, or exploit technical capabilities intended to counter WMD or mitigate risks and impacts to critical assets in operationally relevant conditions.\n- Continue to develop enhancements to the Integrated Munitions Effects Assessment modeling and simulation planning tool.\n- Continue support for Combatant Command exercises and planning events at the Nevada Test Bed to develop target defeat technologies, tools, and capabilities.\n- Continue to develop and maintain interagency capabilities and special tests in support of national priority programs and mission requirements.\n- Integrate engineering rule-based development for automated advanced targeting characterization efforts to meet CCMD and IC WMD and HDBT characterization and defeat requirements.\n- Continue to develop the Functional Full Dimensional Defeat Enterprise process including developing new means for identifying facility functions, determining defeat vulnerabilities in support of attack planning and execution, and determining new battle damage information methods.\n- Continue cooperative CWMD project technical exchange with the United Kingdom (UK) in support of US\/UK Project Agreement.\n- Continue Coalition Warfare Program Agreement with Republic of Korea for advancement of autonomous tunnel exploitation technologies.\n- Continue to develop complex geotechnical models for support of geotechnical site characterization of WMDhard target sites.\n- Continue to develop enhancements to WMDpedia for DPOE and the Sensitive Site Exploitation mobile application.\n- Continue to assess and develop analytic capabilities to enhance the warfighter’s ability to conduct predictive analysis and forecast potential WMD threats informing future CWMD requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 is due to the realignment of Project RE-Counter Terrorism Technologies, Project RM-WMD Counterforce Technologies, Project RR-CWMD Test and Evaluation, and Project RT-Target Assessment Technologies into Project RG-Counter WMD Technologies and Capabilities Development as part of the Agency's RDT&E portfolio restructuring to bring greater agility and efficiency to programmatic and financial operations and better integrate refreshed organizational roles.  Additionally, DTRA increased investment in the development of classified and unclassified USCENTCOM and USSOCOM efforts to counter threat networks by assessing, identifying, and providing capabilities to maintain technological superiority.  Real growth in this project is 15.1%."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR\/RG"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.483"
                                        },
                                        "CurrentYear": {
                                            "val": "8.959"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.253"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.253"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.958"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.919"
                                        },
                                        "BudgetYearFour": {
                                            "val": "23.715"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.190"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RI"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Survivability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "50.493"
                        },
                        "PriorYear": {
                            "val": "7.289"
                        },
                        "CurrentYear": {
                            "val": "5.783"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "63.565"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RD-Nuclear Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Nuclear Survivability project develops, integrates, demonstrates, and transitions innovative technologies for the protection of mission-essential personnel, critical military and national defense capabilities, and associated control and support systems during a nuclear event. Research under this project supports the mission critical systems identified under Department of Defense (DoD) Instruction 3150.09, Chemical, Biological, Radiological, and Nuclear (CBRN) Survivability Policy. The Defense threat Reduction Agency (DTRA) is the DoD-designated center of excellence for electromagnetic pulse survivability assessments. The System Vulnerability and Assessment effort develops nuclear assessment capabilities to support operational planning, weapon effects predictions, and strategic system design. This activity also provides the DoD’s nuclear design and protection standards for new and existing systems, e.g., command and control facilities and aircraft. Key systems include the Nuclear Command and Control system, the net-centric thin-line, and both military and civilian satellites and associated support systems. The radiation-hardened nano-electronics effort develops and integrates radiation-hardened, high-performance prototype nano-electronics to meet DoD space and strategic deterrence system requirements.  The Human Survivability effort supports the Nuclear Test Personnel Review Program (NTPR), confirming the participation of Atomic Veterans in nuclear testing and radiological events and providing radiation dose assessments. The NTPR is administered by the Department of Veterans Affairs and the Department of Justice for radiogenic disease compensation programs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RI: Nuclear Survivability"
                                    },
                                    "Description": {
                                        "val": "Project RI develops, integrates, and transitions novel technologies that radically enhance the survivability and resilience of DoD nuclear forces and their associated control and support systems in the event of an attack or other hostile action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.289"
                                            },
                                            "Text": {
                                                "val": "- Continue producing technical reports addressing DoD radiogenic disease concerns; which address Congressional interest in historical veteran radiation exposure and present day radiological exposures of the DoD-affiliated population.\n- Complete development of the Satellite System Natural and Nuclear Environment Protection Standard.\n- Initiate development of the Satellite System Natural and Nuclear Environment Protection Handbook.\n- Complete update of the North Atlantic Treaty Organization (NATO) Allied Engineering Publication AEP-04 Nuclear Survivability Criteria for Armed Forces Material and Installations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.783"
                                            },
                                            "Text": {
                                                "val": "- Produce appropriate new or updated standards and handbooks to capture critical information for DoD to verify and validate mission critical systems.\n- Coordinate Satellite System Natural and Nuclear Environment Protection Standard with DoD Stakeholders and the DoD Standardization Program Office. \n- Continue producing technical reports addressing DoD radiogenic disease concerns; which address Congressional interest in historical veteran radiation exposure and present day radiological exposures of the DoD-affiliated population.\n- Evaluate Commercial Off the Shelf (COTS) radiation-hardened microelectronics from trusted, commercial sources.  \n- Conduct research to characterize radiation-hardened materials and determine viability for inclusion in DOD systems.\n- Final independent verification and validation (IV&V) of DIAMONDS coding and data prior to migration to DIAMONDS Next Generation.\n- Codify the Information Assurance and Accreditation documentation for the transition from Defense Integration and Management of Nuclear Data Services (DIAMONDS) to DIAMONDS Next Generation.  Provide supporting documentation to DISA for DIAMONDS cloud operation in support of Federal Data Center Consolidation Initiative. \n- Commence concurrent DIAMONDS and DIAMONDS Next Generation testing for functional and data validation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the realignment of Project RI-Nuclear Survivability into Project RD-Nuclear Technologies and Capabilities Development as part of the Agency's RDT&E portfolio restructuring to bring greater agility and efficiency to programmatic and financial operations and better integrate refreshed organizational roles."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR\/RI"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "25.545"
                                        },
                                        "CurrentYear": {
                                            "val": "32.732"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.390"
                        },
                        "PriorYear": {
                            "val": "8.505"
                        },
                        "CurrentYear": {
                            "val": "3.427"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.322"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RD-Nuclear Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Nuclear and Radiological Effects project develops, integrates, and transitions nuclear and radiological assessment modeling tools for use in military planning processes. The assessment modeling tools provide critical analytics for Consequence of Execution (COE) considerations during nuclear targeting and post-detonation nuclear response, supporting interagency strategic and tactical decision making. These COE considerations can include the full range of political, military, economic, social, infrastructure, and information (PMESII) factors and their interaction, extending analytical capabilities beyond common damage assessment practices and into second and third order effects. These activities\/efforts support Combatant Commands and other Department of Defense (DoD) organizations by providing accurate and reliable consequence assessment and response information."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear and Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL develops nuclear and radiological assessment modeling tools to support military operational planning, weapons effects predictions, and strategic system design decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.505"
                                            },
                                            "Text": {
                                                "val": "- Continue to add militarily significant nuclear weapon effects to tools specifically designed for transition to military targeting systems.\n- Continue to add militarily significant nuclear weapon effects to tools specifically designed to support nuclear survivability and standards formulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.427"
                                            },
                                            "Text": {
                                                "val": "- Develop natural gas and water\/seawater effects models in support of U.S. Strategic Command (USSTRATCOM) Consequences of Execution (COE) efforts, linking higher order effects to PMESII analyses.\n- Integrate, demonstrate, and deliver a suite of consistent and enhanced models, tools, references, and data to US and Allied nuclear weapon effects stakeholders."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the realignment of Project RL-Nuclear and Radiological Effects into Project RD-Nuclear Technologies and Capabilities Development as part of the Agency's RDT&E portfolio restructuring to bring greater agility and efficiency to programmatic and financial operations and better integrate refreshed organizational roles."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR\/RL"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.320"
                                        },
                                        "CurrentYear": {
                                            "val": "29.388"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RM"
                    },
                    "ProjectTitle": {
                        "val": "WMD Counterforce Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "173.550"
                        },
                        "PriorYear": {
                            "val": "23.667"
                        },
                        "CurrentYear": {
                            "val": "25.243"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "222.460"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RG-Counter WMD Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Weapons of Mass Destruction (WMD) Counterforce Technologies project develops, integrates, demonstrates, and transitions emerging technologies enabling efforts to find, characterize, assess, and plan for the defeat of WMD threats. There are three core research efforts in this project:  (1) The WMD battlespace awareness effort provides warfighters with capabilities to find, characterize, and assess WMD threats.  This effort develops and integrates sensing technologies with multi-mission Unmanned Aerial System payloads.  (2) The Countering WMD (CWMD) weapons effects effort develops modernized, fast-running, validated CWMD planning tools and integrates modeling and simulation software to optimize the execution of WMD and associated hard target defeat operations.  (3)  The Innovative Technologies and Engineering effort takes promising technologies discovered under fundamental and basic research and further develops them to increase the effectiveness of weapons against blast doors and other underground structures for functional defeat of Underground Facilities (UGFs), WMD, and their delivery systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RM:  WMD Counterforce Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RM provides: (1) full-scale testing of CWMD weapons effects, weapon effects modeling, and weapon delivery system optimization; and (2) WMD sensor, surveillance, and data processing technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.667"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate sample extraction prototype capability for rapid sampling of hazardous chemicals from solid storage.\n- Continue to demonstrate enhanced WMD sample collection and analysis systems for low-visibility search operations.\n- Demonstrate mission planning and analytical tools for chemical -search operations, including sensor emplacement and source attribution.\n- Design, test, and integrate agitation and injection system upgrades to increase target prosecution efficiency and effectiveness.\n- Conduct End-User Evaluations and Operational Evaluations in specific test series to gain operator perspective and to determine system effectiveness and operational utility against WMD targets in representative environments.\n- Begin phase two of three new software architecture developments, allowing WMD defeat modeling and simulation planning tools (i.e., Integrated Munitions Effects Assessment (IMEA) ,and Vulnerability Assessment and Protection Option (VAPO) to more quickly and efficiently enhance integration with planning tools used by partner agencies and international allies. .  \n- Conduct proof of concept demonstrations for enhanced area search sensors and capabilities for biological weapon search missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.243"
                                            },
                                            "Text": {
                                                "val": "- Complete Chemical Intelligence, Surveillance, and Reconnaissance (ISR) area search mission planning tool proof of concept to enhance capabilities to search for, detect, and identify chemical threats prior to release.\n- Transition the Loop-mediated isothermal Amplification (LAMP), the Biological ISR Sample Collection (SCOUT), and the Sampling Capability Improvement Project (SCIP) to the Joint Program Executive Office – Chemical and Biological Defense (JPEO-CBD) in support of Biological ISR sample collection capability improvements.\n- Conduct mission-oriented experiments to model, simulate, analyze, or exploit technical capabilities intended to counter WMD or mitigate risks and impacts to critical assets in operationally relevant conditions.\n- Release updated version of modernized, fast-running, validated Integrated Munitions Effects Assessment, a CWMD modeling and simulation (M&S) planning tool, incorporating near-miss lethality, weapons data, and concrete modeling, to optimize the execution of WMD and associated hard target defeat operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the realignment of Project RM into Project RG-Counter WMD Technologies and Capabilities Development as part of the Agency's RDT&E portfolio restructuring to bring greater agility and efficiency to programmatic and financial operations and better integrate refreshed organizational roles."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR\/RM"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.956"
                                        },
                                        "CurrentYear": {
                                            "val": "12.780"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RR"
                    },
                    "ProjectTitle": {
                        "val": "CWMD Test and Evaluation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.052"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "12.394"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.446"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RG-Counter WMD Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Countering WMD Test and Evaluation Project RR provides a unique national test bed capability for simulated weapons of mass destruction (WMD) facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the Department of Defense (DoD), the Military Services, the Combatant Commanders and other Federal Agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RR: Countering WMD Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Project RR provides a unique national test bed capability for simulated WMD facility characterization, weapon-target interaction, and WMD facility defeat testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- Support Combatant Command exercises and planning events at the Nevada Test Bed in order to develop missile defeat technologies, tools, and capabilities.\n- Develop interagency capabilities and special tests in support of national priority programs and mission requirements.\n- Augment scheduling, test planning, maintenance and analysis capabilities for missile defeat technology tests and demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.394"
                                            },
                                            "Text": {
                                                "val": "- Continue support for Combatant Command exercises and planning events at the Nevada Test Bed in order to develop target defeat technologies, tools, and capabilities.\n- Maintain and further develop interagency capabilities and special tests in support of national priority programs and mission requirements.\n- Support the planning, execution, and analysis of two major CWMD test and demonstration events at the Nevada National Security Site or other locations within or outside the continental U.S."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the realignment of Project RR-Countering WMD Test and Evaluation into Project RG-Counter WMD Technologies and Capabilities Development as part of the Agency's RDT&E portfolio restructuring to bring greater agility and efficiency to programmatic and financial operations and better integrate refreshed organizational roles."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR\/RR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.810"
                                        },
                                        "CurrentYear": {
                                            "val": "14.345"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.816"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.816"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.156"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.451"
                                        },
                                        "BudgetYearFour": {
                                            "val": "17.775"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.131"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RT"
                    },
                    "ProjectTitle": {
                        "val": "Target Assessment Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "293.941"
                        },
                        "PriorYear": {
                            "val": "45.770"
                        },
                        "CurrentYear": {
                            "val": "33.871"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "373.582"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2020, efforts in this project are captured under project RG-Counter WMD Technologies and Capabilities Development."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Target Assessment Technologies project develops, integrates, tests, demonstrates, and transitions processes and technologies providing advanced capabilities in the areas of Weapons of Mass Destruction (WMD) target assessment and functional defeat.  The functional defeat process includes finding and identifying a facility, characterizing its function and physical layout, determining current or future vulnerabilities to available defeat mechanisms, planning and executing an attack, assessing damage, and denying reconstitution efforts.  Applying these processes to time-dependent constraints related to WMD target characterization and threat analysis presents a further technical challenge.  This project develops analytical tools and processes required to (1) find and characterize WMD targets and associated hard and deeply buried targets (HDBTs) and to (2) to assess in real time the results of physical and functional defeat operations (such as a direct attack).  These novel, dynamic capabilities enable Combatant Commands (CCMDs) and the intelligence community (IC) to hold at risk high value targets possessed by adversaries."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RT: Target Assessment Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RT provides CCMDs and the IC with technologies and processes to find and characterize WMD targets and hard and deeply buried targets and then assess the results of attacks against those targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "45.770"
                                            },
                                            "Text": {
                                                "val": "- Complete prototype development, final documentation, and technical report in preparation for transition of a deployable remote ground sensor project.\n- Develop detailed feasibility study and program plan for WMD and Hard Target automated characterization capability.\n- Continue to develop comprehensive soil model library for support of geotechnical site characterization of WMD target sites.\n- Refine and enhance WMD complex modeling capabilities for integration with automated target characterization.\n- Integrate functional defeat and \"pattern of life\" models into automated target characterization capability.\n- Deliver enhanced counter-WMD and underground facility (UGF) schoolhouse training exercises to IC and Combatant Commands."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.871"
                                            },
                                            "Text": {
                                                "val": "- Complete engineering rule-based development for automated advanced targeting characterization efforts to meet CCMD and IC WMD and HDBT characterization and defeat requirements.\n- Further develop the Functional Defeat Enterprise process including identifying facility functions, determining defeat vulnerabilities in support of attack planning and execution, and determining new battle damage information methods.\n- Develop cooperative CWMD project technical exchange with the United Kingdom (UK) in support of a U.S.\/UK Project Agreement.\n- Continue to develop complex geotechnical models for support of geotechnical site characterization of WMD target sites."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the realignment of Project RR-Target Assessment Technologies into Project RG-Counter WMD Technologies and Capabilities Development as part of the Agency's RDT&E portfolio restructuring to bring greater agility and efficiency to programmatic and financial operations and better integrate refreshed organizational roles."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year."
                        }
                    }
                }
            ]
        }
    }
}