{
    "id": "2020-AirForce-PB-3600-MJBOOK-0-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-12",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602605F"
        },
        "ProgramElementTitle": {
            "val": "Directed Energy Technology"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "121.610"
            },
            "CurrentYear": {
                "val": "141.800"
            },
            "BudgetYearOne": {
                "val": "124.379"
            },
            "BudgetYearOneBase": {
                "val": "124.379"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "124.693"
            },
            "BudgetYearThree": {
                "val": "127.465"
            },
            "BudgetYearFour": {
                "val": "132.446"
            },
            "BudgetYearFive": {
                "val": "135.434"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program covers research in Directed Energy (DE) technologies, primarily High Energy Lasers (HEL); including devices; optical beam control; integration; target lethality\/vulnerability assessments; ground-based optical Space Situational Awareness (SSA); and high power microwaves (HPM). Laser research includes moderate to high power laser devices that are applicable to a wide range of applications, optical technologies to propagate laser beams through the atmosphere, and integration of these technologies into demonstration packages.  Space Situational Awareness research uses the Starfire Optical Range (SOR) and the Maui Space Surveillance System (MSSS) to develop and implement technologies to identify visual characteristics such as status and health of orbiting space objects.  In high power microwaves (HPM), this research examines technologies for applications such as counter-electronics and non-lethal weapons. This program conducts research into other novel Directed Energy applications; conducts Directed Energy vulnerability\/lethality assessments; develops protection technologies versus Directed Energy; conducts research into other advanced non-conventional\/innovative weapons; develops and uses tools to compare solutions to determine the most effective and efficient Directed Energy technologies to meet Air Force needs; coordinates efforts through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities.  The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602788F, 1206601F, and 0602298F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "132.993"
                },
                "CurrentYear": {
                    "val": "141.898"
                },
                "BudgetYearOne": {
                    "val": "133.106"
                },
                "BudgetYearOneBase": {
                    "val": "133.106"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "121.610"
                },
                "CurrentYear": {
                    "val": "141.800"
                },
                "BudgetYearOne": {
                    "val": "124.379"
                },
                "BudgetYearOneBase": {
                    "val": "124.379"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-11.383"
                },
                "CurrentYear": {
                    "val": "-0.098"
                },
                "BudgetYearOne": {
                    "val": "-8.727"
                },
                "BudgetYearOneBase": {
                    "val": "-8.727"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.062"
                    },
                    "CurrentYear": {
                        "val": "-0.098"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.146"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.483"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-8.692"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-8.727"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.727"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2018 in Other Adjustments is due to realignment of funds to PE 0602212F to support Research and Development Projects 10 U.S.C. Section 2358.\n\nDecrease in FY 2020 due to the realignment and consolidation of Air Force Applied Research Science and Technology funding for Future Air Force Capabilities Applied Research efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624866"
                    },
                    "ProjectTitle": {
                        "val": "Lasers & Imaging Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "91.384"
                        },
                        "CurrentYear": {
                            "val": "108.294"
                        },
                        "BudgetYearOne": {
                            "val": "92.359"
                        },
                        "BudgetYearOneBase": {
                            "val": "92.359"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "88.856"
                        },
                        "BudgetYearThree": {
                            "val": "89.562"
                        },
                        "BudgetYearFour": {
                            "val": "93.058"
                        },
                        "BudgetYearFive": {
                            "val": "95.164"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the technical feasibility of moderate to high power lasers, including beam control, for applications such as aircraft protection, force protection, and precision engagement from Air Force platforms.  This project investigates the effects of laser weapons on a wide range of systems and components as well as producing, modifying, validating and applying Directed Energy (DE) and non-Directed Energy concept development and assessment tools to determine which technology solutions to pursue.  This project conducts research supporting ground-based optical space situational awareness (SSA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technologies and Directed Energy Assessments"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate High Energy Laser (HEL) device technologies for Air Force applications. Develop and demonstrate optical laser beam control technologies including atmospheric propagation and pointing and tracking. Perform laser system level modeling and simulation validated by laser effects and vulnerability testing. Develop tools and perform assessments which allow comparisons among (DE) concepts and tradeoffs between Directed Energy (DE) and non-Directed Energy solutions. Integrate optical beam control technologies with laser device technologies and demonstrate the combined technologies. Develop and use technologies to better understand the vulnerability of weapon systems to High Energy Lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "60.251"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "82.619"
                                            },
                                            "Text": {
                                                "val": "Develop beam control technologies including aero-effects mitigation techniques. Power-scale monolithic fiber amplifiers using advanced fibers. Conduct effects testing to establish system requirements and validate models. Finish pod development and integration of low power laser subsystems for FY 2020 pod-mounted low power airborne laser demonstration. Begin integration of beam control into pod for  Phase I low power laser system including ground support and aircraft interface. Begin fabrication of moderate power laser subsystem for use in Phase 2 aircraft self-protect 2021\/2022 demonstration vs representative targets. Begin laboratory development of ultra-compact laser sub-system for future airborne applications. Transition the functionality of the Integrated Weapons Environment for Analysis engagement level model into the Advanced Framework for Simulation model for engagement and mission level analysis for internal and external users and utilize Advanced Framework for Simulation Advanced Framework for Simulation model as the weapons server in an advanced framework to support Air Force-wide modeling, simulation, and analysis. Continue to assess Directed Energy weapon and\/or synergistic Directed Energy weapon\/Kinetic Energy weapon capabilities to help users plan weapon investments. Continue to model and characterize foreign high energy laser threats, and provide information to develop mitigation techniques to protect blue assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "66.145"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "66.145"
                                            },
                                            "Text": {
                                                "val": "Continue to develop beam control technologies including aero-effects mitigation techniques based on supersonic data from laboratory and flight tests. Continue to power scale monolithic fiber amplifiers using advanced fibers. Continue with effects testing to establish system requirements and validate models.  Complete integration of beam control subsystems into pod for FY 2020 pod-mounted low power ground and airborne laser demonstration. Begin ground demonstration of Phase I low power laser podded system. Complete development of moderate power system into a pod for Phase 2 moderate power aircraft self-protect demonstration vs representative targets in FY 2021. Complete prototype module for fully packaged ultra-compact fiber amplifier laser. Continue to transition the functionality of the Integrated Weapons Environment for Analysis engagement level model into the Advanced Framework for Simulation model for engagement and mission level analysis for internal and external users and utilize the Advanced Framework for Simulation model as the weapons server in an advanced framework to support Air Force-wide modeling, simulation, and analysis (MS&A). Continue to assess directed energy weapon and\/or synergistic directed energy weapon\/kinetic energy weapon capabilities to help users plan weapon investments. Continue to model and characterize foreign high energy laser threats, and provide information to develop mitigation techniques to protect blue assets."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $16.474 million.  Funding decreased due to re-scoping of Laser Subsystem Development activities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Space Situational Awareness and Satellite Vulnerability"
                                    },
                                    "Description": {
                                        "val": "Develop advanced, long-range, electro-optical technologies that enable ground-based optical Space Situational Awareness (SSA) and quantum-based optical communications.  Develop and use technologies to understand the vulnerability of blue satellite systems and components to lasers. Operate the Starfire Optical Range (SOR) to conduct research meeting internal and customer requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.133"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.675"
                                            },
                                            "Text": {
                                                "val": "Field the dynamic telescope subsystem that searches the geosynchronous satellite belt visible from the mid-Pacific multiple-times per night, enabling a periodic comprehensive census of dim objects in the geo-belt. Mature daylight detection of geosynchronous satellites thus allowing custody through daytime hours when satellites cannot normally be detected by our ground-based optical systems. Mature component technologies for 24\/7 real-time optical imaging of near-earth satellites enabling characterization on tactical timelines. Use Modelling and Simulation to investigate the susceptibility of satellite components  to laser threats  to inform practical designs for protection equipment and for tactically-rapid course-of-action decision-making enabling protection methods. Develop laser-enabled space situational awareness (SSA) techniques focused on full-dark imaging using laser illumination. Investigate laser-enabled options for both ranging to and imaging of geosynchronous satellites from  apertures smaller than 3 meters. Develop long-range secure optical communications technologies leveraging quantum science for free space lasercom channels. Conduct engineering-model simulations of laser-enabled system capable of imaging objects in geosynchronous orbit from ground-based optical sensors. Demonstrate a machine-learning algorithm that can automatically predict several seconds ahead the optical aberrations caused by atmospheric turbulence and do so more accurately and rapidly than current \"hard-wired\" algorithms can. Maintain Starfire Optical Range (SOR) facility and experimental equipment in a mission-ready state."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.214"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.214"
                                            },
                                            "Text": {
                                                "val": "Continue fielding the dynamic telescope subsystem that searches the geosynchronous satellite belt visible from the mid-Pacific multiple-times per night, enabling a periodic comprehensive census of dim objects in the geo-belt. Continue to mature daylight detection of geosynchronous satellites thus allowing custody through daytime hours when satellites cannot normally be detected by our ground-based optical systems. Continue to mature component technologies for 24\/7 real-time optical imaging of near-earth and geosynchronous objects enabling characterization on tactical timelines. Continue investigation through modeling and simulation the susceptibility of satellite components to laser threats  to inform practical designs for protection equipment and for tactically-rapid course-of-action decision-making enabling protection methods. Continue development of laser-enabled space situational awareness (SSA) research focused on full-dark imaging using laser illumination. Investigate laser-enabled options for both ranging to and imaging of geosynchronous satellites from  apertures smaller than 3 meters. Continue development of long-range secure optical communications technologies leveraging quantum science for free space lasercom channels. Continue project to apply machine-learning to automatically identify geosynchronous-orbit objects more accurately and rapidly than current \"hard-wired\" algorithms can. Continue to maintain Starfire Optical Range (SOR) facility and experimental equipment in a mission-ready state."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.539 million.  Justification for increase is described the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624867"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Weapons & Survivability Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.226"
                        },
                        "CurrentYear": {
                            "val": "33.506"
                        },
                        "BudgetYearOne": {
                            "val": "32.020"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.020"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "35.837"
                        },
                        "BudgetYearThree": {
                            "val": "37.903"
                        },
                        "BudgetYearFour": {
                            "val": "39.388"
                        },
                        "BudgetYearFive": {
                            "val": "40.270"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the use of High Power Microwave (HPM) and other unconventional\/innovative weapon concepts to support applications such as nonlethal counter-personnel and electronic warfare including disruption, degradation, and damage of electronic infrastructure on Air Force platforms. This research includes weapon technology that can provide covert effects and\/or no collateral or human damage. The project also investigates the effects of potential adversary High Power Microwave weapons and how to mitigate those effects on US assets, as well as producing and applying Directed Energy (DE) and non-Directed Energy concept development and assessment tools to determine which technology solutions to pursue. This project includes but is not limited to high power microwaves, plasmas, particle beams and millimeter waves."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Power Microwave and Unconventional Weapon Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate technologies for High Power Microwave and unconventional weapon components.  Investigate High Power Microwave and other unconventional weapon concepts using innovative technologies.  Investigate advanced technologies that support force protection tactical applications, including non-kinetic\/non-lethal counter-electronics applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.642"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.231"
                                            },
                                            "Text": {
                                                "val": "Complete ultra-short pulsed laser atmospheric propagation studies in a density gradient. Complete effects studies on electronics based on the assessments from FY 2016 and FY 2017 to support a joint High Power Microwave program with the Navy. Design and develop High Power Microwave components for ground and aerial High Power Microwave demonstrators. Design and develop smaller, higher power, source technology for the joint Air Force-Navy High Power Microwave demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.541"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.541"
                                            },
                                            "Text": {
                                                "val": "Assess the military utility of an ultra-short pulsed laser system. Conduct effects testing on electronics based on the target classes for the joint high power microwave program with the Navy. Develop and test high power microwave components for ground and aerial high power microwave demonstrators. Develop and test smaller, higher power, source technology for the joint Air Force-Navy high power microwave demonstration."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.690 million.  Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Power Microwave Effects and Mitigation Research"
                                    },
                                    "Description": {
                                        "val": "Assess the effects\/lethality of High Power Microwave technologies. Develop and apply sophisticated models to enhance the development of High Power Microwave and related technology. Develop tools and perform assessments which allow comparisons among Directed Energy concepts and tradeoffs between Directed Energy and non-Directed Energy solutions. Investigate technologies to counter the effects of High Power Microwaves."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.584"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.275"
                                            },
                                            "Text": {
                                                "val": "Improve software applications that are hosted in the Directed Energy High Performance Computing Software Applications Institute for a broad spectrum directed energy sources  Develop end-to-end modeling and weapon utility assessments to incorporate High Power Microwave weapon technology into various platforms for multiple target prosecutions. Build synergistic weapon concept assessments that merge kinetic energy and non-kinetic energy weapon investments. Support the Modeling, Simulation, and Analysis tools that have been transitioned to the broader Modeling, Simulation, and Analysis community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.479"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.479"
                                            },
                                            "Text": {
                                                "val": "Assess the military utility of an ultra-short pulsed laser system. Conduct effects testing on electronics based on the target classes for the joint High Power Microwave (HPM) program with the Navy. Develop and test high power microwave components for ground and aerial High Power Microwave demonstrators. Develop and test smaller, higher power, source technology for the joint Air Force-Navy high power microwave (HPM) demonstration.  Continue to support the Modeling, Simulation, and Analysis (MS&A) tools that have been transitioned to the broader Modeling, Simulation, and Analysis community."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.796 million.  Justification for the decrease is described in plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}