{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-10",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603122D8Z"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism Technology Support"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "639.607"
            },
            "PriorYear": {
                "val": "149.541"
            },
            "CurrentYear": {
                "val": "171.321"
            },
            "BudgetYearOne": {
                "val": "95.747"
            },
            "BudgetYearOneBase": {
                "val": "70.517"
            },
            "BudgetYearOneOCO": {
                "val": "25.230"
            },
            "BudgetYearTwo": {
                "val": "97.384"
            },
            "BudgetYearThree": {
                "val": "99.392"
            },
            "BudgetYearFour": {
                "val": "100.687"
            },
            "BudgetYearFive": {
                "val": "103.244"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "101.083"
                },
                "CurrentYear": {
                    "val": "150.271"
                },
                "BudgetYearOne": {
                    "val": "75.517"
                },
                "BudgetYearOneBase": {
                    "val": "75.517"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "149.541"
                },
                "CurrentYear": {
                    "val": "171.321"
                },
                "BudgetYearOne": {
                    "val": "95.747"
                },
                "BudgetYearOneBase": {
                    "val": "70.517"
                },
                "BudgetYearOneOCO": {
                    "val": "25.230"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "48.458"
                },
                "CurrentYear": {
                    "val": "21.050"
                },
                "BudgetYearOne": {
                    "val": "20.230"
                },
                "BudgetYearOneBase": {
                    "val": "-5.000"
                },
                "BudgetYearOneOCO": {
                    "val": "25.230"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.450"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "50.500"
                    },
                    "CurrentYear": {
                        "val": "21.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.042"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Funds re-aligned to SO\/LIC Advanced Development BA: 03 PE: 0603121D8Z"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY20 OCO Request"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "25.230"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "25.230"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 - The Department added additional OCO funds to support the Anti-Tunnel project under Physical Security\nFY 2019 - The budget was reduced to fiscal constraints and higher priorities within the Department.\nFY 2019 OCO request of 25.000 million was Congressionally directed to Base\nFY 2019 The budget was increased for small unmanned aerial system\nFY2020 - The budget reflects the adjustment for a one time cost.  \nFY2020 & FY2021 - Initially, OCO funds were to move to Base, however the Department reversed that decision.  For FY2022 - FY2024 OCO has been realigned to Base."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "484"
                    },
                    "ProjectTitle": {
                        "val": "Combating Terrorism Technology Support (CTTS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "639.607"
                        },
                        "PriorYear": {
                            "val": "149.541"
                        },
                        "CurrentYear": {
                            "val": "171.321"
                        },
                        "BudgetYearOne": {
                            "val": "95.747"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.517"
                        },
                        "BudgetYearOneOCO": {
                            "val": "25.230"
                        },
                        "BudgetYearTwo": {
                            "val": "97.384"
                        },
                        "BudgetYearThree": {
                            "val": "99.392"
                        },
                        "BudgetYearFour": {
                            "val": "100.687"
                        },
                        "BudgetYearFive": {
                            "val": "103.244"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "OCO for Base Requirements ($25,230): OCO for Base Requirements is OCO funding for base budget requirements in support of the National Defense Strategy.  The Budget requests these funds in OCO to comply with the base budget defense caps included in the Budget Control Act of 2011."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Combating Terrorism Technical Support (CTTS) program identifies capabilities to combat terrorism and irregular adversaries and quickly delivers these capabilities to U.S. Defense and interagency users, as well as international partners through rapid research and development, advanced studies, and technical innovation. CTTS continues to expand its partnerships with other Defense and Interagency, as well as with our foreign partners’ rapid development and acquisition organizations to leverage their expertise and prevent duplication as it tries to expedite and transition new and innovative capabilities for Defense and interagency users.  CTTS is unique in its approach, annually obtaining joint requirements directly from military and law enforcement operators, intelligence analyst, and first responders.\n\nCTTS recognizes that many of the combating terrorism requirements also support the 2018 National Defense Strategy and will address peer-to-peer high interest areas. These high priority areas include increasing lethal capability of U.S. forces at the squad and small unit level; countering Small Unmanned Aerial Systems (drones) overseas and domestically; tunnel detection and mapping in theater and along the Southwest U.S. border; novel body and vehicle armor; detecting and mitigating novel chemical threats against commercial transportation; telematics; covert communications; and the use of machine learning and artificial intelligence.  From a broader perspective, projects remain distributed among 10 mission categories, in line with the interagency Technical Support Working Group (TSWG): Advanced Analytic Capabilities; Chemical, Biological, Radiological, Nuclear, and Explosives; Improvised Device Defeat\/Explosives Countermeasures; Investigative and Forensic Science; Irregular Warfare and Evolving Threats; Personnel Protection; Physical Security; Surveillance, Collection, and Operations Support; Tactical Operations Support; and Training Technology Development.\n\nThe CTTS program is a diverse, advanced technology development effort that capitalizes on interagency and international participation to demonstrate the utility and effectiveness of technology when applied to combating terrorism requirements. It includes technology capability development, proof-of-concept demonstrations in field applications, and coordination to transition from development to operational use. CTTS manages approximately 250 individual projects in support of defense, federal, state, local, and international customers and partners. \n\nThe CTTS program justified in the R-2 exhibit identifies the projects fully or partially funded by Congressional appropriations for the CTTS program. However, Combating Terrorism Technical Support also develops technology and provides support using external funds provided by other DoD and federal departments and international partnerships. These projects and support activities are not necessarily reflected in this justification R-2; but the number of activities do reflect positively on the trust and competence that CTTS has earned throughout the Department of Defense and interagency to rapidly conduct critical RDT&E and provide innovative products."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Analytic Capabilities (AAC)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Analytic Capabilities (AAC) Subgroup's objective is to develop and deploy integrated analytic capabilities; enabling Commanders, Warfighters, and Mission Partners to share information and make better\/faster decisions at the Strategic, Operational, and Tactical levels. AAC projects improve sense- making, decision-making, and data management across a range of mission areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.567"
                                            },
                                            "Text": {
                                                "val": "Complete the development of an enhanced Critical Thinking Tool that supports the application of evidence- based reasoning for intelligence questions and captures analytic problem-solving approaches. Complete enhancement of the Model Enabled Analysis, Design, and Execution (MEADE) system to include the Military Decision-making Process (MDMP) by identifying and assessing indirect strategies as well as developing response options against associated types of Gray Zone conflicts. Complete development, integration, evaluation, and field testing of Operate to Know (OtK) CONOPS and tools to establish a capability that streamlines multi-modal situational awareness across the spectrum of military operations in emergent theatres of operation. Complete development of a machine learning lab to predict location of relevant assets. Continue development of new capabilities for mission planning and battle management using advanced geographic information systems (GIS) tools on Android based platforms; specifically, the capability to augment geographic information in the field. Continue development of an ability to extract images from the field and make them useable for digital processing using Optical Character Recognition (OCR) processing so that the images can be used in commercial Arabic translation software. Initiate drone based analytics for in-field mission planning support. Initiate development and apply a deterministic open source information prototype that uses current anticipatory analytic approaches to enable forecasting over three to five years to better forecast and project geopolitical turmoil that will drive future Title 10 requirements.  Initiate testing of a hardware\/software solution that supports two-way intelligence and combat information data flows, in near real-time, between command elements, deployed sensors\/collectors, and individual warfighters in both low latency\/high bandwidth and high latency\/low bandwidth environments with a man-portable form factor.  Initiate use of state of the art machine learning predictive data mining tool to detect anomalous activities for C-WMD proliferation. Initiate development of new supercomputer chip applications that can be used for complex calculations, be forward deployed, hosted locally with concealment to facilitate increased targeting, enemy situational awareness, and that can support increased trans-regional understanding of transnational extremist group threat networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.161"
                                            },
                                            "Text": {
                                                "val": "Complete the Model Enabled Analysis, Design, and Execution (MEADE) capabilities by including user feedback in follow-on development, including cost data and return on investment analytics. Complete development of an ability to extract images from the field and make them useable for digital processing using Optical Character Recognition (OCR) processing so that the images can be used in commercial Arabic translation software. Complete enhancement of Study of Terrorism and Responses to Terrorism (START) Database, updating data, increasing the speed of data refinement, exploring new methodologies, optimizing extant methodologies, and providing data to other Research and Development groups inside and outside of government who need similarly driven innovation. Continue the tagging and retrieval of objects from images for the purpose of analysis and real time alerts using machine learning. Continue efforts to enhance capability of experimental software to meet SOF requirements and improve the probability of the software's rapid and successful integration or transition to operational use at SOFWERX in a sandbox-style environment which sources end-users feedback to the vendor. Continue development and application of a deterministic open source information prototype that uses current anticipatory analytic approaches to enable forecasting over three to five years to better forecast and project geopolitical turmoil that will drive future Title 10 requirements. Continue development and demonstration of software capable of using open source and other available information to develop a detailed country model comprising of iterative models for national, provincial, and local organizational elements across political, economic, military, socioeconomic and cultural domains. Initiate development of a mesh network of Field Programmable Gate Array-based mobile devices for conducting high-performance mobile edge analytics without reach-back to the cloud, enabling support of edge analytics in end-user specified use-cases. Initiate development of a computer vision algorithm in order to provide a capability to tag and track a region of interest, such as targeted individuals, vehicles, and\/or friendly forces. Initiate development of automated software tools for data exploration and extrapolation to derive insight into social networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.537"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.537"
                                            },
                                            "Text": {
                                                "val": "Complete the tagging and retrieval of objects from images for the purpose of analysis and real time alerts using machine learning. Complete efforts to enhance capability of experimental software to meet SOF requirements and improve the probability of the software's rapid and successful integration or transition to operational use at SOFWERX in a sandbox-style environment which sources end-users feedback to the vendor. Complete development and application of a deterministic open source information prototype that uses current anticipatory analytic approaches to enable forecasting over three to five years to better forecast and project geopolitical turmoil that will drive future Title 10 requirements. Complete development and demonstration of software capable of using open source and other available information to develop a detailed country model comprising of iterative models for national, provincial, and local organizational elements across political, economic, military, socioeconomic and cultural domains. Complete development of a mesh network of Field Programmable Gate Array-based mobile devices for conducting high-performance mobile edge analytics without reach-back to the cloud, utilizing the platform to support analytics in end-user designated use-cases. Complete development of a computer vision algorithm in order to provide a capability to tag and track a region of interest, such as targeted individuals, vehicles, and\/or friendly forces. Complete development of automated software tools for data exploration and extrapolation to derive insight. Complete drone based analytics for in-field mission planning support. Initiate development of a data ingestion, storage, formatting and processing system which refines and stores information-products both in a high-throughput data and application environment and deployable as remotely accessible images in support of edge analytics. Initiate development of a methodology to model elicit pathways of travel which leverage topographic, geographic and cultural analytics to predict probable routes and avenues of movement. Initiate development of a solution for enhancing data I\/O in battlefield mobile supercomputers which accelerates data throughput to and from permanent memory to the CPU\/GPU via data transfer pathways. Initiate development of a system capable of detecting, locating, recording, and analyzing sources of radiated electromagnetic energy for autonomous RF signal collection management."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor changes and increases are reflective of departmental priorities.."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CHEMICAL, BIOLOGICAL, RADIOLOGICAL, NUCLEAR, AND EXPLOSIVES (CBRNE)"
                                    },
                                    "Description": {
                                        "val": "The CBRNE subgroup’s objective is to improve defense capabilities to meet tomorrow’s CBRNE threats. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation on threat characterization; materials attribution; personal protective equipment; detection of CBRNE materials at trace and bulk levels at point, proximity and stand-off distances; development of information resources and decision support tools to assist response elements with risk-based decision making; and consequence management for post-event activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.836"
                                            },
                                            "Text": {
                                                "val": "Complete development of next generation evidence packaging for the safe transport of CBRN materials. Complete evaluation of potential methods of production of threat materials, and identify key indicators and warnings for response personnel. Complete a report on integrated lightweight inhalation hazard detection system capable of signaling a combination unite respirator (CUR) switching- mechanism to change operating modes of a CUR between filtered air and supplied air. Complete development of a low profile tactical SCBA to allow for working in confined spaces, tunnels, and similar access denied environments while providing high quality breathing air.  Complete modification of currently fielded ion mobility spectroscopy systems to expand the list of threats detectable to include compounds from emerging military explosives and compounds used in gun powder formulations.  Complete assessment of novel genomic sequencing standards for forensics DNA metagenomics.  Complete development of a next generation sequencing technology for potential applications in field deployed laboratories.  Complete development of a test bed for the evaluation of cargo for contraband including special nuclear materials, explosives, drugs, and other potential materials of interest, utilizing muon tomography and electron stopping.  Complete development of a research and development test bed for the evaluation of high volume explosive sampling devices with a focus on cargo\/container screening.  Complete development of assessment tools and criteria to properly rank and qualify commercial cooling systems to use with CBRNE PPE.  Complete development of a risk-based decision support model for skin decontamination in the case of dermal exposures to CWAs.  Complete the systematic evaluation of gas forming reactions that could be used in improvised chemical devices.  Complete field evaluations and certify a ruggedized garment which provides NFPA 1994 Class 3 and NFPA 1992 protection.  Complete development of a modular computer\/web-based training package for hand-held explosive detection technologies.  Complete NIOSH certification of a new CB protective mask capable of interoperability with tactical equipment for use in tactical environments.  Complete NIOSH certification of a 15-min CBRN protection escape hood capable of fitting in the pocket of a suit jacket that also passes the flammability, heat resistance and CO protection requirements for a combination CBRN\/CO capability.  Complete field testing of wireless communications that provide the ability to communicate without breaching the CBRN suit integrity or requiring an electrical pass-through.  Complete testing new methods to more effectively and efficiently collect nanogram quantities of commercial, military, and homemade explosives that are present near improvised explosive devices.  Complete development of new hardware and software solutions for a broad range of popular handheld detectors, enabling the real-time connectivity of handheld detectors from remote sites to a central location utilizing the First Responder Sensor Protocol.  Complete CBRN respirator testing against additional TICs representative of the current threats encountered.  Complete certification of multiple use biological PPE to NFPA 1999, Standards on Protective Clothing for Emergency Medical Operations, protection, and NFPA 1994, Standard on Protective Ensembles for First Responders to CBRN Terrorism Incidents, Class 4.  Continue source term development for urban dispersion models to improve the ability to characterize deposition patterns in realistic RDD events. Continue best practices for clean-up procedures for contaminated areas after an RDD event. Continue testing and evaluation of a next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats.  Continue evaluation of enhanced sampling materials and systems for CBRNE threats.  Continue support of the Quadrilateral Group on CBR Counterterrorism.  Continue development of an explosive trace detector with a limit of detection less than ten picograms for military and common homemade explosives.  Initiate development of a hyperspectral rapid, large area survey instrument that guides activities ranging from contaminant avoidance to decontamination.  Initiate the development of cheap, disposable multi agent detection paper (MADP) for the rapid, selective, and low cost detection of H, G, and V chemical warfare agents.  The MADPs shall be able to detect HD, HN, GA, GB, GD, GF, VX, VR, and VS.  Initiate the development of a novel, innovative non-encapsulating NFPA 1994 Class 1 protective ensemble that will provide Class 1 protection in a low-profile, tactical ensemble.  Initiate the development of a decontamination solution that can be used on skin and wounds and effectively decontaminate chemical and biological warfare agents.  Initiate development of a low-cost detect-to-identify wearable sensing technology to inform chemical-specialist first responders and warfighters of the presence of a broad range of TIC and CWA vapors. Initiate efforts to enhance mitigation techniques for threat releases in transportation platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.026"
                                            },
                                            "Text": {
                                                "val": "Complete development of an easy-to-understand, standardized, evidence-based fire training program addressing shortcomings in current fire safety and survival training.  Complete modification of currently fielded ion mobility spectroscopy systems to expand the list of threats detectable to include compounds from emerging military explosives and compounds used in gun powder formulations.  Complete development of a test bed for the evaluation of cargo for contraband including special nuclear materials, explosives, drugs, and other potential materials of interest, utilizing muon tomography and electron stopping.  Complete development of a research and development test bed for the evaluation of high volume explosive sampling devices with a focus on cargo\/container screening.  Complete development of a risk-based decision support model for skin decontamination in the case of dermal exposures to CWAs.  Complete the systematic evaluation of gas forming reactions that could be used in improvised chemical devices.  Complete development of a modular computer\/web-based training package for hand-held explosive detection technologies.  Complete NIOSH certification of a new CB protective mask capable of interoperability with tactical equipment for use in tactical environments.  Complete NIOSH certification of a 15-min CBRN protection escape hood capable of fitting in the pocket of a suit jacket that also passes the flammability, heat resistance and CO protection requirements for a combination CBRN\/CO capability.  Complete testing new methods to more effectively and efficiently collect nanogram quantities of commercial, military, and homemade explosives that are present near improvised explosive devices.  Complete development of new hardware and software solutions for a broad range of popular handheld detectors, enabling the real-time connectivity of handheld detectors from remote sites to a central location utilizing the First Responder Sensor Protocol.  Complete CBRN respirator testing against additional TICs representative of the current threats encountered.  Complete testing and evaluation of a next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats.  Complete evaluation of enhanced sampling materials and systems for CBRNE threats.  Complete development of an explosive trace detector with a limit of detection less than ten picograms for military and common homemade explosives.  Complete efforts to better understand microbial associations within complex microbial communities.  Complete enhancing mitigation techniques to reduce the impact of threat releases in transportation platforms and confined spaces.  Complete source term development for urban dispersion models to improve the characterization of deposition patterns in realistic radiological dispersion device (RDD) events.  Identify best practices for clean-up procedures of contaminated areas after an RDD event.  Complete development of low-cost, commercially available detect-to-warn detector for aerosol and vapor chemical hazards, low explosive limit hazards, and enriched\/deficient oxygen levels from background.  Complete development of a CB glove providing National Fire Protection Association (NFPA) 1994, Class 3, protection with greater tactility, durability, dexterity, and comfort.  Complete development of an explosive simulant that supports screening procedures\/technology evaluations without posing an explosive hazard.  Complete an industry challenge to identify an efficient swab solution compatible with fielded detection technologies and that meets practical operational considerations.  Continue development of a low profile tactical SCBA to allow for working in confined spaces, tunnels, and similar access denied environments while providing high quality breathing air.  Continue the development of a novel, innovative non-encapsulating NFPA 1994 Class 1 protective ensemble that will provide Class 1 protection in a low-profile, tactical ensemble.  Continue development of a low-cost detect-to-identify wearable sensing technology to inform chemical-specialist first responders and warfighters of the presence of a broad range of TIC and CWA vapors.  Continue development of an advanced analytical database of improvised Chemical and Biological agent production methods.  Continue development of a commercialized capability to produce aerosolized chemical and biological hazards for threat characterization.  Continue determination of operationally deployed detection techniques and systems could be further developed or exploited to provide additional chemical detection capabilities in a search environment.  Continue identifying successful operational guidance for decontaminating fentanyl and its analogs.  Continue improvement of a previous biological detector prototype to enhance performance and detection capabilities.  Initiate the development of a decontamination solution that can be used on skin and wounds and effectively decontaminate chemical and biological warfare agents.  Initiate the development of low-cost, disposable multi agent detection paper (MADP) for the rapid, selective, and low cost detection of H, G, and V chemical warfare agents.  The MADPs shall be able to detect HD, HN, GA, GB, GD, GF, VX, VR, and VS.  Initiate development of low cost chemical sensors for deployment in a network based sensor environment for large area coverage or temporary venue screening of vapor or aerosol chemical threats in transit or outdoor areas.  Initiate development of a man-portable system that can reliably detect explosives through continuous gas phase monitoring.  Initiate development of a wearable solution that autonomously monitors, detects, and captures threat agents for identification.  Initiate development of a new universal suit seal interface (USSI) to accommodate a broader range of masks and personal protective ensembles.  Initiate development of an interface that integrates chemical detection data in real time to a central data sharing, management, and storage platform.  Initiate development of an online database containing feedback on CBRNE detector field performance and test data.  Initiate assessment of CBRN filter canister performance under various storage configurations.  Initiate an industry challenge to identify functional and improved technologies for securing protective capabilities against CBRN hazards"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.010"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.348"
                                            },
                                            "Text": {
                                                "val": "Complete development of a low profile tactical SCBA to allow for working in confined spaces, tunnels, and similar access denied environments while providing high quality breathing air.  Complete the development of a novel, innovative non-encapsulating NFPA 1994 Class 1 protective ensemble that will provide Class 1 protection in a low-profile, tactical ensemble.  Complete development of a low-cost detect-to-identify wearable sensing technology to inform chemical-specialist first responders and warfighters of the presence of a broad range of TIC and CWA vapors.  Complete development of an advanced analytical database of improvised CB agent production methods.  Complete development of a commercialized capability to produce aerosolized chemical and biological hazards for threat characterization.  Complete identifying successful operational guidance for decontaminating fentanyl and its analogs.  Complete improvement of a previous biological detector prototype to enhance performance and detection capabilities.  Complete development of low cost chemical sensors for deployment in a network based sensor environment for large area coverage or temporary venue screening of vapor or aerosol chemical threats in transit or outdoor areas.  Complete development of an online database containing feedback on CBRNE detector field performance and test data.  Complete assessment of CBRN filter canister performance under various storage configurations.  Complete an industry challenge to identify functional and improved technologies for securing protective capabilities against CBRN hazards.  Continue the development of a decontamination solution that can be used on skin and wounds and effectively decontaminate chemical and biological warfare agents.  Continue the development of low-cost, disposable multi agent detection paper (MADP) for the rapid, selective, and low cost detection of H, G, and V chemical warfare agents.  The MADPs shall be able to detect HD, HN, GA, GB, GD, GF, VX, VR, and VS.  Continue determination of operationally deployed detection techniques and systems could be further developed or exploited to provide additional chemical detection capabilities in a search environment.  Continue development of a man-portable system that can reliably detect explosives through continuous gas phase monitoring.  Continue development of a wearable solution that autonomously monitors, detects, and captures threat agents for identification.  Continue development of a new USSI to accommodate a broader range of masks and personal protective ensembles.  Continue development of an interface that integrates chemical detection data in real time to a central data sharing, management, and storage platform.  Initiate the development of a respiratory protective device designed for canines that can fit the general working dog population.  Initiate the development of a packaging system for rapidly containing and safely transporting corrosive chemical warfare agents, biological warfare agents, explosive samples, and other substances harmful to human health to include chemical filled military munitions.  Initiate the development of a next-generation HazMat Boot that provides NFPA 1994 protection, and provide a more comfortable, functional, and cost-effective solution than available certified products.  Initiate the development of a cost efficient handheld Raman spectrometer for identification of threat materials using COTS hardware, open-source software capable of importing a US government developed Raman library.  Initiate validation methods to confirm routine decontamination of personal protection equipment is sufficient to remove emerging threats like toxins (ricin, abrin) or drugs (opioids, fentanyl analogs).  Initiate updating transportation and indoor models, dermal risk assessment model, and adversary models, and characterize the stability and persistence of opioids in food and water matrices.  Initiate the development of a screening system capable of simultaneously screening passengers and bags carried by passengers for mass casualty weapons.  Initiate the redesign of the current vacuum sampling devices to accommodate collection of liquid samples for chemical or microbiological forensic analysis.  Initiate the characterization of determining the effectiveness of novel delivery methods through empirical data to better understand the potential hazard and develop detection\/mitigation methods for a broad range of materials delivered via those mechanisms.   Initiate the development of evidence and consensus-based guidance for laundry protocols and decontamination confirmation for personal protective equipment after ricin, abrin, and pharmaceutical-based agent incidents.  Initiate the development of a compact, hands-free device that shall continually monitor the air quality in sub-terrarium environments and automatically notify users of dangerous conditions."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.662"
                                            },
                                            "Text": {
                                                "val": "Initiate the development of a small, lightweight self-contained breathing apparatus (SCBA) that allows a user to continue shooting in an underground facility."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor changes and increases are reflective of departmental priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IMPROVISED DEVICE DEFEAT (IDD)"
                                    },
                                    "Description": {
                                        "val": "The IDD\/EC Subgroup’s objective is to deliver capabilities to defeat or neutralize the continuum of terrorist improvised weapons and explosive devices. IDD\/EC improves the operational capabilities of the bomb disposal community, consisting of military Explosive Ordnance Disposal (EOD), and federal, state, and local bomb squads, by developing and delivering advanced tools and technologies, and decision support information to defeat improvised terrorist devices. The IDD\/EC Subgroup identifies and prioritizes multi-agency end-user requirements in collaboration with military units, and federal, state, and local agencies. IDD\/EC actively works with vendors and end-users to deliver advanced prototype systems that provide greater efficiency and increased safety for bomb technicians who investigate, access, evaluate, and if needed, render safe or dispose of suspect devices. All development efforts undertaken are in support Presidential Policy Directive 17 (PPD-17), Countering Improvised Explosive Devices, and the National Bomb Squad Commanders Advisory Board (NBSCAB) National Strategic Plan."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.218"
                                            },
                                            "Text": {
                                                "val": "Complete an East Coast-based technology requirement gathering capability exercise (TRG CAPEX) to develop and test advanced skills to maneuver hazardous duty robots in challenging, real-world scenarios. Complete development of a lightweight IED protective suit and ballistic helmet to allow increased freedom of movement during counter-IED operations. Complete development of power efficient advanced communications ECM techniques that are fully capable of defeating the environmentally adaptive communications capabilities embedded in most advanced wireless systems and networks. Complete research of methods for electromagnetic and electrostatic discharge mechanisms for counter-IED applications in support of directed energy neutralize capabilities. Complete development of an HME neutralization field reference for use by military EOD and public safety bomb technicians. Complete development of common test standards and assessment methods for the full spectrum of EOD disruptors to facilitate the exchange of reliable data. Complete development of a device defeat application that allows bomb technicians to select disruption tools based on automated X-ray diagnostics. Complete development of a robot-mounted X-ray Backscatter system for VBIED diagnostics. Complete development of a hands-free bomb suit heads-up display that projects mission and sensor data onto a bomb suit helmet screen. Complete development of a multi-fit inflatable bomb suit helmet liner capable of being retrofitted to the Med-Eng™ EOD 9, EOD 9A, and SRS 5 model helmets. Continue development of a 3D X-ray Imaging System to interrogate a suspected IED and locate critical components. Conduct a workshop that integrates EOD and Public Safety Bomb Technicians with engineers and roboticists to collaboratively design and develop new capabilities for VBIED response. Initiate development of a humanoid robot for use in IED Defeat operations in urban environments. Initiate development of a small, high definition, live-streaming camera that displays images onto a wearable screen or integrates into a bomb suit heads-up display. Initiate development of a mixed-reality visualization system for command post\/up-range support that will allow bomb technicians and support personnel to see what is transpiring downrange and assist the bomb technician with on-scene analysis. Initiate the development of an enhanced spatial awareness capability for robotic platforms that can maintain 360-degree awareness of the platform's surrounding environment. Initiate the development of a library of CAD files that can be printed with an inexpensive 3D printer at the bomb squad location or sourced to outside parties for printing. Initiate research to produce customizable energetic tools to disrupt explosive devices in high-risk environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.178"
                                            },
                                            "Text": {
                                                "val": "Complete development of a device defeat application that allows bomb technicians to select disruption tools based on automated X-ray diagnostics. Complete development of a robot-mounted X-ray Backscatter system for VBIED diagnostics. Complete development of a 3D X-ray Imaging System to interrogate a suspected improvised explosive device (IED) and locate critical components. Complete development of a small, high definition, live-streaming camera that displays images onto a wearable screen or heads-up display. Complete development of a library of computer-assisted-drawings (CAD) files that can be downloaded from a website and printed with an inexpensive 3D printer at the bomb squad location or sourced to outside parties for printing. Complete development of a rapidly mountable backscatter X-ray system for small to medium sized robotic platforms. Complete development of a humanoid robotic platform prototype for use IED Defeat operations in urban environments. Complete development of an optimized IED jamming system that includes updated frequencies and increased jamming power based on a pre-existing system. Continue conducting workshops that integrate Explosive Ordnance Disposal (EOD) and Public Safety Bomb Technicians (PSTB) with engineers and roboticists to collaboratively design and develop new capabilities for VBIED response. Continue an East Coast-based technology requirement gathering capability exercise (TRG CAPEX) to develop and test advanced skills to maneuver hazardous duty robots in challenging, real-world scenarios. Continue development of a mixed-reality visualization system for command post\/up-range support that will allow bomb technicians and support personnel to see what is transpiring downrange and assist the bomb technician with on-scene analysis. Continue development of bomb disposal tools for deployment on, or by, small UAS-based platforms. Continue development of a low cost obstruction avoidance and proximity alert system for robotic platforms. Continue development of an electronic, user-updatable UAS Guidebook that can be used as a quick reference guide during response operations for identification and analysis of downed UAS platforms. Continue development of a smartphone or tablet-based application that will allow bomb technicians to relay IED and IED incident information graphically to fellow bomb technicians in real-time. Continue development of a humanoid robotic platform for use IED Defeat operations in urban environments. Continue research to produce customizable energetic tools to disrupt explosive devices in high risk environments. Continue bilateral information exchange between U.S.-based bomb technicians and members of the Israel National Police Bomb Disposal Division. Initiate sponsorship of a requirement gathering event where individual bomb technicians compete against one another in skill-based challenges. Initiate development of a digital night vision system capable of producing full color images of items, reflective of their actual color to aid component identification and diagnostics. Initiate development of an add on device that can attach to or be placed in front of an electronic display screen to mitigate degraded visibility caused by ambient bright light. Initiate development of a small, wireless, ground robot able to autonomously map the interior of a structure. Initiate development of an underwater firing system that is ROV platform agnostic and can operate at depths down to 99 feet. Initiate development of a robotic platform designed to operate on rail systems and underground infrastructure for inspecting rail cars and locomotives. Initiate development of library of IED circuits for training, which contains component lists, assembly instructions, and files for making printed circuit boards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.752"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.296"
                                            },
                                            "Text": {
                                                "val": "Complete development of a mixed-reality visualization system for command post\/up-range support that will allow bomb technicians and support personnel to see what is transpiring downrange and assist the bomb technician with on-scene analysis. Complete development of bomb disposal tools for deployment on, or by, small UAS-based platforms. Complete development of a low cost obstruction avoidance and proximity alert system for robotic platforms. Complete development of a smartphone or tablet-based application that will allow bomb technicians to relay IED and IED incident information graphically to fellow bomb technicians in real-time. Complete research to produce customizable energetic tools to disrupt explosive devices in high risk environments. Continue conducting workshops that integrate Explosive Ordnance Disposal (EOD) and Public Safety Bomb Technicians (PSTB) with engineers and roboticists to collaboratively design and develop new capabilities for VBIED response. Continue an East Coast-based technology requirement gathering capability exercise (TRG CAPEX) to develop and test advanced skills to maneuver hazardous duty robots in challenging, real-world scenarios. Continue development of an electronic, user-updatable UAS Guidebook that can be used as a quick reference guide during response operations for identification and analysis of downed UAS platforms. Continue development of a humanoid robotic platform for use IED Defeat operations in urban environments. Continue bilateral information exchange between U.S.-based bomb technicians and members of the Israel National Police Bomb Disposal Division. Continue sponsorship of a requirement gathering event where individual bomb technicians compete against one another in skill-based challenges. Continue development of a digital night vision system capable of producing full color images of items, reflective of their actual color to aid component identification and diagnostics. Continue development of an add on device that can attach to or be placed in front of an electronic display screen to mitigate degraded visibility caused by ambient bright light. Continue development of a small, wireless, ground robot able to autonomously map the interior of a structure. Continue development of a robotic platform designed to operate on rail systems and underground infrastructure for inspecting rail cars and locomotives. Continue development of library of IED circuits for training, which contains component lists, assembly instructions, and files for making printed circuit boards."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.456"
                                            },
                                            "Text": {
                                                "val": "Continue development of an underwater firing system that is ROV platform agnostic and can operate at depths down to 99 feet."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decreases due to changes in Congressional Add funding."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INVESTIGATIVE AND FORENSICS SCIENCE"
                                    },
                                    "Description": {
                                        "val": "The IFS subgroup’s objective is to advance combating terrorism capabilities in investigative and forensic science. IFS supports joint, interagency, and other partners who apply investigative and forensic science methods, means, or practices to forensic intelligence or investigations. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation of new and advanced technology, equipment, forensic techniques, and investigative tools, as well as development of information resources and on support tools for risk-based decision-making and rapid exploitation of evidence. Projects emphasize rapid and field deoxyribonucleic acid (DNA) analysis, identification of insider threat within agencies, pre-blast and post- blast forensic examination, electronic evidence data acquisition and analysis, sensitive site exploitation, forensic intelligence, and criminalistics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.805"
                                            },
                                            "Text": {
                                                "val": "Complete the development of latent print lifters based on antigenic reagents that can be used without detection. Complete development of a tool that can search the internet, find data associated with a user name and password and then collect and store the data. Complete development of a forensic tool that can detect handwriting on digitized documents regardless of the language and then extract it for later analysis. Complete development of a new collection device of trace DNA and new procedures to determine more advanced data from it. Complete the development of electronic transmission protocols for fingerprints and palm prints. Complete the research to determine the best credibility assessment techniques and procedures to be used on persons living in the regions around Israel and distribute the results. Continue the development of a handheld device that can document incident scenes, collect fingerprint images, and can make comparisons at the scene with outside databases. Initiate development of an intelligence focused facial recognition system that analyzes streaming or multiplexing images and videos sources of large volumes. Initiate development of an unconstrained face recognition system for intelligence community to process relevant streaming or multiplexed image and video sources that are too labor intensive for manual review due to their volume. Initiate development of an advanced scalable facial recognition system based on the government developed model. Initiate the research and production of a field handbook describing the procedures used by the Five Eyes nations in exploiting tactical and sensitive site for forensic and investigative information. Initiate development of standard protocols, procedures, and best practices for forensic speaker comparison examiners to accomplish their analyses and examinations. Initiate the development of a miniature concealable body worn audio-video transmitter for law enforcement and tactical personnel. Initiate the development of algorithms that increase the accuracy of NCCA's Avatar and thermal imaging credibility assessment systems. Initiate the development of automated methods to convert foreign fingerprint files into US compatible electronic files and anonymous the source."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.436"
                                            },
                                            "Text": {
                                                "val": "Complete development and fielding of a handheld device that can document incident scenes and collect fingerprint images and can make comparisons at the scene with other databases. Complete the research to determine the best credibility assessment techniques and procedures to be used on persons living in the regions around Israel and distribute the results. Complete the research, production, and fielding of a field handbook describing the procedures used by the Five Eyes nations in exploiting tactical and sensitive sites for forensic and investigative information.  Complete the development and fielding of standard protocols, procedures, and best practices for forensic speaker comparison examiners to accomplish their analyses and examinations.  Complete the development and fielding of a miniature concealable body worn audio-video transmitter for law enforcement and tactical personnel. Complete development and fielding of DNA collection and analysis procedures usable in sensitive sites and restricted areas without leaving any trace.  Continue the development of an advanced scalable facial recognition system based on a government developed model.  Continue the development of automated methods to convert foreign fingerprint and biometric files into US compatible electronic files and anonymize the source of the data and a start building a hardware device for faster file ingesting. Continue the development of a facial recognition toolkit that can quickly identify facial images at sensitive sites. Initiate the development and evaluation of algorithms that increase the accuracy of NCCA's Avatar and thermal imaging credibility assessment systems. Initiate the development of a mobile instrument with a deep UV Raman laser that visualizes undetectable latent fingerprints and makes the images immediately available for analysis.  Initiate development of a vehicle image search tool with artificial intelligence that automatically trains itself to identify new makes and models of vehicles for future analysis. Initiate the development of an automatic video file search and analysis tool for any user defined object to collect evidence and intelligence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.114"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.114"
                                            },
                                            "Text": {
                                                "val": "Complete the development and fielding of an advanced scalable facial recognition system based on the government developed model.  Complete the development and fielding of automated methods to convert foreign fingerprint files into US compatible electronic files and anonymize the source of the data and complete building a hardware device for faster file ingesting. Complete the development and fielding of a facial recognition toolkit that can quickly identify facial images at sensitive sites.  Complete the development and evaluation of algorithms that increase the accuracy of NCCA's Avatar and thermal imaging credibility assessment systems.  Complete the development and delivery of a mobile instrument with a deep UV Raman laser that visualizes undetectable latent fingerprints and makes the images immediately available for analysis.  Complete development and field of a vehicle image search tool with artificial intelligence that automatically trains itself to identify new makes and model of vehicle for future analysis.  Continue the development of an automatic video file search and analysis tool for any user defined object to collect evidence and intelligence.  Initiate the development of forensic procedures to collect and analyze both DNA evidence and latent fingerprint evidence found on adhesive tape and related media. Initiate the development of a small rugged system that automatically documents incident sites and crime scenes with images, photos, sketches, and 3-D visualizations with accurate measurements. Initiate development of a portable device that can identify inorganic material and determine its geo-location of origin. Initiate development of an automated system that rapidly searches large data files to detect, classify, and retrieve weapons, symbols, and other objects.  Initiated development of a portable long range facial identification system that operates accurately up to 300 meters. Initiate development of a cross-domain digital forensics capability that utilizes smart filtering, artificial intelligence, automated multimedia analysis, and malware detection to create a comprehensive “clean” and relevant view of the exportable data and make it available to other operational networks.  Initiate development of a system for audio recordings that finds and labels noises of law enforcement interest and intelligence value. Initiate development of advanced Latent Quality Metric software that standardizes and makes the latent print comparison workflow more efficient and accurate. Initiate development of a rugged, mobile, forensic alternative light source for better visualization and photographing of trace evidence. Initiate development of an automated process to enhance the clarity, detail, and pixel level of low resolution images."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increases are reflective of departmental priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Irregular Warfare and Evolving Threats (IW\/ET)"
                                    },
                                    "Description": {
                                        "val": "The IW\/ET subgroup develops new concepts and capabilities for warfighters and inter-agency partners. In accordance with the Quadrennial Defense Review’s (QDR) emphasis on preparation to defeat adversaries and succeed in a wide range of contingencies, IW\/ET will engage in operational assessment, concept development, and independent validation of unique prototype capabilities to identify, confront, and defeat evolving threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.111"
                                            },
                                            "Text": {
                                                "val": "Complete the design of a holistic common interagency analytical and planning approach that better identifies capabilities, authorities and funding, links US, Allied and partner nation objectives and builds synergy when conducting partner nation capacity building missions.  The analytical and planning approach is available for use in interagency and allied nation training curriculum. Complete the development of a platform to collect and analyze photographs, videos, audio recordings, and general text-based information via precise crowd sourcing techniques. The technical approach will provide the capability to conduct facial, object and ISIL branded content recognition.  An Android-based application will also be available that can be customized for a specific region, language, and purpose to use for crowd source media collection. Upon completion, the project will immediately enhance the ability of information communicators to collect, search, retrieve, view and analyze photos, audio, and video for use. Complete the transition of the Nightingale effort to deploy digital workflow, approval, and archival processes in support of the CVE mission. This project will provide enhanced coordination, information sharing, and messaging capabilities in support of countering violent extremism. Complete the Western Hemisphere Illicit Pathways effort implementing advanced information exchange tools and training to help build partner nation collaborative capacity among critical U.S. southern borders and approaches. Complete OCONUS operational test and evaluation (OT&E) to provide forward deployed units with access to PAINT. This project will provide teams operating in high threat areas with real-time indications and warnings for blue force protection using social media and other publicly available information (PAI). OT&E will conclude in June 2018. Complete development of an improved capability to conduct multi-layered analysis of the Information Environment using publicly available information and display relevant data and product views in a Common Operating Picture to facilitate Phase 0 planning of Information Environment shaping activities to effectively compete in the environment against state and non-state actors. Complete report that defines the information environment in 2025, outline potential capability gaps, and describe necessary actions in order to gain and maintain information dominance. In addition, this effort will explore information-related capabilities of defense agencies, emerging technologies, and will recommend implementation considerations based on current budget concerns. Upon completion, this project will help prepare the USG for evolving challenges in hybrid-warfare. Complete development of a capability to simultaneously engage populations across numerous modalities such as social media, web, voice, SMS, MMS, and paper-to-digital, in order to reach disconnected populations around the globe. This effort will enable wide-scale two-way communications in a variety of geopolitical environments, to include those areas with and without internet connectivity. Complete development of a database containing relevant foreign criminal statutes\/regulations translated into English and searchable against identified behaviors\/activities. This will enable users to compare and search for relevant foreign criminal statutes\/regulations as well as the willingness\/capability of partner nations to take action against identified threat networks. While this approach will initially focus on violent extremist organizations and their supporting networks, it can be applied across a wide-range of non-State, unconventional, and hybrid threats, to include counter-proliferation networks and transnational criminal organizations. This project will help operationalize law as another non-kinetic tool for commanders. Complete the development and test of an exportable information operations capability that legitimate governments’ can use to counter violent extremist messaging. Conduct testing and evaluation by delivering training and periodic evaluation through the use of mobile advise and assist training teams. Continue a Remote Advise and Assist (RAA) project to examine conditions that would lead to successful RAA operations in a full spectrum environment and then develop and field advanced RAA prototypes in order to test the ability of advisors to continue mentoring partners remotely. By having a robust RAA capability, advisors will be able to significantly enhance time with their partners when physical access is severely restricted. By being able to advise partners in a real time operational environment, the time-period needed to enhance that partner’s capacity can be significantly reduced. Observations will examine how to advance virtual communications between advisors and partners during operations. Continue the development of a tool to support decision makers managing digital operations with some form of predictive advice as to how people will respond to a choice of different types of interventions. In this way, decision-making will be improved not only for planning purposes but also for the development of capability underpinned by a behavioral science evidence base. Continue an effort to manage, enhance, and maintain a SUNet enterprise system that allows the user the ability to detect, monitor, understand, and act in the information environment through mission specific enclaves (partitioned mission or function information cells). Initiate and complete a simplified Full Spectrum Remote Advise and Assist (FS-RAA) project to simplify current RAA prototypes in order to test the ability of advisors to continue mentoring poorly educated and minimally vetted partners. By having a simplified FS-RAA capability, advisors will be able to enhance time with their partners when physical access is severely restricted.  By being able to advise poorly educated and minimally vetted partners in a real time operational environment, the time period needed to enhance that partner’s capacity can be significantly reduced while still protecting advanced tactics, techniques and procedures reserved for closely vetted partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.248"
                                            },
                                            "Text": {
                                                "val": "Complete a Remote Advise and Assist (RAA) project to examine conditions that would lead to successful RAA operations in a full spectrum environment and then develop and field advanced RAA prototypes in order to test the ability of advisors to continue mentoring partners remotely. By having a robust RAA capability, advisors will be able to significantly enhance time with their partners when physical access is severely restricted.  By being able to advise partners in a real time operational environment, the time period needed to enhance that partner’s capacity can be significantly reduced. Observations will examine how to advance virtual communications between advisors and partners during operations. Continue the development of a tool to support decision makers managing digital operations with some form of predictive advice as to how people will respond to a choice of different types of interventions. In this way decision making will be improved not only for planning purposes but also for the development of capability underpinned by a behavioral science evidence base. Continue the development of a platform to collect and analyze photographs, videos, audio recordings, and general text-based information via precise crowd sourcing techniques. The technical approach provided the capability to conduct facial, object and ISIL branded recognition.  An Android-based application is also available that can be customized for a specific region, language, and purpose to use for crowd-sourced media collection. The project is enhancing the ability of information communicators to collect, search, retrieve, view and analyze photos, audio, and video for use. Continue an effort to manage, develop, enhance, integrate, test, deploy, and maintain a Secure, Unclassified, Network (SUNet)  enterprise system that allows the user the ability to detect, monitor, understand, and act in the information environment through mission specific enclaves (partitioned mission or function information cells). Continue Phase 1 of a project characterizing the use of commercial tech by various actors (political actors, brands, competitors), which will inform and support the experimentation and prototyping efforts of Phase 2. Phase 2 will explore commercial tech identified in Phase 1 to develop at least one software prototype.  Initiate development of a capability that can deploy, through air drop, large quantities of electronic devices that will land within a predesignated area safely. The deployment containers will draw the attention of the local populace in both the air and on the ground, will float and be watertight. This will provide Military Information Support Operations operators the ability to deliver more complex and tailored messages to targeted populations in a safe and controllable manner, advancing the current capability of leaflet drop operations. Initiate creating a plug-in for the Tactical Assault Kit (TAK) that will provide an operational Command, Control, Communications, Computers and Intelligence tool that is rapid, scalable, flexible, simple and collaborative in nature.  It will run seamlessly between Android, Windows and iOS devices and will provide a secure, digital collaborative environment with planning tools that will provide Joint, Interagency, Intergovernmental and Multinational forces the ability to operate with increased agility in the joint, dynamic, and fluid operational environment. Initiate research exploring the rapidly evolving field of Deep fakes to understand its effect and evaluate options. Initiate new efforts to develop and deploy capabilities that support DoD, interagency and foreign partners and allies who are confronting evolving threat networks and complex global operational environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.590"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.544"
                                            },
                                            "Text": {
                                                "val": "Complete the development of a tool to support decision makers managing digital operations with some form of predictive advice as to how people will respond to a choice of different types of interventions. In this way decision making will be improved not only for planning purposes but also for the development of capability underpinned by a behavioral science evidence base. Complete the development of a platform to collect and analyze photographs, videos, audio recordings, and general text-based information via precise crowd sourcing techniques. The technical approach provided the capability to conduct facial, object and ISIL branded recognition.  An Android-based application is also available that can be customized for a specific region, language, and purpose to use for crowd-sourced media collection. The project is enhancing the ability of information communicators to collect, search, retrieve, view and analyze photos, audio, and video for use.  Complete Phase 2 of a project characterizing the use of commercial tech by various actors (political actors, brands, competitors). Phase 2 will explore commercial tech identified in Phase 1 to develop at least one software prototype. Complete development of a capability that can deploy, through air drop, large quantities of electronic devices that will land within a predesignated area safely. The deployment containers will draw the attention of the local populace in both the air and on the ground, will float and be watertight. This will provide Military Information Support Operations (MISO) operators the ability to deliver more complex and tailored messages to targeted populations in a safe and controllable manner, advancing the current capability of leaflet drop operations. Complete a plug-in for the Tactical Assault Kit (TAK) that will provide an operational Command, Control, Communications, Computers and Intelligence tool that is rapid, scalable, flexible, simple and collaborative in nature.  It will run seamlessly between Android, Windows and iOS devices and will provide a secure, digital collaborative environment with planning tools that will provide Joint, Interagency, Intergovernmental and Multinational forces the ability to operate with increased agility in the joint, dynamic, and fluid operational environment. Complete research exploring the rapidly evolving field of Deep fakes to evaluate its effect and evaluate options.  Initiate transition to a new PE line an effort to  manage, develop, enhance, integrate, test, deploy, and maintain a Secure, Unclassified, Network (SUNet) enterprise system that allows the user the ability to detect, monitor, understand, and act in the information environment through mission specific enclaves (partitioned mission or function information cells).  Initiate project to support MISO operators by integrating cutting edge commercial technologies and applications into a toolkit that consist of advanced equipment that reflect the technology and communications infrastructure in the diverse set of environments in which MISO operates.  The toolkit shall be influence-specific, standardized and by design be interchangeable, to include capabilities that can be procured on the local economy of the country of interest.  Initiate an effort to explore the emerging blockchain technologies and the risks and opportunities posed by them with respect to United States national security interests. If pursued, these projects will improve USG understanding of the Encrypted Ledger. The impact and transition pathway will be determined once a proposal is approved and aligned with end-user specific needs and timelines. Initiate new efforts to develop and deploy capabilities that support DoD, interagency and foreign partners and allies who are confronting evolving threat networks and complex global operational environments."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "3.046"
                                            },
                                            "Text": {
                                                "val": "Initiate project to develop a multiuser, near real-time game that can simulate irregular threats. The platform will\nleverage large all-source data sets to create various wargaming scenarios with built-in parameters. Once the game has used that data to set the scenario, organizers will virtually invite stakeholders, SMEs, and relevant partners to form a secure user base. Once the game begins, participants will collaborate and compete in real time under assigned roles for COA development,\nrefinement, and assessment while interacting with all other users. The simulation platform will record all wargaming interactions\namongst users and generate a secure cloud-based database"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Changes and reductions are reflective of departmental priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PERSONNEL PROTECTION"
                                    },
                                    "Description": {
                                        "val": "The Personnel Protection Subgroup’s objective is to develop new equipment, reference tools, and standards to improve the protection of personnel. Projects focus on putting innovative tools such as automated information management systems, communication devices, tagging, tracking and locating devices, mobile surveillance systems, as well as personal and vehicle protection equipment in the hands of personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.597"
                                            },
                                            "Text": {
                                                "val": "Complete development of systems to enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts. Complete development of counter unmanned aerial vehicle capabilities.  Complete development of a novel material for ballistic and blast protection that utilizes fiber optics to enable visibility with opaque armor.  Complete development of a stand standalone personal armor plate for high power, armor piercing projectile threats using advanced materials.  Complete development of a helmet system to protect against common high power rifle projectile threats.  Complete the development of a test apparatus that serves to measure dynamic and static events during and after the course of a ballistic impact.  Complete development of a small lightweight wearable device that securely transmits biometric and geolocation data to a common operating picture. Complete development of a mobile sensor suite that can detect subsonic and supersonic rounds that are fired at a convoy and display the round’s origin, heading and range on a real time map to provide situational awareness to the operator.  Continue development of biomarker identification for brain injury using magnetic resonance imaging (MRI) and magnetic resonance spectroscopy (MRS) to monitor neurochemical biomarkers for post-traumatic stress disorder and mild traumatic brain injury.  Continue development of a man packable system that reduces or eliminates the radar, electronic, thermal, infrared, visual or acoustic signatures of a dismounted soldier. Continue the development of a multi-modal system to detect, identify and mitigate unmanned aerial threats to tactile vehicles and other mobile platforms in terrestrial and maritime environments.  Initiate development of standalone armor plates to defeat the 7.62 X 39mm, 124 grain, mild steel core (MSC) projectile.  Initiate development of an air deployable unmanned aerial system that is capable of dashing ahead of the V-22 and providing at least 8.5 minutes of overhead intelligence, surveillance and reconnaissance (ISR) at the landing zone or drop zone prior to the force arrival.  Initiate development of a robust Electromyography (EMG) sensor system comprised of electrodes, sampling electronics and processing electronics capable of integration into a robotic\/human augmentation platform.  Initiate the development of advanced systems to detect and mitigate unmanned aerial threats using novel detection and mitigation modalities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.077"
                                            },
                                            "Text": {
                                                "val": "Complete development of a helmet system to protect against common high power rifle projectile threats. Complete the development of a test apparatus that serves to measure dynamic and static events during and after the course of a ballistic impact.  Complete development of a mobile sensor suite that can detect subsonic and supersonic rounds that are fired at convoy and display it on a real time map to provide situational awareness to the operator.  Complete development of systems to enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts.  Complete development of biomarker identification for brain injury using magnetic resonance imaging (MRI) and magnetic resonance spectroscopy (MRS) to monitor neurochemical biomarkers for post-traumatic stress disorder and mild traumatic brain injury.  Complete development of a man packable system that reduces or eliminates the radar, electronic, thermal, infrared, visual or acoustic signatures of a dismounted soldier. Complete development of a small lightweight wearable device that securely transmits biometric and geolocation data to a common operating picture.  Complete the development of a multi-modal system to detect, identify and mitigate unmanned aerial threats to tactile vehicles and other mobile platforms in terrestrial and maritime environments.  Complete development of an air deployable unmanned aerial system that is capable of dashing ahead of the V-22 and providing at least 8.5 minutes of overhead intelligence, surveillance and reconnaissance (ISR) at the landing zone or drop zone prior to the force arrival.  Continue development of standalone armor plates to defeat the 7.62 X 39mm, 124 grain, mild steel core (MSC) projectile.  Continue development of a robust Electromyography (EMG) sensor system comprised of electrodes, sampling electronics and processing electronics capable of integration into a robotic\/human augmentation platform.  Continue the development of advanced systems to detect and mitigate unmanned aerial threats using novel detection and mitigation modalities.  Initiate development of enhanced performance personal body armor and production processes to enable successful completion of first articles tests and subsequent fielding.  Initiate development of an active counter small unmanned aerial vehicle system that will employ a multi-rotor UAV to capture, retrieve and neutralize threat UAV systems.  Initiate development of an updated Armored Passenger Vehicle (APV) Handbook with regards to the current management of government APV programs.  Initiate the investigation of the root causes of poor armor fit among U.S law enforcement agencies. Identify corrective actions and standard procedures to ensure proper fit to body armor users across the anthropometric spectrum of law enforcement professionals.  Initiate the development of a vehicle mounted, tethered aerial platform capable of carrying a wide variety of payloads to fill various mission needs.  Initiate the development of a test fixture to validate the performance of non-pneumatic limb tourniquets. Initiate the development of a heads up display unit to be integrated into an existing helmet system and provide day and night display of data elements of interest to the operator.  Initiate development of a system capable of UAS detection, geolocation, tracking and disruption for the protection of dismounted soldiers and operators.  Initiate development and testing of injection molded ceramic armor to provide interagency vehicle with ballistic protection from advanced projectile threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.165"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.412"
                                            },
                                            "Text": {
                                                "val": "Complete development of standalone armor plates to defeat the 7.62 X 39mm, 124 grain, mild steel core (MSC) projectile.  Complete development of a robust Electromyography (EMG) sensor system comprised of electrodes, sampling electronics and processing electronics capable of integration into a robotic\/human augmentation platform.  Complete the development of advanced systems to detect and mitigate unmanned aerial threats using novel detection and mitigation modalities.  Complete development of an active counter small unmanned aerial vehicle system that will employ a multi-rotor UAV to capture, retrieve and neutralize threat UAV systems.  Complete development of an updated Armored Passenger Vehicle (APV) Handbook with regards to the current management of government APV programs.  Complete the development of a test fixture to validate the performance of non-pneumatic limb tourniquets.  Complete development and testing of injection molded ceramic armor to provide interagency vehicle with ballistic protection from advanced projectile threats.  Continue development of enhanced performance personal body armor and production processes to enable successful completion of first articles tests and subsequent fielding.  Continue the investigation of the root causes of poor armor fit among U.S law enforcement agencies. Identify corrective actions and standard procedures to ensure proper fit to body armor users across the anthropometric spectrum of law enforcement professionals.  Continue the development of a vehicle mounted, tethered aerial platform capable of carrying a wide variety of payloads to fill various mission needs.  Continue the development of a heads up display unit to be integrated into an existing helmet system and provide day and night display of data elements of interest to the operator.  Continue development of a system capable of UAS detection, geolocation, tracking and disruption for the protection of dismounted soldiers and operators.  Initiate development of advanced ceramic materials with enhanced mechanical properties for use in novel armor applications.  Initiate development of innovative materials for use in advanced armor systems.  Initiate development of a two dimensional polymer material bound by robust hydrogen bonds for use in lightweight armor applications.  Initiate development of a standard 7.62 x 39mm projectile test surrogate to provide a standard test round for body armor test protocols.  Initiate development of a multi-threat helmet to provide impact and ballistic and ballistic protection for law enforcement officers. Initiate development of a 360 degree, real time sensor system to provide streaming video and anomaly detection to vehicle platforms on the move."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.753"
                                            },
                                            "Text": {
                                                "val": "Initiate development of a discrete, self-adhesive patch that provides silent, tactile stimulation in order to alert embassy personnel alert notifications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to changes in Congressional Add funding."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PHYSICAL SECURITY"
                                    },
                                    "Description": {
                                        "val": "Rapidly develop and transition physical security\/force protection capabilities and technologies to support forward deployed and domestic first responders, military, interagency, and international partners in the focus areas of Blast Effects and Mitigation; Maritime Security; Screening, Observation, Detection, and Protection; and, Subterranean Activities. Emphasize these technology development efforts primarily at U.S. embassies and consulates, forward operating bases, along the U.S. borders, at mass transportation and commerce nodes, in maritime port and littoral environments, and in support of large scale public venues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "53.064"
                                            },
                                            "Text": {
                                                "val": "Complete development of an automatic target recognition system for on-the-move, standoff IED detection. Complete development of an Advanced Diver Data Display System final prototype for combat swimmers. Complete development and upgrade of a tactical compact aerostat surveillance system for ground and maritime intelligence, surveillance and reconnaissance, as well as communication between non-line-of-sight (NLOS) forces. Complete development of computer modeling and simulation program to determine the smallest booster size needed to initiate detonation of Ammonium Nitrate prill in shipping configuration to determine screening and detection capability needed to prevent the weaponization of fertilizer being transported in public areas.  Complete joint work between U.S. and Australia to test, characterize and model a novel propane tank Vehicle Borne Improvised Explosive Device (VBIED) threat. Complete development of a portable and ruggedized body scanner for personnel protection missions based on the existing AIT stationary body scanner system developed by Tek84. Complete development and evaluation of a scanning system able to maneuver independently inside specified geophysical target areas and provide situational awareness. Complete the design and characterization of a test site for testing emerging technologies for unique operational missions. Complete development of a surveillance system with automated 360-degree long range scanning capability (optical radar) to protect the Force in tactical combat outposts. Complete development of a set of guidelines and certifications that can be used by public, private, academic, and government entities to support the qualification of engineers and architects capable of characterizing and mitigating explosive effects.  Complete testing on localized responses from facades to quantify the effects of responding components on blast propagation through a new series of controlled explosive tests at the Urban Canyon Test facility. Complete development of a joint multi-disciplinary geophysical survey kit, comprised of distinct tools.  Continue construction of a test site in a specific geographic region for testing emerging technologies for unique operational missions.  Complete development of a set of handcuffs that are able to withstand specific physical defeat techniques employed by a detained individual or individuals without the appropriate key, while maintaining the basic design and functionality of currently used handcuffs. Complete development of a software tool associated with a comprehensive evaluation of horizontal directional drilling (HDD) equipment that can be used to focus intelligence collection and threat assessments, providing leadership with enhanced situational awareness and directing the allocation of limited resources to areas of highest risk.  Complete the design and installation of a novel concept for an underground training and tactical test site in the United States, for training operators and testing and evaluating tactical technologies.  Complete development of a larger version of a technology used to block entrances or doorways with time delay and cart for system transport.      Continue development of an advanced active diver thermal protection system for long exposure dives, including SEAL Delivery Vehicle (SDV) operations.  Continue development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures. Continue development of a prototype communications system for special missions in specified environments.  Continue development of a system for detection of unique geophysical phenomena and testing and evaluation of the prototypes’ performance in representative sites. Continue development of a mobile system for stand-off detection and mapping of specified geophysical phenomena using technology developed under previous bilateral tasks. Continue development, integration and T&E of an extended coverage system for novel border protection applications in different terrain\/geophysical conditions.  Continue development of additional mission capabilities to the Sappheiros unattended ground sensor system to enable deployment, detection and tracking of targets in various geophysical environments. Continue development of a prototype system and concept of operations to detect a particular geophysical phenomenon. Continue development of improved, cost-effective High Power Radio Frequency (HPRF) sources for nonlethal vessel and vehicle stopping that achieve militarily useful effective ranges against fast moving target.  Continue development of an algorithm for detecting weapons in baggage that will be integrating into existing baggage x-ray systems. Continue development of a roller door that is forced-entry (FE) resistant and capable of meeting the State Department 15-Minute FE performance criteria.  Initiate the testing and evaluation of the use of binary explosives for unique applications in specific environments. Initiate development of a remote activation device for tactical arresting systems designed to stop vehicles over a short distance.  Initiate development of an in-depth guide of best practices for rescuing tunnel collapse victims inside OSHA-compliant and non-compliant tunnels to enhance survivability.  Initiate development of a novel ship-to-shore fuel transport system in an amphibious towable container that mitigates risk to personnel and fuel loss in the event of an attack. Initiate development of a long-term sensor system incorporated during the tunnel remediation process that will detect tampering, motion, and tunneling activity and provide an alert to a remote monitoring station. Initiate adaptation of a proven land system to a novel type of detection platform. Initiate modification of the Dialogue system to enable communication among a network of multiple users and at longer ranges.  Initiate development of a tactical spray-on reinforcement kit for potentially dangerous structures. Initiate development of a self-positioning personnel tracking system. Initiate development of a fast-running ultra-high performance concrete slab model, WAC-U, and improve tools for design, protective use, and vulnerability assessments. Initiate development of a compact, user-friendly tool for measuring the azimuth and range of a below ground structure from above ground that provides the measurements in real-time. Initiate development of a tactical and easy-to-use tool that will enable an operator to see behind obstacles (e.g. brick walls, sandbags, doors, etc.), from a safe distance, in underground confined structures. Initiate development of a new capability for the modeling of tunnel IED effects within the Vulnerability Assessment and Protection Option (VAPO) software tool and for rendering tactical tunnels unusable through predictive blast modeling."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "56.746"
                                            },
                                            "Text": {
                                                "val": "Complete development of an automatic target recognition system for on the move, standoff IED detection.  Complete development of an Advanced Diver Data Display System final prototype for combat swimmers.  Complete development of a portable and ruggedized body scanner for personnel protection missions based on the existing AIT stationary body scanner system developed by Tek84.  Complete development and evaluation of a scanning system able to maneuver independently inside specified geology target areas and provide situational awareness.  Complete testing on localized responses from facades to quantify the effects of responding components on blast propagation through a new series of controlled explosive tests at the Urban Canyon Test facility.  Complete development of a joint multi-disciplinary geology survey kit, comprised of distinct tools.  Complete development of a software tool associated with a comprehensive evaluation of horizontal directional drilling (HDD) equipment to be used to focus intelligence collection and threat assessments and provide leadership with enhanced situational awareness to allocate limited resources to high risk areas.  Complete the design and installation of a novel concept for an underground training and tactical test site in the United States, for training operators and testing and evaluating tactical technologies.  Complete development of a larger version of a technology used to block entrances or doorways with time delay and cart for system transport.  Complete development of a prototype communications system for special missions in specified environments.  Complete development of a system for detection of unique geology phenomena and testing and evaluation of the prototypes’ performance in representative sites.  Complete development of improved, cost-effective High Power Radio Frequency (HPRF) sources for nonlethal vessel and vehicle stopping that achieve militarily useful effective ranges against fast moving target.  Complete development of a roller door that is forced-entry (FE) resistant and capable of meeting the State Department 15-Minute FE performance criteria. Complete the development of an in-depth guide of best practices for rescuing tunnel collapse victims inside OSHA-compliant and non-compliant tunnels to enhance survivability.  Continue development of a portable and ruggedized body scanner for personnel protection missions based on the existing AIT stationary body scanner system developed by Tek84.  Continue construction of a test site in a specific geographic region for testing emerging technologies for unique operational missions.  Continue development of an advanced active diver thermal protection system for long exposure dives, including SEAL Delivery Vehicle (SDV) operations.  Continue development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures.  Continue development of a novel platform that incorporates the integration of proven land-based sensors for conducting advanced geology surveys.  Continue development of a mobile system for standoff detection and mapping of specified geology phenomena using technology developed under previous bilateral tasks.  Continue development, integration and T&E of an extended coverage system for novel border protection applications in different terrain\/geology conditions.  Continue development of additional mission capabilities to the Sappheiros unattended ground sensor system to enable deployment, detection and tracking of targets in various geology environments.  Continue development of a prototype system and concept of operations based on the use of transmitters and receivers to detect a particular geology phenomenon.  Continue development of an algorithm for detecting weapons in baggage that will be integrated into existing baggage x-ray systems.  Continue the testing and evaluation of the use of binary explosives for unique applications in specific environments.  Continue development of a small, unmanned aerial system (sUAS) to safely conduct reconnaissance of discovered illicit tunnels and routine inspections of underground municipal infrastructure (UMI). Continue modification of a novel system to enable communication among a network of multiple users and at longer ranges.  Continue development of a tactical spray-on reinforcement kit for potentially dangerous structures.  Continue development of a self-positioning personnel tracking system.  Continue development of a fast-running ultra-high performance concrete slab model, WAC-U, and improved tools for design, protective use, and vulnerability assessments.  Continue development of a new capability for the modeling of tunnel IED effects within the Vulnerability Assessment and Protection Option (VAPO) software tool and for rendering tactical tunnels unusable through predictive blast modeling.  Continue development of a tactical and easy-to-use tool that will enable an operator to see behind obstacles (e.g. brick walls, sandbags, doors, etc.), from a safe distance, in underground confined structures.  Continue development and testing of a less-than-lethal-weapon (LLW) prototype that fires pepper projectiles with improved accuracy at extended ranges, enabling engagement of adversaries from a safer distance.  Continue development and test of a man-portable, self-propelled module that can advance through confined spaces, support real time day or night video transmission, and provide a fresh air supply.  Initiate development of a novel ship-to-shore fuel transport system in an amphibious towable container that mitigates risk to personnel and fuel loss in the event of an attack.  Initiate adaptation of a proven land system to a novel type of detection system.  Initiate development and evaluation of an airborne system that can detect specific infrastructure aspects without requiring line of sight.  Initiate the test and evaluation of a low-cost compressed air storage system for the rapid evacuation of personnel from confined subterranean spaces, for both training and operational applications.  Initiate development and evaluation of a mechanical system for blocking tunnel entrances and shafts that provides the same or improved capability as the chemical-reaction-based first generation tunnel block system.  Initiate development of reports compiling recent domestic and international terrorist events involving person-borne and vehicle-borne improvised explosive device (PBIED & VBIED) events, including location, threat, success or failure factors and overall impact.  Initiate test and evaluation of Ethylene-vinyl Acetate (EVA) laminated glass to determine its blast protection performance as compared to Polyvinyl Butyral (PVB) laminated glass."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.455"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.493"
                                            },
                                            "Text": {
                                                "val": "Complete development of a portable and ruggedized body scanner for personnel protection missions based on the existing AIT stationary body scanner system developed by Tek84.  Complete construction of a test site in a specific geographic region for testing emerging technologies for unique operational missions.  Complete development of an advanced active diver thermal protection system for long exposure dives, including SEAL Delivery Vehicle (SDV) operations.  Complete development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures.  Complete development of a novel platform that incorporates the integration of proven land-based sensors for conducting advanced geology surveys.  Complete development of a mobile system for standoff detection and mapping of specified geology phenomena using technology developed under previous bilateral tasks.  Complete development, integration and T&E of an extended coverage system for novel border protection applications in different terrain\/geology conditions.  Complete development of additional mission capabilities to the Sappheiros unattended ground sensor system to enable deployment, detection and tracking of targets in various geology environments.  Complete development of a prototype system and concept of operations based on the use of transmitters and receivers to detect a particular geology phenomenon.  Complete development of an algorithm for detecting weapons in baggage that will be integrated into existing baggage x-ray systems.  Complete the testing and evaluation of the use of binary explosives for unique applications in specific environments.  Complete development of a small, unmanned aerial system (sUAS) to safely conduct reconnaissance of discovered illicit tunnels and routine inspections of underground municipal infrastructure (UMI).  Complete development of adapting a proven land system to a new type of platform detection.  Complete modification of a novel system to enable communication among a network of multiple users and at longer ranges.  Complete development of a tactical spray-on reinforcement kit for potentially dangerous structures.  Complete development of a self-positioning personnel tracking system.  Complete development of a fast-running ultra-high performance concrete slab model, WAC-U, and improved tools for design, protective use, and vulnerability assessments.  Complete development of a new capability for the modeling of tunnel IED effects within the Vulnerability Assessment and Protection Option (VAPO) software tool and for rendering tactical tunnels unusable through predictive blast modeling.  Complete development of a tactical and easy-to-use tool that will enable an operator to see behind obstacles (e.g. brick walls, sandbags, doors, etc.), from a safe distance, in underground confined structures.  Complete development and testing of a less-than-lethal-weapon (LLW) prototype that fires pepper projectiles with improved accuracy at extended ranges, enabling engagement of adversaries from a safer distance.  Complete development and test of a man-portable, self-propelled module that can advance through confined spaces, support real time day or night video transmission, and provide a fresh air supply.  Complete development and evaluation of a mechanical system for blocking tunnel entrances and shafts that provides the same or improved capability as the chemical-reaction-based first generation tunnel block system.  Complete development of reports compiling recent domestic and international terrorist events involving person-borne and vehicle-borne improvised explosive device (PBIED & VBIED) events, including location, threat, success or failure factors and overall impact.  Continue development of a novel ship-to-shore fuel transport system in an amphibious towable container that mitigates risk to personnel and fuel loss in the event of an attack.  Continue development and evaluation of an airborne system that can detect specific infrastructure aspects without requiring line of sight.  Continue the test and evaluation of a low-cost compressed air storage system for the rapid evacuation of personnel from confined subterranean spaces, for both training and operational applications.  Continue test and evaluation of Ethylene-vinyl Acetate (EVA) laminated glass to determine its blast protection performance as compared to Polyvinyl Butyral (PVB) laminated glass.  Initiate development of a realistic, modular subterranean training fixture, made of novel materials and configured above ground that shall replicate a communications- and GPS-denied environment.  Initiate development of a motorized personnel transporter and a non-motorized material transporter to move personnel or materials through confined spaces over various surfaces (e.g., sand, mud, cement, rock)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "1.962"
                                            },
                                            "Text": {
                                                "val": "Initiate development of a relocatable tower system with additional mast height and updated surveillance\nand communications technologies capable of transmitting real time imagery and geolocations between Command and Control\nsites and field operators."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to changes in Congressional Add funding."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURVEILLANCE, COLLECTION AND OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "Identify high-priority user requirements and special technology initiatives focused primarily on countering terrorism through offensive operations.  Enhance US intelligence capabilities to conduct retaliatory or preemptive operations and reduce the capabilities and support available to terrorists."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.730"
                                            },
                                            "Text": {
                                                "val": "Complete the critical design, development, and initial production of the CALYPSO RFIC and initial transceiver devices with integrated CALYPSO chips resulting from the Atlas Enhancement Study. Complete Classified Technical Collection Project. Complete Madonna Classified Social Media Project.  Complete Scorpion Classified Telematics Project and delivery of tools and training.  Complete Integration of voice identification technologies onto the ROVER signal intercepts capability.  The effort shall support integration and correlation of voice capabilities as well as future, optional features including analysis of social media and activity pattern analysis. Complete development of a Biometric System for identifying Cardiological Signatures.  Complete developmental effort of a small, stand-alone tracking device capable of obtaining position location information (PLI) in the presence of high powered jamming\/spoofing or in areas of weak GPS signals.  Complete project that leverages of assets and capabilities to support United States and United Kingdom’s research and development efforts in the areas of audio, video, image and text processing from (primarily, but not constrained to) open data sources.  Complete development of an automated software-based tool that will extract face and hand related data from video streams and fuse the results to present the strongest possible measure of identity from available data. This effort shall provide a functional platform that can be expanded to include other biometric factors found in video such as voice, gait, movements and gestures. Complete Dragonfly Classified Technical Collection Project.  Complete development to integrate the capabilities necessary to receive and process the Iridium GDB service into a custom version of Qualcomm's SirfstarVXP, an application specific integrated circuit (ASIC).  Continue development of new or improved technologies pertaining to non-standard, secure communications.  Continue Cattledog Classified Surveillance Project.  Continue development to deliver novel and high-performance noise reduction and speaker TTL software, based on cochlear and auditory cortex models.  The effort shall support the delivery and integration of two software packages to support military operations and to enhance DOD capabilities.  The technologies must provide near real-time situational awareness of incoming signals, filtering speakers, messages, languages, and location.  Continue development of High Altitude Pseudo Satellite payloads in support of the Coalition Warfare Joint Capabilities Demonstration to develop the Pseudo Synthetic Aperture Radar for airborne persistent surveillance systems.  Continue development and demonstration of a low profile tactical radio system with optimized performance.  The system will enable ready exchange of information between mobile tactical users in a form factor that provides the flexibility to customize the configuration and achieve communications without or in an area with degraded infrastructure.  Continue project to support information sharing and testing of newly developed EW capabilities with the United Kingdom.  Initiate development of a single compact, gimbaled next generation Hyperspectral Imagery (HSI) aerial sensor in both SWIR and LWIR wavebands and provide industry standard data outputs. \nInitiate development of a KA band small form factor electronically steerable array antenna system for maritime and mobile operations.  Initiate Othello Classified Technical Collection Project.  Initiate development of the Carthage Classified Project to develop an Emergency Notification and Tracking communications capability.   Initiate development of Cajamarca, a classified cyber enabled capability.  Initiate development of project Crossfire, a classified special communications and technical collection capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.526"
                                            },
                                            "Text": {
                                                "val": "Complete Option to add transmit functions and production of 20 additional CALYPSO Transceivers. Complete development of new or improved technologies pertaining to non-standard, secure communications. Complete Phase II development and testing of the classified Cattledog Technical Collection and Surveillance capability. Complete development and delivery of a high-performance noise reduction phased array microphone and speaker TTL software capability.  The effort supports the delivery and integration of two systems to support DOD and Law Enforcement.  The technologies provide near real-time situational awareness of incoming signals, filtering speakers, messages, languages, and location. Complete development of High Altitude Pseudo Satellite payloads. Complete development and demonstration of a low profile tactical radio system with optimized performance.  The system will enable ready exchange of information between mobile tactical users in a form factor that provides the flexibility to customize the configuration and achieve communications without or in an area with degraded infrastructure. Complete feasibility assessment of a classified Technical Collection capability. Continue classified project installation support of Social Media base capability. Continue development of a single compact, gimbaled next generation Hyperspectral Imagery (HSI) aerial sensor in both SWIR and LWIR wavebands and provide industry standard data outputs. Continue development of a KA band small form factor electronically steerable array antenna system for maritime and mobile operations. Continue development of an Emergency Notification and Tracking communications capability. Continue development of a classified Cyber Operations capability. Initiate spiral development of the Enhanced CALYPSO RFIC and integrated transceiver devices. Initiate classified feasibility assessment to design and develop a new Cube Satellite Communications System. Initiate classified project to develop a new Personal Electronic Device Secured Note taking applications. Initiate development of a new miniaturized Ultra High Frequency Band antenna or family of antennas. Initiate classified project to develop a specialized antenna system. Initiate classified project to develop wave form identification system. Initiate classified project to develop a Media Exploitation capability. Initiate classified project to develop an Alarm Defeat Capability. Initiate effort to develop a Facial Recognition and Manipulation Capability for Social Media."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.517"
                                            },
                                            "Text": {
                                                "val": "Complete Classified Social Media Project. Complete development of a KA band small form factor electronically steerable array antenna system for maritime and mobile operations. Complete development of an Emergency Notification and Tracking communications capability. Complete development of a classified Cyber Operations Capability.  Continue spiral development of the Enhanced CALYPSO RFIC and integrated transceiver devices. Continue classified feasibility assessment to design and develop a new Cube Satellite Communications System. Continue classified project to develop a new Personal Electronic Device Secured Note taking application. Continue classified project to develop a new Personal Electronic Device Secured Note taking application. Continue development of a new miniaturized Ultra High Frequency Band antenna or family of antennas. Continue development of a new miniaturized Ultra High Frequency Band antenna or family of antennas. Continue classified project to develop a specialized antenna system. Continue classified project to develop wave form identification system. Continue classified project to develop a Media Exploitation capability. Continue classified project to develop a Wireless Alarm Defeat Capability. Continue effort to develop a Facial Recognition and Manipulation Capability for Social Media. Initiate classified Special Communications effort.  Initiate classified technical collection effort.  Initiate classified technical collection effort. Initiate classified development of a cognitive radio. Initiate classified technical collections and surveillance capability.  Initiate classified technical collection and surveillance and counter surveillance capability. Initiate development of a classified special communications capability that integrates advanced computing technologies.  Initiate feasibility assessment to advance use of lasers for communication.   Initiate development of classified surveillance capability.  Initiate development of classified surveillance and technical collection capability. Initiate development of a classified electronic counter surveillance capability. Initiate classified Task Plan to support assessment of High Altitude Reconnaissance Platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "7.991"
                                            },
                                            "Text": {
                                                "val": "Continue development of a single compact, gimbaled next generation Hyperspectral Imagery (HSI) aerial sensor in both SWIR and LWIR wavebands and provide industry standard data outputs.  Initiate classified development of a cognitive radio."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor changes and increases are reflective of departmental priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TACTICAL OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "The Tactical Operations Support subgroup’s mission is to execute rapid research and development projects that enhance capabilities of DoD and Interagency special operations tactical teams engaged in finding, fixing, and finishing terrorists. This includes support to state and local law enforcement agencies to combat domestic terrorism.  The development focus is enabling small tactical units by providing state of the art overmatch capabilities in: Offensive Systems; Unconventional Warfare, Counter-Insurgency Support; Tactical Communications; Tactical Reconnaissance, Surveillance, and Target Acquisition Systems; Specialized Infiltration, Access and Exfiltration Systems; and Survivability Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.356"
                                            },
                                            "Text": {
                                                "val": "Complete spiral development to improve form factor, interoperability, and battery life of a state‐of‐the‐art amplified transceiver speaker unit to work with a number of military and commercial radio devices. Complete development of an augmented reality navigation system capability that fuses and overlays a tablet camera’s live footage, navigation instructions, and targeting information for an operator to utilize while operating a vehicle. Complete development and delivery of a modular multi-ability rapidly reconfigurable hand launched small unmanned aircraft system with a common controller that is capable of being re-configured in the field for mission specific tasks. Complete development of a 7.62x51mm subsonic round optimized to address powder sensitivity issues in order to improve consistency, range, and accuracy. Complete development and delivery of a tactical communications capability that provides small tactical teams the ability to utilize cutting edge software applications and smartphone hardware over an untrusted host-nation cellular\/internet infrastructure that also includes integration with the Android Tactical Assault Kit (ATAK) and secure forward operational logistics. Complete development and delivery of a multispectral augmented visually enhanced reality imaging capability that provides a significant advantage for long-range target acquisition in challenging environments. Complete development and delivery of a maritime canister launched small unmanned aerial system for amphibious and maritime operations requiring overhead aerial ISR capabilities. Complete development and delivery of a next-generation small unmanned aircraft system stabilized gimbal that integrates laser target designation technologies. Complete development of an increased field of view night vision device for Special Operations Forces (SOF). Complete development of a capability to self-geolocate without causing an RF signature and without relying on GPS capabilities. Complete test and evaluation of next generation tooth acoustic communications system for low-profile operations. Continue development of an Air to Surface Employment Kit (A2SEEK), for the already developed Micro Weather Sensor (MWS), to be packaged into a complete system that will be air dropped out of military aircraft to support operators and C2 elements to receive sensed weather elements and formulate aviation reports in deep battlespace or denied areas. Continue development of a man-portable (dismounted\/static), on-the-move (vehicle mounted), and kinetic kill anti-drone system kit that is capable of detection, tracking, identification, and defeating a small Unmanned Aircraft System (sUAS). Continue development of an accurized 120mm mortar system with an advanced targeting system for installation and employment on a 5-ton Medium Tactical Vehicle (MTV) capable of lethal target engagement from a short halt out to 7 kilometers. Continue testing and optimization of barrel length, rifling twist rate, and suppression of the .300 Blackout rifle platform in conjunction with an underwater supercavitating ammunition. Continue spiral development of a next generation Lightweight Medium Machine Gun (LWMMG) and polymer .338 Norma Magnum ammunition to give operators a distinct advantage in both the extended and close-in fight and be able to transition rapidly from mounted operations to dismounted operations. Initiate development of a High Frequency (HF) radio integrated into a cellular phone for use in low-profile operations. Initiate development of a new ballistic algorithm, projectile drag coefficient, and weapon system for lethal target engagement beyond 2,500 meters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.873"
                                            },
                                            "Text": {
                                                "val": "Complete development and delivery of a multispectral augmented visually enhanced reality imaging capability that provides a significant advantage for long-range target acquisition in challenging environments. Complete spiral development of integration of small unmanned aircraft system stabilized gimbal that integrates laser target designation technologies onto current program of record airframes. Complete spiral development to improve form factor, interoperability, and battery life of a state‐of‐the‐art amplified transceiver speaker unit to work with a number of military and commercial radio devices. Complete spiral development of a next generation Lightweight Medium Machine Gun (LWMMG) and polymer .338 Norma Magnum ammunition to give Special Operations Forces a distinct advantage in both the extended and close-in fight and be able to transition rapidly from mounted operations to dismounted operations. Complete development of an Air to Surface Employment Kit (A2SEEK), for the already developed Micro Weather Sensor (MWS), to be packaged into a complete system that will be air dropped out of military aircraft to support operators and C2 elements to receive sensed weather elements and formulate aviation reports in deep battlespace or denied areas. Complete development of an accurized 120mm mortar system with an advanced targeting system for installation and employment on a 5-ton Medium Tactical Vehicle (MTV) capable of lethal target engagement from a short halt out to 7 kilometers. Complete testing and optimization of barrel length, rifling twist rate, and suppression of the .300 Blackout rifle platform in conjunction with an underwater supercavitating ammunition. Complete development of a High Frequency (HF) radio integrated into a cellular phone for use in low-profile operations. Complete development of a new ballistic algorithm, projectile drag coefficient, and weapon system for lethal target engagement beyond 2,500 meters. Complete development of a compact, wide exit pupil direct view optic for use on lightweight medium machine guns to effectively engage targets at the maximum effective range of the weapon system. Complete test and evaluation of an all-in-one wall breaching charge frame capable of breaching heavily reinforced concrete walls in one stage for conventional and Special Operations Forces. Continue development of a man-portable (dismounted\/static), on-the-move (vehicle mounted), and kinetic kill anti-drone system kit that is capable of detection, tracking, identification, and defeating a small Unmanned Aircraft System (sUAS). Initiate development of a small unmanned aerial system gunship with a modular kinetic payload for lethal engagements. Initiate development and testing of a thermal camouflage material for soldier uniforms, vehicles, and hide sites. Initiate development of a clip-on in-line mid-wave infrared thermal sight for use on lightweight medium machine guns, sniper rifles, and for counter-UAS missions. Initiate development of a vertical take-off and landing loitering munition for engagement of targets in urban areas and defilade for Special Operations Forces. Initiate development of lightweight ammunition packaging to replace the standard M2A1 ammunition for use in logistical re-supply by conventional and Special Operations Forces. Initiate development of a family of intermediate caliber weapon systems, including ammunition, for use in close quarters combat, designated marksmen, and individual weapon system roles. Initiate test and evaluation of a stabilized weapon mount for employment on ground vehicles, airframes, and maritime platforms. Initiate test and evaluation of a commercially available cluster munition to determine its efficacy in reducing the dud rate to less than one percent."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.058"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.438"
                                            },
                                            "Text": {
                                                "val": "Complete development of a clip-on in-line mid-wave infrared thermal sight for use on lightweight medium machine guns, sniper rifles, and for counter-UAS missions. Complete development of a vertical take-off and landing loitering munition for engagement of targets in urban areas and defilade for Special Operations Forces. Complete development of lightweight ammunition packaging to replace the standard M2A1 ammunition for use in logistical re-supply by conventional and Special Operations Forces. Complete development of a man-portable (dismounted\/static), on-the-move (vehicle mounted), and kinetic kill anti-drone system kit that is capable of detection, tracking, identification, and defeating a small Unmanned Aircraft System (sUAS). Complete development and testing of a thermal camouflage material for soldier uniforms, vehicles, and hide sites. Complete test and evaluation of a stabilized weapon mount for employment on ground vehicles, airframes, and maritime platforms. Complete test and evaluation of a commercially available cluster munition to determine its efficacy in reducing the dud rate to less than one percent. Continue development of a small unmanned aerial system gunship with a modular kinetic payload for lethal engagements. Continue development of a family of intermediate caliber weapon systems, including ammunition, for use in close quarters combat, designated marksmen, and individual weapon system roles. Initiate development of an advanced weapon sight capable of ranging, tracking, and providing real-time ballistic shooting solutions for individual weapon systems. Initiate development of a low-cost tactical sUAS that complies with current DoD cyber hardening policy. Initiate development of a communications kit optimized for use in subterranean and complex urban terrain. Initiate development of a dual channel near infrared and long wave infrared sight for individual weapon systems. Initiate development of highly accurized ammunition for next generation sniper systems. Initiate development of an electronic warfare kit optimized for use in subterranean and complex urban terrain. Initiate integration of a gimbaled laser target designator on various sUAS platforms for terminal guidance operations. Initiate development of a sense through the wall capability for tactical operators. Initiate development of a rapid, low-collateral damage window breaching mechanism. Initiate development of a remotely controlled identify friend\/foe and lighting capability for multipurpose canines."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "8.620"
                                            },
                                            "Text": {
                                                "val": "Initiate development of a low cost tactical sUAS that complies with current DoD cyber hardening policy. Initiate development of a communications kit optimized for use in subterranean and complex urban terrain. Initiate development of a dual channel near infrared and long wave infrared light for individual weapon systems. Initiate development of highly accurized ammunition for next generation sniper systems. Initiate development of an electronic warfare kit optimized for use in subterranean and complex urban terrain. Initiate integration of a gimbaled laser target designator on various sUAS platforms for terminal guidance operations. Initiate development of a sense through the wall capability for tactical operators. Initiate development of a rapid, low-collateral damage window breaching mechanism. Initiate development of a remotely controlled identify friend\/foe and lighting capability for multipurpose canines. Initiate development of a non-emissive wind sensing capability for sniper teams. Initiate development of a next-generation undersea propulsion mechanism for divers. Initiate development of a maritime camouflage system for insertion operations. Initiate development of a system to kinetically engage maritime platforms from rotary wing platforms for vessel stopping."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to changes in Congressional Add funding."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGY DEVELOPMENT"
                                    },
                                    "Description": {
                                        "val": "The TTD Subgroup’s objective is to provide SOF, DoD, and the interagency with agile, rapid response, R&D capabilities for optimizing performance in the operational environment and increasing readiness for tomorrow’s threats. To meet this objective, the subgroup develops human-centered technologies that are performance outcome focused in the areas of immersive learning technology; human performance tools and techniques; mobile learning solutions; and innovative training and educational concepts. TTD’s capabilities are implemented globally to prepare for critical missions in any operational environment to identify, disrupt, and defeat terrorist threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.257"
                                            },
                                            "Text": {
                                                "val": "Complete an evaluation of tools and techniques used by Special Operations to optimize and maintain cognitive performance through a comprehensive literature review and controlled study. Complete the implementation refinement of a program and next generation technology designed to enhance visual acuity and improve operational visual task performance. Complete the development of task force officer verification and refresher training accessible via a mobile device application. Complete the development of a virtual reality training part task trainer capability for pre-mission tasks associated with AC-130 operations. Complete the evaluation of a reactive shooter course incorporating wearable device human performance measures and training simulation technology. Complete the development of training software for officers to accomplish immersive use of force decision-making training from a desktop computer. Complete the development of an automated capability to automatically diagnose shooter performance. A full analysis of data collected from sight alignment, breathing, trigger process, and shot placement will be provided to coaches and instructors to enhance individual fundamental shooting skills. Continue the development of a Virtual Reality (VR) simulated city environment where students will be immersed into realistic training scenarios, such as surveillance, with representative quantities and behaviors of non-player characters (NPCs) including people and vehicles. Initiate the development of interactive instructional videos consisting of human like avatars demonstrating applied Explosive Ordnance Disposal skills for use as instructional aids in the classroom and student independent study. Initiate the development and evaluation of a synthetic intelligence, surveillance, and reconnaissance (ISR) system to train Full Motion Video (FMV) ISR operational knowledge, skills, and abilities without incurring the costs of utilizing live ISR platforms. Initiate the enhancement of an existing human performance application to incorporate the recording and analysis of mental performance indicators such as stress, motivation, and fatigue thereby providing a common language for instructors, psychologists, and human performance coaches to understand and make decisions about training. Initiate the development and evaluation of an immersive virtual reality training and exercise environment integrated with tools and techniques, such as heart rate monitoring and brain imaging, to objectively assess training effectiveness based on human performance research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.050"
                                            },
                                            "Text": {
                                                "val": "Complete the development and evaluation of an automated capability for the Unites States Marine Corps to immediately diagnose shooter performance thereby enhancing coaches and instructor's capabilities for optimizing individual fundamental shooting skills. Complete the development of interactive instructional videos consisting of human like avatars demonstrating applied Explosive Ordnance Disposal skills for use as instructional aids in the classroom and student independent study. Complete the development and evaluation of a synthetic intelligence, surveillance, and reconnaissance (ISR) system to train Full Motion Video (FMV) ISR operational knowledge, skills, and abilities without incurring the costs of utilizing live ISR platforms. Complete the development of a virtual reality (VR) based training system for Public Safety Bomb Technicians and Military Explosive Ordnance Disposal forward teams to practice sensitive site exploitation skills with realistic lab equipment in simulated field and lab settings. Continue the enhancement of an existing human performance application to incorporate the recording and analysis of mental performance indicators such as stress, motivation, and fatigue thereby providing a common language for instructors, psychologists, and human performance coaches to understand and make decisions about training. Initiate the development of a program of instruction (POI) and training support package for the operation and maintenance of the electro-drive recoil mortar systems. Initiate the development of an interactive and dynamic Full Motion Video (FMV) Processing Exploitation, and Dissemination (PED) desktop training simulator that trains SOF analysts to SOF-specific FMV PED tactics, techniques, and procedures; methodologies; and product standards.  Initiate the development of a multi-sensory (e.g. visual, auditory, tactile) immersive tactical decision making training simulator that features realistic character representation, reaction, and interaction through response to natural language processing and force application. Initiate the development of an immersive mixed reality (MR) simulator for training specific emergency procedures (EPs) for the MK-16 self-contained diving rig often used for Mine Countermeasures operations.  Initiate the development and evaluation of a synthetic Internet sandbox to enable intelligence analysts and information operations personnel to train on tools and methodologies for the collection, analysis, and exploitation of adversary’s publicly available information (PAI), as well as engaging in large-scale Information Operations (IO) exercises, while mitigating the challenges and risks associated with training on the open, publicly visible Internet."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.558"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.818"
                                            },
                                            "Text": {
                                                "val": "Complete the enhancement of an existing human performance application to incorporate the recording and analysis of mental performance indicators such as stress, motivation, and fatigue thereby providing a common language for instructors, psychologists, and human performance coaches to understand and make decisions about training. Complete the development of a program of instruction (POI) and training support package for the operation and maintenance of the electro-drive recoil mortar systems. Complete the development of an interactive and dynamic Full Motion Video (FMV) Processing Exploitation, and Dissemination (PED) desktop training simulator that trains SOF analysts to SOF-specific FMV PED tactics, techniques, and procedures; methodologies; and product standards.  Complete the development of a multi-sensory (e.g. visual, auditory, tactile) immersive tactical decision making training simulator that features realistic character representation, reaction, and interaction through response to natural language processing and force application. Complete the development of an immersive mixed reality (MR) simulator for training specific emergency procedures (EPs) for the MK-16 self-contained diving rig often used for Mine Countermeasures operations. Continue the development and evaluation of a synthetic Internet sandbox to enable intelligence analysts and information operations personnel to train on tools and methodologies for the collection, analysis, and exploitation of adversary’s publicly available information (PAI), as well as engaging in large-scale Information Operations (IO) exercises, while mitigating the challenges and risks associated with training on the open, publicly visible Internet.  Initiate the development of photorealistic immersive training environments to replicate high-risk scenarios and standardize curriculum for Explosive Ordnance Disposal technicians and other operators. Initiate the development of a wireless system of GPS beacons and tablet-based software program for objectively assessing shooter performance during Close Quarters Combat or house\/building clearing operations training. Initiate the development of a program of instruction to teach physical and cognitive enhancement methods and incorporate human performance measurement technologies to evaluate and validate the methods taught. Initiate the development of an intelligent tutoring system that will instruct Soldiers in how to integrate and interpret operations, intelligence, and civil information within the Common Operating Picture for enhanced situational awareness and reduced cognitive workload. Initiate the development of a virtual reality training software tool with a wearable ocular display interface that enables students and operators to interface with physical arming and firing features of thousands of user-selected ordnance items."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "1.740"
                                            },
                                            "Text": {
                                                "val": "Initiate the development of an AC-130J Virtual Reality Combat Mission Trainer to enable operational crews to engage in mission tasks within a simulated environment that replicates sensory information of real-world mission performance found in joint mission essential task (JMET) environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor changes and increases are reflective of departmental priorities."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603121D8Z"
                                    },
                                    "Title": {
                                        "val": "SO\/LIC Advanced Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.100"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.202"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.306"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.412"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}