{
    "id": "2020-Navy-PB-1319-MJBOOK-0-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-3",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602114N"
        },
        "ProgramElementTitle": {
            "val": "Power Proj Applied Research"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "23.028"
            },
            "CurrentYear": {
                "val": "27.643"
            },
            "BudgetYearOne": {
                "val": "18.546"
            },
            "BudgetYearOneBase": {
                "val": "18.546"
            },
            "BudgetYearTwo": {
                "val": "19.583"
            },
            "BudgetYearThree": {
                "val": "23.743"
            },
            "BudgetYearFour": {
                "val": "25.048"
            },
            "BudgetYearFive": {
                "val": "29.341"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Research and Development Framework.  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE supports both advanced technology research and near to mid-term transition opportunities.  The advanced research focus is primarily on directed energy, high speed weapon propulsion, and electro-optic\/infrared (EO\/IR) sensor technologies. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.553"
                },
                "CurrentYear": {
                    "val": "14.643"
                },
                "BudgetYearOne": {
                    "val": "14.610"
                },
                "BudgetYearOneBase": {
                    "val": "14.610"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.028"
                },
                "CurrentYear": {
                    "val": "27.643"
                },
                "BudgetYearOne": {
                    "val": "18.546"
                },
                "BudgetYearOneBase": {
                    "val": "18.546"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "9.475"
                },
                "CurrentYear": {
                    "val": "13.000"
                },
                "BudgetYearOne": {
                    "val": "3.936"
                },
                "BudgetYearOneBase": {
                    "val": "3.936"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "13.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.524"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.936"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.936"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "10.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The program increase in FY 2020 is associated with an increased concentration on the applied research of Air Weapons."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Power Proj Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "13.372"
                        },
                        "CurrentYear": {
                            "val": "14.643"
                        },
                        "BudgetYearOne": {
                            "val": "18.546"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.546"
                        },
                        "BudgetYearTwo": {
                            "val": "19.583"
                        },
                        "BudgetYearThree": {
                            "val": "23.743"
                        },
                        "BudgetYearFour": {
                            "val": "25.048"
                        },
                        "BudgetYearFive": {
                            "val": "29.341"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses the technology issues involving the Navy's capability to project naval power on the broad seas and in the littoral regions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DIRECTED ENERGY"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop Directed Energy technology for Navy applications. The DE program addresses the requirements of future Navy combatants to provide ship defense against the emerging threats that are proliferating throughout the Navies of the world. The Directed Energy portion of this activity consists of two elements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.494"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy Research:\nInitiate research in component technologies and basic understanding of laser\/material interactions to enable higher power, more lethal High Energy Laser, high power Microwave\/Radio Frequency, and Ultra Short Pulse Laser (USPL) weapons capabilities. Some examples of research include the development of novel laser and beam directory architectures, improved sensor and illuminator technologies including materials and coating, improved HEL electrical to optical efficiency, improved laser sources with enhanced spectrum control, reduced system jitter and improved precision aim point maintenance. Other research areas that will be explored are the syntheses of target recognition, pose\/trajectory estimation, autonomous aim point selection and maintenance including tracking through intermittent viewing conditions such as waves and clouds, understanding atmospheric characterization and modeling tools, blooming, laser\/material\/target interactions, novel laser sources in Medium Wavelength Infrared (MWIR) and Long Wavelength Infrared (LWIR) (4-12 microns), USPL propagations and effects. Research will continue in Counter Directed Energy Weapons (CDEW), in response to the development of high energy laser (HEL) and high-power microwave (HPM)\/high-power radio frequency (HPRF) threats. Complete effort to develop a fiber based high power laser operating in the eye safe regime beyond 2 microns.\n\nElectronics \n\nDevelop & apply innovative S&T in plasmas, pulsed power, electromagnetic acceleration, particle beams, high-energy & ultra-short-pulse lasers (USPL), and non-linear optics to support current and future Navy and DoD needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.463"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy Research:\nContinue research and thrusts in component technologies and basic understanding of laser\/material interactions to enable higher power, more lethal High Energy Laser, high power Microwave\/Radio Frequency, and Ultra Short Pulse Laser weapons capabilities. Some examples of research include the development of novel laser and beam directory architectures, improved sensor and illuminator technologies including materials and coating, improved HEL electrical to optical efficiency, improved laser sources with enhanced spectrum control, reduced system jitter and improved precision aim point maintenance. Other research areas that will be explored are the syntheses of target recognition, pose\/trajectory estimation, autonomous aim point selection and maintenance including tracking through intermittent viewing conditions such as waves and clouds, understanding atmospheric characterization and modeling tools, blooming, laser\/material\/target interactions, novel laser sources in Medium Wavelength Infrared (MWIR) and the Long Wavelength Infrared (LWIR)-(4-12 microns), USPL propagations and effects. Research will continue in Counter Directed Energy Weapons (CDEW), in response to the development of high energy laser (HEL) and high-power microwave (HPM)\/high-power radio frequency (HPRF) threats. Complete effort to develop a fiber based high power laser operating in the eye safe regime beyond 2 microns.\n\nElectronics:  Continue applied research efforts to apply innovative Science and Technology (S&T) in plasmas, pulsed power, electromagnetic acceleration, particle beams, high-energy & Ultra Short Pulse Lasers (USPL), and non-linear optics to support current and future Navy and DoD needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.427"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.427"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research efforts and thrusts in component technologies and basic understanding of laser\/material interactions to enable higher power, more lethal High Energy Laser (HEL), high power Microwave\/Radio Frequency, and Ultra Short Pulse Laser (USPL) weapons capabilities. Some examples of research include the development of novel laser and beam directory architectures, improved sensor and illuminator technologies including materials and coating, improved HEL electrical to optical efficiency, improved laser sources with enhanced spectrum control, reduced system jitter and improved precision aim point maintenance. Other research areas that will be explored are the syntheses of target recognition, pose\/trajectory estimation, autonomous aim point selection and maintenance including tracking through intermittent viewing conditions such as waves and clouds, understanding atmospheric characterization and modeling tools, blooming, laser\/material\/target interactions, novel laser sources in Medium Wavelength Infrared (MWIR) and the Long Wavelength Infrared, USPL propagations and effects. Research will continue in Counter Directed Energy Weapons (CDEW), in response to the development of HEL and high-power microwave (HPM) and high-power radio frequency threats. Complete effort to develop a fiber based high power laser operating in the eye safe regime beyond 2 microns.\n\nElectronics: Conduct applied research efforts to apply innovative Science and Technology (S&T) in plasmas, pulsed power, electromagnetic acceleration, particle beams, high-energy & Ultra Short Pulse Lasers, and non-linear optics to support current and future Navy and DoD needs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HIGH SPEED PROPULSION AND ADVANCED WEAPON TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Applied Research into a wide range of technologies that support high speed weapons work in this activity is focused on demonstrating propulsion and vehicle technologies for Mach 3 to Mach 8 or beyond capable weapons. This work includes technologies associated with high-acceleration projectile structures, high temperature and high strength materials to enable projectiles to survive high-speed launch environment, improved thermal prediction methodologies and test techniques, wide dynamic pressure adaptable projectile controls and non-explosively launched lethal mechanisms. The high speed projectile technologies are intended to support long range Naval Surface Fire Support weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Examples of current investments include topics relevant for development of high speed\/hypersonic aerodynamics technologies to support exploratory development to enable very long range hypersonic boost-glide missiles and hypersonic ship-launched projectiles. Specific research and development plans include:  development of  very long range hypersonic boost-glide missiles and hypersonic ship-launched projectiles;  advanced computational and experimental techniques for hypersonic boundary layer transition;  high temperature thermal management research; ultra-high temperature materials research for hypersonic leading edges and nose tips; technology maturation of advanced airframes and controls;  high G-force components and miniaturization of electronics; advanced guidance and control technologies for high speed weapons;  insulator and ablative technology investigations; high speed propulsion and integrated airframe technology development to enhance system range, responsiveness, and reliability;  and advanced material solutions to high speed airframes and air systems operating in maritime environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.878"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue current investments to include topics relevant for development of high speed\/hypersonic aerodynamics\ntechnologies to support exploratory development to enable very long range hypersonic boost-glide missiles and hypersonic\nship-launched projectiles. Specific research and development plans include continued development of very long range hypersonic boost-glide missiles and hypersonic ship-launched projectiles; advanced computational and experimental techniques for hypersonic boundary layer transition; high temperature thermal management research; ultra-high temperature materials research for hypersonic leading edges and nose tips; technology maturation of advanced airframes and controls; high Gforce components and miniaturization of electronics; advanced guidance and control technologies for high speed weapons; insulator and ablative technology investigations; high speed propulsion and integrated airframe technology development to enhance system range, responsiveness, and reliability; and advanced material solutions to high speed airframes and air systems operating in maritime environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investments to include topics relevant for development of high speed propulsion for solid rocket motors and hybrid type propulsion technologies such as solid-fuel ramjets for greatly enhanced projectile range and missiles. High-speed and hypersonic external aerodynamic technologies will be investigated to support future development efforts to enable hypersonic boost-glide missiles and hypersonic ship-launched projectiles. \n\nSpecific research and development plans include continued development of very long range hypersonic boost-glide missiles and hypersonic ship-launched projectiles; advanced computational and experimental techniques for hypersonic boundary layer transition; high temperature thermal management research; ultra-high temperature materials research for hypersonic leading edges and nose tips; technology maturation of advanced airframes and controls; high G-force components and miniaturization of electronics; advanced guidance and control technologies for high speed weapons; insulator and ablative technology investigations; high speed propulsion and integrated airframe technology development to enhance system range, responsiveness, and reliability; and advanced material solutions to high speed airframes and air systems operating in maritime environments."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increases from FY 2019 to FY 2020 are associated with an increased concentration on the applied research of Air Weapons such as hypersonic ship launched strike weapons."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVIGATION, ELECTRO OPTIC\/INFRARED (EO\/IR), AND SENSOR TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This activity describes Navy Science and Technology investments in the areas of Electro Optic\/Infrared (EO\/IR) devices and advanced sensors and includes investment\/performance in the technology areas of EO\/IR, Electronic Warfare (EW), Electromagnetic Warfare, and Communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.521"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronic Warfare:\n- Continue the development of an active optics system that can survey a wide area and instantly, nonmechanically zoom-in on an area of interest for target tracking\/identification.\n- Continue development of new processes\/methodologies to enable construction of composite countermeasures that fit the engagement timeline while maintaining effectiveness against existing and emerging IR guided threats.\n- Continue effort to develop mid & long wave IR focal plane arrays using graded-band gap W-type-II. Superlattices with much higher detectivity than that of state-of-the-art HgCdTe (MCT).\n- Continue development of next generation IR focal plane sensor and countermeasures to defeat it.\n- Continue research to apply manifold modeling and optimal control techniques to airborne EO\/IR sensor systems.\n- Continue development of novel photovoltaic and autonomous soaring technology to enable long range EW sensor delivery systems.\n-Complete development of novel photovoltaic and autonomous soaring technology to enable long range EW sensor delivery systems.\n-Complete development of methodology to concatenate nanoparticle structures for spectral control of obscurant material.\n\n\nElectro Optic\/Infrared\n\n- Continue development of next generation IR focal plane sensor and countermeasures to defeat it.\n- Continue research to apply manifold modeling and optimal control techniques to airborne EO\/IR sensor systems.\n- Continue development of methodology to concatenate nanoparticle structures for spectral control of obscurant material\n- Continue development and prove a method of more efficiently transporting EW sensors using a low Reynolds Number regime boundary layer control system.\n- Continue development of a water assisted take-off process for electronic warfare sensors.\n- Continue development of advanced fuel cell technology for UAS to increase on-station time of EW sensors.\n- Continue efforts for Unmanned Aerial System (UAS) Based EW: The objective is to develop a System of Systems (SoS) able to artificially create the appearance of a realistic naval force to many adversary surveillance and targeting sensors simultaneously. It will benefit the warfighter by providing battle space confusion to adversary surveillance and targeting systems both above and below water, creating seamless cross-domain countermeasure coordination, and enabling rapid advanced technology\/capability insertion to counter emerging threats. Technology developments will include reconfigurable and modular EW payloads, Distributed Decoy and Jammer Swarms (DDJS), effective acoustic countermeasures (CM), and Multiple Input\/Multiple Output Sensor\/CM (MIMO S\/CM) for false force generation to both above and below water sensors.\n- Continue development of ultra-low noise uncooled nanotechnology infrared sensors.\n- Continue development of nanoatomic sensor nonvolatile memories.\n- Continue development of electronic field of view and zoom imagers.\n- Conduct multiple efforts of EO\/IR threats through both active and passive countermeasures technologies and assuring deployment capabilities are available to achieve the proper disposition of materials for extended durations.\n\n\nElectronics \n-Create and explore new concepts, components, techniques, and subsystems for the detection of UV, visible, and infrared radiation to support current and future Navy and DoD needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.570"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics:  Efforts to create and explore new concepts, components, techniques, and subsystems for the detection of UV, visible, and infrared radiation to support current and future Navy and DoD needs.\n\nElectromagnetic Warfare:  Conduct multiple efforts to address the necessary technologies to engage Electro Optic\/Infrared (EO\/IR) threats through both active and passive countermeasures technologies and assuring deployment capabilities are available to achieve the proper disposition of materials for extended durations.  Recent results in the application of new material concepts applied to IR concepts have received interest for potential follow on consideration pending successful demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.596"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronics:  Create and explore new concepts, components, techniques, and subsystems for the detection of Ultra-violet (UV), visible, and infrared radiation to support current and future Navy and DoD needs with attention given to quantum enabled precise time, and magnetic and gravimetric sensing.\n\nElectromagnetic Warfare: Multiple efforts will be executed to address the necessary technologies to engage Electro Optic\/Infrared threats through both active and passive countermeasures technologies and assuring deployment capabilities are available to achieve the proper disposition of materials for extended durations. Recent results in the application of new material concepts applied to IR concepts have received interest for potential follow on consideration pending successful demonstrations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STRIKE AND LITTORAL COMBAT TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The focus of this activity is on those technologies that will support Naval Precision Strike Operations and provide the Navy of the future the ability to quickly locate, target, and strike critical targets ashore."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.708"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research in Advanced Radio Frequency\/Electro Optic (RF\/EO) Sensor & Seeker Technologies for Navy and Marine Corp operations and systems.\n\nElectromagnetic Warfare:\n\nTechnology development is ongoing to address capabilities to understand the defeat mechanism for operations of ISR platforms using non-traditional frequencies as well as protecting current capabilities against electronic attack through enhanced concepts.   The non-traditional integration of ISR capabilities is being implemented into a major Commercialization Pilot Program (CPP) funded effort at NRL to validate expectations at minimal cost to this program and expand the capability of a significant testing resource."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare: \n\nTechnology development is ongoing to address capabilities to understand the defeat mechanism for operations of ISR platforms using non-traditional frequencies as well as protecting current capabilities against electronic attack through enhanced concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.749"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.749"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare: Technology development is ongoing to address capabilities to understand the defeat mechanism for operations of Intelligence Surveillance and Reconnaissance (ISR) platforms using non-traditional frequencies as well as protecting current capabilities against electronic attack through enhanced concepts.   The non-traditional integration of ISR capabilities is being implemented into a major Commercialization Pilot Programs (CPP) funded effort at NRL to validate expectations at minimal cost to this program and expand the capability of a significant testing resource."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This Program Element (PE) develops early component technologies that can be integrated into weapon systems that meet warfighter requirements.  Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).  The metrics used to evaluate 6.2 programs are necessarily less precise than those used in 6.3 programs. \n\nThe metrics for this PE can be divided into two categories:  technological and organizational\/functional.  Technological metrics address the success of the work performed.  The primary technological metrics used in this PE involve laboratory experiments\/tests demonstrating proof of the concept for the technology.  This demonstration is frequently a hand-assembled functioning breadboard of the concept.  The organizational\/functional metrics applied to this PE include:  transition of the technology to advanced development in a 6.3 PE and applicability of the technology to documented warfighter problems or requirements.  Successful implementation of these categories would result in the application of a pass\/fail metric and further evaluation for possible transition to a 6.3 development\/demonstration program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "9.656"
                        },
                        "CurrentYear": {
                            "val": "13.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.656"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "High Performance Microwave for Counter-IED Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.828"
                                        },
                                        "Text": {
                                            "val": "Explore the effectiveness of High Power Microwave (HPM) weapons.  Perform detailed modeling and simulation of emerging threats to Naval forces, including developing new tools to better predict the effectiveness of HPM weapons.  The outputs from the simulation work will be experimentally verified and utilized to inform future technology investments in solid state HPM technologies for improved capabilities. Detailed size, weight and power trade-off studies of candidate solid state technologies performed to enable conceptual design development."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "9.000"
                                        },
                                        "Text": {
                                            "val": "Funds will be used towards the isolating\/determining high power microwave (HPM) waveform spaces that enable control over desired levels-of-lethality on small unmanned aerial vehicle (sUAV) and similar targets, with the least power density, to drive development of transitionable HPM sources and electronically steerable radiators."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Optics"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.828"
                                        },
                                        "Text": {
                                            "val": "The Navy is exploring the potential to defeat anti-ship cruise missiles (ASCM) with laser weapons.  It is generally believed that adaptive optics will be critical to compensate for atmospheric effects that would otherwise degrade the effectiveness of a laser for this critical mission.  The FY18 appropriation will be used to mature technology and scientific understanding that advances the Navy's ability to use adaptive optics in future laser weapons."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Develop advanced components for use in directed energy applications."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}