{
    "id": "2020-Navy-PB-1319-MJBOOK-0-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-5",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602131M"
        },
        "ProgramElementTitle": {
            "val": "Marine Corps Lndg Force Tech"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "54.526"
            },
            "CurrentYear": {
                "val": "63.212"
            },
            "BudgetYearOne": {
                "val": "56.604"
            },
            "BudgetYearOneBase": {
                "val": "56.604"
            },
            "BudgetYearTwo": {
                "val": "50.623"
            },
            "BudgetYearThree": {
                "val": "51.624"
            },
            "BudgetYearFour": {
                "val": "52.674"
            },
            "BudgetYearFive": {
                "val": "53.728"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) addresses demand signals emphasized by the Commandant of the Marine Corps, the Chief of Naval Operations, and the Chief of Naval Research, as well as those pulled from dynamic engagement with stakeholders. Research efforts are carefully selected to ensure they have the potential to expand warfighting capabilities, inform operational concepts and requirements development, and advance state of the art technology and scientific knowledge.  Current guidance also highlights the need to accelerate our pace of development and guide the approach to rapid experimentation, prototyping, and learning.\n\nAs reflected in the Marine Corps Operating Concept, the current strategic guidance from the Commandant, Expeditionary Forces will conduct maneuver warfare in environments characterized by complex terrain, technology proliferation, information used as a weapon, a battle of signatures, and an increasingly contested maritime domain. Additionally, an emergent operation stressor is the contested urban environment which exemplifies the characterizations listed above. The urban environment is one of the most complex terrains with physical compartmentalization and canalization, additional physical dimensions (subterranean and multi-story structures), crowded conditions and associated threat obscuration, communications challenges, informational and human aspects, and proliferation of observation and fires technologies. This environment requires capabilities addressing all the activities within this PE and while it provides many challenges, unique opportunities are also presented and can further shape technology approaches. \n\nThese future challenges and portents demand robust technologies for the Marine Corps, but the technology options are constrained. They must have a lightweight deployable character, and the ability to operate in austere conditions with little fixed infrastructure or support while retaining the agility and lethality of an integrated maneuver force. Technology must provide full spectrum capability against robust and complex peer and near-peer adversaries while meeting Size, Weight, Power, Post limitations, and information availability within Distributed, Intermittent and Limited environments. \n\nThe approach within this PE encompasses ideas that support both revolutionary and evolutionary capabilities, and in this way considers and balances both \"push\" and \"pull\" aspects of technology projects. Due to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.936"
                },
                "CurrentYear": {
                    "val": "59.607"
                },
                "BudgetYearOne": {
                    "val": "56.604"
                },
                "BudgetYearOneBase": {
                    "val": "56.604"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "54.526"
                },
                "CurrentYear": {
                    "val": "63.212"
                },
                "BudgetYearOne": {
                    "val": "56.604"
                },
                "BudgetYearOneBase": {
                    "val": "56.604"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.590"
                },
                "CurrentYear": {
                    "val": "3.605"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.395"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "7.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.409"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "2.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Cyber Pure Line Item redistribution realigned $6.273M from Project 3001 into Project 2958."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2958"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Activities"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.273"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.273"
                        },
                        "BudgetYearTwo": {
                            "val": "5.877"
                        },
                        "BudgetYearThree": {
                            "val": "6.005"
                        },
                        "BudgetYearFour": {
                            "val": "6.125"
                        },
                        "BudgetYearFive": {
                            "val": "6.248"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The plans and associated programs contained in this Project are realigned from the Expeditionary CYBER Project 3001 in PE: 0602131M MARINE CORPS LNDG FORCE TECH beginning in FY 2020."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Cyber"
                                    },
                                    "Description": {
                                        "val": "This activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cyber related research will be conducted to develop methodologies to securely transfer information real-time across security boundaries for tactical users. Research will expand upon general cyber health assessments for distributed systems to understand cyber resilience for systems-of-systems. Develop new algorithms and tools to demonstrate Cyber-EW capabilities for tactical engagement. Cyber-related approaches will be used to better characterize digital waveforms for better situational awareness."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2020 is due to realignment of Expeditionary Cyber from the Expeditionary Cyber R-2 Activity in Project 3001 and placed into Project 2958 beginning in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this Project is the development, demonstration, and assessment of technologies that represent capabilities to meet unique Marine Corps needs in conducting Expeditionary Cyber Warfare in the future.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3001"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps Landing Force Tech"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "52.595"
                        },
                        "CurrentYear": {
                            "val": "56.212"
                        },
                        "BudgetYearOne": {
                            "val": "50.331"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.331"
                        },
                        "BudgetYearTwo": {
                            "val": "44.746"
                        },
                        "BudgetYearThree": {
                            "val": "45.619"
                        },
                        "BudgetYearFour": {
                            "val": "46.549"
                        },
                        "BudgetYearFive": {
                            "val": "47.480"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds applied research; technology assessment, road mapping, and concept development; and less technologically mature projects within the Future Naval Capability (FNC) process as means to inform, enhance, enable, and invent future concepts and capabilities with new Science and Technology (S&T). This project is organized into ten activities, the core of which is represented by the eight Expeditionary Warfighting Capability Areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMMAND, CONTROL, COMMUNICATIONS, AND COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity investigates robust, resilient, and secure networked communications pathways and capability that support an expeditionary force's distributed and disaggregated operations. Research supports both networked and local computation for communications that exploits the expeditionary forces close physical proximity to threats while mitigating shortfalls commiserate within Distributed, Intermittent and Limited environments. Expeditionary forces must operate in the cyber domain and in addition to defending communications networks, vehicles, and weapons systems, are reliant on electronic controllers for basic operations and as such are susceptible to cyber attacks.\n\nTechnologies addressed within this activity include secure, robust, self-forming, mobile communications networks; distributed computing to support information dissemination to all echelons; improved capabilities in over-the-horizon, beyond line-of-sight, and restricted environment communications and sensors; and software and data processing to support formation of an appropriate common picture. Other efforts include power management, low detectability, conforming to Size, Weight, Power, Cost constraints, and interoperability within the joint environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of urban\/restricted environment communications technologies.\n- Continue Adaptable Antennas, Self-Adapting Radio Prototype and RF Technologies efforts.\n- Complete a limited distributed, Cyber Technology development effort.\n- Complete a meta-material antennas effort.\n- Complete an Electro-Magnetic Technologies effort.\n- Complete Cognitive Networking and Trusted Computing Technology efforts.  \n- Initiate Advanced Expeditionary Cyber Technology efforts.\n- Initiate Photonic Component Technologies\n- Initiate Full Duplex Technologies \n- Transfer all USMC applied research Cyber Technology to Expeditionary Cyber Activity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Understanding the lightweight, deployable character of expeditionary forces, efforts are focusing on the improving and expanding the operational capability of Command, Control, Communications and Computers which requires rethinking many of the underlying technologies. Investigations include increasing bandwidth and dynamic range in portable systems. Also included are electromagnetic signature management, countermeasure and interoperability technologies to manage control and exploitation of the electromagnetic spectrum. Focus is also on developing underlying technologies to enable multifunction operations at multiple-domain cryptography and security levels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Command, Control, Communications and Computers (C4) research focuses on operations in the challenging warfighter electromagnetic spectrum environment by making investments in the multifunction electronic warfare domains. Mission requirements include lightweight, portable, deployable systems for expeditionary forces. Investigations include increasing bandwidth and dynamic range in portable systems. Also included are electromagnetic signature management, machine learning, countermeasures and interoperability technologies to manage control and exploitation of the electromagnetic spectrum. Focus also includes developing underlying technologies to enable multifunction operations at multiple-domain cryptography and security levels. Research is closely coordinated with the Intelligence, Surveillance, and Reconnaissance and Expeditionary Cyber research to address the multifunction requirement of future systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIREPOWER"
                                    },
                                    "Description": {
                                        "val": "The activity investigates a large variety of weapons to provide the warfighter with a decisive, yet surgical, tactical advantage to collectively address 21st-century combined-arms warfare against peer and near-peer states. Research efforts increase the reach, lethality and capacity, while retaining mobility and tempo beneficial to expeditionary maneuver warfare. Maintaining focus on size, weight, power, cost Size, Weight, Power, Cost and Distributed, Intermittent and Limited environments stresses the technical solutions available.\n\nTechnologies being developed are intended for application on both current and future expeditionary weapons and elements of the kill chain. They include, but are not limited to, the following: fuze, fire control, launch\/propulsion, lethality, and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.131"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue investigation of the scalability of variable effects conventional munitions and gun technology for improving firepower effectiveness while increasing affordability and decreasing logistics burden in support of expeditionary warfare.\n- Continue development of precision fires engagement technologies, to include trajectory shaped 81mm mortars, 83mm missiles, and smaller precision munitions.\n- Continue design and development of lightweight technologies to provide individual Marines enhanced capabilities to detect and identify man-sized targets to the maximum effective ranges of their individual weapons, during all conditions (daylight, limited visibility, & darkness), by integrating multiple optics capabilities into a single system.\n- Continue Semi-Autonomous Fires Technology.\n- Continue Awareness for Lightweight Engagements and Remote Targeting (ALERT) to develop large \n- Complete Azimuth and Inertial Micro-electromechanical System (MEMS) Navigation System (AIM) to develop low cost, precision, inertial navigation systems for use in highly accurate handheld targeting systems, shoulder launched missiles, and munitions.\n- Complete development of concepts for a 155mm mortar or self-propelled Howitzer that would utilize existing stockpiles of 155mm artillery ammunition.\n- Complete Caseless, Lightweight, Low-volume Round (CLLVR) to develop lightweight, small caliber ammunition for individual, crew served, and remotely mounted weapons.\n- Initiate High-Reliability Dual Purpose Improved Conventional Munitions (DPICM) Replacement (HRDR) to develop high-reliability sub-munitions fuzing technologies.\n- Initiate development of concept for thin film materials to thermally mask equipment and munitions and provide counter rocket, artillery, and mortars (C-RAM) capability for future munitions.\n- Initiate development of concepts for a 155mm mortar or self-propelled Howitzer that would utilize existing stockpiles of 155mm artillery ammunition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.190"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This activity will continue research of end-to-end navigation technologies suitable for flight corrections of gun launched munitions in satellite and network denied environments.  Development of real-time, multi-spectral target detection and identification systems continue for individual shooters, providing anomaly and object detection and decision-aid algorithms.  Materials research focuses on thin film coatings that change how munitions interact with electromagnetic waves, and on novel materials and processes to improve energetic output of explosives. Munitions efforts will focus on increasing range and precision at low cost."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.595"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.595"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Resources in this activity will be used to conduct research in end-to-end navigation technologies suitable for shaping the trajectories of extended range, precision, gun-launched munitions in satellite- and network-denied environments. \nConduct research into real-time, multi-spectral target detection and identification technologies for individual shooters will continue in order to improve anomaly and object detection and decision-aid algorithms. Conduct\nresearch to develop thin film coatings that will change how munitions interact with electromagnetic waves, and for novel materials and processes to improve energetic output of explosives."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity investigates new ways and means to protect forces and materiel across all operational settings, from contested sea-land surface interfaces to complex urban environments. The portfolio protects against adversaries' challenges such as guided-rockets and missiles, mobile coastal artillery, threat Electronic Warfare, and counter Intelligence, Surveillance and Reconnaissance. Mines and obstacles both in the water and ashore also complicate amphibious landings. The activity invests in vehicle survivability aspects that are exacerbated due to Size, Weight, Power, Cost constraints inherent to Marine Corps operation and the harsh nature of the amphibious environment. \n\nTechnologies addressed include lightweight armor for ballistic and underbody blast protection, advanced sensors for counter tactical surveillance, active protection, and signature management. This activity also considers technology for payloads, packages and sensors that are needed by amphibious vehicles (both manned and unmanned) including mine counter measures; explosive hazard defeat systems; and obstacle and threat detection systems as well as technologies for improved protection for individuals against blast, ballistic and blunt impact threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.579"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of technologies for stand-off detection and neutralization of mines, IEDs, and Unexploded Ordnance (UXO).\n- Continue development of technologies to defeat side\/top attack and advanced mine fuzes (seismic, acoustic, and infrared) through advanced signature reduction, duplication, and projection.\n- Continue a program to determine the feasibility to detect and neutralize anti-helicopter mine threat.\n- Continue broad based material (ceramics, fiber and fiber re-enforced plastics) studies so that significant weight reductions (greater than 50%) can be achieved.\n- Continue studies to improve ballistic and blast armor material and systems models so that novel concepts can be evaluated and material property characteristics which provide the necessary improvements can be identified prior to significant monetary investments.\n- Continue a program to develop modular mission packages for the detection, neutralization, marking and reporting of explosive hazards using multiple, existing vehicles in movement to contact and amphibious raid scenarios.\n- Continue a program to study the use of autonomous vehicles in the detection, neutralization, marking and reporting of explosive hazards using multiple, existing vehicles in movement to contact and amphibious raid scenarios.\n- Complete Counter Rockets, Artillery, Mortars, and Sniper efforts addressing indications and warnings for pre-shot sniper detection and enabling detection of sniper observation and targeting in advance of a ballistic event.\n- Complete the development of technologies that will detect and classify optics (sniper scopes, ccds, eyeball, etc.) from a moving platform.\n- Complete the scientific investigation into an integrated PPE performance tool for assessing coordinated human and armor performance (mobility, back-face deformation, area of coverage, propensity for injury and mass).\n- Complete technology development programs to address force protection personal protective equipment capability gaps (Transitioned from Maneuver activity).\n- Complete the refinement and improve current suite of advanced biomechanical instrumentation to assess potential reductions of Warfighter mobility and functionality caused by PPE systems.\n- Complete modeling and simulation efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.\n- Complete the study of technologies to enable detection of explosive hazards and surveillance\/targeting systems in complex environments such as jungles and the littoral environment.\n- Initiate the study of technologies to enable detection of explosive hazards and surveillance\/targeting systems in complex environments such as jungles and the littoral environment.\n-Initiate projects that enable detection of explosive hazards and surveillance\/targeting systems in challenging operational environments based on previous study."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.670"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This activity is emphasizing developing miniaturized hardware sensing systems for the detection of threats across a variety of sensing modalities to include visual, thermal, RADAR, and Light Detecting and Ranging to take advantage of unique susceptibilities of threat systems at significant ranges.  Leveraging these sensor systems, there will be development of computer vision and machine learning approaches for automated target recognition within these innovative sensing modalities. Work also continues to track technologies in the area of passive armor but there will be decreasing investments in this area until basic research in materials science provide opportunities for significant improvement in protection levels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research will continue to focus on detecting ambush threats and surveillance of vehicles and personnel prior to reaching threat engagement range.  Sensing modalities and advanced algorithms leveraging computer vision and machine learning will continue to be developed to provide counter targeting and tactical surveillance.  Improve signature management and control, to include material development, will be explored.  Develop improved active protection system countermeasures to expand threat set and protected area and improve robustness to operational environments and enabling technologies for countering unmanned aerial vehicles through kinetic and directed energy means."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN PERFORMANCE, TRAINING AND EDUCATION"
                                    },
                                    "Description": {
                                        "val": "This activity investigates two technology investment areas, warrior resilience, and decision-making and expertise development. Warrior resilience is focused on advanced training technologies and methodologies that enhance neural, cognitive, and physical readiness. Decision making and expertise development accelerates the development and improves the retention of skills in decision making, situation awareness, and individual and team adaptability and coordination on decentralized, dynamic and dispersed battlefields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.153"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue studies into next generation physical performance enhancement methodologies and technologies (enhanced warfighter psycho-physical performance).\n- Continue research to evaluate the feasibility of integrating augmented reality technologies into current and emerging training systems.\n- Complete the development of foundational learning theories extended to complex tasks for a range of expertise levels, training mitigation strategies triggered by neurophysiological markers of learning, cognition and expertise, and principles of expertise development on a continuum of novice to expert.\n- Complete development of statistical methods for measuring small unit decision making (SUDM), using previous work on developing assessments of small unit decision making (e.g., Levels of Mastery), and provide a series of training sessions on statistical modeling to enable ground work to be laid by SUDM projects to also use statistical modeling.  \n- Complete research into the effects of glucose administration to mitigate stress reactions in trauma patients.\n- Complete design and development of an automated functional movement screening system to provide a low cost accurate solution for fit-for-duty evaluations and injury prevention training.\n- Initiate research into automated simulation content generation via a field worn sensor suite.\n- Initiate research for establishing optimal training intervals for improvement in physical performance and warrior mindset.\n- Initiate the use of augmented reality technologies into tactical decision making tools to support information dominance requirements.\n- Initiate research into developing artificial intelligence to support infantry simulation based training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.687"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "As efforts decrease in the areas of trauma mitigation and functional movement studies, focus will shift towards simulation-based training, operational decision tools, and physical training tools. Rapid advances in artificial intelligence and terrain and environment collection have provided an opportunity to explore potential impacts into tactical unit-level infantry training and mission planning. Efforts will investigate means with which to document, classify, and data collect on current training programs enabling the development of tools to enhance these programs to increase effectiveness and minimize injury. Efforts will also include an increase in training tools for operation in Electronic Warfare (EW) and Cyber contested environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Across the three technology investment areas of 'Warrior Resilience' (WR), 'Decision Making and Expertise Development' (DMED), and Operational Tools (OT) research will continue to focus on providing small unit leaders with effective training and tools to gain them the winning edge on the battlefield. These capabilities will provide information to the warfighter at the point of friction and with increased information flow (\"the right information, presented the right way, at the right time\") to aid cognitive reasoning about the effects of the battlefield - whether physical or physiological - and mitigation of negative aspects of combat. The WR portfolio will fund research into further understanding the necessity, and ability, to train front-line (infantry) troops for maximum performance. The DMED portfolio will research and implement state-of-the-art and science of learning-based training techniques to improve the development of small unit decision making expertise. The Operational Tools portfolio will increase the ability of the warfighter to process information and speed decision making by implementing novel data collection techniques (multi-spectral collection of signals across the electro-optical spectrum) and processing of these inputs for display - in real time, as the ultimate goal - directly to the individual who requires the information to make a timely, accurate decision."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity investigates enhanced situational awareness, persistent surveillance, and tactical decision making through automated analysis of data and rapid integration of information and acquired knowledge.  Specific technologies in this activity effectively present actionable information to decision-makers, especially those at the lower command levels.  This includes biometric monitoring for expeditionary operations, operational course of action (COA) development, and autonomous surveillance in support of distributed operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of capabilities to integrate socio-cultural models of human behavior with the ability to forecast the processes of decision making through predictive forecasting models.\n- Continue research to develop algorithms that can disambiguate complex network graphs containing millions of sparsely characterized nodes.\n- Continue research in deep machine understanding of information requirements relevant to amphibious warfare.\n- Continue research on technologies needed to enable multi-INT sensors to collaborate in real time on complex fusion tasks.\n- Continue a project to enable the synchronized planning and management and ISR assets given a set of disparate mission information requirements.\n- Continue effort to represent disparate data as a reduced feature vector.\n- Continue research in analytics for limited and isolated computational environments to enable advanced analytic capabilities to be available on expeditionary lightweight computing platforms.\n- Complete work on specific nanomaterial triggers and receptors.\n- Complete development of urban sensing technologies to detect weapons at distance.\n- Complete work on new optical taggants with improved producibility.\n- Complete development of low power consumption urban sensing technologies.\n- Complete development of information on demand technologies to provide the warfighter with the right information at the right time.\n- Complete efforts addressing \"battlespace awareness\" of human networks, improving the accuracy of classification decisions and enabling a human network predictive capability. Once a human network sensor can be defined and dynamically observed in a common feature space, predictive capabilities are realized. If one network is observed to be moving towards at risk behavior, a generalized force warning may be enabled addressing the threat associated with all networks with similar human network sensors. When combined, research into human network awareness, network classification and network prediction, will be a powerful tool for warfare against the irregular actor.\n- Complete research in automated techniques to establish the reliability of data from human and machine sources.  \n- Complete development of advanced analytics (data disambiguation, conditioning, fusion and dissemination) as a set of map reduce tasks that can run across highly distributed data architecture.\n- Complete research on the automated deconfliction and fusion of multi-intelligence tracks on movers of interest, enabled by a rich maritime ontology and active wiki technology.\n- Complete research in characterizing patterns of life from persistent track data.\n- Complete research on collapsing networks inferred from disparate data sources.\n- Complete research in representing the content of large data stores in a way that allows remote and accurate searching against data indexes to be enabled.\n- Complete development of distributed information architecture technologies.\n- Complete Actionable Intelligence for Expeditionary and Irregular Warfare effort which includes real-time methods for Identifying Human Networks.\n- Complete development of adaptable enemy course of action engine to manipulate adversary decisions.\n- Complete efforts to track entities of interest in a high clutter environment via geolocation of optical \ntags from a UAV platform.\n- Complete efforts to derive high resolution models of human networks statistically, with associated behavior attributes.\n- Complete technology development efforts required to enable a lightweight hyperspectral sensor capable of material characterization.\n- Complete research on technologies needed to produce products from multi-modal information in response to information requirements by leveraging cloud data access capabilities.\n- Complete effort to mature machine vision classifiers to the detection of specific objects from airborne video.\n- Initiate effort to mature machine vision classifiers to the detection of specific objects from airborne video.\n- Initiate effort to represent graph based representations of the information content of a cloud that can be shared over limited bandwidths between clouds.\n- Initiate effort to develop advanced query capabilities on no-SQL data bases.\n- Initiate effort to develop novel analysis capabilities applicable to open source data.\n- Initiate effort connecting tactical clouds to each other and connecting tactical clouds to traditional Marine Corps Tactical Service Oriented Architecture environments. The goal is that each cloud and non-cloud instance is able to replicate all (but only) mission critical data in a bandwidth efficient manner.  \n- Initiate research on using machine learning to project Measures of Effectiveness Performance based on Common Tactical Picture and Common Intelligence Picture content and on autonomous tactical decision support tools informed by these projections.   \n- Initiate research on using artificial intelligence to compose and trigger analytic workflows based on the content of big real-time data streams and research on training classifiers to predict links between insurgent groups and between insurgent groups and other entities over time.  \n- Initiate research on computational accuracy throttling and power mitigation strategies for real-time processors operating under constrained and fluctuating power resources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.969"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This activity will begin to divest investments in hardware centered approaches to low power sensing and advanced optical components for multi-spectral imagers.  However, investments in smart graphs, network shaping metrics, actionable visualizations will continue. Increased focus will be on investments in context aware (smart) Artificial Intelligence (AI), automation, machine learning, deep learning, and computer vision algorithms. Additionally work will begin on research in strong artificial intelligence applied to the domain of decision support (memory neural networks) and in context adaptive pattern recognition systems (looping), as well as to leverage foundational theory for reinforced learning"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.276"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.276"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research in applying supervised learning and unsupervised learning algorithms to the Naval domain.  Continue development of strong Artificial Intelligence as applied to both images and text. Accelerate development of algorithms that can infer patterns in common intelligence and tactical pictures useful to the development of decision support tools.  Accelerate the development of planners that can learn from historical data.  Develop a question answering capability that is relevant to the Naval domain.  Exam network formation, growth and fracture."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "USMC FNC TECHNOLOGY CANDIDATES"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity, formerly named USMC Future Naval Capabilities (FNCs), addresses the applied research associated with the Marine Corps' participation in the Department of the Navy's (DoN) Future Naval Capabilities (FNC) Program.  The objective of the work in this Program Element (PE) is to develop and mature technologies needed by the Marine Corps to initiate FNCs in PE 0603640M Marine Corps Advanced Technology Development (ATD) that can be commenced at higher Technology Readiness Levels (TRLs).  Investments in this activity are coordinated with similar and non-duplicative efforts in PE 0602750N Future Naval Capabilities Applied Research, where the Navy's participation in the FNC Program is funded.  The FNC Program was restructured for FY19 to accelerate transition to the Fleet and Force.  This restructuring involved a zero based review of all ongoing FNC projects where each effort was assessed for its technology maturity and transition commitment.  Ongoing efforts were categorized as FNCs or Technology Candidates.  Some efforts were terminated and others were accelerated to achieve the goals of the restructured program.  FNCs, which have higher Technology Readiness Levels (TRLs of 4\/5 to 6) and transition funding commitments, are being resourced in PE 0603640M Marine Corps Advanced Technology Development (ATD).  Funding for technology candidates at lower TRLs (3 to 4) is being resourced in this PE.  ONR is working closely with the Resource Sponsors and acquisition stakeholders to develop high priority technological capabilities needed by the operational forces. \n\nPrior to FY19, the underlying FNC Program investments in this PE were aligned to specific FNC projects.  In order to increase agility, exploit technology advances, and respond quickly to naval needs, future applied research investments supporting FNC technology candidates are being developed in a more flexible manner. This approach facilitates an optimum response when developing and maturing the technology options that will be developed further in PE 0603640M Marine Corps Advanced Technology Development (ATD). The FNC Program has been fully restructured in favor of a more direct and higher level of collaboration.  Investments are organized to enhance collaboration with the acquisition stakeholders and their resource sponsors.  \n\nA complete accounting of the technologies being developed in this PE will be provided separately to the Congressional oversight committees."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.630"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue Automated Processing for Spectral Exploitation and Dissemination (APSED) - Develop autonomous cueing algorithms.\n- Continue Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS) - Research and assess compact processing and storage hardware for sensor management, image refinement and storage, and dissemination.\n- Continue Radar \/ Context Fusion - Research and design software algorithms to summarize Human Intelligence (HUMINT) data as a spatial threat surface.\n- Continue Data Conditioning - Research and design machine content extraction algorithms and algorithms capable of formatting a structured report.\n- Continue Network Adaptive Communication Services - Research and design a software policy specification that uses inputs from mission priorities, users and data conditioning that is based on Dynamic Tactical Communications Network (DTCN) prioritization.\n- Complete SHD-FY13-02 Ground Based Air Defense On-The-Move (GBAD). \n- Complete Radar Fusion and False Track Mitigation - Improve real-time algorithm effectiveness within the relevant environment.\n- Complete EMW-FY16-01 Densified Propellant Fire From Enclosure - Confined Space(FFE\/CS) Propulsion Technologies.\n- Initiate EMW-FY17-01 High Reliability DPICM Replacement (HRDR).  This effort will increase the legacy 155mm Dual Purpose Improved Conventional Munition (DPICM) projectile cannon fired sub-munition reliability to at least 99% and allow the Marine Corps to retain an anti-personnel\/anti-armor, artillery-based Area Effect Munition (AEM) capability.\n- Initiate EPE-FY16-01 Advanced Topcoat Systems for Ground Vehicle (ATS-GV) - Continue development of isocyanate free topcoat resin systems for the ground vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.799"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The technologies being pursued under this activity include, but are not limited to, investments that focus on developing and maturing new capabilities for asymmetric and irregular warfare, distributed operations, information dominance, maneuverability, survivability, self-defense and expeditionary warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Future Naval Capability Technology Candidate development in FY20 will continue to focus on a broad range of technologies including, but are not limited to, investments that focus on developing and maturing new capabilities for asymmetric and irregular warfare, distributed operations, information dominance, maneuverability, survivability, self-defense and expeditionary warfare."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LOGISTICS"
                                    },
                                    "Description": {
                                        "val": "This activity investigates the practical discipline and real world application of the deployment, sustainment, reconstitution, and re-deployment of forces engaged in expeditionary operations.  Logistics replaces mass with assured knowledge and speed, is equally capable ashore or afloat in austere environments, and is fully scalable to meet uncertain requirements.  This includes efficient and responsive force sustainment, planning and directing logistics operations, logistics demand reduction, fleet maintenance, and expeditionary energy.  Expeditionary Energy enhances combat capability of expeditionary warfighters by increasing the efficiency and effectiveness of energy production, storage, distribution and use. Beyond traditional energy efforts, this portfolio also looks at other issues, including energy-efficient behaviors and hybridization of energy sources. These pillars are thoroughly integrated and perpetually related in execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.589"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue applied research toward materials that will reduce, or prevent, wear and corrosion on systems and equipment.\n- Continue development of high efficiency, high specific power, rugged, and inexpensive solar photovoltaic energy harvesting technologies.\n- Complete development of water purification applied research focused toward small personal water purification devices. This includes previous work in an energy recovery system for enhancing the efficiency of small reverse osmosis water purification devices. \n- Complete applications of advanced material surface treatments and coatings for reducing required maintenance and enhancing operational readiness of expeditionary warfare vehicles, machinery, and electrical systems \n- Complete the development of advanced water location, harvesting, packaging, distribution, and quality monitoring systems to enable Marines to be fully self-sufficient for water resources on the battlefield.\n- Complete operations research and analysis efforts to enhance seabased expeditionary supply chain concepts and technologies.\n- Complete development of infrastructureless In-Transit Visibility (ITV) technologies to enable asset tagging, tracking, locating, and monitoring anywhere in the expeditionary supply chain.\n- Complete the development of modular thermoacoustic systems capable of acting as power generation or heat-pump devices.\n- Complete the development of energy scavenging technologies to minimize wasted thermal, RF, kinetic, and other energy on the battlefield.\n- Complete the development of stochastic studies to model and insert Additive Manufacturing into the Naval Supply Chain.  \n- Complete the development of a project to investigate the feasibility and attributes of the wireless transfer of power technologies for dismounted Marines.\n- Initiate the development of stochastic studies to model and insert Additive Manufacturing into the Naval Supply Chain.  \n- Initiate the development of a project to investigate the complex physical processes occurring associated with complex geometries when using laser directed energy metal deposition processes with titanium alloys.   \n- Initiate the development of a project to investigate the feasibility and attributes of the wireless transfer of power technologies for dismounted Marines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.784"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This activity includes developing technologies to anticipate and reduce maintenance demands while increasing reliability.  This includes applied research and evaluation of advanced manufacturing methods including metal additive manufacturing (AM), friction stir welding and additive friction stir welding, and cold spray for structural repair of Marine Corps equipment.  Additional focus will be on developing a thorough understanding of material Process-Structure-Properties-Performance for high hard steel repair and other structural materials.  This research area also includes applied research to predict vehicle health and prognostics of remaining useful life for military ground vehicles and equipment in support of Condition Based Maintenance (CBM) goals, while seeking to automate CBM practices through automatic data retrieval and algorithm development.\n\nThe focus of this investment area includes enhancing combat capability by increasing energy production, storage, distribution, and curbing energy consumption of the individual Marine and other tactical assets. Activities involve applied research into new, rugged, low cost, and high specific power solar cell technologies that are compatible with military use on flexible substrates, while overcoming current limitations including short-lived cell stability and small area cell growth.  Additionally, investigations will take place for developing more energy efficient components for the Marine warfighter and high energy and power density technologies to simultaneously curb exponential power use trends, reduce combat load, and  enhance mission duration and combat performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.254"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.254"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Logistics development in FY20 will focus on the broad range of technologies noted in the FY19 plans section above. Research into friction stir welding, additive friction stir welding, and cold spray for structural repair of Marine Corps equipment will complete.  Research will be initiated in artificial intelligence tools to support logistics planning, execution, and combat support.  Develop enhancing autonomous logistics aerial\/ground asset teaming. Develop cyberphysical security of Digital Manufacturing methods, including Additive Manufacturing."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANEUVER"
                                    },
                                    "Description": {
                                        "val": "This activity investigates new ways and means to land forces and material through contested sea-land surface interfaces and then conduct maneuver warfare. In order to enable future Amphibious Operations, research efforts will support autonomous operations across the sea-surf-ground environment, improved fuel efficiency and speed of amphibious vehicles, amphibious vehicle technologies, water performance, and amphibious payloads to change the dynamics of a surface amphibious assault. This includes the emergence manned-unmanned teaming and autonomous vehicle collaboration. \n\nThe technologies included in this work address areas of mobility, materials, propulsion, signature reduction, modularity, and unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.696"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue lightweight Expeditionary Systems Materials (ESM) efforts to determine feasibility of scaling and producing candidate structural armor.\n- Continue mobility enhancement development effort for current and future light and medium weight Marine Corps vehicle programs.\n- Continue efforts addressing technologies to mitigate acceleration and traumatic brain injuries to vehicle occupants.\n- Continue efforts addressing advanced suspension systems with ride height adjustment capabilities, adjustable ride quality capabilities, rollover prevention, and load equalizing systems to enhance tactical mobility and survivability.\n- Continue efforts addressing improvements in vehicle fuel efficiency by improvements in drive train efficiencies, engine efficiencies and alternative fuels capabilities to enhance tactical mobility.\n- Continue technology development programs to address maneuver capability gaps in survivability such as an advanced seat technology effort to improve\/increase occupant protection within the platform by reducing injury due to the effects of dynamic blast events and accidental vehicle rollover.\n- Continue efforts in advanced perception and context-based reasoning aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continue the development of autonomy technologies and system concepts that will enable unmanned ground vehicles (UGVs) to be used as autonomous logistic connector vehicles.\n- Continue lightweight armor, material, and structural technologies that enable maneuver and survivability of small, light expeditionary platforms.\n- Continue survivability technologies that enable defeat of all unitary and tandem RPG and select Anti-Tank Guided Missile (ATGM) threats, and the demonstration of survivable vehicles.\n- Continue non-GPS localization technologies such that autonomous vehicles can navigate in areas where satellite data is inaccessible.\n- Continue the development of technologies that enable vehicle component modularity and reduce life cycle costs.\n- Continue mobility technologies that enable improved vehicle agility and stability.\n- Continue Advanced Mobility efforts in Future Fuel Alternatives and Advanced Propulsion and Suspension Technologies to improve vehicle fuel efficiency through improvements in drive train and engine efficiencies and alternative fuels capabilities to enhance tactical mobility.\n- Continue the development of technologies that sustain vehicle components longer and reduce life cycle costs.\n- Continue the development of autonomous technologies automating behavior generation and enabling adaptive behavior using virtual environments.\n- Continue technology development programs to address expeditionary maneuver capability gaps.\n- Continue the development of fuel saving vehicle technologies, including advanced transmission, power train, and electrical power system technologies.\n- Continue the development of autonomous technologies by enhanced human machine interface (HMI) through gestures and natural language understood by unmanned ground systems (UGS).\n- Continue survivability technologies to provide reduction in the probability of detection in a given background.\n- Complete advanced seat technology effort to improve\/increase occupant protection within the platform by reducing injury due to the effects of dynamic blast events and accidental vehicle rollover.\n- Initiate technology development programs to address expeditionary High Water Speed capability gaps.\n- Initiate development of cognitive reasoning systems that enable manned-unmanned teaming with high levels of autonomy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.516"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts will research advanced mobility technologies and concepts for tactical and combat ground and amphibious vehicles to extend the operational reach and range, enable higher operational tempo over rough terrain, and to provide protection against cyber threats.  This activity will emphasize efforts on providing an autonomous capability to the amphibious fleet for maneuver from ship to shore in a contested landing environment.  Also planned for development is autonomous perception, path planning, and vehicle controls for amphibious vehicles from small low cost craft, traditional amphibious combat and assault vehicles, and landing craft.  Research will develop knowledge and models for characterizing the surf zone impacts on amphibious craft to allow for physics based simulation of unmanned amphibious craft transition from sea to land environments.  Also to be explored are vision based perception systems capable of robust object recognition and complex scene understanding in dynamic environments.  In addition efforts will address technologies that can lead to next generation manned ground vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research will focus on intelligent mobility technologies to enable greater capability in harsh off road and littoral environments.  Efforts will include better understanding of the ground interface through terrain characterization and researching enhanced platform effectors that allow the system to adapt to varying terrain approaching real time thereby increasing operational tempo.   Efforts also include the development of forward-operating autonomous unmanned systems, in communication limited and Global Positioning System denied environments, with a focus on sense-making from local-sensors at the edge.  Research will continue to improve the impacts of the surf zone and other land-sea interfaces on vehicle dynamics."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 is due to the completion of Modernization Enhanced Experimentation efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPEDITIONARY CYBER"
                                    },
                                    "Description": {
                                        "val": "This activity provides freedom of maneuver and influence in the cyber-electronic warfare domain while simultaneously denying the same to the adversary and protecting critical command systems. Technologies are being developed using a multi-disciplinary approach that combines Radio Frequency electronics, digital signal processing, computer engineering, software engineering, machine learning and data science to support Naval Expeditionary warfighters operating with size, weight and power constrained equipment in Disrupted, Intermittent, Limited environments. Areas of applied research include distributed precision time, predictive software defined radio architectures, coordinated Cyber and Spectrum maneuver to mitigate detection and exploitation, tactical Cyber visualization, discovering and mapping networks in dense urban environments, contextual awareness and blind channel characterization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.690"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiate a USMC Expeditionary Cyber Applied Research Technology Activity addressing Cyber at the tactical edge.\n- Initiate cognitive blind channel characterization.\n- Initiate predictive software defined radio architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.574"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Cyber related encryption and multiple-domain processing tools are developed to enable a new class of portable devices that can securely transfer information across multiple tactical user platforms. Research is performed on the phenomenology of cyber battle damage on a class of systems, and results are used to develop hardware and algorithms for assessing cyber system health.  Develop and test a new class of component technologies, architectures, and embedded algorithms that demonstrate improved cyber Electronic Warfare resilience. Technologies are developed to perform autonomic monitoring and self-healing of EW-cyber, Command, Control, Communications and Computers and information exchange systems. Cyber behavior research will also be performed on a class of autonomous systems to demonstrate optimized stability, efficiency and resiliency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 to FY 2020 decrease is due realignment of Expeditionary Cyber from this Project and Activity to Project 2958 Cyberspace Activities for FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FUTURE CONCEPTS, TECHNOLOGY ASSESSMENT, AND ROADMAPPING"
                                    },
                                    "Description": {
                                        "val": "This activity supports the planning and integration of technology development efforts across the entire Program Element (PE). In conjunction with the Concepts Based Capabilities System and the Marine Corps Warfighting Laboratory, unique and novel concepts for advanced warfighting are developed and validated. Effectiveness analyses are conducted to identify the synergistic effects that can be achieved through the integration of emerging technology with innovative tactics, doctrine, and techniques. Technology assessments are conducted to determine the supporting technologies that have the highest impact across the warfare areas, and warrant further investment within this PE. Technology Roadmapping is conducted to help identify opportunities to leverage technology development within the Department of the Navy and the Department of Defense, as well as, with the commercial sector and university communities. The resultant technology investment strategy is developed and used to guide out-year technology development efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.355"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue planning and integration of technology development efforts to meet imposing security threats that challenge our Nation.\n- Continue a review and assess the Marine Corps' required surface connector capabilities specifically exploring promising and relevant research, technologies, capabilities and opportunities by which the Marine Corps can anticipate and identify potential solutions that meet the service's surface connector requirements.\n- Continue a technology assessment for a Cyber\/Electronic Warfare Coordination Cell (CEWCC) to enable seamless integration of kinetic and non-kinetic fires during expeditionary operations.\n- Complete a technology assessment for a Cyber\/Electronic Warfare Coordination Cell (CEWCC) to enable seamless integration of kinetic and non-kinetic fires during expeditionary operations.\n- Continue planning and integration of technology development efforts to meet imposing security threats that challenge our Nation.\n- Continue a review and assess the Marine Corps' required surface connector capabilities specifically exploring promising and relevant research, technologies, capabilities and opportunities by which the Marine Corps can anticipate and identify potential solutions that meet the service's surface connector requirements.\n- Continue a technology assessment for a Cyber\/Electronic Warfare Coordination Cell (CEWCC) to enable seamless integration of kinetic and non-kinetic fires during expeditionary operations.\n- Complete a review and assessment of Expeditionary Force 21 (including revisions).  This new USMC concept describes how the Marine Corps must deploy and operate, and what force attributes will be required.  This study will describe Expeditionary Force 21 implications for S&T. Nested directly under Cooperative Strategy 21 (Naval Strategy), Expeditionary Force 21 covers a 10-year planning horizon that informs, and is informed by, other USMC concepts and documents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.593"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess technologies that best address warfare environments and drivers described in the Marine Corps Operating Concept (MOC) and the Navy's A Design for Maintaining Maritime Superiority. This includes technologies within expeditionary design constraints that exploit scientific opportunities, and develop technology concepts to enable the execution of maneuver warfare in environments characterized by complex terrain including dense urban, technology proliferation, information used as a weapon, battles of signatures, and an increasingly contested maritime domain. Focus on and assess strategies that develop and field more flexible and adaptive technology quicker and with unit costs that win battlefield economics. Create roadmaps and concepts that enhance expeditionary capabilities against peer and near-peer adversaries whose technologies rival our own. Explore science and technology approaches that can speed up assessment, exploitation, and delivery of capability to expeditionary warfighters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess systems of technologies that best address warfare environments and drivers described in the MOC and the Navy's A Design for Maintaining Maritime Superiority. Identify and integrate numerous technology options within expeditionary design constraints to develop technology counterparts to Operational Concepts. Create technology roadmaps, concepts, and holistic systems of systems approaches that fulfil the needs identified in Operational Concepts such as the Marine Corps' Expeditionary Advanced Based Operations Concept and Littoral Operations in a Contested Environment Concept and enhance expeditionary capabilities against peer and near-peer adversaries."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this PE is the development of technologies to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare and Combating Terrorism.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.931"
                        },
                        "CurrentYear": {
                            "val": "7.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.931"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.931"
                                        },
                                        "Text": {
                                            "val": "Conduct Applied Research associated with two major thrust areas supporting Marine Corps warfighting capabilities. \n\nCyber-Development of active cyber defense techniques -\n\nConduct Cyber-Development of active cyber defense techniques on relevant tactical vehicles. Demonstrate these active defense techniques in a lab environment. Construct attacks for INL benchmark model to determine if Cyber Physical model can detect intrusion via metrics. Cyber technique development against UAS threat. Development of local time and frequency event scenarios associated with low level transient system dynamics needed to measure and control transient responses.\n\nAsset Lifecycle Management - \n\nConduct research for new sensors and integrated vehicle health management systems for emerging vehicle programs and prototypes, such as the Armored Reconnaissance Vehicle, in order to enhance overall asset lifecycle management.  While existing and prior research has been targeted to supporting the large legacy fleets through leverage of existing vehicle sensors and controller area networks, this research will investigate new asset health data sensing systems to support more advanced diagnostics and prognostics asset management capabilities."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interdisciplinary Expeditionary Cybersecurity Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "This program will fund the following research efforts in FY19:\n- Identification of system vulnerabilities within blue and gray\ncyberspace that affect Expeditionary Cyber operations\n- Develop proof of vulnerabilities, where applicable \n- Propose defensive technologies and methodologies for target\nplatforms"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Corps Asset Life-Cycle Management"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "2.000"
                                        },
                                        "Text": {
                                            "val": "Conduct research for new sensors and integrated vehicle health management systems for emerging vehicle programs and prototypes, such as the Armored Reconnaissance Vehicle, in order to enhance overall asset lifecycle management."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}