{
    "id": "2020-Army-PB-2040-JBOOK-c3dfc4efbfac46da70170659364c6c2d720e705db77d6ab495afa846698c0b96-34",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA5C-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0304270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Development"
        },
        "R1LineNumber": {
            "val": "174"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.616"
            },
            "CurrentYear": {
                "val": "8.922"
            },
            "BudgetYearOne": {
                "val": "22.875"
            },
            "BudgetYearOneBase": {
                "val": "19.675"
            },
            "BudgetYearOneOCO": {
                "val": "3.2"
            },
            "BudgetYearTwo": {
                "val": "56.417"
            },
            "BudgetYearThree": {
                "val": "67.971"
            },
            "BudgetYearFour": {
                "val": "37.954"
            },
            "BudgetYearFive": {
                "val": "29.321"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "238.076"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element encompasses engineering and manufacturing development for tactical Electronic Warfare (EW) terrestrial (ground) employment applications. The systems under this program provide the Army with the capability to detect, identify, locate, collect\/process, report, and engage (disrupt, degrade or deny) hostile forces to prevent their effective use of communications, counter-mortar\/counter-battery radars, surveillance radars, and electronically fused munitions.\n\nProject EW5 provides for Prophet Enhanced, the current system under the Prophet Ground acquisition program. Its primary mission is to provide 24-hour Situation Development and Information Superiority to the supported maneuver brigade enabling the most effective engagement of enemy forces. Prophet Enhanced provides a modular, scalable, open architecture based system solution optimized for ease of use in a variety of configurations (Stationary-Fixed, Mobile and Manpack).\n\nProject EW6 provides for the Army Reprogramming Analysis Team (ARAT), a Department of the Army established project to develop techniques, methods, tools and architecture to reprogram mission software embedded in Army EW systems, Force Protection Systems (FPS), and Target Sensing Systems (TSS) in response to changes in threat signatures.  ARAT Research and Development enables continuous development of: 1) automated threat analysis tools to rapidly detect (flag) threat changes within intelligence systems, 2) tools to minimize the time to develop EW Mission Software and Products (MSP) for both air and ground EW systems, 3) tools and technology to minimize the time required to test and validate MSPs, 4) improved communications conduits to transmit mission software changes to field users, and 5) enhanced mission-software uploading tools. These efforts allow for rapid threat analysis, simulation, mission software development, distribution and uploading of mission software changes directly to the supported Soldier in the field.  The ARAT project will develop, test and equip an Army-wide infrastructure capable of rapidly reprogramming electronic combat software embedded in offensive and defensive weapon systems.\n\nProject FJ5 provides for Terrestrial Layer System (TLS), a new start effort that initiates in FY 2020 and has the first year of funding in this Program Element in FY2021 to address a Signals Intelligence (SIGINT), Electronic Warfare (EW), and Cyber-enabling integrated solution to support Multi Domain Battle capability gaps and provide Force Protection, Situational Development, and Information Superiority to the maneuver forces.\n\nFiscal Year 2020 funds Electronic Warfare (EW) Development for Prophet Enhanced efforts (Project EW5) and the Army Reprogramming Analysis Team (ARAT) efforts (Project EW6)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.616"
                },
                "CurrentYear": {
                    "val": "8.922"
                },
                "BudgetYearOne": {
                    "val": "16.142"
                },
                "BudgetYearOneBase": {
                    "val": "16.142"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.616"
                },
                "CurrentYear": {
                    "val": "8.922"
                },
                "BudgetYearOne": {
                    "val": "22.875"
                },
                "BudgetYearOneBase": {
                    "val": "19.675"
                },
                "BudgetYearOneOCO": {
                    "val": "3.2"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "6.733"
                },
                "BudgetYearOneBase": {
                    "val": "3.533"
                },
                "BudgetYearOneOCO": {
                    "val": "3.2"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "6.733"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.533"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "3.2"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "$3.533 million Base is a result of $4.000M increase for Enhanced Signal Processing (ESP) kit development and integration onto Prophet Platforms (Project EW5) in support of the most recent National Defense Strategy and Near Peer Operations, and decrease of $.467 million to account for the availability of prior year execution balances.\n\n$3.200 million OCO increase for development and integration of Theater Specific Signals of Interest (SOI) into the Prophet Enhanced system (Project EW5) in support of Army Modernization Priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EW5"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Warfare Development - MIP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.751"
                        },
                        "CurrentYear": {
                            "val": "1.881"
                        },
                        "BudgetYearOne": {
                            "val": "13.277"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.077"
                        },
                        "BudgetYearOneOCO": {
                            "val": "3.2"
                        },
                        "BudgetYearTwo": {
                            "val": "9.349"
                        },
                        "BudgetYearThree": {
                            "val": "6.218"
                        },
                        "BudgetYearFour": {
                            "val": "6.292"
                        },
                        "BudgetYearFive": {
                            "val": "6.357"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "49.125"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Prophet Enhanced is the current system under the Prophet Ground acquisition program.  Funds provide for development and integration of Technical Insertion upgrades for Next Generation Signals and state-of-the-art Signals Intelligence (SIGINT) exploitation techniques to increase the capabilities of the Prophet Enhanced and maintain operational relevance.  The Prophet Enhanced is the tactical commander's sole organic ground-based SIGINT\/Electronic Warfare system for the Multi-Function Teams (MfTs) organic to the Brigade Combat Teams (BCTs) and Expeditionary-Military Intelligence Brigades (E-MIBs).  Its primary mission is to provide 24-hour Situation Development and Information Superiority to the supported maneuver brigade to enable the most effective engagement of enemy forces.  Prophet Enhanced provides a modular, scalable, open architecture-based system solution optimized for ease of use in a variety of configurations (Stationary-Fixed, Mobile and Manpack).  It also incorporates product modification, integration, and test of equipment for rapid integration of Technical Insertions (TI) and product development to ensure operational relevance.\n\nJustification:\nFY 2020 Base funding in the amount of $10.077 million will support continuing non-recurring engineering upgrades to the Prophet Enhanced Signals of Interest (SOI) baseline to support the National Defense Strategy that is Near Peer focused; funding will develop the Intelligence and Electronic Warfare Tactical Proficiency Trainer and Target Signature Arrays (IEWTPT\/TSA), integrate the Enhanced Signal Processing (ESP) kit onto the Prophet Enhanced system, and continue to pursue signal of interest upgrades.\n\nFY 2020 OCO funding in the amount of $3.200 million will support the development, integration and testing\/accreditation of new, Theater Specific, signal capabilities to ensure that Prophet keeps pace with the constantly changing signal environment and to ensure that Prophet maintains its operational relevance against key enemy threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Development of next generation signals, enhanced SIGINT exploitation, and improved manpack signal sets enable the Prophet system to remain operationally relevant with state-of-the-art Signal and Threat exploitation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.13"
                                            },
                                            "Text": {
                                                "val": "Funds will provide for core, matrix  and contractor system engineering and program management support for the Prophet program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.45"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.45"
                                            },
                                            "Text": {
                                                "val": "Funds will provide for matrix and contractor system engineering and program management support for the Prophet program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding in FY 2020 allows for the support of required system engineering and program management labor costs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Upgrade to JICD 4.2"
                                    },
                                    "Description": {
                                        "val": "JCID 4.2 will allow Theater Netcentric Geolocation (TNG) capabilities to leverage collaborative networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.409"
                                            },
                                            "Text": {
                                                "val": "Development of new JICD 4.2 software and integration into Prophet Enhanced."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Signal of Interest upgrades"
                                    },
                                    "Description": {
                                        "val": "The Signal Environment that Prophet Systems exploit is constantly changing with evolving threats.  This environment creates gaps in Prophet?s ability to collect and exploit these signals.  Prophet must constantly integrate software upgrades to remain relevant against these numerous, key, and high-priority emerging threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.212"
                                            },
                                            "Text": {
                                                "val": "Development of Next Generation SIGINT capabilities to include numerous key REDHAWK software applications and integration of the Next Generation Manpack software into the Prophet SIGINT Software (PS2) Baseline.  The REDHAWK applications and Manpack Software address signal exploitation gaps in Prophet?s ability to exploit key tactical signals and threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.881"
                                            },
                                            "Text": {
                                                "val": "Continuing development of Next Generation SIGINT capabilities to include, but not limited to upgrades to incorporate the National Intelligence Community architecture, numerous key Redhawk, X-Midas and Salvage software applications and integration of the Enhanced Signal Processing (ESP) kit into the Prophet Enhanced system.  The software applications and ESP kits address signal exploitation gaps in Prophet?s ability to exploit key tactical Near Peer signals and emerging signal threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Continuing, but not limited to development of Next Generation SIGINT capabilities into the Prophet SIGINT Software (PS2). The new signals and libraries of signals address key exploitation gaps in the Prophet system's ability to collect against key tactical near peer signals and emerging threats."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "3.2"
                                            },
                                            "Text": {
                                                "val": "Development of, but not limited to Theater Specific Next Generation SIGINT capabilities, including Redhawk, X-Midas and Salvage software applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding in FY 2020 and OCO funding allows for increased development of high priority Signals of Interest (SOI) and integration of SOI libraries, which is a more economical means of increasing the number of signals the Prophet Enhanced system can exploit."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence and Electronic Warfare Tactical Proficiency Trainer and Target Signature Arrays (IEWTPT\/TSA)"
                                    },
                                    "Description": {
                                        "val": "The Intelligence and Electronic Warfare Tactical Proficiency Trainer and Target Signature Arrays (IEWTPT\/TSA) is required to conduct training to sustain operator proficiency on the Prophet Enhanced after the system has been fielded and post New Equipment Training (NET) training."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Continued development of Intelligence and Electronic Warfare Tactical Proficiency Trainer and Target Signature Arrays (IEWTPT\/TSA) training systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Both the Prophet Enhanced software and the integration readiness of IEWTPT\/TSA have reached the maturity level requiring funding in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Signal Processing Operational Testing"
                                    },
                                    "Description": {
                                        "val": "Operational testing required after integration of the Enhanced Signal Processing kit into the Prophet Enhanced system."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.044"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.044"
                                            },
                                            "Text": {
                                                "val": "Funds provide for, but are not limited to release testing of the system-level Prophet System Software (PS2) to include accreditation and productization of all New Technical Insertion (TI) capabilities.  The final release software version is fielded to all the Prophet Systems to upgrade capabilities against Peer Near Peer and emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds not required prior to FY 2020 based on this effort being a final packaging of PS2, which is being developed through early FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Signal Processing Integration & Development"
                                    },
                                    "Description": {
                                        "val": "Effort to integrate the Enhanced Signal Processing kit into the Prophet Enhanced system."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.583"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.583"
                                            },
                                            "Text": {
                                                "val": "Non-recurring engineering included but not limited to integrate the Enhanced Signal Processing kit onto the Prophet Enhanced system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 is the first year that the effort was resourced."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BZ9753"
                                    },
                                    "Title": {
                                        "val": "Prophet Enhanced Modifications (MIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "49.093"
                                        },
                                        "CurrentYear": {
                                            "val": "43.847"
                                        },
                                        "BudgetYearOne": {
                                            "val": "57.103"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "55.052"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "2.051"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "44.602"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.15"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BZ9751"
                                    },
                                    "Title": {
                                        "val": "SPECIAL PURPOSE SYSTEMS (MIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.241"
                                        },
                                        "CurrentYear": {
                                            "val": "4.162"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.048"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.096"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.145"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.194"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DX9"
                                    },
                                    "Title": {
                                        "val": "National Integration To Tactical Systems(MIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.32"
                                        },
                                        "CurrentYear": {
                                            "val": "9.06"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.49"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.49"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.223"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.183"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.425"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.537"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604021A"
                                    },
                                    "Title": {
                                        "val": "Electronic Warfare Technology Maturation (MIP)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "18.043"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.043"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.8"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "36.843"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Prophet Research and Development (R&D) Acquisition Strategy is structured to maintain operational relevancy of Prophet Enhanced systems in a dynamic threat environment while reducing risk and streamlining business and engineering processes. Contracting activities are to maintain SIGINT relevance and complete Technical Insertion (TI) to Prophet Enhanced systems to pursue the latest Signals of Interest and design against obsolescence. The Technical Insertion (TI) contract supports R&D and other developmental work."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM Electronic Warfare & Cyber"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.481"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.13"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.45"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.45"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Upgrade to JICD 4.2"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD Mission Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.409"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Signals of Interst Upgrade"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD Mission Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.212"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.881"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.2"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "3.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IEWTPT\/TSA"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD Mission Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enhanced Signal Processing Integration & Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "GD Mission Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.583"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.583"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Enhanced Signal Processing Operational Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test & Evaluation Command"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.044"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.044"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.044"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444561_EW5.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Prophet Technical Insertion (TI)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2008"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Delta Testing  (2021)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "System Delta Testing  (2023)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prophet Modification of Legacy Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prophet Enhanced Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prophet Modification of Legacy Systems - Fielding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EW6"
                    },
                    "ProjectTitle": {
                        "val": "ARAT-TSS - MIP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.865"
                        },
                        "CurrentYear": {
                            "val": "7.041"
                        },
                        "BudgetYearOne": {
                            "val": "9.598"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.598"
                        },
                        "BudgetYearTwo": {
                            "val": "10.068"
                        },
                        "BudgetYearThree": {
                            "val": "10.453"
                        },
                        "BudgetYearFour": {
                            "val": "10.662"
                        },
                        "BudgetYearFive": {
                            "val": "10.864"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "67.551"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Army Reprogramming Analysis Team (ARAT) is a Department of the Army established program to develop techniques, methods, tools, and architecture to rapidly reprogram mission software embedded in Army Electronic Warfare (EW) Force Protection Systems (FPS) in response to changes in threat signatures. The regulatory guidance directing this mission is contained in Army Regulation (AR) 525-15, AR 525-22, and AR 95-1. The ARAT develops integrated technical solutions required to counter increasingly sophisticated EW Signal threats to US Forces. The ARAT mission software reprogramming infrastructure supports the Army Campaign Plan to provide the Regionally Aligned Forces tactical Commander timely rapid-reprogramming capability of EW systems with mission software.  The ARAT mission responsibility is to develop and distribute Mission Software and Products to forward deployed combat forces. ARAT identifies and analyzes worldwide threat signature changes which affect EW systems; determines the impact of observed Signal Intelligence (SIGINT)  signature changes; rapidly develops new mission software to adapt friendly systems to detect and defeat enemy threats to U.S. Army ground and air platforms; disseminates the Mission Software and Products to forward deployed forces, and provides government developed tools and software to upload new mission software into the affected EW systems."
                        },
                        "ProjectMissionDescription": {
                            "val": "Current military operations are conducted in a rapidly changing threat environment, where Improvised Explosive Devices (IEDs), Infra Red (IR) man-portable air defense systems (MANPADS) seekers, radar guided surface-to-air-missiles (SAM), laser guided weapons, anti-helicopter mines, and targeting sensors are proliferating and evolving. Integrated solutions are required to counter increasingly sophisticated EW threats.  The ARAT reprogramming infrastructure supports the tactical Commander by providing timely rapid reprogramming of mission software and information dissemination for Army supported, Joint and allied services.  ARAT supports integrated reprogramming of target acquisition, target engagement, vehicle survivability, and Aircraft Survivability Equipment (ASE). ARAT rapid-reprogramming infrastructure supports tactical requirements for deployed aircraft and ground-based (e.g. Counter Radio-Controlled Improvised Explosive Device (CREW)) survivability systems. ARAT identifies and analyzes threat signature changes which affect EW systems; determines the impact of observed signature changes; develops new mission software to adapt the system to the changes; disseminates the mission software; and provides methods to upload the new mission software into the affected EW systems. Each element within the ARAT infrastructure plays a specific role within the program's rapid reprogramming process, providing the Soldier with the capability to install mission and target identification software at the lowest possible level, thus maximizing flexibility for tactical commanders. ARAT participates in the operational and developmental test design of Army EW systems, and supports Joint Service Reprogramming Exercises in all theaters. ARAT Research and Development enables continuous development of: 1) automated threat analysis tools to rapidly detect (flag) threat changes within the intelligence system, 2) tools to minimize the time to develop Mission Software and Products (MSP), 3) tools and technology to minimize the time required to test and validate MSPs, 4) improved communications conduits to rapidly transmit mission software to upload into supported EW systems. These efforts allow for rapid threat analysis, threat modeling and simulation, mission software development and testing, distribution and uploading of mission software directly to the supported Soldier in the field."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Keeping Pace with the Enemy and Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing a capability for the Government to rapidly develop and distribute organic mission software solutions for multiple EW systems.  The Army must continually modernize and enhance software tools, hardware modernization, and processes counter enemy technology.  ARAT EW6 Military Intelligence Program (MIP) executes Research, Development, Test, and Evaluation (RDTE) funding to provide an organic Army capability for this organization to rapidly develop, test and distribute mission software solutions for forward deployed combat forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.872"
                                            },
                                            "Text": {
                                                "val": "ARAT had several FY 2018 accomplishments.  \n\nARAT completed Phase 1 of the Ground Electronic Warfare (GrEW) Automated Test Set (ATS). The GrEW ATS replicates complex open air Radio Frequency (RF) environments in the laboratory allowing rapid, fully automated testing of EW system loads with actual hardware in the loop, reducing software development timelines, providing higher-fidelity software testing, and lowering sustainment costs by reducing or eliminating field testing for GrEW systems.  The GrEW ATS is in operation in the ARAT laboratory at Aberdeen Proving Ground, MD.  The GrEW ATS is scalable to insert capability to replicate future threat systems as well as physical and climatic environments utilizing modelling and simulation to predict RF propagation.  The GrEW system became operational in early FY17 and has reduced engineering timelines from 6 weeks to 2 weeks. \n\nARAT completed the ARAT Display Emulator. ARAT designed and developed an ARAT Display Emulator IP-1150A Multispectral Warning Cockpit Display.  The IP-1150A is a legacy analog display still utilized on the UH-60A\/L Blackhawk and the CH-47C\/D Chinook aircrafts.  This follow-on project leverages the previous Display Emulator that concentrated on Army aircraft with glass cockpit digital technology.  The Display Emulator replicates multiple aircraft displays on COTS computers executing precise emulation of all ASE symbology without the need for actual aircraft hardware.  This capability allows testers to monitor multiple devices during the Independent Verification and Validation (IV&V) process.  The Display Emulator technology reduces time for testing of mission software by providing visualization of symbology that previously required a manual lookup table for engineering validation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.722"
                                            },
                                            "Text": {
                                                "val": "This FY effort will capitalize on accomplishments in FY 2018 and will continue to enhance: 1) Intelligence data requirements to support MSP development for EO\/UV\/IR spectrums and other multi-spectral sensors for aviation and non-aviation EW systems, 2) Government organic knowledge and application-base enabling reprogramming of future systems, 3)USG capability for the reprogramming of multi-spectral EW systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.972"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.972"
                                            },
                                            "Text": {
                                                "val": "ARAT's FY 2020 plan will continue to focus on the rapid development, testing, and distribution of mission software for regions worldwide. In support of Air Mission software development, ARAT will continue automating threat simulation development, Radio Frequency automated signal generation, automating threat analysis tools, developing a universal mission software generation tool, and software hardening capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "ARAT has increased from FY 2019 to FY 2020 due to increased emphasis on automation of threat simulations development and threat analysis tools."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infrastructure Improvements Multispectral"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing the Army's Multispectral Missile Warning System (MWS) software sustainment infrastructure.  With the worldwide proliferation of MANPADS the Army must have the capability to rapidly analyze and develop mission software solutions that detect and counter MANPADS to defend Army Aviation platforms against this lethal threat."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.637"
                                            },
                                            "Text": {
                                                "val": "ARAT completed the Knee Board Card Generator (KBCG).   ARAT designed and developed a KBCG software tool.  Kneeboard cards, utilized in the aircraft cockpit, allow combat Aviators to quickly determine the lethality of the threat system engaging the aircraft and the appropriate countermeasures needed to defeat the threat.  The KBCG automates the process of converting threat data information to Kneeboard Cards. The KBCG can support multiple Aircraft Survivability Equipment (ASE) radar warning receivers on Army aircraft and serves as the primary means of displaying cockpit symbology. This automated process reduces production time from several days to a few minutes and allows for customization prior to final publication."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.104"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct infrastructure enhancements for an OFP software development environment to enable the USG to develop and deploy an OFP environment for MWS. Continue evaluation of data and conduct analysis requirements for MANPADS characterization and enhance the organic government analysis and sustainment process to support OFPs and subsequently adapt MWSs to new threats. Enhance government organic capability, thereby decreasing the risk that systems cannot be readily adapted to changing threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.306"
                                            },
                                            "Text": {
                                                "val": "ARAT will continue to enhance Multispectral Mission Software development, testing, and distribution infrastructure.  ARAT will continue modernization of the multispectral software development environment as well as automation of threat analysis tools and multispectral simulation capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is only a slight increase from FY 2019 to FY 2020.  The increase is attributed to slightly higher costing expected on the various planned efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infrastructure Improvement Radio Frequency General"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing the Army's Radio Frequency (RF) EW system Mission Software and Products (MSP) development and distribution infrastructure.  The Army must fight in a contested and congested EW environment.  Mission software solutions to defend against RF threats must be rapidly developed, tested, and distributed to Soldiers on an ever changing battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.538"
                                            },
                                            "Text": {
                                                "val": "ARAT completed the Automated Testing for AN\/APR 39D(V)2 Mission Software.  ARAT designed and delivered a Radio Frequency (RF) automated mission software test capability for the Army?s newest Radar Warning Receiver (RWR), the AN\/APR 39D(V)2 system.  Prior to developing this capability, testing of mission software was conducted in a manual test process that took months to complete.  The development of this automated testing capability optimizes the Army?s ability to rapidly develop and test mission software for this modernized RWR, initially fielded on the AH-64A Apache Longbow Helicopter.  The RWR provides cockpit indication of enemy RF missile activity and alerts the pilot of appropriate countermeasure to defeat the threat.  This automated testing capability provides the Army with a rapid capability to test a mission software solution that detects and defeats threats to Army Aviation platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.349"
                                            },
                                            "Text": {
                                                "val": "Further augment the ARAT communications architecture to enhance the rapid secure transmission of mission software changes to EW systems, with emphasis on remote user and highly mobile Soldier connectivity. Will continue to enhance the USG integrated EW development and test environment to ensure MSP and threat countermeasure integration on the respective EW platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.469"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.469"
                                            },
                                            "Text": {
                                                "val": "In support of Ground Electronic Warfare Radio Frequency Mission Software development, ARAT will develop modernization efforts for the automated testing of mission software, develop laboratory environmental models that replicate actual physical and climatic environments worldwide, and optimize threat automation tools.  Additionally, ARAT will create a software tool that will control various versions of Radio Frequency (RF) simulators and RF Signal Generators."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is only a slight increase from FY 2019 to FY 2020.  The increase is attributed to slightly higher costing expected on the various planned efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Flagging and Mission Data Set Reprogramming Tool Development"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing the Army's capability to monitor changes in enemy EW systems that affect system performance of Army detection, declaration, and countermeasure EW systems onboard.  The enemy is continuously developing or modifying it's EW systems.  For Army platforms to have protection against enemy systems it must have a robust capability to immediately detect changes in threat system performance and rapidly develop, test, and distribute a mission software solution that counters the threat.  This effort will enhance the Army's capability bridge detection of a change in enemy threat and the rapid development of MSP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.818"
                                            },
                                            "Text": {
                                                "val": "ARAT completed an in depth analysis of existing threat change detection models currently being utilized by the US Army.  The findings from this analysis revealed recommended software enhancements to optimize the Army's ability to rapidly detect changes in threat performance or the introduction of new threat systems to specific locations worldwide."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.866"
                                            },
                                            "Text": {
                                                "val": "Continue to enhance spiral applications for ARAT internal system specific threat flagging, threat analysis, mission software generation and testing processes. Will conduct spiral enhancement of threat flagging (threat performance change detection) and intelligence analytical tools, based on supported systems performance criteria, to rapidly identify and counter emerging and changing threats that adversely affect the performance of the EW systems. Will continue to enhance mission software development, testing and validation tools to decrease time from threat-change detection to the distribution of MSP in order to increase the accuracy and fidelity of threat identification, and reduce the engineering involvement\/workload associated with the manually intensive analysis and MSP development processes. Will continue to enhance software tools that enhance a data support infrastructure that employs the EWIR database."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.851"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.851"
                                            },
                                            "Text": {
                                                "val": "ARAT will continue the design and development of the modernized Threat Change Detection (TCD) tool.  This tool will provide the enhanced ability for the Army to rapidly detect and analyze National level captured signal intelligence parametric data.  The TCD tool will utilize analytical tools to assess the change in threat emitters and to prioritize the lethality of a threat change and its impact to US Forces.  Additionally, ARAT will continue with modernization efforts of the mission software generation tools and hardware infrastructure.  Planned FY 2020 effort will include the creation of a Universal Mission Data Set Generation (UMG) tool.  The UMG tool will consolidate the current multiple Mission Data Set Generation tools into a single tool.  The benefit of a single tool will enhance the Mission Software development process by reducing the sustainment of 5 Generation tools into a single Generation tool."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is only a slight decrease from FY 2019 to FY 2020.  The decrease is attributed to lower costing expected on the various planned efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The efforts to be funded in this project will require a combination of systems specific and high-tech knowledge. The contractual services portion for the project will be obtained from both the Communications-Electronics Command (CECOM) Software Engineering Center (SEC) competitive omnibus and the Research, Development and Engineering Command (RDECOM) and the Defense Technical Intelligence Center (DTIC) high tech contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM SEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.522"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.865"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.161"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.182"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.182"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "USG Labor"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM SEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.111"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.372"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.383"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.383"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.866"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM SEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.838"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.084"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.084"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.002"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM SEC, RDECOM, DTIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "34.726"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.428"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.949"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.949"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444561_EW6.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Software Development Support (see notes in Schedule Detail)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "- Software Test Automation\n- Threat Analysis Data Evaluation Tool\n- Enhance Data Distribution"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "FJ5"
                    },
                    "ProjectTitle": {
                        "val": "Terrestrial Layer System (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "37"
                        },
                        "BudgetYearThree": {
                            "val": "51.3"
                        },
                        "BudgetYearFour": {
                            "val": "21"
                        },
                        "BudgetYearFive": {
                            "val": "12.1"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "121.400"
                        }
                    },
                    "R2aExhibit": []
                }
            ]
        }
    }
}