{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-14",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603289D8Z"
        },
        "ProgramElementTitle": {
            "val": "Advanced Innovative Analysis and Concepts"
        },
        "R1LineNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "153.312"
            },
            "PriorYear": {
                "val": "36.763"
            },
            "CurrentYear": {
                "val": "37.178"
            },
            "BudgetYearOne": {
                "val": "37.645"
            },
            "BudgetYearOneBase": {
                "val": "37.645"
            },
            "BudgetYearTwo": {
                "val": "38.478"
            },
            "BudgetYearThree": {
                "val": "39.582"
            },
            "BudgetYearFour": {
                "val": "39.558"
            },
            "BudgetYearFive": {
                "val": "40.350"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Strategic Capabilities Office (SCO) supports the National Defense Strategy by accelerating the development, demonstration, and transition of capabilities that increase the lethality of the Joint Force in contested environments.  In a partnership endeavor across the Office of the Secretary of Defense (OSD), Joint Staff, Combatant Commands (CCMDs), the Services, the Intelligence Community (IC), and other U.S. Government agencies, SCO combines capability innovation with new concepts for warfighting that leverage new technology areas, including autonomy, artificial intelligence, and machine learning.  SCO conducts projects on accelerated timelines, in all warfighting domains, at any classification or access level.\n\nThe Advanced Innovative Analysis and Concepts Program Element supports development, studies, analysis, and demonstration of integrated concepts and prototypes, analysis in support of ongoing efforts to shape and counter emerging threats, cross-Service and cross-Defense\/Intelligence concepts, and red-teaming. Projects focus on proving component and subsystem maturity prior to integration in major systems, and may involve risk reduction initiatives. Due to the nature of these projects, specific applications and detailed plans are available at a higher classification level."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.763"
                },
                "CurrentYear": {
                    "val": "37.263"
                },
                "BudgetYearOne": {
                    "val": "37.645"
                },
                "BudgetYearOneBase": {
                    "val": "37.645"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.763"
                },
                "CurrentYear": {
                    "val": "37.178"
                },
                "BudgetYearOne": {
                    "val": "37.645"
                },
                "BudgetYearOneBase": {
                    "val": "37.645"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.085"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction Section 8024(f)"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.085"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "329"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Innovative Analysis and Concepts"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "153.312"
                        },
                        "PriorYear": {
                            "val": "36.763"
                        },
                        "CurrentYear": {
                            "val": "37.178"
                        },
                        "BudgetYearOne": {
                            "val": "37.645"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.645"
                        },
                        "BudgetYearTwo": {
                            "val": "38.478"
                        },
                        "BudgetYearThree": {
                            "val": "39.582"
                        },
                        "BudgetYearFour": {
                            "val": "39.558"
                        },
                        "BudgetYearFive": {
                            "val": "40.350"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Strategic Capabilities Office (SCO) conducts analysis in support of ongoing efforts to shape and counter emerging threats, with special emphasis on: innovative and architecture-level concepts, cross-Service and cross-Defense\/Intelligence concepts, red-teaming, and on a case-by-case basis, research and development projects to demonstrate concept.  SCO identifies, analyzes, and accelerates the development, demonstration, and transition of selected capabilities to shape and counter emerging threats, and to improve U.S. security posture.  In a partnership endeavor across the Office of the Secretary of Defense (OSD), Joint Staff, Combatant Commands (CCMDs), the Services, the Intelligence Community (IC), and other U.S. Government agencies, SCO combines capability innovation with concepts of operation and information management to develop novel, high-leverage approaches to address pressing national security challenges.  SCO conducts projects on accelerated timelines, at any classification or access level.  \n\nThe Advanced Innovative Analysis and Concepts Program Element supports development, studies, analysis, and demonstration of integrated concepts and prototypes, analysis in support of ongoing efforts to shape and counter emerging threats, cross-Service and cross-Defense\/Intelligence concepts, and red-teaming.  Projects focus on proving component and subsystem maturity prior to integration in major systems, and may involve risk reduction initiatives.  Due to the nature of these projects, specific applications and detailed plans are available at a higher classification level."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High-Fidelity Analysis and Concept Generation"
                                    },
                                    "Description": {
                                        "val": "The Strategic Capabilities Office (SCO) conducts analysis to identify and accelerate the development, demonstration, and transition of potentially game-changing capabilities to shape and counter emerging threats and improve U.S. security posture.  All innovative concepts developed within SCO must first undergo a phase of thorough analysis before moving forward to become a project.  Due to the nature of these projects, specific applications and detailed plans are available at a higher classification level."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.763"
                                            },
                                            "Text": {
                                                "val": "Continue to innovate in partnership with Services Program Offices and CCMDs to identify game-changing uses of existing systems and technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.553"
                                            },
                                            "Text": {
                                                "val": "Continue to innovate in partnership with Services Program Offices and CCMDs to identify game-changing uses of existing systems and technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.465"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.465"
                                            },
                                            "Text": {
                                                "val": "Continue to innovate in partnership with Services Program Offices and CCMDs to identify game-changing uses of existing systems and technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 to FY 2020 increase is the result of minor inflation rate adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quick Win Projects"
                                    },
                                    "Description": {
                                        "val": "The Strategic Capabilities Office (SCO) pursues rapid research and development projects and prototyping to deliver new capabilities to the warfighter swiftly (2 years or less), called a “Quick Win.”  For “Quick Wins,” SCO identifies, analyzes, and accelerates the development, demonstration, and transition of selected capabilities to shape and counter emerging threats, and to improve U.S. security posture.  Projects focus on proving component and subsystem maturity prior to integration in major systems, and may involve risk reduction initiatives.  Due to the nature of these projects, specific applications and detailed plans are available at a higher classification level."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.625"
                                            },
                                            "Text": {
                                                "val": "Start FY 2019 Quick Win projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.180"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.180"
                                            },
                                            "Text": {
                                                "val": "Complete FY 2019 Quick Win projects, start FY 2020 Quick Win projects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 to FY 2020 increase is the result of minor inflation rate adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are specific to each Advanced Innovative Analysis and Concepts effort and include measures identified in the management approach, Statement of Work (SOW), and Period of Performance (POP).  In addition, completions and successes are monitored against schedules and deliverables stated in the initiative's management approach.  Due to the nature of these projects, specific applications and detailed plans are available at a higher classification level"
                        }
                    }
                }
            ]
        }
    }
}