{
    "id": "2020-ChemicalandBiologicalDefenseProgram-PB-0400-MJBOOK-0-0-44c3a4aff04877f327093d2fed4ed3a9907dbc9834ee536139756a9e0713feaf-0",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-CBDP-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (BASIC RESEARCH)"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "43.769"
            },
            "CurrentYear": {
                "val": "42.103"
            },
            "BudgetYearOne": {
                "val": "45.238"
            },
            "BudgetYearOneBase": {
                "val": "45.238"
            },
            "BudgetYearTwo": {
                "val": "45.369"
            },
            "BudgetYearThree": {
                "val": "45.385"
            },
            "BudgetYearFour": {
                "val": "45.384"
            },
            "BudgetYearFive": {
                "val": "45.376"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The projects in this program element (PE) advance fundamental knowledge in life and physical sciences.  These are basic research efforts directed at promoting theoretical and experimental research in Life and Physical Sciences.\n\nIndividual projects include:\n- Life Sciences (LF1): fundamental efforts to understand living systems' response to biological or chemical agents, to support detection, diagnostics, protection, and medical treatment (e.g. microbiology, biochemistry, pathogenic mechanisms, cell and molecular biology, immunology, nanoscale science, and information science).\n\n- Physical Sciences (PS1): fundamental scientific phenomena to support investigation of physical and chemical properties and interactions for enhanced functionalities important to detection, diagnostics, protection, and decontamination (e.g. chemistry, physics, materials science, nanotechnologies, nanoscale science, and environmental science)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.898"
                },
                "CurrentYear": {
                    "val": "42.103"
                },
                "BudgetYearOne": {
                    "val": "45.311"
                },
                "BudgetYearOneBase": {
                    "val": "45.311"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.769"
                },
                "CurrentYear": {
                    "val": "42.103"
                },
                "BudgetYearOne": {
                    "val": "45.238"
                },
                "BudgetYearOneBase": {
                    "val": "45.238"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.129"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.073"
                },
                "BudgetYearOneBase": {
                    "val": "-0.073"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.129"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.073"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.073"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY18 (-$0.129M): Reprogrammings to support core competencies at the U.S. Army Medical Research Institute for Infectious Diseases and CBDP Defense Finance and Accounting System transactions.\n\nFY20 (-$0.073M): Program adjustments to balance overall portfolio efforts.\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "LF1"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL\/BIOLOGICAL DEFENSE - LIFE SCIENCES (BASIC RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.312"
                        },
                        "CurrentYear": {
                            "val": "26.815"
                        },
                        "BudgetYearOne": {
                            "val": "29.730"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.730"
                        },
                        "BudgetYearTwo": {
                            "val": "29.813"
                        },
                        "BudgetYearThree": {
                            "val": "29.824"
                        },
                        "BudgetYearFour": {
                            "val": "29.823"
                        },
                        "BudgetYearFive": {
                            "val": "29.818"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (LF1) focuses on fundamental efforts to understand living systems' responses to biological or chemical agents, to support detection, protection, diagnostics, and medical treatment.  Research focuses on studying factors which influence the behavior of chemicals, toxins, and pathogens in relation to the host or target.  Understanding of host\/agent interactions can drive exploration of novel approaches to detect, diagnose or protect against threats.  Research also focuses on medical countermeasures for improved efficacy against a wide array of current and future threat agents."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Life Sciences"
                                    },
                                    "Description": {
                                        "val": "Focuses on fundamental efforts to understand living systems' responses to biological or chemical agents, to support detection, protection, diagnostics, and medical treatment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.312"
                                            },
                                            "Text": {
                                                "val": "- Reservoir host - Characterized bat immune response to viral infection to understand pathogen\/host interactions. Completed, tested, and validated primers and probes for filovirus animal model and developed in vitro and in vivo inflammatory response models. \n- Nano-drug delivery - Validated nano-structured material drug delivery in various tissues and measured bio-distribution for optimal therapeutic delivery. The program completed its in vivo validation against agent challenge and demonstration of proof of concept. No further activity planned at this time. \n- Persisters - Elucidated the role of identified genes and metabolites that are factors in bacterial persistence. \n- In vitro glycosylation - Characterized the effects of glycan structures on biological stability and immunogenicity and evaluated efficacy of therapeutic bioscavengers. \n- Blood-brain barrier - Developed a particle based delivery system for transport of a macromolecular-molecule antidote across the blood-brain barrier.  Investigated the influence of chemical surrogates and alphaviruses penetration of the blood-brain barrier.  \n- Bacterial resistance - Evaluated the role of gene amplification and duplication in the development of multiple drug resistance in bacterial pathogens. Investigated a gene amplification detection system that can identify changes in antimicrobial and multidrug resistance. Demonstrated proof of concept that used volatile organic compounds for detection of antibiotic resistant bacteria. \n- Viral pathogenesis - Investigated filovirus glycoprotein tertiary structure and other viral structures for improved development of assays which will support identification of protective structures. \n- Biomarkers - Explored the application of microfluidics to examine the host-immune response in the microenvironment and biomarker discover for infection onset and response to therapy. \n- Enabling Science - Characterized a family of unique double-stranded RNA molecules that can indicate infection and give information on the type of infection.  Developed robust genetic control architectures for guidance of antimicrobials against bio threats. Chemical scavengers - Evaluated lung alveoli cellular response to chemical agents. Assessed in vitro transport of oximes using an artificial carrier molecule.  Assessed nano-polymer materials for skin decontamination.\n- STEM - Supported Science Technology, Engineering and Math (STEM) strategic efforts to develop talent across the education continuum to enrich our current and future DoD workforce to meet defense technological challenges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.815"
                                            },
                                            "Text": {
                                                "val": "- Blood-brain barrier - Evaluate nanoparticle and antivirals neuro-protective agents in mice.  Continue development of particle based delivery systems for transport of macromolecule antidotes across the blood-brain barrier. \n- Viral pathogenesis - Expand modeling of viral structures to second pathogen and begin correlation of data in mouse models. \n- Develop delivery molecules and begin to assess viral protein and virus like particle variants for multi-strain protective antibody.  \n- Biomarkers - Perform optimization and evaluation of microneedle microfluidics and establish biomarker validation for various threats.\n- Enabling Science - Continue to characterize a family of unique double-stranded RNA molecules and begin to collect biomarkers that can indicate infection and give information on the type of infection. \n- Continue developing robust genetic control architectures for guidance of antimicrobials against bio threats.\n- Chemical scavengers - Assess the expression of lung alveoli cellular inflammatory receptors. Assess whether efflux pump inhibitors alter the access of neurological agents in the brain. Prepare antibody-targeted nanoparticles loaded with oxime.  \n- STEM: Support Science Technology, Engineering and Math (STEM) strategic efforts to develop talent across the education continuum to enrich our current and future DoD workforce to meet defense technological challenges.\n\nPrograms ending in FY19:\n-Reservoir host - Use developed inflammatory response models to elucidate function of filovirus proteins in bats. Transfer data to larger animal model program and conclude efforts.  \n- Persisters - Identify potential drug targets to enhance antibiotic efficacy from developed data. Transfer data to larger antimicrobial resistance program and conclude efforts. \n- In vitro glycosylation - Develop tools that can identify glycosylation patterns and corresponding therapeutic proteins for potential future therapeutics. Transfer data to larger antimicrobial resistance program and conclude efforts. \n- Bacterial resistance - Develop diagnostic tools for early and rapid identification of resistant pathogens based on gene amplification changes.  Validate genomic patterns of resistance with secondary pathogens."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.730"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.730"
                                            },
                                            "Text": {
                                                "val": "- Blood-brain barrier - Develop a comprehensive model of the blood-brain barrier molecular antidotes to demonstrate mechanisms of transport for modulators and alphaviruses. Continue to elucidate transport vehicles in established mouse models of BBB transport. \n- Viral pathogenesis - Continue to expand modeling of viral structures to second pathogen and begin correlation of data in mouse models.  Begin screening delivery molecules for bioavailability and immunogenicity and assess efficacy of single dose protection against multiple viral targets.\n- Biomarkers - Begin testing microneedles and microfluidic extraction studies in vivo and validating biomarker results against industry standards. Correlate biomarkers of various threats against different animal models to understand where further research may be needed. \n- Enabling Science - Complete a characterize a family of unique double-stranded RNA molecules and evaluate collected biomarkers that can indicate infection and give information on the type of infection. Continue developing robust genetic control architectures for guidance of antimicrobials against bio threats.\n- Chemical scavengers - Continue to assess the expression of lung alveoli cellular inflammatory receptors and test with potential therapeutic molecules. Assess how cholinergic stimulation of astrocyte networks are affected by chemical agents and therapeutics. Continue to evaluate transport of antibody-targeted nanoparticles loaded with oxime. \n- Animal Models - Initiate selection of animal models and threat\/therapeutic classes for data validation. Characterize tissue models against known targets to assess comparability to human organ response. Begin validation of organ and animal models against clinical data.\n- STEM - Supporting Science Technology, Engineering and Math (STEM) strategic efforts to develop talent across the education continuum to enrich our current and future DoD workforce to meet defense technological challenges."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "74.565"
                                        },
                                        "CurrentYear": {
                                            "val": "67.994"
                                        },
                                        "BudgetYearOne": {
                                            "val": "77.803"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "77.803"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "77.799"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.285"
                                        },
                                        "BudgetYearFour": {
                                            "val": "82.463"
                                        },
                                        "BudgetYearFive": {
                                            "val": "83.596"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "NT2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "51.625"
                                        },
                                        "CurrentYear": {
                                            "val": "53.720"
                                        },
                                        "BudgetYearOne": {
                                            "val": "52.902"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "52.902"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "50.111"
                                        },
                                        "BudgetYearThree": {
                                            "val": "52.385"
                                        },
                                        "BudgetYearFour": {
                                            "val": "52.377"
                                        },
                                        "BudgetYearFive": {
                                            "val": "52.368"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "73.276"
                                        },
                                        "CurrentYear": {
                                            "val": "70.960"
                                        },
                                        "BudgetYearOne": {
                                            "val": "71.882"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "71.882"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "76.953"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.329"
                                        },
                                        "BudgetYearFour": {
                                            "val": "75.839"
                                        },
                                        "BudgetYearFive": {
                                            "val": "75.928"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.878"
                                        },
                                        "CurrentYear": {
                                            "val": "21.698"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.798"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.798"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.039"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.538"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.833"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.682"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.781"
                                        },
                                        "CurrentYear": {
                                            "val": "22.749"
                                        },
                                        "BudgetYearOne": {
                                            "val": "24.180"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "24.180"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.295"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.085"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.076"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.071"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "92.231"
                                        },
                                        "CurrentYear": {
                                            "val": "88.188"
                                        },
                                        "BudgetYearOne": {
                                            "val": "120.526"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "120.526"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "128.035"
                                        },
                                        "BudgetYearThree": {
                                            "val": "127.992"
                                        },
                                        "BudgetYearFour": {
                                            "val": "122.006"
                                        },
                                        "BudgetYearFive": {
                                            "val": "122.553"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "PS1"
                    },
                    "ProjectTitle": {
                        "val": "CHEM\/BIO DEFENSE - PHYSICAL SCIENCES (BASIC RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.457"
                        },
                        "CurrentYear": {
                            "val": "15.288"
                        },
                        "BudgetYearOne": {
                            "val": "15.508"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.508"
                        },
                        "BudgetYearTwo": {
                            "val": "15.556"
                        },
                        "BudgetYearThree": {
                            "val": "15.561"
                        },
                        "BudgetYearFour": {
                            "val": "15.561"
                        },
                        "BudgetYearFive": {
                            "val": "15.558"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (PS1) advances fundamental scientific knowledge in physical science areas that include chemistry, physics, materials science, environmental sciences, and nanotechnology that could potentially lead to transformational CB defensive capabilities enhancing Warfighter performance and safety. \n\nIndividual efforts in this project include:\n- Research results in physics, chemistry, and materials sciences that have potential application in point and remote detection, diagnostics, as well as protection and decontamination.  \n- Surface and environmental sciences focus on the study of physical and chemical properties and phenomena of interactions, especially with regard to Non-Traditional Agents (NTAs), that seek to improve capabilities such as detection, protection, and decontamination.  \n- Research in nanotechnology and nanoscale sciences, such as nanoelectromechanical systems, molecular motors, nano-mechanical resonance sensing, and nano-meter imaging, has potential application across CB capability areas to provide significant enhancement by decreasing detection response times, increasing medical countermeasure effectiveness against a wider array of threat agents, and providing currently unavailable modalities like detection imbedded in fabrics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Physical Sciences"
                                    },
                                    "Description": {
                                        "val": "Focuses on fundamental scientific phenomena including chemistry, physics, materials science, environmental science, and nanotechnology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.457"
                                            },
                                            "Text": {
                                                "val": "- Environmental Availability - Completed bacteriophage against Burkholderia psuedomallei (Bp) study. Established physical, epidemiological, geophysical and ecological parameters for the presence of Bp. Compare virulence between clinical and environmental Bp isolates.  \n- Photonics - Initiated the design and fabrication of photonic components, including nano-scale thermal resonators, selective sensor coatings for optical resonators to enable chemical sensing applications. \n- Chemical Reactivators - Synthesized the first potential re-activator molecule and conducted kinetics studies. \n- Multifunctional Materials - Examined the impact of processing parameters in designing large scale membranes, which respond to multiple CB threats via deactivation and conformation change to enable novel means of protection and minimization of thermal burden. \n- Catalysts for CB Defense - Designed and synthesized novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment. \n- Design Rules - Investigated the impact of morphology on approaches to mitigate chemical and biological threats on CB relevant substrates - such as fibers and yarns. Investigated the impact of composition on structure and activity of materials to mitigate chemical and biological threats on CB relevant substrates. Studied the fundamental mechanisms between CB threats and surfaces at ambient pressure in order to elucidate its impact on reaction mechanisms between CB threats and state-of-the-art and novel CB mitigating surfaces. \n- Biomimetic - Optimized catalytic polyelectrolyte and metal organic framework structures for hydrolysis or oxidation of toxic agents. Evaluated and model self-decontaminating catalytic properties of materials for further testing against real agents.  \n- Novel Destruction - Investigated the elementary reactions, fundamental process parameters, and material mechanisms of a new means of neutralizing chemical warfare agents using a single-step, continuous supercritical water oxidation platform. Assessed and evaluated the efficacy of short chain fatty acids as a means of inactivating B. anthraces vegetative cells, endospores, and other microorganisms under a variety of environmental conditions and surfaces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.288"
                                            },
                                            "Text": {
                                                "val": "- Continue to examine the impact of processing parameters in designing large scale membranes, which respond to multiple CB threats via deactivation and conformation change to enable novel means of protection and minimization of thermal burden. \n- Continue designing and synthesizing novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment. \n- Continue to investigate the impact of morphology on approaches to mitigate chemical and biological threats on CB relevant substrates such as fibers and yarns. \n- Continue to investigate the impact of composition on structure and activity of materials to mitigate chemical and biological threats on CB relevant substrates.  \n- Continue to study fundamental mechanisms between CB threats and surfaces at ambient pressure in order to elucidate its impact on reaction mechanisms between CB threats and state-of-the-art and novel CB mitigating surfaces. \n- Continue investigation of ecological and environmental drivers of Burkholderia pseudomallei virulence and persistence using multiplexed barcoded high throughput sequencing.\n- Continue to examine biomarkers from interstitial fluid and begin microneedle biosensor development to identify protein analytes.  Optimize catalytic polyelectrolyte and metal organic framework structures for hydrolysis or oxidation of toxic agents.  Evaluate and model self-decontaminating catalytic properties of materials for further testing against real agents. \n- Continue to assess and evaluate the efficacy of short chain fatty acids as a means of inactivating B. anthracis vegetative cells, endospores, and other microorganisms under a variety of environmental conditions and surfaces. \n- Continue to investigate the elementary reactions, fundamental process parameters, and material mechanisms of a new means of neutralizing chemical warfare agents using a single-step, continuous supercritical water oxidation platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.508"
                                            },
                                            "Text": {
                                                "val": "- Environmental Availability - Determine genetic changes that occur when bacteria enters nonculturable state. Determine conditions that resuscitate bacteria and assess virulence after resuscitation.  \n- Photonics - Complete the design and fabrication of photonic components, including nano-scale thermal resonators, functionalized metallic nanohole arrays, and selective sensor coatings for optical resonators, and complete the proof of concept for chemical sensing using these components. \n- Chemical Reactivators - Determine mechanistic and structural studies of the aged reactivator complexes. \n- Multifunctional Materials - Reproduce synthesis to target a polymer composition containing the desired volume fraction of polymer blocks as required for successful and stable membrane generation. \n- Catalysts for CB Defense- Combined experimental data and modeling data to determine mechanism of the degradation. Synthesize metal organic framework (MOF) hybrids and quantify effects of interferent molecules. \n- Biomimetic - Evaluate molecules for bioremediation conditions that mimic field conditions.  Begin to screen catalysts in libraries to validate chemistry. \n- Novel Destruction - Continue to optimize chemical surrogates and design modifications of lab reactor for use with threat agents. Complete system requirement for the field prototypes"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "74.565"
                                        },
                                        "CurrentYear": {
                                            "val": "67.994"
                                        },
                                        "BudgetYearOne": {
                                            "val": "77.803"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "77.803"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "77.799"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.285"
                                        },
                                        "BudgetYearFour": {
                                            "val": "82.463"
                                        },
                                        "BudgetYearFive": {
                                            "val": "83.596"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "NT2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "51.625"
                                        },
                                        "CurrentYear": {
                                            "val": "53.720"
                                        },
                                        "BudgetYearOne": {
                                            "val": "52.902"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "52.902"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "50.111"
                                        },
                                        "BudgetYearThree": {
                                            "val": "52.385"
                                        },
                                        "BudgetYearFour": {
                                            "val": "52.377"
                                        },
                                        "BudgetYearFive": {
                                            "val": "52.368"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "73.276"
                                        },
                                        "CurrentYear": {
                                            "val": "70.960"
                                        },
                                        "BudgetYearOne": {
                                            "val": "71.882"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "71.882"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "76.953"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.329"
                                        },
                                        "BudgetYearFour": {
                                            "val": "75.839"
                                        },
                                        "BudgetYearFive": {
                                            "val": "75.928"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.878"
                                        },
                                        "CurrentYear": {
                                            "val": "21.698"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.798"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.798"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.039"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.538"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.833"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.682"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.781"
                                        },
                                        "CurrentYear": {
                                            "val": "22.749"
                                        },
                                        "BudgetYearOne": {
                                            "val": "24.180"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "24.180"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "30.295"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.085"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.076"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.071"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "92.231"
                                        },
                                        "CurrentYear": {
                                            "val": "88.188"
                                        },
                                        "BudgetYearOne": {
                                            "val": "120.526"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "120.526"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "128.035"
                                        },
                                        "BudgetYearThree": {
                                            "val": "127.992"
                                        },
                                        "BudgetYearFour": {
                                            "val": "122.006"
                                        },
                                        "BudgetYearFive": {
                                            "val": "122.553"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}