{
    "id": "2020-AirForce-PB-3600-MJBOOK-3-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-68",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "1203174F"
        },
        "ProgramElementTitle": {
            "val": "Space Innovation, Integration and Rapid Technology Development"
        },
        "R1LineNumber": {
            "val": "298"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.081"
            },
            "CurrentYear": {
                "val": "21.019"
            },
            "BudgetYearOne": {
                "val": "43.292"
            },
            "BudgetYearOneBase": {
                "val": "43.292"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "44.761"
            },
            "BudgetYearThree": {
                "val": "24.643"
            },
            "BudgetYearFour": {
                "val": "24.859"
            },
            "BudgetYearFive": {
                "val": "67.149"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.390"
                },
                "CurrentYear": {
                    "val": "21.019"
                },
                "BudgetYearOne": {
                    "val": "24.220"
                },
                "BudgetYearOneBase": {
                    "val": "24.220"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.081"
                },
                "CurrentYear": {
                    "val": "21.019"
                },
                "BudgetYearOne": {
                    "val": "43.292"
                },
                "BudgetYearOneBase": {
                    "val": "43.292"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.309"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "19.072"
                },
                "BudgetYearOneBase": {
                    "val": "19.072"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-2.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.309"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "19.072"
                                },
                                "BudgetYearOneBase": {
                                    "val": "19.072"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018: -$2.000M Congressional reduction - unjustified request\n\nFY 2020: +$20.000M increase to accelerate development of standardized space trainers; -$0.928M reduction for execution rephase"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "67A011"
                    },
                    "ProjectTitle": {
                        "val": "Space Analysis and Application Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.081"
                        },
                        "CurrentYear": {
                            "val": "21.019"
                        },
                        "BudgetYearOne": {
                            "val": "43.292"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.292"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "44.761"
                        },
                        "BudgetYearThree": {
                            "val": "24.643"
                        },
                        "BudgetYearFour": {
                            "val": "24.859"
                        },
                        "BudgetYearFive": {
                            "val": "67.149"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Located at Peterson AFB, Colorado, the Space Innovation, Integration and Rapid Technology Development (SIIRTD) program develops and modifies modeling and simulation tools that Air Force Space Command's Space Analysis Center uses for operations research, military utility analyses, tradeoff studies, and other evaluations of space mission areas to guide planning, programming, requirements generation, analyses of alternatives, and other activities.  Development activities incorporate changes in fielded and projected space operational capabilities, as well as technical improvements, into the group's software tools to ensure their data and technology remain current. Space Training Simulators develop and upgrades space training emulators using Standard Space Trainer (SST) to meet Space Mission Force (SMF) threat-based, advanced training requirements as well as funds connection to Distributed Mission Operations (DMO)training networks. Finally, its innovation, education, and training activities foster solutions to operational deficiencies and enhance the integration of space systems into Air Force operations, thereby enabling service and joint warfighters to realize the full potential of existing and planned space capabilities.  \n\nSpace acquisition must respond with speed and agility to emerging adversary threats. Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture. Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver SIIRTD weapon system capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 1206392F and 1206398F.\n\nThe FY2020 funding request was reduced by $0.928M to account for the availability of prior year execution balances.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Model\/Tool Development and Capability Upgrades"
                                    },
                                    "Description": {
                                        "val": "Develops, verifies, and validates models for space mission areas and modifies existing models to portray new capabilities that meet the national senior leader intent. Advancing M&S tools to incorporate space effects at the campaign, mission and engagement levels with the goal of enhancing decision support, visualization, exercise and wargaming. Rapidly meet downward-directed guidance implementing the system resiliency and situational awareness necessary to win in a contested space domain. Activities may include, but are not limited to, acquisition, program office support, studies, technical analysis,prototyping, etc. The space M&S is used for military utility analyses, trade studies, and other space program evaluations supporting OSD, Joint Staff, Headquarters Air Force, Headquarters Air Force Space Command, and the Space and Missile Center."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.201"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.326"
                                            },
                                            "Text": {
                                                "val": "Revamp existing space models and tools to meet recent presidential, CDRSTRATCOM, and COMAFSPC guidance. Begin developing a space campaign model to assess force structures in a contested environment to better organize USSPACECOM\/Space Force warfighting needs. Continue transforming FY2018 activities. Key models include the Advanced Framework for Simulation, Integration, and Modeling (AFSIM). This is an Air Force process that harnesses disparate domain capabilities into a simulation environment. Threat, Vulnerability, Timeline (TVT) is a tool underpinning key POM decisions, overlaying force structure on the given threat constructs to identify warfighting shortfalls. The Program's mission\/campaign modeling suites must be updated to produce technically sound and responsive space analyses for warfighter operations in a highly-contested environment. These tools assess how well we meet national and military needs identified by the Enterprise Space Architecture Office (ESAO) and Joint Space Warfighter Forum (JSWF). The Space Surveillance Network Analysis Model (SSNAM) is a key warfighting tool supporting the JFSCC's operation centers' situational awareness. As a major warfighting domain, it is critical we establish the tool to accurately represent space.\n\nContinue to produce technically sound and responsive space\/cyberspace analyses analyzing warfighter ops in a highly-contested environment in support of national and military needs and other model modifications as needed based on leadership questions and future analysis of alternatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.423"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.423"
                                            },
                                            "Text": {
                                                "val": "Continue to modernize space models and tools to meet recent presidential, CDRSTRATCOM, and COMAFSPC guidance. Begin developing a space campaign model to assess force structures in a contested environment to better organize USSPACECOM\/Space Force warfighting needs. Continue transforming FY 2019 activities. Key models include the Advanced Framework for Simulation, Integration, and Modeling (AFSIM). This is an Air Force process that harnesses disparate domain capabilities into a simulation environment. Threat, Vulnerability, Timeline (TVT) is a tool underpinning key POM decisions, overlaying force structure on the given threat constructs to identify warfighting shortfalls. The Program's mission\/campaign modeling suites must be updated to produce technically sound and responsive space analyses for warfighter operations in a highly-contested environment. These tools assess how well we meet national and military needs identified by the Enterprise Space Architecture Office (ESAO) and Joint Space Warfighter Forum (JSWF). The Space Surveillance Network Analysis Model (SSNAM) is a key warfighting tool supporting the JFSCC's operation centers' situational awareness. As a major warfighting domain, it is critical we establish the tool to accurately represent space.\n\nContinue to produce technically sound and responsive space\/cyberspace analyses analyzing warfighter ops in a highly-contested environment in support of national and military needs. Produce other model modifications as needed based on leadership questions and future analysis of alternatives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 to FY2020 $0.097 increase due to inflation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Model Verification"
                                    },
                                    "Description": {
                                        "val": "Verification of changes made to models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.752"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.330"
                                            },
                                            "Text": {
                                                "val": "Continue verification of model changes resulting from model development and modification efforts.  Development and capability upgrades of system modeling tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.373"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.373"
                                            },
                                            "Text": {
                                                "val": "Continue to modernize space models and tools to meet recent presidential, CDRSTRATCOM, and COMAFSPC guidance. Begin developing a space campaign model to assess force structures in a contested environment to better organize USSPACECOM\/Space Force warfighting needs. Continue transforming FY 2019 activities. Key models include the Advanced Framework for Simulation, Integration, and Modeling (AFSIM). This is an Air Force process that harnesses disparate domain capabilities into a simulation environment. Threat, Vulnerability, Timeline (TVT) is a tool underpinning key POM decisions, overlaying force structure on the given threat constructs to identify warfighting shortfalls. The Program's mission\/campaign modeling suites must be updated to produce technically sound tools assess and responsive space analyses for warfighter operations in a highly-contested environment. These tools assess how well we meet national and military needs identified by the Enterprise Space Architecture Office (ESAO) and Joint Space Warfighter Forum (JSWF). The Space Surveillance Network Analysis Model (SSNAM) is a key warfighting tool supporting the JFSCC's operation centers' situational awareness. As a major warfighting domain, it is critical we establish the tool to accurately represent space.\n\nContinue to produce technically sound and responsive space\/cyberspace analyses analyzing warfighter ops in a highly-contested environment in support of national and military needs. Produce other model modifications as needed based on leadership questions and future analysis of alternatives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 to FY2020 $0.43M increase due to inflation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Model Validation"
                                    },
                                    "Description": {
                                        "val": "Validated model change results."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.813"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.439"
                                            },
                                            "Text": {
                                                "val": "Continue validation of model changes resulting from model development and modification of system tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.502"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.502"
                                            },
                                            "Text": {
                                                "val": "Continue to modernize space models and tools to meet recent presidential, CDRSTRATCOM, and COMAFSPC guidance. Begin developing a space campaign model to assess force structures in a contested environment to better organize USSPACECOM\/Space Force warfighting needs. Continue transforming FY 2019 activities. Key models include the Advanced Framework for Simulation, Integration, and Modeling (AFSIM). This is an Air Force process that harnesses disparate domain capabilities into a simulation environment. Threat, Vulnerability, Timeline (TVT) is a tool underpinning key POM decisions, overlaying force structure on the given threat constructs to identify warfighting shortfalls. The Program's mission\/campaign modeling suites must be updated to produce technically sound and responsive space analyses for warfighter operations in a highly-contested environment. These tools assess how well we meet national and military needs identified by the Enterprise Space Architecture Office (ESAO) and Joint Space Warfighter Forum (JSWF). The Space Surveillance Network Analysis Model (SSNAM) is a key warfighting tool supporting the JFSCC's operation centers' situational awareness. As a major warfighting domain, it is critical we establish the tool to accurately represent space.\n\nContinue to produce technically sound and responsive space\/cyberspace analyses analyzing warfighter ops in a highly-contested environment in support of national and military needs. Produce other model modifications as needed based on leadership questions and future analysis of alternatives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 to FY 2020 $0.63M increase due to inflation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Training Simulators"
                                    },
                                    "Description": {
                                        "val": "Develop\/upgrade Standard Space Trainer (SST) simulators to meet Space Mission Force (SMF) threat-based, advanced training requirements as well as builds connectivity to Distributed Mission Operations (DMO) training networks. Follows direction set out in USAF Operational Training Infrastructure (OTI) Flight Plan, as well as meets United States Strategic Command's Integrated Priority List (IPL)priority."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.315"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.924"
                                            },
                                            "Text": {
                                                "val": "Distributed Mission Operations - Space (DMO-S) modeling and simulation development and develop the Geostationary Space Situational Awareness (GSAAP) Standard Space Trainer (SST). GSSAP SST will include DMO connectivity, Enterprise Ground Service (EGS) compatibility, and Blue\/White\/Red operator-in-the-loop modeling and simulation consoles (i.e., GSSAP space operator consoles, instructor\/evaluator consoles, and opposing force consoles). Also begins development of Space-Based Infrared System (SBIRS), Upgraded Early Warning Radar (UEWR) SSTS and planned delivery of Global Positioning System (GPS) SST."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.994"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.994"
                                            },
                                            "Text": {
                                                "val": "Accelerate completion of SSTs for GSSAP and SBIRS (projected completion in early FY 2021); begin SST development for additional weapon systems, to include Mistar, Advanced Extremely High Frequency (AEHF), Wideband Global Satellite System (WGS), and Defense Satellite Communication System (DSCS)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 to FY 2020 $22.070M increase due to additional SST development.  As part of the Space Enterprise Vision and space training shortfalls outlined in the Space Cadre Task Force Report (15 Aug 18)."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "SPAF 01 GNRLT"
                                    },
                                    "Title": {
                                        "val": "General IT"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.661"
                                        },
                                        "CurrentYear": {
                                            "val": "1.564"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.350"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.350"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.374"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.398"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.425"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.451"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Funding and content procures equipment for the SIIRTD AFSPC Virtual Analysis Capability (AVAC) system.  Supports space and cyber modeling and analysis using a variety of Linux and Windows based hardware and software suites. Also procures Information Technology (IT) hardware & software infrastructure for the Distributed Communications Architecture for ACC."
                        },
                        "AcquisitionStrategy": {
                            "val": "Any new projects funded in this program will be awarded using competitive procedures to the maximum extent possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Develop\/modify software tools\/models - OCO"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop\/modify software tools\/models"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SimaTek"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Denver, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.303"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.311"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.311"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop\/modify software tools and models"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Segue Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lake Forest, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.870"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Develop and modify software tools\/models"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Segue Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lake Forest, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.596"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.792"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.987"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.987"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Space Training Simulator Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sonalysts Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.315"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.924"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "31.994"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "31.994"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "SIIRTD"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Model development\/modification, verification, and validation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Space Training Simulators"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}