{
    "id": "2020-Navy-PB-1319-MJBOOK-0-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-4",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Applied Res"
        },
        "R1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "182.614"
            },
            "CurrentYear": {
                "val": "180.549"
            },
            "BudgetYearOne": {
                "val": "119.517"
            },
            "BudgetYearOneBase": {
                "val": "119.517"
            },
            "BudgetYearTwo": {
                "val": "119.535"
            },
            "BudgetYearThree": {
                "val": "121.947"
            },
            "BudgetYearFour": {
                "val": "124.439"
            },
            "BudgetYearFive": {
                "val": "126.937"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The activities described in this program element (PE) address future Navy and Marine Corps capabilities needed to maintain maritime superiority and ensure national security.  They are based on input from Naval Research Enterprise stakeholders (including the Naval enterprises, the combatant commands, OPNAV and Headquarters Marine Corps) and are designed to exploit breakthroughs in science and technology in order to deliver maximum warfighting benefit to our sailors and marines.  These efforts are aligned with shared priorities throughout the whole of RDT&E in order to quickly advance new capabilities from discovery to deployment across the warfighting domains.\n\nThis PE addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy.  It supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms.  The goal is to provide the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage while preserving operational capability.  Within the Naval Transformational Roadmap, this investment directly supports the Theater Air and Missile Defense transformational capability required by Sea Shield and the Ship to Objective Maneuver key transformational capability.  This is accomplished by improvements in platform offensive performance, stealth, and self-defense.  \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "125.557"
                },
                "CurrentYear": {
                    "val": "124.049"
                },
                "BudgetYearOne": {
                    "val": "121.889"
                },
                "BudgetYearOneBase": {
                    "val": "121.889"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "182.614"
                },
                "CurrentYear": {
                    "val": "180.549"
                },
                "BudgetYearOne": {
                    "val": "119.517"
                },
                "BudgetYearOneBase": {
                    "val": "119.517"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "57.057"
                },
                "CurrentYear": {
                    "val": "56.500"
                },
                "BudgetYearOne": {
                    "val": "-2.372"
                },
                "BudgetYearOneBase": {
                    "val": "-2.372"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "56.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.947"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.372"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.372"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.004"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "62.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The program decrease in FY 2020 is due to the completion of research efforts included in the Applied Research Challenge (ARC) program through FY 2019. These efforts were within Surface Ship & Submarine HM&E subproject."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "122.743"
                        },
                        "CurrentYear": {
                            "val": "124.049"
                        },
                        "BudgetYearOne": {
                            "val": "119.517"
                        },
                        "BudgetYearOneBase": {
                            "val": "119.517"
                        },
                        "BudgetYearTwo": {
                            "val": "119.535"
                        },
                        "BudgetYearThree": {
                            "val": "121.947"
                        },
                        "BudgetYearFour": {
                            "val": "124.439"
                        },
                        "BudgetYearFive": {
                            "val": "126.937"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy.  It supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms.  The goal is to provide the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage while preserving operational capability.  Within the Naval Transformational Roadmap, this investment directly supports the Theater Air and Missile Defense transformational capability required by Sea Shield and the Ship to Objective Maneuver key transformational capability by virtue of improvements in platform offensive performance, stealth, and self-defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AIRCRAFT TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The Aircraft Technology activity develops technologies for reduced observables technology and enhanced capability of naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, saleable naval air vehicle technologies, such as - autonomous air vehicle command and control, helicopter and tilt rotor systems, aerodynamics, propulsion systems, materials, structures and flight controls for future and legacy air vehicles. \n\nVariable Cycle Advanced Technology (VCAT) will identify and mature critical, relevant variable\/adaptive cycle propulsion system technologies for the next generation carrier-based Tactical Aircraft (TACAIR)\/Intelligence, Surveillance and Reconnaissance (ISR) systems. The Sea-Based Aviation National Naval Responsibility (SBA NNR) Structures and Materials program will develop the next generation structural capability and material response science for aircraft technology in fixed and rotary wing, manned and unmanned airframe technology to achieve reduced weight, increased durability, strength, streamlined manufacturability, reduced life-cycle cost and maintenance\/readiness gaps improvements. Program payoffs include increased availability\/readiness, reduced sustainment requirements, fatigue\/loads life enhancement, reduced weight and improved range, and advanced prognostics design tools. \n\nThese efforts addresses unique attributes to propulsion and power technologies for Naval Aviation, as well as those having higher importance to Naval Aviation and some that are more pervasive to all of military aviation. Related basic research efforts are addressed under 0601153N Defense Research Sciences."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "38.127"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Pursue research related to Sea-Based Aviation National Naval Responsibility (SBA NNR) priorities in Aviation, Propulsion, and Structures and Materials.\n- Examples of research in Aircraft Technology include efforts in Virtual Ship\/Aircraft Dynamic Interface, Manned\/\nUnmanned Handling Qualities and Control, Automated Deck Operations, High Lift Aerodynamics and Vertical\/Short Takeoff and Landing (V\/STOL) Operations, the development of rotorcraft\/VTOL systems automated launch and recovery technology and mechanical\/environmental failure prediction research.\n- Examples of research in Propulsion include the VCAT Program. Major engine manufacturers and system contractors will develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based TACAIR\/ISR systems.\n- Examples of research in Structures and Materials include advanced composite durability technology.\n- Expanding material degradation risk prediction and operational environment-driven materials selection methods.\n- Pursue research related to Autonomy including efforts on high confidence\/Safe Autonomous Control in naval environments and on supervisory control of decentralized heterogeneous Unmanned Aerial System (UAS). \n- Expanding efforts on safe-perception based autonomous control in complex naval environments and on autonomy to support combined unmanned and manned air systems\/units."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Ongoing research related to SBA NNR priorities in Aviation, Propulsion, and Structures and Materials.\n\nOngoing research in Aircraft Technology, examples of research\/efforts include Virtual Ship\/Aircraft Dynamic Interface, Manned\/Unmanned Handling Qualities and Control, Automated Deck Operations, High Lift Aerodynamics and V\/STOL Operations, the development of rotorcraft\/VTOL systems automated launch and recovery technology and mechanical\/environmental failure prediction research. \n\nOngoing research in Propulsion, examples of research\/efforts include the VCAT Program. Major engine manufacturers and system contractors will develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based TACAIR\/ISR systems. \n\nOngoing research in Structures and Materials, examples of research\/efforts include advanced composite durability technology, new materials development, process-property relationship analysis, improved material selection tools, structural life prediction, multi-functional surfaces, and structural optimization for lightweighting.. \n\nExpanding material degradation risk prediction and operational environment-driven materials selection methods. \n\nOngoing research related to Autonomy, examples of research\/efforts include high confidence\/Safe Autonomous Control in naval environments and on supervisory control of decentralized heterogeneous UAS. Expand efforts on safe-perception based autonomous control in complex naval environments and on autonomy to support combined unmanned and manned air systems\/units."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct ongoing research related to Sea Based Aviation National Naval Responsibility (SBA NNR) priorities in Aviation, Propulsion, and Structures and Materials.  Ongoing research in Aircraft Technology, examples of research\/efforts include Virtual Ship\/Aircraft Dynamic Interface, Manned\/Unmanned Handling Qualities and Control, Automated Deck Operations, High Lift Aerodynamics and Vertical\/Short Take-off and Landing (V\/STOL) Operations, the development of rotorcraft\/Vertical Take-Off and Landing (VTOL) systems automated launch and recovery technology and mechanical\/ environmental failure prediction research.  Examples of ongoing research in Propulsion include the Variable Cycle Advanced Technology (VCAT) Program. Major engine manufacturers and system contractors will develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based Tactical Aircraft (TACAIR) systems. \n\nOngoing research in Structures and Materials include: advanced composite durability technology; new materials development; process-property relationship analysis; improved material selection tools; structural life prediction; multi-functional surfaces; and structural optimization for reducing structural weight.  Methods to expanding material degradation risk prediction and operational environment-driven materials selection methods will be created. \n\nExamples of ongoing research related to Autonomy include: high confidence\/Safe Autonomous Control in naval environments and on supervisory control of decentralized heterogeneous Unmanned Aircraft Systems (UAS).  Expand efforts on safe-perception based autonomous control in complex naval environments and on autonomy to support combined unmanned and manned air systems\/units.\n\nSpecific efforts in FY 2020 include:\n\nEfforts to mature Integrated Propulsion, Power and Thermal Management System technologies to an appropriate level to meet the next generation TACAIR Technology Maturation Readiness Review notional plan and schedule.  Investigate technologies that could increase engine efficiency, power and aircraft range including engine inlet distortion control, turbomachinery and drive systems optimization, high temperature engine materials and coatings, engine compressor casing treatments and advanced thermal management and transport systems.\n\nFlight Dynamics & Control analysis and scaled experiments to demonstrate knowledge fundamental aspects of phenomena associated with multibody control systems with a focus on the ability to demonstrate guaranteed performance relative to a desired end state.  Demonstrate algorithms and technology to enable precise ship-relative navigation in GPS-denied environments.\n\nAerodynamics research to demonstrate a new method for in situ measurement if ship airwake dynamics.  Demonstrate a leap forward in the capability to run real-time simulations of the coupled aerodynamics involved in ship-based recovery of rotary wing aircraft in order to advance the capability of piloted simulations and increase their effectiveness as training tools.\n\nHigh Fidelity Composite Characterization for Rapid Certification of Advanced Structures - application of previously developed advanced characterization methods for current and emerging next generation Composites.  This data will feed rapid certification through advanced damage modeling and failure predictions.  Advanced Galvanic Compatibly Theory for Operationally Optimized Material Selection - validation and transition of novel compatibility theory to improve material selection and design in vehicle sustainment and life extension."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FLEET FORCE PROTECTION AND DEFENSE AGAINST UNDERSEA THREATS"
                                    },
                                    "Description": {
                                        "val": "Fleet Force Protection and Defense against Undersea Threats efforts include applied research for complementary sensor and processing technologies for platform protection.  Current small platforms (both surface and airborne) have little to no situational awareness (SA) or self-protection against air, surface, and asymmetric threats.  A goal of this activity is to provide these platforms with effective self-protection.  The technology areas specific to platform protection will develop individual, multispectral electro-optical (EO), infrared (IR), radio frequency (RF), electro-magnetic (EM), visual and acoustic or chemical sensors\/biosensors and associated processing.  To defend platforms from current and advanced threats in at-sea littoral environments and in port, these technologies must improve multispectral detection and distribution of specific threat information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing: \n-Finish Sensors & Associated Processing related efforts to develop an implosion-resistant hydrogen storage technology for use in undersea fuel cells, development of wide area standoff detection of explosives, and study of Electrochemical sensors for the distributed, remote detection of explosives.\n\nUndersea Warfare:\n-Conduct undersea storage capacity of hydrogen by developing an implosion-resistant, safe, and inexpensive hydrogen storage technology that addresses powering autonomous systems, such as autonomous undersea vehicles and distributed autonomous underwater networks, for persistent force protection and defense against undersea threats.  \n\nMaterials and Chemistry:\n-Design and develop, utilizing room temperature ionic liquids to demonstrate and fabricate inexpensive, miniaturized, low power electrochemical sensors for use in autonomous as well as distributed sensor networks.  \n-Develop real time, standoff, moving target, laser based detection for explosives and hazardous chemicals with the intent of shifting the paradigm of trace chemical detection through surface contact swabbing to a faster, more flexible wide area, standoff method for significant enhancement of force protection. \n-Develop and design a new class of safe high performance rechargeable zinc air batteries to supplant state of lithium-ion batteries.  \n-Develop chemical vapor sensing strategy for application in marine environment, significantly different than terrestrial environment.   \n-Demonstrate electrochemical detection elements incorporated into electronic integrated circuits. \n-Demonstrate efficiency of zinc sponge anode in an electrochemical cell."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Warfare:\nOngoing research in Undersea Warfare, examples of research include conceptualizing and performing laboratory and field studies to: developing acoustics technology and associated signal processing for the detection of small unmanned aerial vehicles (UAVs); continued development of a pressure tolerant, inexpensive hydrogen storage based on hydrogenated graphene to increase undersea storage capacity.\n\nMaterials and Chemistry: \nOngoing research in Materials and Chemistry, examples of research include design and development, utilizing room temperature ionic liquids, to demonstrate and fabricate inexpensive, miniaturized, low power electrochemical sensors for use in autonomous as well as distributed sensor networks; developing real time, standoff, moving target, laser based detection for explosives and hazardous chemicals with the intent of shifting the paradigm of trace chemical detection through surface contact swabbing to a faster, more flexible wide area, standoff method for significant enhancement of force protection; development and design of a new class of safe high performance rechargeable zinc air batteries to supplant state of lithium-ion batteries; development of chemical vapor sensing strategy for application in a marine environment, significantly different than terrestrial environment; performance demonstrations of highly sensitive electrochemical detection elements incorporated into electronic integrated circuits; and demonstrations of high efficiency of zinc sponge anode in an electrochemical cell."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors and Associated Processing: Develop a new 3D ISAR capability for moving targets in air,\nspace, ground, and sea to allow better target recognition.\n\nMaterials and Chemistry: Design and develop, utilizing room temperature ionic liquids, to demonstrate and fabricate\ninexpensive, miniaturized, low power electrochemical sensors for use in autonomous as well as distributed sensor networks. Develop real time, standoff, moving target, laser based detection for explosives and hazardous chemicals with the intent of shifting the paradigm of trace chemical detection through surface contact swabbing to a faster, more flexible wide area, standoff method for significant enhancement of force protection. Develop and design a new class of safe high performance rechargeable zinc air batteries to supplant state of lithium-ion batteries. Development of chemical vapor sensing strategy for application in marine environment, significantly different than terrestrial environment. Significant accomplishments include performance demonstration of highly sensitive electrochemical detection elements incorporated into electronic integrated circuits. Demonstration of high efficiency of zinc sponge anode in an electrochemical cell. \n\nUndersea Warfare: Conceptualize and perform laboratory and field studies to: develop acoustics technology and associated signal processing for the detection of small Unmanned Aerial Vehicles (UAVs); and the development of a pressure tolerant, inexpensive hydrogen storage based on hydrogenated graphene to increase undersea storage capacity."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ADVANCED ENERGETICS"
                                    },
                                    "Description": {
                                        "val": "Advanced Energetics efforts address technology development to provide substantial improvements in energetic material systems and subsystems, primarily in terms of performance, but also addressing safety, reliability, and affordability concerns.  Goals include: advanced energetic materials for warheads, propellants, and reactive material based subsystems for both defensive and offensive applications.  Efforts include: development of new fuels, oxidizers, explosive ingredients and formulations; and reliable simulation tools and diagnostics to develop and design superior-performance, and\/or reduced-vulnerability systems tailored to specific warfighter missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.014"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Pursue research related to Advanced Energetics including development and evaluation of advanced explosive\/propellant\/ reactive ingredients and formulations for the next generation higher performing systems.\n\nPursue research in proof of concept efforts to develop insensitive explosives, propellants, and munitions without compromising performance. This work involves development of high quality, small particle energetic ingredients, novel processing techniques, and advanced energy conversion concepts; and involves both theoretical and experimental efforts.\n\nExpand research in development and diagnostics of novel energy conversion concepts to enhance performance, more efficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead application."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.497"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Ongoing research related to Advanced Energetics including development and evaluation of advanced explosive\/propellant\/reactive ingredients and formulations for the next generation higher performing systems.\n \nOngoing research in proof of concept efforts to develop insensitive explosives, propellants, and munitions without compromising performance. This work involves development of high quality, small particle energetic ingredients, novel processing techniques, and advanced energy conversion concepts; and involves both theoretical and experimental efforts.\n\nOngoing research focused on chemical processing technologies. Incorporate molecular design and crystal morphology technology into scale-up and process development.  New compliant commodity energetic ingredients will be transitioned to the industrial base as appropriate.\n \nContinue research in development and diagnostics of novel energy conversion concepts to enhance performance, more efficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead application."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.380"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research related to Advanced Energetics including development and evaluation of advanced explosive\/propellant\/\nreactive ingredients and formulations for the next generation higher performing systems.\n\nConduct research in proof of concept efforts to develop insensitive explosives, propellants, and munitions without\ncompromising performance. This work involves development of high quality, small particle energetic ingredients, novel\nprocessing techniques, and advanced energy conversion concepts; and involves both theoretical and experimental efforts.\n\nConduct research focused on chemical processing technologies. Incorporate molecular design and crystal morphology\ntechnology into scale-up and process development. New compliant commodity energetic ingredients will be transitioned to\nthe industrial base as appropriate.\n\nConduct research in development and diagnostics of novel energy conversion concepts to enhance performance, more\nefficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead\napplication."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURFACE SHIP & SUBMARINE HULL MECHANICAL & ELECTRICAL (HM&E)"
                                    },
                                    "Description": {
                                        "val": "Technology programs focused on providing technologically superior warfighting capabilities at reduced total ownership costs for surface and subsurface platforms through investments in applied research and advanced technology development of programs in:  a) Advanced Naval Power, b) hydrodynamics, c) structures, d) autonomy for unmanned surface vehicles (USV), and e) platform survivability. This element also includes the National Naval Responsibility in Naval Engineering (NNR-NE).  The NNR-NE supports early applied research in the areas of propulsion, platform structures, hydrodynamics, automation control and system engineering, design tools, naval power systems and ensuring a strong and healthy academic infrastructure.  Specific research themes are:\n\nAdvanced Naval Power Systems Technology:\nEfforts address electrical and auxiliary system and component technology to dramatically improve energy and power density, operating efficiency, and recoverability from casualties. A major investment focus is providing the power and energy required for directed energy weapons on current and future surface combatants. Advanced Naval Power efforts include: developing technologies for high-power, cyber-secured energy networks, distribution and control of power, providing warfighting capability with more energy efficient systems; mitigate adverse impacts of alternative fuel on Naval platforms and equipment; and utilizing the Electric Ship Research and Development Consortium (ESRDC) efforts to develop modeling and simulation tools to provide critical design and operational capabilities for the all-electric ship program, accelerate development and demonstration of technologies, reduce risk of new technology insertion, and address the national shortage of electrical power engineers. \n\nDevelop new machinery integration concepts. Develop simulation based Verification, Validation and Accreditation (VV&A) methods and technologies.  Contribute to system reconfiguration.  Design a ship electrical system architecture based on a main bus that distributes \"rough\" Direct Current (DC) power throughout the ship at nominally 10 KV.  Development of macro- and atomic-scale multi-physics models is being pursued to enhance understanding of materials processing and performance, energy conversion mechanisms, cyber-physical energy concepts, and power management.  System-level studies focus on the scalability and reliability of component technologies.  Another thrust is the development of tools to model heat transfer at multiple length scales allowing for simulation of heat flow through the ship in order to evaluate the impact of power conversion electronics, sensors, and weapons on the overall thermal balance of the vessel.\n\nAdvanced Sea Platform Technology:\nHydrodynamics: Critical platform design for surface ships hydrodynamics that is focused on the theory, computation, and lab and at-sea experimentation to develop understanding and prediction capabilities for all hydrodynamic phenomena associated with surface ships and small craft, their effects on vessel performance, and concepts for modification.  Propulsor hydrodynamics is focused on understanding the physics of flow around propulsors and their interactions to improve propulsor performance, mobility, efficiency, and affordability, as well as prediction and control of various types of cavitation on propulsors and appendages. This also includes predictive capability of cavitation inception, thrust breakdown, and erosion phenomenon and scaling laws. Technology efforts in the area of Subsurface Hydrodynamics include identifying, understanding, predicting, and controlling flow physics, as well as turbulence and stratified wakes.  This is further applied to Subsurface Maneuvering Technologies, and understanding the Dynamics of Interacting Platforms. Additionally hydrodynamic technologies focused on the signature aspects of the hull-propulsor interaction and maneuvering.\n\nPlatform Structures: Focused on time-varying, structural reliability analysis and prediction for a ship structural system with uncertainty quantification and propagation. Specific topics include novel structural configurations across composite and metallic materials and prediction methods for advanced global hull strength, local panel and component strength, fatigue and fracture strength, and seaway loads and load effects for high-speed\/high-performance ships and vessels.  Hull life assurance addresses development of new structural system approaches for surface ships and submarines, including the management of weapons effects to control structural damage and the improvement of structural materials.\n\nUnmanned Surface Vehicles (USV): Autonomy for USVs and related mission functions aligned with Naval S&T strategic focus on autonomy and unmanned vehicles. Unmanned Sea Surface Vehicle (USSV) applied research includes short-term motion forecasting for recovery of USSVs on a host ship in higher sea states and determination of slamming loads on high-speed planing hulls for structural weight reduction Distributed intelligence for automated survivability addresses both the basic technology of automating machinery control systems, as well as, distributed control of systems utilizing autonomy for mission context based reconfiguration.\n\nSea Platform Survivability Technology:\nAligned with survivability S&T strategic focus area, research investigates electromagnetic (EM) sources (including major ferro and non-ferromagnetic sources, eddy currents, and Corrosion Related Magnetic Fields (CRM)) that are associated with naval platforms.  Develop understanding of EM field propagation relationships and analysis aids, and technologies to predict the electromagnetic properties of a naval platform.  Advance physics based understanding of platform acoustics. Discover and develop algorithms and methods that will enable the development of improved design, analysis, and prediction tools for enhanced acoustic performance. Understand, design and develop optical and acoustic metamaterials to control light and sound propagation over a large frequency range.  New architectures to overcome challenges associated with loss, bandwidth, and scalability are being explored.  Design and develop models, algorithms, and integrated development environments for simulation and control of complex, interdependent, distributed shipboard machinery systems to enable integrated, autonomous operation and reconfiguration of shipboard machinery systems.  Efforts also include: signature reduction, hull life assurance, hydromechanics, distributed control for automated survivability (includes damage control), and advanced naval power systems. Signature reduction addresses electromagnetic, infrared, structural acoustics and acoustic signature tailoring, both topside and underwater. Develop and advance time critical stealth technologies for SSBN and SSN programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "71.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced Naval Power Systems Technology:\nPursue research related to the Next Generation Integrated Power System (NGIPS) and Distribution\/Control of Power Advanced Power Systems with a focus on power and energy requirements for directed energy weapons on current and future surface combatants. \nConduct applied research related to critical S&T to investigate efforts related to Power & Energy Technology, including alternative power sources, UAV fuel cell development and power and energy outreach and sustainability efforts.\nFinish effort to make significant impact in high voltage power electronics technology to enable compact power converters, medium voltage distributed power architectures, new weapons and sensor systems for Navy and Marine applications. \n\nAdvanced Sea Platform Technology:\nConduct applied research related to critical S&T to investigate platform design efforts related to propulsor and subsurface hydrodynamics; structural reliability science; and structural acoustics. \n\nExpand research related to the unmanned sea surface vehicle and Medium Displacement Unmanned Surface Vehicle (MDUSV)  and USV Swarm efforts.  \n\nPursue research related to naval engineering and platform design, including Ohio Replacement Program efforts.\n \nSea Platform Survivability Technology:\nConduct applied research related to critical S&T to investigate efforts related to signature reduction; machinery autonomy; and platform survivability. \n\nScience & Technology to Address Complex Hybrid WarfareThreats: \n- Continue and expand efforts related to directed energy weapons, Route Reconnaissance and Clearance methodologies, and development of modular, reconfigurable, integrated multi-modal stand-off detection and neutralization of explosive hazard (IED & Mines) system. \n- Complete research in the mitigation of Counter Improvised Explosive Devices (C-IED) effects (blast, blunt trauma, ballistics) on personnel.\n- Initiate projects to counter complex hybrid warfare threats. S&T technologies will address a broad range of multi-faceted threats that employ both conventional and unconventional forces.\n\nApplied Research Challenge (ARC): \n- Continue base program efforts including network information sciences, long-range high-resolution imaging, ocean surface scatter in radio frequency (RF) propagation, wake measurement technologies, thermal management systems, high power control modules for ship application, decision support\/uncertainty analysis for operational environments, and reactive composite materials.  Continued development of advanced undersea autonomy for Naval missions.\n\nMaterials and Chemistry:\nUnderstanding methods for fabricating nickel\/graphene\/cobalt magnetic tunneling junctions to develop new tunnel barrier materials technology for fast low power radiation hard memory and magnetic sensors.  This effort will be a paradigm shift for magnetic tunnel junction technology, which is significantly different than use of conventional oxides such as magnesium oxide (MgO) and aluminum oxide (Al2O3). Successful accomplishments have been made to show that graphene can be used as a tunnel barrier material.\n\nElectronics:\nCreate and explore new high voltage, high efficiency wide bandgap and ultra-wide bandgap power switches for electric propulsion and electric weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "72.772"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced Energy Systems Research:\nOngoing applied research related to critical S&T in Power & Energy Technology related to energy systems.  This research in energy systems provides innovative energy technologies and system designs to increase mission capability.  Areas of research include all scientific and engineering aspects of the production, conversion, delivery, and use of energy for installation critical infrastructure, forward operating and remote bases, humanitarian assistance and disaster relief operations, manned and unmanned platforms, and general energy network applications. Primary objectives are to improve warfighting readiness, effectiveness, and flexibility through research projects focused on enhancing energy cyber-security, resiliency and efficiency.  Research programs often include activities that purposely incorporate veterans and other military personnel into projects to enhance military applicability and to provide a sustainable source of military-experienced professionals for the DoN energy workforce.\n\nAdvanced Naval Power Systems Technology: \nOngoing research related to the NGIPS and Distribution\/Control of Power Advanced Power Systems with a focus on power and energy requirements for directed energy weapons on current and future surface combatants. \n\nAdvanced Sea Platform Technology: \nOngoing applied research related to critical S&T to investigate platform design efforts related to propulsor and subsurface hydrodynamics; structural reliability science; and structural acoustics. Expand research related to the unmanned sea surface vehicle. \n\nOngoing research related to naval engineering and platform design, including Ohio Replacement Program efforts. \n\nSea Platform Survivability Technology: \nOngoing applied research related to critical S&T to investigate efforts related to signature reduction; machinery autonomy; and platform survivability. \n\nScience & Technology to Address Complex Hybrid Warfare Threats: \nOngoing projects to counter complex hybrid warfare threats. S&T technologies will address a broad range of multi-faceted threats that employ both conventional and unconventional forces. The S&T technologies will continue to expand and emphasize various compact platforms in multi-environments.\n\nApplied Research Challenge (ARC):\n\nOngoing base program efforts, initiated in FY 2017 and FY 2018, including network information sciences, long-range high-resolution imaging, ocean surface scatter in RF propagation, wake measurement technologies, thermal management systems, high power control modules for ship application, decision support\/uncertainty analysis for operational environments, and reactive composite materials. In particular, continue research to develop and test autonomy for Unmanned Undersea Vehicle (UUV) missions including understanding of counter-UUV autonomy options; implementations and testing. \n\nMaterials and Chemistry: \nOngoing research for understanding methods for fabricating nickel\/graphene\/cobalt magnetic tunneling junctions to develop new tunnel barrier materials technology for fast low power radiation hardened memory and magnetic sensors.  This continuing effort will be a fundamental shift for magnetic tunnel junction technology, which is significantly different than the use of conventional oxides such as MgO and Al2O3. Favorable accomplishments have been made to show that graphene can be used as a tunnel barrier material.\n\nElectronics: \nOngoing research to create and explore new high voltage, high efficiency wide bandgap and ultra-wide bandgap power switches for electric propulsion and electric weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "67.859"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "67.859"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced Naval Power and Energy Systems Research and Technology: \nAdvanced energy systems research includes a significant research program with the Hawaii Natural Energy Institute (HNEI) at the University of Hawaii that is focused on the analysis and optimization of resilient electrical grids and microgrids in the Pacific region.  Prior and on-going research has demonstrated the ability of advanced batteries and other power management technologies to greatly enhance the stability and reliability of electrical grids possessing high penetrations of variable renewable energy resources.  Results from these demonstrations will be used to evaluate and increase the energy resiliency of critically infrastructures on DOD installations in the Pacific.  The HNEI program has also initiated a new collaboration with the Alaska Center for Energy and Power (ACEP) at the University of Alaska Fairbanks to explore the use of energy storage technologies and distributed energy resources to enhance the energy resiliency of microgrids at remote locations and at DOD facilities in cold weather environments.\n\nTo support both new and existing surface ship and submarine programs, specific new and ongoing efforts are aimed at supporting electrical system reliability, as well as advanced power distribution and control and will utilize the Electric Ship Research and Development Consortium (ESRDC) to develop modeling and simulation tools, system analysis tools and models to provide critical design and operational capabilities for the all-electric ship program, accelerate development and demonstration of technologies, and to reduce risk of technology insertion. These efforts also address the national shortage of naval electrical power engineers. \n\nOngoing research related to the Next Generation Integrated Power System (NGIPS) and Distribution\/Control of Power Advanced Power Systems with a focus on power and energy requirements for directed energy weapons and advance sensor systems on current and future surface combatants, as well as for unmanned naval platforms.\n\nAdvanced Sea Platform Technology: \nNew and ongoing applied research related to critical S&T that supports platform design and advanced capability efforts related to propulsor, surface, and subsurface hydrodynamics; platform performance, and platform structural reliability. Specifically, efforts to utilize advanced analytics (machine learning and artificial intelligence), incorporate environmental effects on platform performance, research related to advancing unmanned sea surface vessel technologies and capabilities. Specific naval engineering and platform design efforts to support set-based design for the Next Generation Attack Submarine SSN(X), and efforts to mitigate technology and susceptibility risk for the COLUMBIA class submarine program and the Future Surface Combatant Force. \n\nSea Platform Survivability Technology: \nNew and ongoing applied research related to critical S&T to investigate efforts related to signature reduction; structural and machinery acoustics; machinery autonomy; and platform survivability (detectability and susceptibility); and acoustic and non-acoustic signatures. Specifically, efforts utilizing advanced analytics (machine learning and artificial intelligence) and the integration of environmental effects on platform performance and detectability, Specific naval engineering and platform design efforts to support the Next Generation Attack Submarine SSN(X), and efforts to mitigate technology and susceptibility risk for the COLUMBIA class submarine program and the Future Surface Combatant Force. Ongoing base program efforts, initiated in FY 2018 and FY 2019, include ocean surface scatter in RF propagation, wake measurement technologies, thermal management systems, high power control modules for ship application, decision support\/uncertainty analysis in operational environments, and reactive composite materials.\n\nSubmarine Security S&T\nNew and ongoing research efforts focused on the science and physics based signal detection technologies that, individually or as a system, can impact the security of the SSBN and submarines in general. Efforts looking at both passive and active detection technologies with near term (0-5 years), mid-term (5-10 years) and far term (10-20 years) implications, as well as improving the understanding of the generation, radiation, propagation, scatter, and detection of a variety of signal types (acoustic, chemical, optical, electromagnetic, hydrodynamic and radiological) associated with a submarine's operation.\n\nAutonomy Technology: \nOngoing research related to critical multidisciplinary autonomy challenges that cut across areas\/domains, including air, sea, undersea and ground. This includes multi-disciplinary research into the science of autonomy focuses on four interrelated areas: scalable and robust distributed collaboration among autonomous systems; human\/unmanned system collaboration; autonomous perception and intelligent decision-making; and intelligent architectures for autonomous systems. Continue research to develop and test autonomy for Medium Displacement Unmanned Surface Vehicle (MDUSV) missions including perception and classification. Ongoing efforts, initiated in FY 2018 and FY 2019, include network information sciences, long-range high-resolution imaging, and decision support\/uncertainty analysis for operational environments. In particular, continue research to develop and test autonomy for Unmanned Undersea Vehicle (UUV) missions including understanding of counter-UUV autonomy options; implementations and testing. Autonomy development involving a shared world model and sensor feedback will continue. Extensive in-water testing will continue."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease is due to the completion of the Applied Research Challenge (ARC) program which concludes in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVAL RESEARCH ENTERPRISE"
                                    },
                                    "Description": {
                                        "val": "The Independent Applied Research (IAR) R2 activity was stood up in FY 2013 as the Naval Research Enterprise (NRE) to consolidate all NRE related IAR investments. Projects funded in this R2 Activity are intended to be approximately 2-3 years in length.  Based on historical trends approximately 30% of these projects will turn over each year.  The Naval Research Enterprise (NRE) encompasses the IAR efforts focused on solving a wide range of Naval Science and Technology (S&T) fleet issues utilizing unique Naval Warfare Center (WC) laboratory capabilities. Efforts under this activity address the full spectrum of the Naval Research and Development Framework using focus areas which engage Naval aviation, sea surface, undersea, space, weapons, communication, information, and human systems. The IAR Program provides participating WCs with in-house funding for applied research to support the execution of their assigned missions by: \n-Developing and maintaining a cadre of active researchers who can distill and extend results from worldwide research and apply them to solve Naval problems.\n-Promoting the hiring and development of talented new scientists and engineers (S&E) with the insurance of proper mentoring with senior personnel.\n-Encouraging collaboration with universities, private industry, and other Navy and Department of Defense laboratories. \n\nFunded projects are chosen through rigorous internal competition by each WC's selection committee and typically last two to three years.  IAR projects are generally designed to promote investment in high-risk\/high-payoff research and also allow young S&Es to manage Navy relevant research projects. A limited number of successful efforts developed under the In-House Laboratory Independent Research (ILIR) basic research Program Element 0601152N are matured and further developed under the IAR program with the goal of transitioning these technologies to the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete FY 2016 IAR projects which were three years in duration.\n- Continue IAR projects initiated in FY 2017.\n- Initiate FY 2018 IAR projects that are intended to be approximately three years in length."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.586"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Independent Applied Research (IAR) shall align with Naval Research framework priorities (IAR projects which were three years in duration); Augmented Warfighter, Integrated & Distributed Forces; Operational Endurance, Sensing and Sense-Making, and Scalable Lethality.  FY19 IAR projects will expand efforts in the areas of physics, chemistry, biotechnology, earth sciences, mathematics, and other hard and soft sciences.  Representative projects include; Life Preserver Performance in Waves, Electronic Warfare Activity Recognition, Boron-Based Solid Fuel Development for Ramjet Application, Modularization Algorithm for Additive Manufactured Parts, Data Visualization Support for Creation of a Numerical Table: Effects on Training and Performance, Development of a Fully Integrated Ignition System for Multiple Pulse Hybrid Rocket Motor Firings, Active Sonar-based Cooperative UUV Interception, HFA Tactical Oceanography, and Ultra Short Pulse Laser Induced Plasma Filaments for Extended Covert Communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.562"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.562"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Independent Applied Research (IAR) shall align with Naval Research framework priorities (IAR projects which were three years in duration); Augmented Warfighter, Integrated & Distributed Forces; Operational Endurance, Sensing and Sense-Making, and Scalable Lethality. FY20 IAR projects will expand efforts in the areas of physics, chemistry, biotechnology, earth sciences, mathematics, and other hard and soft sciences. Representative projects include; Life Preserver Performance in Waves, Electronic Warfare Activity Recognition, Boron-Based Solid Fuel Development for Ramjet Application, Modularization Algorithm for Additive Manufactured Parts, Data Visualization Support for Creation of a Numerical Table: Effects on Training and Performance, Development of a Fully Integrated Ignition System for Multiple Pulse Hybrid Rocket Motor Firings, Active Sonar-based Cooperative Unmanned Underwater Vehicle Interception, and Ultra Short Pulse Laser Induced Plasma Filaments for Extended Covert Communications.\n\nFund the development of innovative prototypes at Warfare Centers and Naval Laboratories solving key warfighter problems that are identified through the Hacking for Defense innovation process pipeline."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial and air) and the protection of those platforms.  Each PE Activity has unique goals and metrics, some of which include classified quantitative measurements.  Overall metric goals are focused on achieving sufficient improvement in component or system capability such that the 6.2 applied research projects meet the need of or produce a demand for inclusion in advanced technology that may lead to incorporation into acquisition programs or industry products available to acquisition programs.  Efforts funded in this PE also include energy programs in support of Navy energy guidance and efforts in support of the Ohio Replacement program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "59.871"
                        },
                        "CurrentYear": {
                            "val": "56.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "116.371"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "24.142"
                                        },
                                        "Text": {
                                            "val": "Funding used to advance research and facilitate technology adoption for lithium-ion battery\nsafety and electrical grid resiliency, reliability and security."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "24.142"
                                        },
                                        "Text": {
                                            "val": "Funding used to carryout alternative energy research in several areas including modeling and simulation tools for energy efficient ship design, unmanned vehicle power systems, cyber-secure and resilient micro-grids, marine-derived renewable energy, and a variety of shore-based energy efforts addressing energy challenges in the Asia-Pacific regions, including Hawaii, Alaska, Guam, California, and Australia."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "28.000"
                                        },
                                        "Text": {
                                            "val": "Funding used to carryout alternative energy research in several areas including modeling and simulation tools for energy efficient ship design, unmanned vehicle power systems, cyber-secure and resilient micro-grids, marine-derived renewable energy, and a variety of shore-based energy efforts addressing energy challenges in the Asia-Pacific regions, including Hawaii, Alaska, Guam, California, and Australia."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Generation and Storage Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct and expand on-going competitively awarded efforts that improve Li-ion battery safety and increase micro-grid resiliency and efficiency"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battery Storage and Safety"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.828"
                                        },
                                        "Text": {
                                            "val": "Funding used to conduct effort to develop safer battery technologies, including nonflammable electrolytes and safe cell technology, and to increase micro-grid resiliency and efficiency, including advancements in battery technologies and utilization.  Conduct and expand on-going competitively awarded efforts that improve Li-ion battery safety and increase micro-grid resiliency and efficiency."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Composite Structures Research for Enhanced Mobility"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.828"
                                        },
                                        "Text": {
                                            "val": "This effort will develop advanced fiber reinforced plastics for maritime craft and vessel structural components having the strength and weight benefits of traditional composite materials but without the corresponding cost and producibility limitations.  In addition, this effort will develop hybrid inflatable structures for high load applications culminating in building and testing a full-scale lightweight ramp structure capable of supporting a 75 ton M1A1 tank.  This ramp concept combines a metallic or composite compression member, drop stitch panels, and tension cables to form a lightweight, foldable ramp compatible with smaller vessels such as the Expeditionary Fast Transport and amphibious craft concepts such as the Ultra-Heavy Amphibious Connector."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "This effort will develop advanced fiber reinforced plastics for maritime craft and vessel structural components having the strength and weight benefits of traditional composite materials but without the corresponding cost and producibility limitations.  In addition, this effort will develop hybrid inflatable structures for high load applications culminating in building and testing a full-scale lightweight ramp structure capable of supporting a 75 ton M1A1 tank.  This ramp concept combines a metallic or composite compression member, drop stitch panels, and tension cables to form a lightweight, foldable ramp compatible with smaller vessels such as the Expeditionary Fast Transport and amphibious craft concepts such as the Ultra-Heavy Amphibious Connector."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Standoff Detection of Buried Hazards"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.931"
                                        },
                                        "Text": {
                                            "val": "Detection of Buried Hazards : Develop the basic signal processing requirements for the Laser Multi-Beam Differential Interferometric Sensor system have been analyzed and transformed into system specifications.  Draft the necessary test plan to investigate the effectiveness based both acoustic and seismic excitation for buried object detection in outdoor environment"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "3.000"
                                        },
                                        "Text": {
                                            "val": "Detection of Buried Hazards : Develop the basic signal processing requirements for the Laser Multi-Beam Differential Interferometric Sensor system have been analyzed and transformed into system specifications.  Draft the necessary test plan to investigate the effectiveness based both acoustic and seismic excitation for buried object detection in outdoor environment"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Energetics Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.500"
                                        },
                                        "Text": {
                                            "val": "These funds will be used towards the advanced demonstration of energetic materials in a variety of weapon system applications to include:  high performance solid rocket and air breathing propulsion, reactive materials demonstrations and effects in advanced lethality and effectiveness models, advanced warhead concepts to include novel reactive shaped charge configurations, hybrid reactive material warhead demonstrations, and the development and demonstration of any necessary modeling and simulation capabilities for quantification of damage effects on adversary weapon systems, and other potential energetic technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Hull Form Development and Demonstration"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Using computation fluid dynamic modeling, design innovative sea-keeping small-craft with improved performance characteristics utilizing advanced building techniques and materials."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}