{
    "id": "2020-Navy-PB-1319-MJBOOK-0-0-a56c7a9b227f9c34d6c2010c1b75789785589abe64a46931357add0057a031c6-6",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602235N"
        },
        "ProgramElementTitle": {
            "val": "Common Picture Applied Research"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "35.846"
            },
            "CurrentYear": {
                "val": "36.348"
            },
            "BudgetYearOne": {
                "val": "49.297"
            },
            "BudgetYearOneBase": {
                "val": "49.297"
            },
            "BudgetYearTwo": {
                "val": "49.431"
            },
            "BudgetYearThree": {
                "val": "52.157"
            },
            "BudgetYearFour": {
                "val": "53.923"
            },
            "BudgetYearFive": {
                "val": "56.685"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Research and Development Framework. This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century. The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nActivities and efforts in this program examine concepts and technologies that enable the transformation to network centric warfare. Network centric capabilities rely on information to connect assets and provide timely and accurate understanding of the environment. The mission area requirements for rapid, accurate decision-making; dynamic, efficient, mission-focused communications and networks; and pervasive and persistent sensing drive network centric S&T investments. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.450"
                },
                "CurrentYear": {
                    "val": "36.348"
                },
                "BudgetYearOne": {
                    "val": "36.486"
                },
                "BudgetYearOneBase": {
                    "val": "36.486"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "35.846"
                },
                "CurrentYear": {
                    "val": "36.348"
                },
                "BudgetYearOne": {
                    "val": "49.297"
                },
                "BudgetYearOneBase": {
                    "val": "49.297"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.604"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "12.811"
                },
                "BudgetYearOneBase": {
                    "val": "12.811"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.604"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "12.811"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.811"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding increases in FY 2020 reflects the increased emphasis and investment in Artificial Intelligence related applied research associated with advancing naval capabilities for decision making tools, systems, and supporting technologies."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Common Picture Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "35.846"
                        },
                        "CurrentYear": {
                            "val": "36.348"
                        },
                        "BudgetYearOne": {
                            "val": "49.297"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.297"
                        },
                        "BudgetYearTwo": {
                            "val": "49.431"
                        },
                        "BudgetYearThree": {
                            "val": "52.157"
                        },
                        "BudgetYearFour": {
                            "val": "53.923"
                        },
                        "BudgetYearFive": {
                            "val": "56.685"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The activities described in this Program Element (PE) address future Navy and Marine Corps capabilities needed to maintain maritime superiority and ensure national security.  They are based on input from Naval Research Enterprise (NER) stakeholders (including the Naval enterprises, the combatant commands, OPNAV and Headquarters Marine Corps) and are designed to exploit breakthroughs in science and technology in order to deliver maximum warfighting benefit to our sailors and marines.  These efforts are aligned with shared priorities throughout the whole of RDT&E in order to quickly advance new capabilities from discovery to deployment across the warfighting domains.\n\nActivities and efforts in this program examine concepts and technologies that enable the transformation to network centric warfare. Network centric capabilities rely on information to connect assets and provide timely and accurate understanding of the environment. The mission area requirements for rapid, accurate decision-making; dynamic, efficient, mission-focused communications and networks; and pervasive and persistent sensing drive network centric S&T investments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMMUNICATION AND NETWORKS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop high throughput dynamic wireless communications and network technologies critical to the mission performance and robustness of naval communications for widely dispersed, mobile air, land, surface and submerged platforms.  These platforms are often Size, Weight and Power (SWaP) limited, and will operate under constraints of cluttered Radio Frequency (RF) spectrum, harsh Electro-Magnetic Interference (EMI) and Beyond Line Of Sight (BLOS) conditions.  The technical payoff is increased network data rates, interoperability across heterogeneous radios, dynamic bandwidth management, and greater mobile network connectivity.  The operational payoff is that warfighters from the operational command to the tactical edge have near real-time access to information, knowledge and decision-making necessary to perform their tasks, including coalition and allied forces.  Emphasis is on tactical edge communications and networks to fully realize net-centric warfare, bridging the Global Information Grid (GIG) and the 'disadvantaged user', e.g., small-deck combatants, submarines, unmanned vehicles, distributed sensors and ground units in urban and RF challenged environments.  \n\nThe current specific objectives are:\n\n- Radios and Apertures: Develop technologies for high band radio, electrically-small and actively scanned antennas, addressing critical issue of radio spectrum bandwidth efficiency, spectrum contention and clutter, agile frequency communications with dynamic spectrum access, all-digital front-end with wide dynamic range, power amplifier efficiency, multipath effects, saltwater propagation and BLOS communications. Develop algorithms and signal processing for space-time-frequency diversity communications, including measures for electronic protection, such as low-intercept, antijam waveforms and modulation.  Develop affordable antenna technologies for small size and weight, high radiation efficiency, and wideband operation with rapid beam-steering.  Develop alternatives to RF communications in airborne and terrestrial environments as well as high data rate underwater communications for undersea warfare (distributed sensor netting, unmanned underwater vehicle data exfiltration, submarine Communications at Speed and Depth) using electro-optic\/infra-red (EO\/IR) technologies.  Develop secure, high bandwidth communications systems and the exploitation of existing and emerging network protocols that will avail development of new, Low Earth Orbit (LEO) based data transport mechanisms.\n\n- Tactical Networking and Network Control\/Management: \nDevelop advanced networking techniques for robust, highly dynamic environments; interoperable networks for secure communications and protocols, bandwidth and network management techniques that manage and allocate bandwidth across tactical and theater levels in support of net-centric operations. Develop rapidly auto-configuring and self-organizing networks with efficient and survivable routing, secure authentication, mobility management and Quality-of-Service guarantee, while optimizing network resources.  Address low bandwidth, synchronization and reliability for Service Oriented Architecture (SOA)\/middleware architecture in both mobile ad-hoc networks (MANET) and infrastructure-based Internet Protocol (IP) backbone networks. Develop cognitive network planning and operations engines whose criteria are based directly on mission objectives, while self-adapting and managing the spectrum allocation and radio resources in such a way that network operations, SOA community of interest, and computer network defense are integrated to form a single common tactical network picture that requires a minimum of human intervention and skill."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.283"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued research in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, Satellite Communication (SATCOM) performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management.\n\nContinued network-centric and information warfare capability for the Navy\/Marine Corps by addressing deficiencies and science gaps in tactical networks. These capabilities addressed unique military environment and application challenges enabling new mission concepts requiring minimal human intervention. Focused on three specific objectives: dynamic network structural analytics and adaptation; robust network organization and transport, distributed group collaboration and discovery; and adaptive signaling and sensing to improve military wireless communications.  Demonstrated a digital design receiver testbed for compressed sensing techniques for a communications relay; and real time application of analytic complex network theory metrics to both aid the prediction of network performance and to assist a cyber tool to identify and track network strengths and weaknesses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.242"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Information Technology: \nObjective is to provide resilient and effective network-centric and information warfare capability for the Navy\/Marine Corps by addressing deficiencies and science gaps in tactical networks. These capabilities address unique military environment and application challenges enabling new mission concepts requiring minimal human intervention. Current work and near-term plans focus on three specific objectives: dynamic network structural analytics and adaptation; robust network organization and transport, distributed group collaboration and discovery; and adaptive signaling and sensing to improve military wireless communications. Specific research examples include increasing the performance of low powered networks by using compressed sensing technology and technology to improve the design of distributed and cooperative Intelligence, Surveillance and Reconnaissance (ISR), Integrated Cyber and Electronic Warfare (ICE) operations in denied and contested Electromagnetic environments. \n\nConduct ongoing research and related thrusts in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, Satellite Communication (SATCOM) performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communications and Networks: Continue ongoing research and related thrusts in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, Satellite communications (SATCOM) performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management.\n\nInitiate new efforts and research supporting the development of a transmission signal waveform that is less detectable, but operates with higher capacity for a given range, than existing waveforms.\n\nInformation Technology:  Continue work to provide secure, resilient, effective network-centric and information warfare capability for the Navy\/Marine Corps by addressing deficiencies and science gaps in tactical networks. These capabilities address unique military environment and application challenges enabling new mission concepts requiring minimal human intervention. Current work and near-term plans focus on three specific objectives: dynamic network structural analytics and adaptation; robust network organization and transport, distributed group collaboration and discovery; and adaptive signaling and sensing to improve military wireless communications. Current research projects will deliver technology for high assurance Field-Programmable Gate Array (FPGA) application design, technology for increasing the performance of low powered networks by using compressed sensing technology, and technology to improve the design of distributed and cooperative Intelligence, Surveillance and Reconnaissance (ISR), Integrated Cyber and Electronic Warfare (ICE) operations in denied and contested Electromagnetic environments.\nDevelop a transmission signal waveform that is less detectable, but operates with higher capacity for a given range, than existing waveforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "APPLIED INFORMATION SCIENCES FOR DECISION MAKING"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop enablers for decision making and mission execution, to achieve battlespace superiority.  It focuses on the development of algorithms and software technologies that identify and integrate informational content from multiple sources, leading to decision aids that support user-cognitive processes.  Because persistent sensors are generating massive amounts of data, the focus is on technologies that not only integrate information from diverse sources, but also provide indications of information significance in ways that support the user's decision needs, regardless of location and operational situation.  To achieve this, it must be possible to automate understanding of the battlespace by identifying objects, determining relationships among the objects, assessing intent, and automatically generating courses of action with associated risks and uncertainty.  Effort will also be devoted to developing technology for increasing assurance and security for Consultation, Command and Control (C3) information systems and technology for improving information discovery and information presentation in such systems.  The Nano Electronics Technology activity is focused on developing ultra-low power, higher performance computing devices and components that are based on novel functionalities of nanometer scale materials and are enabled by improved understanding of nanomaterials, new devices and circuit design concepts, as well as new architectures uniquely suited for nanoscale systems.Applied research in artificial intelligence for the unique challenges of the Naval domain including providing intelligent decision aiding while operating in the complex spatio-temporal environments of distributed Naval forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Information Technology: \nInitiated research to improve the operational capability of Naval decision support systems and decrease the cost of these systems through transformative advances in information management that enables agility in timely and accurate decision and action. The military capability from this task area is technology to support improved situational awareness and operational effectiveness, improved techniques for dealing with information-intensive applications, and information management processes that improve the speed and accuracy of decisions and actions. \n\nElectromagnetic Warfare: \nInitiated research in advancing the state-of-the-art in being able to uniquely identify target of interest in very complex environments using passive technologies to assure high confidence to the decision maker when combined with other information sources.  This is being accomplished by expanding specific emitter identification technologies into areas detecting previously unaddressed and unexplored with the intent of maintaining battlespace superiority.\n\nQuantum Information Sciences: \nContinued research of Quantum Key Distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable; and research of algorithms for naval functions such as routing, weapon-target pairing, etc., a key application such as radar cross section calculation.\n\nComputational Methods for Decision Making (formerly Data Understanding, Information Integration, and Resource Optimization): \nContinued research of Information Integration, Automated Image Understanding, and Resource Optimization for the purpose of developing innovative methods for combining traditional and non-traditional data from sensors and disparate sources to provide the best estimate of objects, events, and conditions in the battlespace, in terms of their identity, associated error or uncertainty, context, impact, while inferring relationships and their intentions; developing automated, image and signal intelligence understanding tools based on rigorous mathematical and statistical methods that lead to improved change detection, improve object and activity detection and recognition capabilities, context and scene understanding, and inferring of the threat levels to support decision making and persistent and adaptive surveillance; and developing automated decision-support tools based on mathematically rigorous techniques (e.g., mathematical optimization) that support decision-making to ensure the best use of scarce and\/or expensive resources, achieving optimal allocations for large complex scenarios, including ones that contain uncertainty, in drastically reduced amounts of time. Develop methods that support decision making in networked sensor management and allocation to ensure sensor assets are deployed in an optimal, or near optimal, manner.\n\nNanoscale Electronics Technology:\nContinued research in novel nanometer scale (feature size near or below 10nm) logic\/memory devices and related circuits and architectures to deliver ultra-low power, light weight and high performance computational capability for autonomous vehicles and individual warfighters. \n\nCyber Defense:\nContinued research in cyber systems, leveraging results from basic research program, developing and evaluating technical approaches for future naval capabilities. The program investigates technologies for enhancing efficiency, robustness and cyber resiliency for all classes of computing systems in naval enterprise systems as well as Navy's real-time safety critical cyber physical systems. \n\nData Analytics:\nContinued research in new approaches to support tactical decision makers and information superiority. This is performed by producing distributed situation assessment of a commander's environment through development of a common tactical picture; developing collaborative, distributed mission plans; monitoring and dynamically re-planning mission execution as required; understanding their environment by being able to access distributed heterogeneous enterprise information stores intelligently through use of autonomic software; effectively using sensor information and making resource allocation decisions and information operations. Specific research involves real-time computing, decision aids and collaborative workspaces; secure distributed architectures; and information warfare methods to protect secure information."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Information Technology:\nObjective is to improve the operational capability and security of Naval decision support systems and decrease the cost of these systems through transformative advances in information management that enables agility in timely and accurate decision and action. The military capability from this task area is technology to support improved situational awareness and operational effectiveness, improved techniques for dealing with information-intensive applications, and information management processes that improve the speed and accuracy of decisions and actions. Specific research examples include technology to detect and remediate security vulnerability in Commercial-off-the-Shelf software, technology to identify and locate individuals of interest using multi-biometrics, technology for goal driven autonomous systems, and technology to improve performance of Navy Watchstand personnel who must monitor multiple workstations concurrently.\n\nElectromagnetic Warfare: \nThe technologies being developed are advancing the state-of-the-art in being able to uniquely identify target of interest in very complex environments using passive technologies to assure high confidence to the decision maker when combined with other information sources.  This is being accomplished by expanding specific emitter identification technologies into areas detecting previously unaddressed and unexplored to maintain battlespace superiority.\n\nQuantum Information Sciences: \nConduct research of Quantum Key Distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable; and research of algorithms for naval functions such as routing, weapon-target pairing, etc., a key application such as radar cross section calculation. \n\nComputational Methods for Decision Making: \nConduct research of Information Integration, Automated Image Understanding, and Resource Optimization for the purpose of developing innovative methods for combining traditional and non-traditional data from sensors and disparate sources to provide the best estimate of objects, events, and conditions in the battlespace, in terms of their identity, associated error or uncertainty, context, impact, while inferring relationships and their intentions; developing automated, image and signal intelligence understanding tools based on rigorous mathematical and statistical methods that lead to improved change detection, improve object and activity detection and recognition capabilities, context and scene understanding, and inferring of the threat levels to support decision making and persistent and adaptive surveillance; and developing automated decision-support tools based on mathematically rigorous techniques (e.g., mathematical optimization) that support decision-making to ensure the best use of scarce and\/or expensive resources, achieving optimal allocations for large complex scenarios, including ones that contain uncertainty, in drastically reduced amounts of time. Develop methods that support decision making in networked sensor management and allocation to ensure sensor assets are deployed in an optimal, or near optimal, manner. The amount of data that the decision makers are facing today is much larger than any time before in human history.  In addition, the data is much more complex, heterogeneous and fast changing.  Analysis of such large and complex datasets is beyond the cognitive abilities of any single decision maker.  The aim of this thrust is to develop new methods for extraction and analysis of relevant information from large-scale datasets, and to develop new tools for distributed information sharing and decision-making. To achieve this aim, it is required to advance fundamental understanding of networks (such as social and organizational networks), and to integrate rigorous methods from mathematical and computational sciences with methods from social sciences. \n\nNanoscale Electronics Technology: \nConduct research in novel nanometer scale (feature size near or below 10nm) logic\/memory devices and related circuits and architectures to deliver ultra-low power, light weight and high performance computational capability for autonomous vehicles and individual warfighters. \n\nCyber Defense: \nConduct research in cyber systems, leveraging results from basic research program, developing and evaluating technical approaches for future naval capabilities. The program investigates technologies for enhancing efficiency, robustness and cyber resiliency for all classes of computing systems in naval enterprise systems as well as Navy's real-time safety critical cyber physical systems. \n\nData Analytics: \nConduct research in new approaches to support tactical decision makers and information superiority. This is performed by producing distributed situation assessment of a commander's environment through development of a common tactical picture; developing collaborative, distributed mission plans; monitoring and dynamically re-planning mission execution as required; understanding their environment by being able to access distributed heterogeneous enterprise information stores intelligently through use of autonomic software; effectively using sensor information and making resource allocation decisions and information operations. Specific research involves real-time computing, decision aids and collaborative workspaces; secure distributed architectures; and information warfare methods to protect secure information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.336"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.336"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Quantum Information Sciences: Conduct research of quantum key distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable.  Conduct research into interconversion of optical and mechanical quantum states for memory and potential processing tasks.\n\nComputational Methods for Decision Making: Conduct research of Information Integration, Automated Image Understanding, and Resource Optimization for the purpose of developing innovative methods for combining traditional and non-traditional data from sensors and disparate sources to provide the best estimate of objects, events, and conditions in the battlespace, in terms of their identity, associated error or uncertainty, context, impact, while inferring relationships and their intentions; developing automated, image and signal intelligence understanding tools based on rigorous mathematical and statistical methods that lead to improved change detection, improve object and activity detection and recognition capabilities, context and scene understanding, and inferring of the threat levels to support decision making and persistent and adaptive surveillance; and developing automated decision-support tools based on mathematically rigorous techniques (e.g., mathematical optimization) that support decision-making to ensure the best use of scarce and\/or expensive resources, achieving optimal allocations for large complex scenarios, including ones that contain uncertainty, in drastically reduced amounts of time. Develop methods that support decision making in networked sensor management and allocation to ensure sensor assets are deployed in an optimal, or near optimal, manner. The amount of data that the decision makers are facing today is much larger than any time before in human history. In addition, the data is much more complex, heterogeneous and fast changing. Analysis of such large and complex datasets is beyond the cognitive abilities of any single decision maker. The aim of this thrust is to develop new methods for extraction and analysis of relevant information from large-scale datasets, and to develop new tools for distributed information sharing and decision-making. To achieve this aim, it is required to advance fundamental understanding of networks (such as social and organizational networks), and to integrate rigorous methods from mathematical and computational sciences with methods from social sciences. Imitate new research to study the interplay of three phenomena, heterogeneous and dynamically generated input data from various sources, online decisions, and online learning. Develop methods for integrating massive amounts of diverse data, and present useful information to a tactical commander for planning. Develop new ways to extract and understand human\/content interactions to build an algorithm of personalized learning actions for learning and training purposes.\n\nNanoscale Electronics Technology: Conduct research in novel nanometer scale (feature size near or below 10nm) logic\/memory devices and related circuits and architectures to deliver ultra-low power, light weight and high performance computational capability for autonomous vehicles and individual warfighters. Initiate exploration of ultra-low power computing applications utilizing mixed signal neuromorphic chips.\n\nCyber Defense: Conduct research in cyber systems, leveraging results from basic research program, developing and evaluating technical approaches for future naval capabilities. The program investigates technologies for enhancing efficiency, robustness and cyber resiliency for all classes of computing systems in naval enterprise systems as well as Navy's real-time safety critical cyber physical systems. Continue efforts to matures technologies and continue work to introduce new capabilities into many cyber security areas, such as automated cryptographic design exploration, cyber decoys and disinformation, automated Commercial off-the- shelf (COTS) cyber attack surface reduction, intrinsic cyber attack resilient industrial control systems, and many more. Addressing the root cause of cyber vulnerability and reducing reliance to operator is one of the main theme of the program.\n\nData Analytics: Conduct research in new approaches to support tactical decision making and assured networked command and control. This is performed by producing distributed situation assessment of a commander's environment through development of a common tactical picture; developing collaborative, distributed mission plans; monitoring and dynamically replanning mission execution as required; understanding their environment by being able to access distributed heterogeneous enterprise information stores intelligently through use of autonomic software; effectively using sensor information and making resource allocation decisions and information operations. Specific research involves real-time computing, decision aids and collaborative workspaces; secure distributed architectures; and information warfare methods to protect secure information. Initiate new research efforts supporting the development of a set of Assured C2 applications that can operate in challenging communications environments.\n\nElectromagnetic Warfare:  Continue efforts to research and develop technologies for advancing the state-of-the-art in being able to uniquely identify target of interest in very complex environments using passive technologies to assure high confidence to the decision maker when combined with other information sources.  This is being accomplished by expanding specific emitter identification technologies into areas detecting previously unaddressed and unexplored to maintain battlespace superiority.\n\nInformation Technology: Objective is to improve the operational capability and security of Naval decision support systems and decrease the cost of these systems through transformative advances in information management that enables agility and timely, accurate decision making. The military capability from this task area is technology to support improved situational awareness and operational effectiveness, improved techniques for dealing with information-intensive applications, and information management processes that improve the speed and accuracy of decisions and actions. \n\nNew research projects will deliver technology for Deep Learning networks that can explain their decisions, improved hydraulic efficiency for meso-scale robotic systems, and adaptive memory for long duration autonomous systems. \n\nApplied research on artificial intelligence in support of: Collaborative complex decision-making; Developing artificial intelligence technologies that actively inform and assist different stages of the decision making process; Developing interfaces and dialogue systems for human-machine teaming; Developing agile intelligent cognitive electronic warfare algorithms and architectures; Integrating artificial intelligence with robotic systems for human-machine collaboration and robot training; and Predictive maintenance (digital twin) for Naval platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increases from FY 2019 to FY 2020 reflects the increased emphasis and investment in Artificial Intelligence related applied research associated with advancing naval capabilities for decision making tools, systems, and supporting technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MULTI-SOURCE INTEGRATION AND COMBAT IDENTIFICATION"
                                    },
                                    "Description": {
                                        "val": "This activity addresses Theater Air And Missile defense (TAMD), and responds to warfighter needs for rapid, high confidence Combat Identification (CID) of air and missile threats at long range, using real time and non-real time threat attributes and intelligence information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare \nNew algorithmic approaches are being developed to conduct automatic target recognition using associative learning.  A small sized design has been built to improve Radio Frequency (RF) detection of targets at High Frequency (HF) frequencies as precursors to adversary air attacks.  This in conjunction with improvements being made in HF surface wave radar array geometries should greatly improve operational capabilities in this reinvigorated part of the RF spectrum.  A new concept for rapidly assessing concurrently multiple missiles with multiple Electronic Warfare (EW) responses is being investigated to provide for rapid high quality assessment in this complex environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare: \nA small sized design has been built to improve RF detection of targets at HF frequencies as precursors to adversary air attacks.  This in conjunction with improvements being made in HF surface wave radar array geometries should greatly improve operational capabilities in this reinvigorated part of the RF spectrum.  A new concept for rapidly assessing concurrent multiple missiles with multiple EW responses is being investigated to provide for rapid high quality assessment in this complex environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.550"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.550"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare:\nContinue efforts to improve RF detection of targets at HF frequencies as precursors to adversary air attacks and improvements in HF surface wave radar array geometries. Continue work on concepts for rapidly assessing concurrent multiple missiles with multiple EW responses to provide for rapid high quality assessment in this complex environment.\n\nExpand ship signatures analysis for certain threat categories to determine how to mitigate vulnerabilities and develop methods for robust countermeasures employment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TACTICAL SPACE EXPLOITATION"
                                    },
                                    "Description": {
                                        "val": "The Tactical Space Exploitation initiative explores the application of new space craft technologies on small, light-weight and low-cost satellites, to enhance naval warfighting capabilities by taking advantage of the global access, revisit and connectivity provided by orbital platforms.\n\nSpacecraft Technology: Affordable, expendable payload and bus technologies will be developed, which will serve as building blocks for future responsive space systems: payloads, bus technologies and significant space robotic technologies that address on-orbit inspection, servicing, repair and assembly, and mission-life extension."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.118"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Spacecraft Technology \nDevelop advanced, high-payoff technologies that will preserve, protect, and enhance space capabilities in the performance of functions that are of critical importance to Naval operations while also reducing the cost of Department of Defense (DoD) space activities.  Initiate efforts to develop the key tomographic algorithm needed to construct three-dimensional ionospheric electron density from persistent space-based stereoscopic observations, to enable significant passive reduction of Over The Horizon Radar (OTHR) registration errors. Initiate use of the new NRL Loop Heat Pipe (LHP) transient numerical model and stability theory to design oscillation-free LHPs, to enable precise, reliable spacecraft thermal regulation for higher mission reliability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.137"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Space Research and Spacecraft Technology: \nContinue development of advanced, high-payoff technologies that will preserve, protect, and enhance space capabilities in the performance of functions that are of critical importance to Navy-Marine Corps operations while also reducing the cost of DoD space activities.\n\nNext-Generation Sensing:  \nConduct effort to develop a single pixel camera architecture for passive microwave imaging, maintaining currently delivered spatial resolution and calibration performance while significantly reducing current aperture diameter.  \n\nSpacecraft Technology: Initiate development of a new capability for local Space Situational Awareness (SSA) with a novel system that detects and tracks objects in close proximity to a satellite that is equipped with this capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.188"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.188"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Space Research and Spacecraft Technology: Continue efforts to advanced, high-payoff technologies that will preserve, protect, and enhance space capabilities in the performance of functions that are of critical importance to Navy-Marine Corps operations while also reducing the cost of DoD space activities.\n\nNext-Generation Sensing:  Continue efforts to develop a single pixel camera architecture for passive microwave imaging, maintaining currently delivered spatial resolution and calibration performance while significantly reducing current aperture diameter.  \n\nSpacecraft Technology: Continue work to develop a new capability for local space situational awareness (SSA) with a novel system that detects and tracks objects in close proximity to a satellite that is equipped with this capability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2019 to FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies that enable Information Warfare including communications and information assurance capabilities to enable all-source data access, tailored dissemination of information to Command and Control (C2) and Intelligence, Surveillance and Reconnaissance (ISR) users across the network, and rapid, accurate decision making based on this information.  The operational benefits sought are increased speed of response, accuracy, and precision of command; distributed self-synchronization; flexibility and adaptability to an operational situation; and decision superiority.  \n\nSpecific examples of metrics under this PE include:\n- Increase network data rates and interoperability across heterogeneous radios; improve dynamic bandwidth management and mobile network connectivity.\n- Increase the understanding of the battlespace by the development of automated tools for extracting information from images and signals, identifying objects, determining relationships among the objects, assessing intent, and generating courses of action.\n- Improve the integration of sensors, networks, decision aids, weapons, and supporting systems into a highly adaptive, human-centric, comprehensive maritime system.\n- Improve integrated signals electronics packages in small, light-weight, and low-cost satellites to test new concepts for global ship tracking and two-way data exfiltration."
                        }
                    }
                }
            ]
        }
    }
}