{
    "id": "2020-AirForce-PB-3600-MJBOOK-1-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-118",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "1206860F"
        },
        "ProgramElementTitle": {
            "val": "Rocket Systems Launch Program (SPACE)"
        },
        "R1LineNumber": {
            "val": "150"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "33.023"
            },
            "CurrentYear": {
                "val": "19.721"
            },
            "BudgetYearOne": {
                "val": "13.192"
            },
            "BudgetYearOneBase": {
                "val": "13.192"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "17.999"
            },
            "BudgetYearThree": {
                "val": "21.074"
            },
            "BudgetYearFour": {
                "val": "20.509"
            },
            "BudgetYearFive": {
                "val": "19.045"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.975"
                },
                "CurrentYear": {
                    "val": "19.721"
                },
                "BudgetYearOne": {
                    "val": "17.692"
                },
                "BudgetYearOneBase": {
                    "val": "17.692"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "33.023"
                },
                "CurrentYear": {
                    "val": "19.721"
                },
                "BudgetYearOne": {
                    "val": "13.192"
                },
                "BudgetYearOneBase": {
                    "val": "13.192"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "12.048"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-4.500"
                },
                "BudgetYearOneBase": {
                    "val": "-4.500"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.045"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "13.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.907"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.500"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "661023"
                    },
                    "ProjectTitle": {
                        "val": "Rocket System Launch Program (RSLP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.023"
                        },
                        "CurrentYear": {
                            "val": "19.721"
                        },
                        "BudgetYearOne": {
                            "val": "13.192"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.192"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "17.999"
                        },
                        "BudgetYearThree": {
                            "val": "21.074"
                        },
                        "BudgetYearFour": {
                            "val": "20.509"
                        },
                        "BudgetYearFive": {
                            "val": "19.045"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Per FY 2019 National Defense Authorization Act, the Evolved Expendable Launch Vehicle (EELV) program, will be renamed the National Security Space Launch program, effective 1 March 2019.\n\nRocket Systems Launch Program (RSLP) provides responsive space and Research, Development, Test and Evaluation (RDT&E) launch vehicle support to DoD and other government agencies using commercial launch systems and excess ballistic missile assets.  The RSLP mission was established by the Secretary of Defense in 1972.  The small launch program complements the National Security Space Launch (NSSL) program with multiple options to acquire dedicated spacelift and rideshare services for developmental, demonstration, and small operational space vehicles.  It provides mission planning, payload integration, vehicle acquisition, processing, launch operations, booster storage and disposition, aging surveillance, maintenance and logistics support for selected DoD responsive space and RDT&E launches.  Costs directly attributable to a specific launch or program (e.g., reliability of flight testing, maintenance of launch vehicle processing infrastructure) are paid by the user (Air Force, Navy, Army, Missile Defense Agency (MDA), Defense Advanced Research Project Agency (DARPA), National Reconnaissance Office (NRO), etc.).  RSLP maintains exclusive control of deactivated Minuteman and Peacekeeper assets used in testing to include refurbishment, transportation and handling, storage, aging surveillance, and launch services.  RSLP also funds general research, development, prototyping, integration, and supplemental reliability of flight testing efforts for launch to enhance the reliability of the Minotaur and other fleet vehicles (e.g., updates to the Modular Mechanical Ordnance Destruct System).\n\nThe FY2020 funding request was reduced by $4.5 million to account for the availability of prior year execution balances.\n\nSpace acquisition must respond with speed and agility to emerging adversary threats.  Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture.  Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver Rocket Systems Launch weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 1206392F and 1206398F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 6, RDT&E Management Support because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Tiny Launch"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "13.000"
                                        },
                                        "Text": {
                                            "val": "In FY 2018 RSLP provided rapid prototypes and demonstrations of a more agile, responsive logistics and launch model on tiny launch vehicles. Tiny launch service capability ensured demonstration of two payloads (Air Force Research Lab cubesat and multiple Space Test Program cubesats) of less than 400lbs to Lower Earth Orbit (LEO) to meet FY 2019 initial launch capability (ILC)."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Storage\/Refurbishment\/Demil"
                                    },
                                    "Description": {
                                        "val": "Storage, refurbishment, inventory control, and demil\/disposal of deactivated Minuteman, Peacekeeper and other missile flight test assets"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.208"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.773"
                                            },
                                            "Text": {
                                                "val": "Continuing storage, refurbishment, inventory control, and demil\/disposal of deactivated Minuteman, Peacekeeper and other missile flight test assets and performing research and development support operations as required. Investigating and developing shipping throughput capacity to maximize opportunity for motor disposal. Continuing support activities to include but not limited to sustainment replacement and refurbishment of support equipment, mission support, special studies etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.844"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.844"
                                            },
                                            "Text": {
                                                "val": "Continue storage, refurbishment, inventory control, and demil\/disposal of deactivated Minuteman, Peacekeeper and other missile flight test assets and perform research and development support operations as required. Investigate and develop shipping throughput capacity to maximize opportunity for motor disposal. Continue support activities to include but not limited to sustainment replacement and refurbishment of support equipment, mission support, special studies etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $4.929M.  This reduction reflects a decrease in planned motor disposal, refurbishment, inventory control, and research development for operations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aging Surveillance"
                                    },
                                    "Description": {
                                        "val": "Perform aging surveillance-related activities on stored motors"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.215"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.048"
                                            },
                                            "Text": {
                                                "val": "Continuing to perform aging surveillance-related activities on stored motors; continuing to perform analysis and studies to identify and evaluate potential safety-related issues affecting stored motors; continuing program office support and related support activities such as, but not limited to mission support, special studies, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.948"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.948"
                                            },
                                            "Text": {
                                                "val": "Continue performing aging surveillance-related activities on stored motors; continue performing analysis\/studies to identify and evaluate potential safety-related issues affecting stored motors; continue program office support and related support activities such as, but not limited to mission support, special studies, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decrease compared to FY 2019 by $1.100M.  This reduction reflects a decrease in aging surveillance activities, analysis\/studies, and program office support."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Other Launch Support Services"
                                    },
                                    "Description": {
                                        "val": "Perform launch services activities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Continuing launch vehicle acquisition, processing, launch services support, mission assurance, and operations to launch RDT&E payloads.\n\nRapidly responding to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, prototyping, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Continue launch vehicle acquisition, processing, launch services support, mission assurance, and operations to launch RDT&E payloads.\n\nRapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, prototyping, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.500M.  This reduction reflects reduced scope of launch study\/service planned and identified for FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}