{
    "id": "2020-Navy-PB-1319-JBOOK-9da760a8280e5c477a40ce5d303141285b83ab4a577b7d5903632d5298d41e17-20",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603673N"
        },
        "ProgramElementTitle": {
            "val": "(U)Future Naval Capabilities Advanced Tech Dev"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "215.946"
            },
            "CurrentYear": {
                "val": "214.184"
            },
            "BudgetYearOne": {
                "val": "231.907"
            },
            "BudgetYearOneBase": {
                "val": "231.907"
            },
            "BudgetYearTwo": {
                "val": "281.953"
            },
            "BudgetYearThree": {
                "val": "277.461"
            },
            "BudgetYearFour": {
                "val": "273.380"
            },
            "BudgetYearFive": {
                "val": "278.874"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Future Naval Capabilities (FNC) program represents the requirements-driven, delivery-oriented piece of the Department of the Navy (DON) Science and Technology (S&T) portfolio. The efforts described in this Program Element (PE) address the Advanced Technology Development associated with the FNC Program.  The objective of the work in this PE is to develop promising technologies emerging from the FNC Applied Research program that have successfully matured to higher Technology Readiness Levels (TRLs).  \n\nThe FNC Program was restructured for FY19 to accelerate transition to the Fleet and Force.  This restructuring involved a zero based review of all ongoing FNC projects, where each effort was assessed for its technology maturity and transition commitment.  Ongoing efforts were categorized as FNCs or Technology Candidates.  Some efforts were terminated and others were accelerated to achieve the goals of the restructured program.  Funding for FNCs, which have higher Technology Readiness Levels (TRLs of 4\/5 to 6) and transition funding commitments, are being resourced in this PE, 0603673N Future Naval Capabilities Advanced Technology Development.  ONR is coordinating closely with the resource Sponsors and acquisition stakeholders to develop high priority technological capabilities needed by the operational forces.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "231.772"
                },
                "CurrentYear": {
                    "val": "232.996"
                },
                "BudgetYearOne": {
                    "val": "230.269"
                },
                "BudgetYearOneBase": {
                    "val": "230.269"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "215.946"
                },
                "CurrentYear": {
                    "val": "214.184"
                },
                "BudgetYearOne": {
                    "val": "231.907"
                },
                "BudgetYearOneBase": {
                    "val": "231.907"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-15.826"
                },
                "CurrentYear": {
                    "val": "-18.812"
                },
                "BudgetYearOne": {
                    "val": "1.638"
                },
                "BudgetYearOneBase": {
                    "val": "1.638"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.209"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-26.103"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "7.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.746"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.638"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.638"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.144"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-11.935"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The program increase in FY 2020 responds to increase demand to develop technologies for transition to Programs of Record.  \n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3346"
                    },
                    "ProjectTitle": {
                        "val": "Future Naval Capabilities Adv Tech Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "215.946"
                        },
                        "CurrentYear": {
                            "val": "206.684"
                        },
                        "BudgetYearOne": {
                            "val": "231.907"
                        },
                        "BudgetYearOneBase": {
                            "val": "231.907"
                        },
                        "BudgetYearTwo": {
                            "val": "281.953"
                        },
                        "BudgetYearThree": {
                            "val": "277.461"
                        },
                        "BudgetYearFour": {
                            "val": "273.380"
                        },
                        "BudgetYearFive": {
                            "val": "278.874"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Prior to FY19, Future Naval Capabilities (FNC) Program investments were selected almost two years in advance of execution.  It was determined by Navy and Marine Corps leadership that this approach limits Department of the Navy's (DON) ability to exploit technology advances and respond quickly to naval needs.  As a result, future Budget Activity (BA) 3 investments supporting the FNC Program are now made less than one year before commencing execution.  Because FNCs are now starting at higher Technology Readiness Levels (TRL), the typical duration of an FNC has been shortened to 3-years.  The FNC Program has been fully restructured in favor of a more direct and higher level of collaboration.  Program Element R-2 Activities were modified for FY19 to align to warfare areas and the corresponding resource sponsors that will integrate FNC technologies into acquisition programs of record.  These R-2 Activities have been continued into FY20.  \n\nA complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CAPABLE MANPOWER (CMP)"
                                    },
                                    "Description": {
                                        "val": "The Capable Manpower R-2 Activity, modified for FY19, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in Program Element (PE) 0602750N Future Naval Capabilities (FNC) Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of Deputy Chief of Naval Operations (CNO) for Manpower, Personnel, Training and Education and Marine Corps Training and Education Command (TECOM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Complete Manpower Planning and Optimization Toolset - Demonstrate the newly developed manpower planning and optimization functional enhancements targeted for transition.\n\nFNC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS (UAS) INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Complete UAS Control Station Human Machine Interface - Integrate human machine interface and vehicle controller software into the Advanced Processor Build (APB) -17 software update for the AN\/BYG-1 combat control system.\n\nFNC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Complete Decision Making-Learning Management System (DM-LMS) - Assess the reliability and validity of DM-LMS design measures.\n- Complete Digital Integrated Representation of Tactical Environment (DIRTE) - Test and demonstrate the Graphical User Interface (GUI) to assess the ease of use and ability to modify the terrain and associated features. \n- Complete Simulation Tailored Training and Assessment (ST2A) - Test and evaluate the full ADSUDM concept using the integrated training simulation demonstration prototype.\n\nFNC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER ANTI-ACCESS\/AREA DENIAL (A2AD) TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\t\n- Complete Environment Designed to Undertake Counter A2AD Tactics, Training & Experimentation (EDUCAT2E) \n- Conduct a final demonstration and transition the newly developed, denied-and-degraded effects technology to platform sponsors, the training community, and combat system developers.\n\nFNC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Continue Operational Planning Tool - Develop new software tools that support comprehensive and collaborative planning through the use of decision support services, analytic tools, and common displays.  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to IW-FY16-01 under a new Information Warfare (IW) R-2 Activity).\n\nFNC: CMP-FY17-01 MANPOWER, PERSONNEL & TRAINING STRATEGIC PLANNING APPLICATION\n- Initiate Manpower, Personnel & Training Planning Application - For this FNC, delayed one year to start in FY18, develop decision support software to capture key interconnections, time delays and feedbacks between Manpower, Personnel, and Training stakeholders that serve as a common set of assumptions and boundaries for decision analyses. \n\nFNC: CMP-FY17-02 FUTURE INTEGRATED TRAINING ENVIRONMENT (FITE)\n- Continue Future Integrated Training Environment (FITE) - Develop synthetic environment language to communicate changes during run-time, and implement changes within the simulations.\n\nFNC: CMP-FY18-01 LEARNING CONTINUUM AND PERFORMANCE AID (LCAPA)\n- Initiate Learning Continuum and Performance Aid (LCaPA) - Commence development of a federated software system to manage an individualized learning continuum through on-the-job and other training events that includes career path guidance and performance tracking. \n\nFNC: CMP-FY18-02 MANNED AND UNMANNED COMMON PLANNING PICTURE\n- Initiate Manned and Unmanned Common Planning Picture - Commence development of software to enable a sailor to plan and brief manned (navigation, own ship, etc.) and unmanned (Unmanned Undersea Vehicle (UUV) and Unmanned Air Vehicle (UAV)) events simultaneously as an integrated planning tool that communicates the commander's intent.  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to UW-FY18-01 under a new Undersea Warfare (UW) R-2 Activity).\n\nFNC: CMP-FY19-03 Fleet Training Technologies (FleeT2)\n- Initiate FleeT2 - Commence development of adaptive, dynamic tools to capture and assess mission performance of warfare teams and operators to support high-velocity and ready relevant learning of representational techniques, model dynamics, and high computational tractability.  (In FY19, this FNC Product will be realigned within this PE to SW-FY19-04 under a new Surface Warfare (SW) R-2 Activity)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.514"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include efforts that focus on the future integrated training environment for integrated air and ground operations of the marine air-ground task force, learning continuum and performance aids, manpower, personnel and training strategic planning, simulation tailored training and assessments, decision making and learning management systems, an assessment process for the selection of unmanned aerial systems personnel, simulation toolsets for analysis of mission, personnel and systems that includes techniques to optimize manpower planning, next generation perceptual training systems and tools, augmented immersive team training, behavioral and performance analysis for intelligent training, advanced technologies for automated performance assessment in games and tools for game-based training and assessment of human performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.640"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.640"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity in FY20 include technologies supporting the future integrated training environment and ready relevant learning. Training simulator software and hardware to support the rapid integration and interoperability of air and ground legacy and future simulation-based training is being developed to address the shortfall in sorties needed to maintain readiness for integrated air and ground operations of the marine air-ground task force.  This technology will allow pilots and aircrews to train effectively in a common, simulated operating environment. Flexible and interoperable learning continuum and performance aids will be developed, providing individual career management, skill classification, selection, automatic training content re-engineering, supervisor evaluations, and Fleet readiness tracking.  New machine learning algorithms will input training data from the lifelong learning record, and output a training model that is usable for adaptive training. The focus on ready relevant training will accelerate learning, reduce the decay of acquired skills, and provide readiness tracking of performance at an individual level."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 was due to an increased investment in technologies supporting the future integrated training environment and ready, relevant training.  A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENTERPRISE AND PLATFORM ENABLERS (EPE)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructured Future Naval Capabilities (FNC) Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.301"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Complete Tools for Predicting Array Operational Loading & Distribution - Conduct at-sea testing of an instrumented towed array on a Virginia Class submarine and continue validation efforts on the numerical tool.  \n\nFNC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Demonstrate aluminum coating effectiveness to minimize Degree of Sensitization (DoS) and develop aluminum DoS repair tools to mitigate corrosion damage.  (In FY19, this FNC Product will be realigned within this Program Element (PE) to SW-FY14-01 under a new Surface Warfare (SW) R-2 Activity)\n- Complete Aluminum Alloy Corrosion Prediction Tool - Demonstrate integration of Degree of Sensitization (DoS) detection algorithms with the DoS detection tool and conduct testing of the integrated capability.\n\nFNC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Conduct OEM qualification testing for environmental and mechanical properties, and ease of fabrication for engine components for a planned demonstration test.  (In FY19, this FNC Product will be realigned within this PE to SW-FY15-01 under a new Surface Warfare R-2 Activity)\n\nFNC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Design and carry out experiments which fully characterize medium-scale material concepts.  (In FY19, this FNC Product will be realigned within this PE to UW-FY15-01 under a new Undersea Warfare (UW) R-2 Activity)\n\nFNC: EPE-FY16-01 ADVANCED TOPCOAT SYSTEM (ATS)\n- Continue Advanced Topcoat Systems for Air Vehicle (ATS-AV) - Perform initial laboratory verification and qualification studies on modified primer and topcoat chemistries, including chemical analysis and material-interaction compatibility verification.  (In FY19, this FNC Product will be realigned within this PE to AW-FY16-01 under a new Air Warfare (AW) R-2 Activity)\n\nFNC:  EPE-FY19-04 Signature Management System (SMS)\n- Continue SMS - Continue developing advanced signature management technology for submarine applications.  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to UW-FY19-01 under a new Undersea Warfare R-2 Activity)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPEDITIONARY MANEUVER WARFARE (EMW)"
                                    },
                                    "Description": {
                                        "val": "The Expeditionary Maneuver Warfare R-2 Activity, modified for FY19, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in PE 0602750N, Future Naval Capabilities (FNC) Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Deputy Commandant for Combat Development and Integration (CD&I) and the Director of Expeditionary Warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: EMW-FY17-01 HIGH RELIABILITY DUAL-PURPOSE IMPROVED CONVENTIONAL MUNITION (DPICM) REPLACEMENT (HRDR)\n- Continued High Reliability DPICM Replacement in PE 0603640M Marine Corps Advanced Technology Demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.840"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include those efforts that focus on autonomous unmanned surface vehicles for mine warfare, off-board refueling and data transfer for unmanned surface vehicles, automated data analysis for expeditionary Mine Countermeasures (MCM), advanced undersea weapon systems for mine warfare, ground based air defense on-the-move high energy laser systems, advanced sonar technology for high clearance rate MCM, defense of harbor and near-shore naval infrastructure against asymmetric threats, fuel efficient tactical vehicles, renewable and sustainable expeditionary power, exchange of actionable information at the tactical edge, actionable intelligence enabled by persistent surveillance, densified propellants for fire from enclosed\/confined spaces, spectral and reconnaissance imagery, azimuth and inertial navigation systems, counter radio-controlled improvised explosive device electronic warfare, and precision universal mortars."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.399"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.399"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity in FY20 include those efforts that focus on Mine Countermeasures (MCM) task force planning, multi-mission airborne mine detection, and mine neutralization without collateral damage. Mission management tools will be developed for the Mine Countermeasures Commander to assist in the planning and re-planning, scheduling, and allocation of MCM task force assets using an extremely modular, open systems approach. This will provide MCM Commanders with the ability to rapidly re-plan and schedule emerging LCS\/MCM Mission Package assets and maintain situational awareness of heterogeneous groups of systems. The investment in single-system, day\/night, multi-mission airborne mine detection technologies usable at all water depths will be increased in order to reduce the MCM timeline and facilitate our capability to counter surface\/near surface mines in the Surf Zone or Beach Zone (BZ) at night. The viability of the preliminary design and schedule to support Fire Scout integration will be thoroughly explored. New mine neutralization technologies will enhance the effectiveness and efficiency of Navy expeditionary force capabilities in their assigned response mission to counter naval mine and maritime improvised explosive device threats. This technology will enhance the capability of the Maritime Expeditionary Standoff Response (MESR) System of Systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 reflects an increased investment in multi-mission airborne mine detection technologies that offer the potential for a significant reduction in the MCM timeline, and an investment in new mine neutralization technologies countering naval mine and maritime improvised explosive device threats. This increase includes specific and substantial ramp-up in FY 2020 for the Single-system Multi-mission Airborne Mine Detection (SMAMD) effort and initiating the Low Observable No Collateral Damage - Neutralization (LONCD-N) System development.\n\nA complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE HEALTH PROTECTION (FHP)"
                                    },
                                    "Description": {
                                        "val": "The Force Health Protection R-2 Activity focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in Program Element (PE) 0602750N, Future Naval Capabilities (FNC) Applied Research.  These advanced technology investments align to programs under the purview of the Surgeon General of the Navy and the Defense Health Agency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.717"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Continue activities to adapt the hypoxia alert system hardware\/software to guide treatment of casualties in order to sustain performance during high-altitude mountain operations.\n\nFNC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Complete Acute Care Cover for Severely Injured Limbs (ACCSIL) - Integrate the bioactive coating and external conformal cover, which will conclude the pre-clinical studies.  \n\nFNC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Complete Blast Load Assessment: Sense and Test (BLAST) - Integrate blast force sensor technologies with algorithms relating blast force exposures to the likelihood of injury, and conduct clinical testing of the neuro-functional assessment tool.\n\nFNC: FHP-FY16-01 INCAPACITATION PREDICTION FOR READINESS IN EXPEDITIONARY DOMAINS - AN INTEGRATED COMPUTATIONAL TOOL (I-PREDICT)\n- Continue I-PREDICT - Conduct measurements of the high strain rate characteristics of human tissues to allow an accurate prediction of the severity of battlefield injuries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.802"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include those efforts that focus on enabling new practices, procedures, medical devices and pharmaceuticals for the improvement of personnel performance, casualty prevention and combat casualty care.  These technologies aim to decrease the logistical burden of forward medical operations, mitigate and prevent combat-related illness and injury, and provide cutting-edge medical applications for Navy and Marine Corps warfighters on land, at sea, and in the air."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY19 to FY20 was due to the completion of an FNC system that predicts, detects, and warns warfighters of hypoxia in a way that accounts for individual tolerance differences.  A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCENET (FNT)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructured Future Naval Capabilities (FNC) Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "60.565"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FNT-FY13-01 ELECTRONIC WARFARE (EW) BATTLE MANAGEMENT FOR SURFACE DEFENSE\n- Complete EW Battle Management (EWBM) - Automate blue and red force monitoring in EW planning and develop techniques to integrate that information into force level tactical decision making.\n\nFNC: FNT-FY13-03 SILK THREAD\n- Complete Silk Thread Product 1 - Complete hardware development and transition to designated programs of record.\n- Complete Silk Thread Product 2 - Complete hardware development and transition to designated programs of record.\n\nFNC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Complete Adaptive Multi-Intelligence (INT) Correlation & Identification (AMICA) - Extended into FY18 to complete the modification of algorithms to enable cross-domain information fusion and optimization of theater and tactical battlespace assets to conduct anti-surface warfare.\n\nFNC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Complete Adaptive TCPED for Anti-Submarine Warfare (ASW) Services - Develop algorithms and software to ensure network connectivity for low latency data sharing and autonomous and adaptive Command and Control (C2) services for coordination of data collection and sharing.  \n- Complete Data Exfiltration and Networked Platform Interaction - Demonstrate and assess the performance of the radio components and waveforms in a host platform in simulated environments.\n\nFNC: FNT-FY14-03 EXCHANGE OF ACTIONABLE INFORMATION AT THE TACTICAL EDGE (EAITE)\n- Continue Actionable Information Tactical Applications - Develop gisting algorithms to assess the content of a machine produced product to a reference ontology.  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to IW-FY14-02 under a new Information Warfare (IW) R-2 Activity). \n\nFNC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced Airborne Early Warning (AEW) Electronic Protection - Test and improve AEW electronic protection capabilities within a relevant environment.  (In FY19, this FNC Product will be realigned within this PE to AW-FY15-01 under a new Air Warfare (AW) R-2 Activity).\n\nFNC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud - Develop predictive motion models, enemy course-of-action and intent analytics with multi security levels for integrated fires and integrated air and missile defense operational intelligence.  (In FY19, this FNC Product will be realigned within this PE to IW-FY15-02 under a new Information Warfare R-2 Activity).\n\nFNC: FNT-FY15-04 SCALABLE INTEGRATED RADIO FREQUENCY (RF) SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Implement and evaluate spectral interference mitigation and coordination techniques during laboratory and at-sea tests.  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to UW-FY15-02 under a new Undersea Warfare (UW) R-2 Activity).\n- Complete Electronic Warfare Tactical Decision Aid (EW-TACAID) - Implement and test techniques developed to provide efficient operator interfaces in support of netted sensor and coordinated EW operations.  \n- Continue Scalable Integrated Radio Frequency (RF) for Submarines (SIRF-Sub) - Demonstrate prototype effectiveness via testing in laboratory and at-sea scenarios.  (In FY19, this FNC Product will be realigned within this PE to UW-FY15-02 under a new Undersea Warfare R-2 Activity).\n\nFNC: FNT-FY16-01 BUGLE\n- Continue Bugle - Conduct testing and a demonstration of advanced waveforms.  (In FY19, this FNC Product will be realigned within this PE to IW-FY16-02 under a new Information Warfare (IW) R-2 Activity).\n\nFNC: FNT-FY16-02 COMBINED ELECTRO-OPTICS (EO)\/INFRA-RED (IR) SURVEILLANCE AND RESPONSE SYSTEM (CESARS)\n- Continue Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Implement final designs through the fabrication of the high resolution sensor and optics hardware, laser hardware, turret hardware, and processing and system controls.  (In FY19, this FNC Product will be realigned within this PE to IW-FY16-03 under a new Information Warfare R-2 Activity).\n- Continue Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Demonstrate a large Focal Plane Array (FPA) stitching and panoramic capability.  (In FY19, this FNC Product will be realigned within this PE to IW-FY16-03 under a new Information Warfare R-2 Activity).\n\nFNC: FNT-FY17-01 COMMUNICATIONS AND INTEROPERABILITY FOR INTEGRATED FIRES (CIIF)\n- Continue Communications as a Service (CaaS) - Emulate, test and develop software for date forwarding and routing protocols between Internet Protocol (IP) and non-IP networked data links.  (In FY19, this FNC Product will be realigned within this PE to IW-FY17-01 under a new Information Warfare R-2 Activity).\n- Continue Mission-Based Networking for Data Distribution Systems (DDS) (MiND) - Initiate firmware porting and the porting of waveform software code to the emulation platform.  (In FY19, this FNC Product will be realigned within this PE to IW-FY17-01 under a new Information Warfare R-2 Activity).\n\nFNC: FNT-FY17-02 SUBMARINE SIMULTANEOUS TRANSMIT AND RECEIVE (SUBSTAR)\n- Continue Submarine Simultaneous Transmit and Receive (SubSTAR) - Test and improve the prototype broadband simultaneous transmit and receive subsystems.  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to UW-FY17-01 under a new Undersea Warfare (UW) R-2 Activity).\n\nFNC: FNT-FY17-04 RESILIENT HULL\/INFRASTRUCTURE MECHANICAL & ELECTRICAL SECURITY (RHIMES)\t\n- Continue SCAMM - Demonstrate proactive information shaping capabilities in the laboratory. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-02 under a new Information Warfare (IW) R-2 Activity).\n- Continue SCRAM- Demonstrate resilient software to protect redundant controllers and controllers without redundancy in a laboratory environment. (In FY19, this FNC Product will be realigned within this PE to SW-FY17-01 under a new Surface Warfare (SW) R-2 Activity).\n\nFNC: FNT-FY18-04 NANOSAT COMMUNICATIONS FOR ANTI-ACCESS AREA DENIAL (A2AD) OPERATIONS\n- Initiate Nanosat Communications Payloads - Integrate and test a nanosat payload to verify communications performance in the UHF-band in a laboratory environment.  (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity).\n- Initiate Shipboard Integration - Integrate and test UHF networking with a digital mobile radio using a shipboard antenna and tracking.  (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity).\n\nFNC: FNT-FY18-05 ADVANCED COORDINATION TECHNIQUES FOR DISTRIBUTED ELECTRONIC WARFARE (EW)\n- Initiate Coordinated Radio Frequency EW (CRFEW) - Implement precision geo-location and coordinated engagement techniques to surface ship applications in order to provide surface ships with emitter geo-location capabilities and the ability to coordinate electronic attack engagements on battlespace emitters.  (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare (IW) R-2 Activity).\n- Initiate Next Generation Surface Electronic Warfare User Interface - Begin a domain analysis for familiarization with relevant Navy systems, programs of record, technical performers, and the system constraints imposed on human machine interface development.  (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity).\n- Initiate Propagation Channel Assessment and Prediction (PCAP) - Implement techniques for providing real-time propagation channel assessments using shipboard and netted radio frequency sensors and data communication infrastructures.  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to IW-FY18-03 under a new Information Warfare (IW) R-2 Activity)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "POWER AND ENERGY (P&E)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructured Future Naval Capabilities (FNC) Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Complete Air Independent Propulsion System - Complete Phase II fuel cell energy system integration into an unmanned undersea vehicle (UUV) energy section and conduct Technology readiness levels (TRL) 6 land-based testing and transition planning. \n\nFNC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Complete High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Complete circuit protection component testing in a relevant system environment.\n\nFNC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ UNITED STATES MARINE CORPS (USMC) APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Complete Compact High Density Tactical Energy Storage - Complete development, demonstration, and testing of a full-scale TRL-6 Compact High Density Tactical Energy Storage module with a hybrid power system interface.\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop and demonstrate a megawatt scale multifunction energy storage system with an incorporated non-propagating battery subsystem. \n\nFNC: P&E-FY17-02 TORPEDO ADVANCED PROPULSION SYSTEM (TAPS)\n- Continue Torpedo Advanced Propulsion System (TAPS) - Conduct limited component development and testing, preparing for a down-selection to one technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA SHIELD (SHD)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructured Future Naval Capabilities (FNC) Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "55.745"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC:  SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Complete Compact Modular Sensor-Processing Suite (CMSS) - Finish the final Demonstration of the multi-sensor detection of ocean mines that had to be extended into FY18.\n\nFNC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Continue Cooperative Networked Radar - Conduct testing and demonstrating software algorithms and techniques for cross-platform radar operation deliver enhanced sensitivity.  (In FY19, this FNC Product will be realigned within this Program Element (PE) to SW-FY13-02 under a new Surface Warfare (SW) R-2 Activity).\n\nFNC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE\n- Continue ATT Timeline Compression (ATTTC) - Conduct a static in-water demonstration.  (In FY19, this FNC Product will be realigned within this PE to SW-FY14-03 under a new Surface Warfare R-2 Activity).\n- Continue Concept C Countermeasure - Conduct an at-sea static assessment of the complete subsystem.  (In FY19, this FNC Product will be realigned within this PE to SW-FY14-03 under a new Surface Warfare R-2 Activity).\n\nFNC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Autonomous Threat Detection and Localization - Conduct testing and preparations for an at-sea demonstration of the full detection, classification, localization, and tracking sequence on an Extra Large Unmanned Undersea Vehicle (XLUUV).  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to EMW-FY14-03 under a new Naval Expeditionary Maneuver Warfare (EMW) R-2 Activity).\n- Continue Remote Command & Control - Conduct testing and preparations for an at-sea demonstration of full command and control functionality on an Extra Large Unmanned Undersea Vehicle (XLUUV).  (In FY19, this FNC Product will be realigned within this PE to EMW-FY14-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity).\n- Continue Tactical Positioning & Fire Control - Conduct testing and preparations for an at-sea demonstration of the sensor placement and firing solution functionality on an Extra Large Unmanned Undersea Vehicle (XLUUV).  (In FY19, this FNC Product will be realigned within this PE to EMW-FY14-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity).\n\nFNC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S - Validate the Ship Self-Defense System (SSDS) algorithm and the fire control loop concept using modeling and simulation tools.  (In FY19, this FNC Product will be realigned within this PE to SW-FY14-04 under a new Surface Warfare (SW) R-2 Activity).\n\nFNC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MINE COUNTERMEASURES (MCM)\n- Continue Expeditionary MCM Automated Data Analysis - Collect at-sea training data for multi-band automatic target recognition and fusion algorithms.  (In FY19, this FNC Product will be realigned within this PE to EMW-FY15-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity).\n- Continue MCM Task Force Planning - Conduct experiments and a table-top war-game on the re-planning and planning of risk, using the results to update the algorithms and human-machine interface approach.  (In FY19, this FNC Product will be realigned within this PE to EMW-FY15-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity).\n\nFNC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Complete Hyper Velocity Projectile - Design, fabricate and begin assembly of hypervelocity projectiles in preparation for a full-up launch to validate common interfaces for powder gun and railgun launches.\n\nFNC: SHD-FY16-04 SHIP-LAUNCHED ELECTRONIC WARFARE (EW) EXTENDED ENDURANCE DECOY (SEWEED)\n- Continue Ship-launched EW Extended Endurance Decoy (SEWEED) - Conduct flight testing of the decoy demonstrator vehicle and isolation testing of the payload module.  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to IW-FY16-04 under a new Information Warfare (IW) R-2 Activity).\n\nFNC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Continue Surface Ship Periscope Detection and Discrimination (SSPDD) - Continue development and commence preparation of an initial test plan for the government-reference prototype sensor and data fusion system.  (In FY19, this FNC Product will be realigned within this PE to SW-FY16-01 under a new Surface Warfare (SW) R-2 Activity).\n\nFNC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Continue Next Generation Airborne Passive System (NGAPS) - Test and integrate hardware for field communications, control, health monitoring, mission planning and contact separation\/correlation.  (In FY19, this FNC Product will be realigned within this PE to AW-FY16-02 under a new Air Warfare (AW) R-2 Activity).\n\nFNC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Continue Softkill Performance and Real-Time Assessment (SPARTA) - Develop and optimize performance assessment algorithms and align them with a pending system requirements review.  (In FY19, this FNC Product will be realigned within this PE to IW-FY16-05 under a new Information Warfare R-2 Activity).\n\nFNC: SHD-FY17-02 AUTONOMOUS UNMANNED SURFACE VEHICLES FOR MINE WARFARE (MIW)\n- Continue Autonomous Situational Awareness and Hazard Avoidance System for Unmanned Surface Vehicles (USVs)- Demonstrate with an Unmanned Surface Vehicle (USV) an autonomous situational awareness and avoidance capability that enables avoidance of fixed and moving hazards, with the ability to regain track and revisit missed areas using low bandwidth communications.  (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare (EMW) R-2 Activity).\n- Continue High Temperature Superconducting (HTS) Magnetic Influence Sweep Payload for Unmanned Surface Vehicles (USVs)-Demonstrate improved clearance rates and reduced risk to USVs from mine detonation, and improved mean time between maintenance.  (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity).\n- Continue Underway Refueling and Data Transfer for Unmanned Surface Vehicles (USVs) and Remote Multi-Mission Vehicles (RMMVs) - Demonstrate automated\/unmanned refueling of an USV with data download\/upload using a second unmanned platform in up to sea state 3.  (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity).\n\nFNC: SHD-FY17-05 DEEP RELIABLE ACOUSTIC PATH EXPLOITATION SYSTEM (DRAPES)\n- Continue Deep Reliable Acoustic Path Exploitation System (DRAPES) - Integrate algorithms and hardware for undersea communications, health monitoring, and contact separation\/correlation.  (In FY19, this FNC Product will be realigned within this PE to IW-FY17-03 under a new Information Warfare (IW) R-2 Activity).\n\nFNC: SHD-FY18-08 FORCE-LEVEL INTEGRATED FIRES REAL-TIME ENGAGEMENT COORDINATION AND PERFORMANCE ESTIMATION (FIRECAPE)\n- Initiate FIRECAPE Algorithms - Begin development of prototype tactical software and testing on tactical hardware to validate the performance of algorithms against complex threat raids.  (In FY19, this FNC Product will be realigned within this PE to IW-FY18-04 under a new Information Warfare R-2 Activity)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA STRIKE (STK)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructured Future Naval Capabilities (FNC) Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "44.404"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Complete Long Range Find, Fix and ID - Conduct testing, mitigate exceptions, and demonstrate the Long Range Find, Fix, and ID capability.\n\nFNC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Complete Anti-Surface Warfare (ASuW) Weapon Upgrade - Demonstrate a phase II capability in a tactically relevant environment.\n\nFNC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Complete SMOKE - Design, develop and demonstrate an advanced propulsion system for a future air-to-air missile.\n\nFNC: STK-FY14-01 BANK SHOT\n- Complete Bank Shot - Develop the software architecture and associated algorithms that provide for data fusion.\n\nFNC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Complete Collaborative Anti-Surface Warfare Engagement (CASE) - Demonstrate software operability and interoperability for flexible weapon behaviors at the salvo level in an anti-access area-denial environment.\n- Continue Collaborative Electronic Attack (CEA) - Perform bench-top and hardware-in-the-loop testing of the electronic support\/electronic attack hardware and cognitive components (In FY19, this FNC Product will be realigned within this Program Element (PE) to IW-FY14-03 under a new Information Warfare (IW) R-2 Activity).\n\nFNC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Test, assess, and improve the synthetic aperture radar electronic protection capability in relevant littoral environments.  (In FY19, this FNC Product will be realigned within this PE to AW-FY15-03 under a new Air Warfare (AW) R-2 Activity).\n\nFNC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM INFRA-RED (IR)\/ELECTRO-OPTICAL (EO)\/ROCKET PROPELLED GRENADE (RPG) (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Demonstrate the technological feasibility of a RPG hard-kill defense system and its component operability.  (In FY19, this FNC Product will be realigned within this PE to AW-FY15-04 under a new Air Warfare R-2 Activity).\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Build and test the final Infra-Red Countermeasures (IRCM) prototype system to be used in the field test demonstration of countermeasures techniques, build expendables based on derived expendable requirements, and perform radiometric measurements in the field.  (In FY19, this FNC Product will be realigned within this PE to AW-FY15-04 under a new Air Warfare R-2 Activity).\n\nFNC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Conduct in-water testing and assessment of autonomy algorithms for mission planning, waypoint navigation and vehicle health.  (In FY19, this FNC Product will be realigned within this PE to UW-FY15-03 under a new Undersea Warfare (UW) R-2 Activity).\n- Continue MUHV Sensors, Navigation and Guidance - Conduct in-water demonstrations for maturation assessment of the multiband and hybrid sonar, inertial navigation, and fiber optic systems. (In FY19, this Future Naval Capabilities (FNC) Product will be realigned within this Program Element (PE) to UW-FY15-03 under a new Undersea Warfare (UW) R-2 Activity).\n\nFNC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Complete Extended-Range Targeting (E-RAT) - Conduct concept and technology demonstrations of subsystem models to assess the feasibility and operability of new technologies for targeting and fire control modes at extended ranges.\n\nFNC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Continue Reactive Electronic Attack Measures (REAM) - Test and improve reactive electronic attack measures in the representative environment.  (In FY19, this FNC Product will be realigned within this PE to AW-FY16-04 under a new Air Warfare (AW) R-2 Activity).\n\nFNC: STK-FY17-04 ALPO\n- Complete ALPO - Complete the proof of technological feasibility and assessment phase of an advanced signal processing system in a relevant tactical environment.\n\nFNC: STK-FY18-01 PRECISION ELECTRONIC ATTACK TECHNOLOGIES (PEAT)\n- Initiate Multi-platform Retrodirective Electronic Warfare (EW) - Develop and implement EW techniques and supporting technology for multi-platforms effects.  (In FY19, this FNC Product will be realigned within this PE to AW-FY18-01 under a new Air Warfare R-2 Activity).\n- Initiate Single Platform Coherent Arrays - Develop and implement Electronic Warfare techniques and supporting technologies for intra-platform synchronized EW effects.  (In FY19, this FNC Product will be realigned within this PE to AW-FY18-01 under a new Air Warfare R-2 Activity)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AIR WARFARE (AW)"
                                    },
                                    "Description": {
                                        "val": "The Air Warfare R-2 Activity, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in Program Element (PE) 0602750N, Future Naval Capabilities (FNC) Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Director of Air Warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.214"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include those efforts that focus on extended range targeting, advanced protection from infrared and electro-optic threats, radar electronic attack protection, intelligent collaborative engagements, multifunction capabilities for missile warning sensors, advanced threat aircraft countermeasures, technologies that discriminate and provide terminal guidance for weapons that engage moving targets, numerous advanced weapons technologies, high altitude Anti-Submarine Warfare (ASW), placement and operation of active ASW distributed systems, data exfiltration and networked platform interaction, advanced topcoat systems for air vehicles, air platforms safety and affordability technologies, virtual-constructive representations on live avionics displays for training, and dynamic adaptive and modular training for unmanned aerial systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.871"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.871"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity in FY20 include those efforts that focus on enhanced corrosion protection for aircraft surfaces and galvanic interfaces in order to improve durability and reduce toxicity\/exposures, advanced radio enhancements for long range anti-ship missiles and other weapons, human machine interface and vehicle controller command and control technologies that implement full and partial UxV transfer of control and discovery, software performance assessment tools to automatically collect, fuse, display, analyze, and archive live virtual constructive training data from disparate systems, and multi-platform technologies for collaborative airborne manned and unmanned tactical electronic warfare operations at all jamming ranges."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 reflects the initiation of new FNCs involving unmanned vehicle control software, live virtual constructive training, and collaborative electronic warfare technologies.  A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INFORMATION WARFARE (IW)"
                                    },
                                    "Description": {
                                        "val": "The Information Warfare R-2 Activity, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in Program Element (PE) 0602750N, Future Naval Capabilities (FNC) Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Deputy Chief of Naval Operations for Information Warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "74.446"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity cover rapidly evolving technological areas and include those that focus on next-generation command, control and decision support services, cyber security, cyber operations, real-time engagement coordination and performance estimation, next generation countermeasure technologies for ship missile defense, extended distributed weapons coordination, cross field processing and smart use of distributed systems, network collaborative precision navigation and timekeeping, communications and interoperability for integrated fires, shipboard panoramic infrared and electro-optic cueing and surveillance systems, a tactical cloud that exploits cross warfare area data sources, electronic warfare battle management for surface defense, autonomous persistent tactical surveillance, mission-based waveform controls and networking, satellite vulnerability mitigation, comprehensive maritime operational and navigational planning via decision support services, collaborative algorithms for non-Global Positioning System (GPS)-based navigation, technologies that enable real-time situational awareness of tactic-edge Internet Protocol (IP) networks operating in contested environments, technologies enabling coordination between shipboard and expendable Electro-Optical\/Infrared (EO\/IR) countermeasures, automation technologies that improve theater level anti-submarine warfare operations and multi-domain battle management capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "61.814"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "61.814"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity in FY20 cover rapidly evolving technological areas and include those that: a)enable distributed and networked sensor and weapon control by providing a communications interface for combat systems applications, b) deliver data and information via any combination of available tactical data links, c) enhance security, d) provide an improved capability to detect and track the newest generation of ultra-quiet submarines in the deep ocean, e) provide the surface fleet with a position fixing capability in a Global Positioning System (GPS) denied environment, f) correlate multi-sensor, multi-platform, radio-frequency, geo-location data to create a passive common operating picture and enable coordinated engagements of multi-mode, multi-aspect, threat sensors using networked tactical electronic warfare and information operations systems, g) build on networked electronic warfare infrastructures to provide new user interfaces for multi-platform, coordinated electronic support and electronic attack techniques, h) sense and assess real-time environmental conditions to improve sensor performance forecasting and automate the detection of very quiet targets within undersea surveillance barriers, and i) develop technologies that can be demonstrated in an 'A'-size sonobuoy capable of delivering the array gain required to localize and collect passive acoustic intelligence of ultra-quiet submarines at tactically relevant ranges through exploitation of a unique feature of the sound channel."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 was due to the completion and delivery to acquisition programs of record of several Future Naval Capabilities (FNC) that successfully demonstrated a Technology Readiness Level (TRL) of 6, including the FNCs providing a tactical cloud capability that exploit cross warfare area data sources and a means to detect and measure incoming threats.  A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURFACE WARFARE (SW)"
                                    },
                                    "Description": {
                                        "val": "The Surface Warfare R-2 Activity, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in Program Element (PE) 0602750N, Future Naval Capabilities (FNC) Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Director of Surface Warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.656"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include those efforts that focus on hyper velocity projectiles, full sector torpedo defense, cooperative networked radars, sonar automation, radar resource management for integrated air and missile defense, periscope detection and discrimination, high fidelity active sonar training, anti-ship missile defense, long range detection and tracking, naval interceptor improvements, unmanned systems common control, digital array radars, multifunction shipboard energy storage and power distribution, high power solid state circuit protection, compact power conversion for advanced surface machinery systems, resilient hull and infrastructure mechanical and electrical security, phased array antennas, human injury and treatment models, aluminum alloy corrosion control and prevention, affordable common radar architectures, total ship survivability damage tolerance and recoverability, adaptive training to enhance individual and team learning, and platform design and acquisition tools that reduce manpower."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "46.824"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "46.824"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity in FY20 include those efforts that focus on: a) high density, modular and configurable, high cycle rate, megawatt-scale multifunction energy storage systems for electric weapons and sensor loads that are necessary to provide continuous operational availability, b) the integration testing necessary to implement attack resilient architectures and toolsets that can be retrofitted to both legacy and modern shipboard control systems, c) the incorporation of high density reactive materials into warheads such as the ALaMO 57mm round so as to significantly increase lethality without requiring changes to flight dynamics, guidance, and\/or interaction with the respective weapon system, d) advanced alloys and airfoil coatings for Gas Turbine hot section components that will realize a 3X improvement in engine life at higher operating temperatures and pressures, improving the mean time between failure of these expensive ship engines, e) technologies that counter unmanned aerial surveillance drones, f) a new in-situ electrodeposition repair process to coat heat exchanger tubing surfaces with materials and alloys that restore and improve the integrity of damaged Cu-Ni tubing, g) training for staffs and operators required to conduct command and control against peer threats in degraded and denied environments, h) a new electronic initiation safety device for energetic initiation for both SM-6 and SM-2 upgrades, i) a receive-only capability on SPY-6V1 for improved situational awareness during EMCON and improved radar timelines with advanced waveforms for communications and radar operation, and j) modular virtual-constructive simulation technologies, realistic phenomenology and behavior models for synthetic entities in support of warfighter command Ttam and platform operator staff multi-mission training, assessment and certification."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 enables the initiation of new FNCs for in-situ repair of heat exchanger tubing, training for operations in command and control denied or degraded environments, a new electronic initiation safety device for the SM-2 and SM-6, and receive-only SPY-6V1 improvements.  A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UNDERSEA WARFARE (UW)"
                                    },
                                    "Description": {
                                        "val": "The Undersea Warfare R-2 Activity, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in Program Element (PE) 0602750N, Future Naval Capabilities (FNC) Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Director of Undersea Warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.212"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include those efforts that focus on extended range modular undersea heavyweight vehicle technology for submarine-launched torpedoes, coherent electronic attack capabilities for submarines, vector sensors and signal processing for acoustic arrays, panoramic infrared sensors, technologies for rapid and covert surveillance, electronic sensors for detection of low probability of intercept periscope detection radars, torpedo advanced propulsion systems, simultaneous transmit and receive capabilities for submarines, scalable integrated radio frequency systems for undersea platforms, electronic warfare tactical decision aids, tools for predicting array operational loading and distribution, acoustic damping systems, corrosion mitigation technologies that increase operational availability, panoramic photonics mast technologies, hyper-spectral scanning imagery, low light level video cameras, new material development and lab characterization, unmanned aerial system control technologies, adaptive training for submarine navigation and piloting, signature management technologies, and information architectures for improved decision making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "51.359"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "51.359"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity in FY20 include those efforts that focus on a) simultaneous transmit and receive capabilities for radio frequency antenna apertures as well as the backend processing that enable stealthy submarine information operation missions, b) an integrated combat capability to the Submarine Payload Control System that supports collaborative planning, payload coordination, briefing, and enhanced mission execution through seamless integration with the unmanned vehicle controller, c) reducing the signature of current and future submarines in order to enhance their military effectiveness, d) automated data analysis for expeditionary mine countermeasures, e) a modular and adaptive electronic warfare trainer, scenario generator and digital stimulator that's applicable to multiple training facilities and air, surface, and undersea platforms, f) high performance submersible radar absorbing structures that use advanced manufacturing techniques to improve affordability, durability, scalability, and the performance of submarine mast materials, and g) technologies offering a covert broadband acoustic signal structure with advanced processing algorithms that will increase an SSBN's ability to conduct bathymetric fixes in a wider range of operational environments."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2019 to FY 2020 supports completion and delivery to acquisition programs of record of several Future Naval Capabilities (FNC) including tools for predicting array operational loading\/distribution and heavyweight torpedo improvements.  A complete accounting of the technologies being developed and a full disposition of each technology development effort will be provided separately to the Congressional oversight committees."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The performance metric for this Program Element (PE) is measured by the number of FNCs that transition through an acquisition POR to deploy new capabilities into the Fleet or Force."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "7.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other projects"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Advanced Development of High Yield Conventional Energetics"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "7.500"
                                        },
                                        "Text": {
                                            "val": "FY19 funds will be used towards the advanced demonstration of energetic materials in a variety of weapon system applications to include:  high performance solid rocket and air breathing propulsion, reactive materials\ndemonstrations and effects in advanced lethality and effectiveness models,advanced warhead concepts to include novel reactive shaped charge configurations, hybrid reactive material warhead demonstrations, and the development and demonstration of any necessary modeling and simulation capabilities for quantification of damage effects on adversary weapon systems,and other potential energetic technologies."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other projects"
                        }
                    }
                }
            ]
        }
    }
}