{
    "id": "2020-Army-PB-2040-JBOOK-6862ccffed1a667db11cb620e9184b2662501ed68aad7c3c768162a310d4d712-12",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605706A"
        },
        "ProgramElementTitle": {
            "val": "Materiel Systems Analysis"
        },
        "R1LineNumber": {
            "val": "188"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.694"
            },
            "CurrentYear": {
                "val": "21.223"
            },
            "BudgetYearOne": {
                "val": "21.342"
            },
            "BudgetYearOneBase": {
                "val": "21.342"
            },
            "BudgetYearTwo": {
                "val": "21.631"
            },
            "BudgetYearThree": {
                "val": "21.681"
            },
            "BudgetYearFour": {
                "val": "21.673"
            },
            "BudgetYearFive": {
                "val": "22.79"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "152.034"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) funds Headquarters, Department of the Army (HQDA) civilians at the United States (U.S.) Army Materiel Systems Analysis Activity (AMSAA) to conduct responsive and effective materiel systems analysis to support modernization solutions for the U.S. Army Future Force. AMSAA conducts systems and engineering analyses to support Army decisions in technology, materiel acquisition, and the design, development, fielding, and sustainment of Army weapon\/materiel systems. As part of this mission, AMSAA develops and certifies system level performance data used in Army studies, and develops item-level performance methodology and Models and Simulations (M&S) for the current and future operational environment and emerging threats.  \n\nAMSAA exercises HQDA responsibility for developing, maintaining, improving, verifying, validating, and accrediting item-level performance data and M&S for combat effects and logistics.  This includes the development and maintenance of common data formats. In support of its materiel systems analysis mission, AMSAA analyzes the performance and combat effectiveness of conceptual, developmental, and fielded systems. Unique models and methodologies have been developed to predict critical performance variables, such as weapon accuracy, target acquisition, rate of fire, probability of inflicting catastrophic damage, personnel and vehicle survivability, mobility, system reliability and several additional capability areas. AMSAA generates performance and effectiveness measures and ensures their standard use across major Army and Joint studies. AMSAA conducts and supports various systems analysis efforts across the entire materiel system life cycle, such as: Analysis of Alternatives (AoAs); analytical support to Cross-Functional Teams (CFTs); system cost\/performance tradeoffs and early technology tradeoffs to inform system and acquisition program risk assessments; weapons\/systems mix analyses; business case analyses; cost benefit analyses; requirements analyses; technology insertion studies; reliability growth studies; Physics of Failure (PoF) analyses; Schedule and Technical Risk evaluations, and analytical support for Test and Evaluation. These analyses are used by leadership within HQDA (both Army Staff and Assistant Secretaries in the HQDA Secretariat), Army Materiel Command, Army Research, Development and Engineering Command (RDECOM), Training and Doctrine Command, Army Test and Evaluation Command, Program Executive Officers\/Project Managers, Army Futures Command (AFC) and the Office of Secretary of Defense (OSD)\/Department of Defense (DoD). AMSAA's inclusion as one of the central members of the Future Modernization Analysis Center of the Army Futures Command illustrates the critical contributions the organization has and continues to make in supporting Acquisition Modernization decisions.\n\nAMSAA analyses and data are used by these organizations in making acquisition, procurement, and logistics decisions in order to provide quality equipment and procedures to the Soldier, along with enhancing and sustaining readiness for the Current and Future Force. AMSAA's M&S capabilities support the development, linkage, and accreditation of live, virtual, and constructive simulations, and provide unique tools that support systems analysis of individual systems and the combined-arms environment. AMSAA maintains over 75 models and simulations, both internally developed to address specific analytical requirements. This M&S infrastructure provides a hierarchical modeling framework that is unique to AMSAA and allows for a comprehensive performance and effectiveness prediction capability that can be utilized to make trade-off and investment decisions prior to extensive and expensive hardware testing of proposed systems\/technologies for the readiness of the Current and Future Force.  \n\nAMSAA exercises HQDA responsibility for Army reliability methodology development. In this role, as the Army's Executive Agent for reliability and maintainability (R&M) standardization improvement, AMSAA develops and implements R&M reform initiatives that support acquisition decisions and life cycle management. AMSAA develops and applies engineering approaches that assess the reliability of Army materiel and provides recommendations on ways to improve reliability, thereby reducing logistics footprints and life cycle costs, and extending failure-free periods for deployed equipment. AMSAA's electronic and mechanical PoF program pioneered the Army's involvement in utilizing computer-aided engineering tools in the analysis of root-cause failure mechanisms at the component level during the system design process. AMSAA's reliability engineering and PoF tools\/analyses have been used extensively to support the design improvement of developmental and fielded systems used in Current Operations, resulting in improved reliability, reduced Operating and Support costs, and reduced logistics expenditures and footprints. AMSAA, in conjunction with the Army Evaluation Center (AEC), form the Center for Reliability Growth, which develops critical tools, methodologies, policies, formal guidance, and educational materials needed to help acquisition programs achieve their required reliability during the acquisition process. The reliability improvements achieved for major weapon systems translates into billions of dollars in operating and support cost savings over the life cycle.\n\nAMSAA's unique analytical capabilities are supporting AEC\/Army Test and Evaluation Command (ATEC) to assess and determine the essential analytical requirements to enhance Army evaluations and reduce extensive testing. AMSAA's support in this area improves evaluation products and results in better materiel solutions to the Warfighter. AMSAA assists in systems evaluations which support various Acquisition Category (ACAT) materiel system decisions, and provides quick response analyses in support of rapid initiatives for Current Operations.\n\nAs the Army's center for materiel systems analysis, AMSAA provides the technical capability to support Army and DoD decision makers throughout the entire acquisition process in responding to analytical requirements across the full spectrum of materiel. AMSAA's unique in-house, consistent, integrated analytical capability is a critical asset that provides Army leadership with timely, independent, unbiased, reliable, and high quality analysis to support complex decisions required for Current Operations and the development of the Future Force. AMSAA's integrated set of skills and tools are focused on its core mission to develop and deliver Analytical Solutions to enable Readiness."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.89"
                },
                "CurrentYear": {
                    "val": "21.226"
                },
                "BudgetYearOne": {
                    "val": "21.524"
                },
                "BudgetYearOneBase": {
                    "val": "21.524"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.694"
                },
                "CurrentYear": {
                    "val": "21.223"
                },
                "BudgetYearOne": {
                    "val": "21.342"
                },
                "BudgetYearOneBase": {
                    "val": "21.342"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.196"
                },
                "CurrentYear": {
                    "val": "-0.003"
                },
                "BudgetYearOne": {
                    "val": "-0.182"
                },
                "BudgetYearOneBase": {
                    "val": "-0.182"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.004"
                    },
                    "CurrentYear": {
                        "val": "-0.003"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.192"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.182"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.182"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "541"
                    },
                    "ProjectTitle": {
                        "val": "Materiel Sys Analysis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.694"
                        },
                        "CurrentYear": {
                            "val": "21.223"
                        },
                        "BudgetYearOne": {
                            "val": "21.342"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.342"
                        },
                        "BudgetYearTwo": {
                            "val": "21.631"
                        },
                        "BudgetYearThree": {
                            "val": "21.681"
                        },
                        "BudgetYearFour": {
                            "val": "21.673"
                        },
                        "BudgetYearFive": {
                            "val": "22.79"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "152.034"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds Headquarters, Department of the Army (HQDA) civilians at the United States (U.S.) Army Materiel Systems Analysis Activity (AMSAA) to conduct responsive and effective materiel systems analysis to support modernization solutions for the U.S. Army Future Force. AMSAA conducts systems and engineering analyses to support Army decisions in technology, materiel acquisition, and the design, development, fielding, and sustainment of Army weapon\/materiel systems. As part of this mission, AMSAA develops and certifies system level performance data used in Army studies, and develops item-level performance methodology and Models and Simulations (M&S) for the current and future operational environment and emerging threats.  \n\nAMSAA exercises HQDA responsibility for developing, maintaining, improving, verifying, validating, and accrediting item-level performance data and M&S for combat effects and logistics.  This includes the development and maintenance of common data formats. In support of its materiel systems analysis mission, AMSAA analyzes the performance and combat effectiveness of conceptual, developmental, and fielded systems. Unique models and methodologies have been developed to predict critical performance variables, such as weapon accuracy, target acquisition, rate of fire, probability of inflicting catastrophic damage, personnel and vehicle survivability, mobility, system reliability and several additional capability areas. AMSAA generates performance and effectiveness measures and ensures their standard use across major Army and Joint studies. AMSAA conducts and supports various systems analysis efforts across the entire materiel system life cycle, such as: Analysis of Alternatives (AoAs); analytical support to Cross-Functional Teams (CFTs); system cost\/performance tradeoffs and early technology tradeoffs to inform system and acquisition program risk assessments; weapons\/systems mix analyses; business case analyses; cost benefit analyses; requirements analyses; technology insertion studies; reliability growth studies; Physics of Failure (PoF) analyses; Schedule and Technical Risk evaluations, and analytical support for Test and Evaluation. These analyses are used by leadership within HQDA (both Army Staff and Assistant Secretaries in the HQDA Secretariat), Army Materiel Command, Army Research, Development and Engineering Command (RDECOM), Training and Doctrine Command, Army Test and Evaluation Command (ATEC), Program Executive Officers\/Project Managers, Army Futures Command (AFC) and the Office of Secretary of Defense (OSD)\/Department of Defense (DoD). AMSAA's inclusion as one of the central members of the Future Modernization Analysis Center of the Army Futures Command illustrates the critical contributions the organization has and continues to make in supporting Acquisition Modernization decisions.\n\nAMSAA analyses and data are used by these organizations in making acquisition, procurement, and logistics decisions in order to provide quality equipment and procedures to the Soldier, along with enhancing and sustaining readiness for the Current and Future Force. AMSAA's M&S capabilities support the development, linkage, and accreditation of live, virtual, and constructive simulations, and provide unique tools that support systems analysis of individual systems and the combined-arms environment. AMSAA maintains over 75 models and simulations, both internally developed to address specific analytical requirements. This M&S infrastructure provides a hierarchical modeling framework that is unique to AMSAA and allows for a comprehensive performance and effectiveness prediction capability that can be utilized to make trade-off and investment decisions prior to extensive and expensive hardware testing of proposed systems\/technologies for the readiness of the Current and Future Force.  \n\nAMSAA exercises HQDA responsibility for Army reliability methodology development. In this role, as the Army's Executive Agent for reliability and maintainability (R&M) standardization improvement, AMSAA develops and implements R&M reform initiatives that support acquisition decisions and life cycle management. AMSAA develops and applies engineering approaches that assess the reliability of Army materiel and provides recommendations on ways to improve reliability, thereby reducing logistics footprints and life cycle costs, and extending failure-free periods for deployed equipment. AMSAA's electronic and mechanical PoF program pioneered the Army's involvement in utilizing computer-aided engineering tools in the analysis of root-cause failure mechanisms at the component level during the system design process. AMSAA's reliability engineering and PoF tools\/analyses have been used extensively to support the design improvement of developmental and fielded systems used in Current Operations, resulting in improved reliability, reduced Operating and Support costs, and reduced logistics expenditures and footprints. AMSAA, in conjunction with the Army Evaluation Center (AEC), form the Center for Reliability Growth, which develops critical tools, methodologies, policies, formal guidance, and educational materials needed to help acquisition programs achieve their required reliability during the acquisition process. The reliability improvements achieved for major weapon systems translates into billions of dollars in operating and support cost savings over the life cycle.\n\nAMSAA's unique analytical capabilities are supporting AEC\/ATEC to assess and determine the essential analytical requirements to enhance Army evaluations and reduce extensive testing. AMSAA's support in this area improves evaluation products and results in better materiel solutions to the Warfighter. AMSAA assists in systems evaluations which support various Acquisition Category (ACAT) materiel system decisions, and provides quick response analyses in support of rapid initiatives for Current Operations.\n\nAs the Army's center for materiel systems analysis, AMSAA provides the technical capability to support Army and DoD decision makers throughout the entire acquisition process in responding to analytical requirements across the full spectrum of materiel. AMSAA's unique in-house, consistent, integrated analytical capability is a critical asset that provides Army leadership with timely, independent, unbiased, reliable, and high quality analysis to support complex decisions required for Current Operations and the development of the Future Force. AMSAA's integrated set of skills and tools are focused on its core mission to develop and deliver Analytical Solutions to enable Readiness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materiel Systems Analysis"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY19, AMSAA will be one of the central members of the Futures and Modernization Analysis Center (FMAC)\/Army Futures Command (AFC). These funds will be used by the AMSAA to conduct various materiel systems analysis efforts in support of senior Army decision makers during fiscal years 2019 through 2025. AMSAA will continue to conduct analyses, materiel systems performance data generation and certification, methodology development, Modeling and Simulation (M&S) development, and verification, validation, and accreditation.  The accomplishments include performance and combat effectiveness analyses of materiel systems and technology base programs for the Department of Army Secretariat\/Staff, the Army Materiel Command, the Research, Development and Engineering Command, Program Executive Officers\/Program Managers, the Training and Doctrine Command, the Army Service Component Commands, the Army Test and Evaluation Command, Army Futures Command and the OSD. These analyses form the basis for AMSAA to successfully conduct Analysis of Alternatives (AoA?s), system cost\/performance tradeoffs, early technology trade-offs, weapons\/systems mix analyses, system Technical and Schedule risk assessments, business case analyses, cost benefit analyses, requirements analyses, technology insertion studies, reliability growth studies, Physics of Failure (PoF) analyses; provide extensive analytical support to the Cross Functional Teams; and analytical support for Test and Evaluation. As a member of the FMAC\/AFC, AMSAA will support the SECARMY and CSA priorities and marks a fundamental change in the Army?s approach to modernization and how it delivers future capabilities required to achieve overmatch against future near-peer adversaries. AMSAA\/FMAC will continue to provide the analytical support throughout the acquisition life-cycle to senior leadership and increased experimentation to further enhance effective and efficient Modernization to ensure all warfighting formations have the concepts and capabilities required to defeat adversaries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.694"
                                            },
                                            "Text": {
                                                "val": "Critical analyses from AMSAA will continue to support key Army acquisition milestone decision reviews. AMSAA will support Army conceptual and developmental Acquisition Category ((ACAT) 1, ACAT 2, ACAT 3, and ACAT 4) programs, including but not limited to: Future Vehicle Lift, Vehicle Protection Suite, Maneuver Short Range Air Defense, Cannon ? Delivered Area Effects Munition, Biometrics Enabling Capabilities, Unified Network Operations, and Squad ? Multipurpose Equipment Transport. AMSAA will also enhance analysis capabilities in the cybersecurity and Cyber Electromagnetic Activities (CEMA) areas by developing models and capabilities to address cybersecurity and software risk factors for acquisition programs. Additionally, AMSAA will support multiple analysis efforts in support of the Army Secretariat and Staff. This includes directly participating in and providing analytical products for Army Requirements Oversight Councils (AROCs) and Army Systems Acquisition Review Councils (ASARCs) to assist senior leaders in key acquisition strategy and life cycle decisions for a variety of materiel systems\/programs. AMSAA will also provide analytical support to modify Test and Evaluation (T&E) planning efforts, reduce testing through the use of modeling and simulation, and provide software reliability and analysis capabilities to support T&E. Further, AMSAA will conduct follow-on studies for major Army programs undergoing engineering change proposals and continue to provide essential certified weapons system performance data for all major Army studies. AMSAA?s technical work program relating to Analysis of Alternatives (AoA) (providing analytic input and certified data, as well as leading specified AoAs), Business Case Analyses, Cost Benefit Analyses, and Risk Assessments will continue at a high level (similar to fiscal year (FY) 2016 and FY2017). In addition to support for ACAT 1 and ACAT 2 programs, AMSAA is anticipating an increase in analytical support to Army ACAT 3 and ACAT 4 systems due to budget restrictions and financial limitations. AMSAA will continue efforts in support of the Army Center for Reliability Growth (CRG), as well as efforts on current operations related tasks, analyses, and model enhancements. AMSAA will continue to enhance its comprehensive set of system performance data and essential verified and validated item\/system level methodologies, tools, and models and simulations to conduct materiel system performance analysis. AMSAA?s analysis capabilities and products will enable Senior Leaders to properly shape and influence acquisition policy, procedures, and materiel solutions and increase readiness for our Current and Future Force."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.043"
                                            },
                                            "Text": {
                                                "val": "AMSAA will continue to provide critical analyses and data to support key Army acquisition milestone decisions and reviews. AMSAA will continue to support Army conceptual and developmental Acquisition Category ((ACAT) 1, ACAT 2, ACAT 3, and ACAT 4) programs, including but not limited to: Family of Unmanned Aircraft Systems, Cyberspace Situational Understanding, Enhanced Heavy Equipment Transport System, Big Data Initiatives, and Cyber Electromagnetic Activities (CEMA)\/Electronic Warfare (EW). AMSAA will further develop and enhance Cyber, Air & Missile Defense, and life cycle cost analytic capabilities to ensure more robust analysis of potential capabilities to properly equip the Current and Future Force. Additionally, AMSAA will ensure modeling and simulation readiness by properly updating and sustaining key analytic tools and models.  AMSAA will continue to support a variety of trade-space efforts and analyses in support of the Army Secretariat and Staff. This will include directly participating in and providing analytical products for Army Requirements Oversight Councils (AROCs) and Army Systems Acquisition Review Councils (ASARCs) to assist senior leaders in key acquisition strategy and life cycle decisions for a variety of materiel systems\/programs. AMSAA will also provide analytical support to modify Test and Evaluation (T&E) planning efforts, reduce testing through the use of modeling and simulation, and provide software analysis and reliability capabilities to support T&E. AMSAA will conduct follow-on studies for major Army programs undergoing engineering change proposals and continue to provide essential certified weapons system performance data for all major Army studies. AMSAAs technical work program relating to Analysis of Alternatives (AoAs) (providing analytic input and certified data, as well as leading specified AoAs), Business Case Analyses, and Cost Benefit Analyses and Risk Assessments will continue at a high level (similar to fiscal year (FY) 2017 and FY2018). AMSAA will continue efforts in support of the Army Center for Reliability Growth (CRG). Moreover, AMSAA will continue to develop and enhance its comprehensive set of system performance data and essential verified and validated item\/system level methodologies, tools, and models and simulations to conduct materiel system performance analysis. This will insure accurate and up-to-date analytical products are provided across the full spectrum of Army capability\/commodity areas. Overall, AMSAA?s analysis capabilities and products will enable Senior Leaders to properly shape and influence acquisition policy, procedures, and materiel solutions and increase readiness for our Current and Future Force."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.342"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.342"
                                            },
                                            "Text": {
                                                "val": "AMSAA will continue to provide critical analyses and data to support key Army acquisition milestone decisions and reviews. AMSAA will continue to provide critical analytical support to the Army Cross Functional Teams (CFT), and to support Army conceptual and developmental all Acquisition Category programs including but not limited to: Family of Unmanned Aircraft Systems, Cyberspace Situational Understanding, Future Vertical Lift, Optionally Manned Fighting Vehicle, Future M1 Replacement, Big Data Initiatives, and Cyber Electromagnetic Activities\/Electronic Warfare. AMSAA will further develop and enhance Cyber, Air and Missile Defense, and life cycle cost analytic capabilities to ensure more robust analysis of potential capabilities to properly equip the Current and Future Force. Additionally, AMSAA will ensure modeling and simulation readiness by properly updating and sustaining key analytic tools and models.  AMSAA will continue to support a variety of trade-space efforts and analyses in support of the Army Secretariat and Staff. AMSAA will also provide analytical support to modify Test and Evaluation (T&E) planning efforts, reduce testing through the use of modeling and simulation, and provide software analysis and reliability capabilities to support T&E. AMSAA will conduct follow-on studies for major Army programs undergoing engineering change proposals and continue to provide essential certified weapons system performance data for all major Army studies. AMSAAs technical work program relating to Analysis of Alternatives (AoA?s) (providing analytic input and certified data, as well as leading specified AoA?s), providing direct analytical support to the CFT?s, Business Case Analyses, and Cost Benefit Analyses and Risk Assessments will continue at a high level (similar to fiscal year (FY) 2018 and FY2019). AMSAA will continue efforts in support of the Army Center for Reliability Growth, as well as efforts on current operations related tasks, analyses, and model enhancements. Moreover, AMSAA will continue to develop and enhance its comprehensive set of system performance data and essential verified and validated item\/system level methodologies, tools, and models and simulations to conduct materiel system performance analysis. This will insure accurate and up-to-date analytical products are provided across the full spectrum of Army capability\/ commodity areas. Overall, AMSAA?s analysis capabilities and products will enable Senior Leaders to properly shape and influence acquisition policy, procedures, and materiel solutions and increase readiness for our Current and Future Force. AMSAA?s inclusion as one of the central members of the Futures and Modernization Analysis Center (FMAC)\/Army Futures Command (AFC) illustrates the critical contributions the organization has and continues to make in supporting Acquisition Modernization decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding changes due to economic adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.18"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}