{
    "id": "2020-Navy-PB-1319-JBOOK-70424d53d505ad36f58958e9097dbb4e960ff5c07915d7e5672a15384a45783b-19",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606355N"
        },
        "ProgramElementTitle": {
            "val": "(U)Warfare Innovation Management"
        },
        "R1LineNumber": {
            "val": "193"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "27.759"
            },
            "CurrentYear": {
                "val": "41.918"
            },
            "BudgetYearOne": {
                "val": "28.750"
            },
            "BudgetYearOneBase": {
                "val": "28.750"
            },
            "BudgetYearTwo": {
                "val": "39.456"
            },
            "BudgetYearThree": {
                "val": "43.884"
            },
            "BudgetYearFour": {
                "val": "40.802"
            },
            "BudgetYearFive": {
                "val": "43.570"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Allied\/Coalition Maritime Environment (ACME) 0798:\nThis project promotes interoperability with allied and coalition forces by facilitating maritime interoperability in both processes and communication systems, including emerging capabilities, to counter growing high-end asymmetric threats. \n\nSpace & Electronic Warfare (SEW) Engineering 2144:\nThis project is a systems engineering non-acquisition program to develop, test, implement Technical Authority (TA) products, and validate Naval Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR), Business Information Technology (IT), and Space System architectures to support naval, Joint and Coalition missions across normal, contested, and degraded cyber\/operational environments.  The objective of this project is carried out by multiple tasks that ensure development and delivery of naval Information Warfare (IW) capabilities that are well-integrated, interoperable, secure, and resilient to meet validated warfighting requirements.  \n\nThe Intelligence, Surveillance, and Reconnaissance (ISR) Architecture 2147:\nThis project is intended to guide system of systems capability development and promote interoperability across Navy ISR programs, as well as interoperability and alignment with Department of Defense (DoD)-wide enterprise initiatives including Joint Information Environment (JIE) and Intelligence Community (IC) Information Technology Environment (ITE). This effort to develop integrated ISR architectures will also help instill systems engineering discipline and standardization across the Navy ISR Enterprise and provide a means by which to assess ISR POR progress in conforming to a single Navy architecture.\n\nFleet Experimentation 3319:  \nThe U.S. Navy's Fleet Experimentation (FLEX) project advances\/augments operational and tactical warfighter capabilities through the experimentation of high payoff initiatives, technologies and concepts, Fleet Concepts of Operations (CONOPS), doctrine, and new tactics, techniques and procedures (TTP). The main focus of FLEX between 2018 and 2024 is to operationalize \"A Design For Maintaining Maritime Superiority\" Blue Line of Effort (LOE) through the execution of Fleet Design materiel\/non-materiel capability employment.  \n\nTrident Warrior Project 3320: \nThe U.S. Navy's Trident Warrior (TW) experimentation campaign enables early delivery of capabilities to the warfighter via Fleet-directed Trident Warrior operational events with an emphasis on United States Fleet Forces\/Commander Pacific Fleet (USFF\/CPF) directed focus areas. \n  \nMaritime Communications Demonstration Project 3420:\nClassified Project Maritime Communications Demonstration (MCD) is not a new start.  Funding was realigned from project 3319 FLEX in FY18. The Expeditionary SFOC Communications is developing and experimenting innovative concepts designed to validate both materiel and non-materiel methodologies to provide resilient command and control within the maritime domain.  Identified previous work done within OSD channels, and will leverage lessons learned."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "28.841"
                },
                "CurrentYear": {
                    "val": "41.918"
                },
                "BudgetYearOne": {
                    "val": "36.877"
                },
                "BudgetYearOneBase": {
                    "val": "36.877"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.759"
                },
                "CurrentYear": {
                    "val": "41.918"
                },
                "BudgetYearOne": {
                    "val": "28.750"
                },
                "BudgetYearOneBase": {
                    "val": "28.750"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.082"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-8.127"
                },
                "BudgetYearOneBase": {
                    "val": "-8.127"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.082"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-8.067"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.067"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.060"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.060"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY2020 funding request for project 2144 (Space & Electronic Warfare Engineering) was reduced by $5.218 million to account for the availability of prior year execution balances.\n\nThe FY2020 funding request for project 3319 (Fleet Experimentation) was reduced by $0.906 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0798"
                    },
                    "ProjectTitle": {
                        "val": "Allied\/Coalition Maritime Environment (ACME)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.076"
                        },
                        "BudgetYearOne": {
                            "val": "1.114"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.114"
                        },
                        "BudgetYearTwo": {
                            "val": "1.157"
                        },
                        "BudgetYearThree": {
                            "val": "1.204"
                        },
                        "BudgetYearFour": {
                            "val": "1.250"
                        },
                        "BudgetYearFive": {
                            "val": "1.272"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The ACME program advances Information Warfare (IW) (to include Command, Control, Communications, Computers; Intelligence, Surveillance and Reconnaissance (C4ISR); Electronic Warfare (EW); and Cyber Warfare), interoperability with Australia, Canada, New Zealand, United Kingdom, United States (AUSCANNZUKUS), North Atlantic Treaty Organization (NATO), and other Allied and Coalition partners. The program determines maritime operational gaps with our allies, identifies Doctrine, Organization, Training, Material, Leadership, Personnel, and Facilities (DOTMLPF) solutions with the potential to fill those gaps, and assesses these solutions and associated concepts of operation in laboratory and at-sea environments. The ACME program includes integration and testing in support of joint and Allied war fighting capabilities, including interoperability testing of IW equipment. Allied and joint interoperability is critical for future maritime operations, especially as the United States Navy (USN) expands Internet Protocol (IP) networking throughout the fleet via Consolidated Afloat Networks and Enterprise Services (CANES), Next Generation Networks (NGEN), Mission Partner Environment\/ Future Mission Networking (MPE\/FMN), the U.S. Battlefield Information Collection and Exploitation System - eXtended (BICES-X), and with the Joint Information Environment (JIE).\nCurrently, IP connectivity with AUSCANNZUKUS and other Allied\/Coalition forces is limited, requiring extensive backhaul through ashore infrastructure. Higher bandwidth solutions suitable for use over tactical networks require development and assessment for emerging coalition and joint interoperability requirements, such as Maritime Domain Awareness (MDA), Network Operations Without Shore (NOWS), Satellite Communications (SATCOM) Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operations, and to counter Anti-Access Area Denial (A2\/AD) threats. Increases in data throughput are required for the effective exchange of rich IW data sets and services via Service Oriented Architectures (SOA) within the limitations of High Frequency (HF), Ultra-High Frequency (UHF), and other portions of the radio frequency spectrum, coupled with appropriate Information Assurance and Computer Network Defense (IA\/CND) mechanisms. Development and assessment of potential solutions will integrate improved IP capabilities with the Advanced Digital Network Systems (ADNS) and existing international standards (e.g. Allied Communications Publication 200, NATO Standardization Agreements 5066 and 4691). The continued development and refinement of advanced tactical networking technologies and protocols, to include Low Probability of Intercept (LPI), Low Probability of Detection (LPD), and Anti-Jam (AJ) capabilities as well as Automatic Link Establishment (ALE) standards, will provide for a significant improvement in secure data sharing within, and between, coalition maritime elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Relay Capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Allied\/Coalition Maritime Environment (ACME) funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.076"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop and evaluate secure and interoperable technologies and capabilities supporting Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operations, to include multibearer routing, distributed applications and services and their integration with Mission Partner Environment\/ Future Mission Networking (MPE\/FMN).  This will include Allied\/Coalition Shared Situational Awareness, cross-domain and data labeling solutions in maritime tactical networking environments, and advanced Information Assurance and Computer Network Defense (IA\/CND) solutions (with common and interoperable processes and technologies). \n- Assess technologies for interoperable maritime networking with the continued refinement of advanced tactical networking and communication capabilities, including high-latitude\/polar environments, which promote task group-centric operations. Solutions will address higher bandwidth, Low Probability of Intercept (LPI)\/Low Probability of Detection (LPD)\/Anti-Jam (AJ) technologies across the Radio Frequency (RF) and Optical spectrum and include airborne capabilities. Evaluation of electromagnetic spectrum management and visualization technologies, force-level Electronic Warfare\/Electro-magnetic Maneuver Warfare (EW\/EMW) will also enhance interoperable Information Warfare (IW). \n- Continue to increase Allied IW interoperability with other joint and maritime multi-national forums, such as the Combined Communications Electronic Board (CCEB), Multinational Maritime Information-system Interoperability Steering Group (M2I2), MPE\/FMN, and Joint Information Environment (JIE) forums.\n- Continue to assess and validate individual technologies, integrated solutions, and associated Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) through experimentation, trials and demonstrations with Australia, Canada, New Zealand, United Kingdom, United States (AUSCANNZUKUS) and other Allied\/Coalition partners during operational venues, such as the United States Navy (USN) Rim of the Pacific (RIMPAC) or United Kingdom (UK) Joint Warrior exercise series."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop and evaluate secure, interoperable technologies and capabilities supporting Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operations including Allied\/Coalition Shared Situational Awareness, cross-domain and data labeling solutions in maritime tactical networking environments, and advanced Information Assurance and Computer Network Defense (IA\/CND) solutions (with common and interoperable processes and technologies). \n- Continue to evaluate technologies for interoperable maritime networking. Solutions will address higher bandwidth, Low Probability of Intercept (LPI)\/Low Probability of Detection (LPD)\/Anti-Jam (AJ) technologies across the Radio Frequency (RF) and Optical spectrum and include airborne capabilities. Evaluation of electromagnetic spectrum management and visualization technologies, force-level Electronic Warfare\/Electro-magnetic Maneuver Warfare (EW\/EMW) will also enhance interoperable Information Warfare (IW). \n- Continue to enhance Allied IW interoperability with other joint and maritime multi-national forums, such as the Combined Communications Electronic Board (CCEB), Multinational Maritime Information-system Interoperability Steering Group (M2I2), MPE\/FMN, and Joint Information Environment (JIE) forums.\n- Continue to assess and validate individual technologies, integrated solutions, and associated Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) through experimentation, trials and demonstrations with Australia, Canada, New Zealand, United Kingdom, United States (AUSCANNZUKUS) and other Allied\/Coalition partners during operational venues, such as the United States Navy (USN) Rim of the Pacific (RIMPAC) or United Kingdom (UK) Joint Warrior exercise series."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The $0.038 million increase is attributed to additional support required for Allied Information Warfare (IW) interoperability exercises with other joint and maritime multi-national forums."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Advanced Relay Capabilities: The ACME program will employ laboratory testing and at-sea demonstrations to assess specific technologies, operational concepts, and integrated Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) solutions pertaining to Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operational environments, Network Operations Without Shore (NOWS), Maritime Domain Awareness (MDA), Mission Partner Environment\/ Future Mission Networking (MPE\/FMN), Joint Information Environment (JIE), and other aspects of Information Warfare (IW). These assessments will report on identified capability gaps, link capability gaps to technology\/DOTMLPF gaps, identify technologies and DOTMLPF solutions considered ready for deployment, transition to a program of record to enhance Fleet war fighting capability, and enhance Allied interoperability."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2144"
                    },
                    "ProjectTitle": {
                        "val": "Space & Elec Warfare Engineering"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "22.058"
                        },
                        "BudgetYearOne": {
                            "val": "14.535"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.535"
                        },
                        "BudgetYearTwo": {
                            "val": "23.841"
                        },
                        "BudgetYearThree": {
                            "val": "28.209"
                        },
                        "BudgetYearFour": {
                            "val": "24.635"
                        },
                        "BudgetYearFive": {
                            "val": "26.165"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "To support Navy objectives in advancing Information Warfare (IW) capabilities, the Space and Electronic Warfare (SEW) Engineering project provides six main functions:\n\n(1) Develop the architectures, specifications and standards, tools, and processes to support a single integrated Navy plan for cybersecurity. These engineering artifacts provide Navy specific guidance to drive common and consistent implementation of security controls across current and future Navy Programs of Record\/projects. This eliminates redundancies and inefficiencies characteristic of previous stove-pipe development efforts in which each system addressed security individually. These efforts enable a standardized approach to move out faster to improve the Navy's cyber resiliency. \n\n(2) Provide the cybersecurity vulnerability and functional test capability which supports cybersecurity test requirements and the Command, Control, Communications, Computers, Intelligence (C4I) components of USS Secure. USS Secure is a cyber assessment program within the Navy. This System of Systems (SoS) (Afloat, Aloft, C4I & Shore) capability in a test laboratory environment provides a rapidly re-configurable capability that integrates maritime hardware systems into a virtual platform. This platform level SoS provides cybersecurity research, development, test and evaluation, and training, not otherwise possible. This combination of Systems Commands (SYSCOM) laboratories, cyber ranges, and Red Teams simulating Navy platforms in operational maritime environments is critical for effectively evaluating cyber threats against specified mission threads.\n\n(3) Define an integrated Enterprise Architecture to support design, development and delivery of integrated Navy Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR), Business Information Technology (IT), and Space System capabilities. This architecture reflects current (as-is) and future (target) end states to support technical analyses, program planning, and enterprise-level investment decisions across IW capabilities. Perform mission based system of systems analysis to ensure integration and interoperability, and validate end-to-end warfighting capabilities to quickly address emerging threats. \n\n(4) Provides engineering tools and processes to drive rigorous Systems Engineering discipline across the acquisition lifecycle to support rapid development and delivery of secure and interoperable C4ISR, Business IT, and Space Systems capabilities that meet Fleet requirements. Conduct Systems Engineering Technical Reviews (SETRs) to provide independent, objective assessments of technical maturity and compliance with applicable architectures, specifications and standards across IW capabilities. \n\n(5) The Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX) provides a means to demonstrate and evaluate the interoperability of United States (US), North Atlantic Treaty Organization (NATO), and coalition information sharing systems.\n\n(6) Navy Additive Manufacturing (AM) technology aligns to CNO priorities to deliver revolutionary capabilities to improve fleet readiness.  These enterprise solutions will provide the foundation to (1) enhance warfighter capability through new innovative system designs; (2) increase readiness through low volume production of hard to source items; and (3) improve warfighting capacity by enabling production at or near the point of need. Specific efforts include the development of an Enterprise Digital Manufacturing Architecture which addresses design and certification of AM capabilities for both afloat and ashore, development of Cyber Security Risk Management Profiles for devices and applications on operational networks, definition of a secure Technical Data Package to describe components that can be digitally manufactured, and the development of an overarching, enterprise-level Digital Manufacturing Thread (device management, digital rights management, licensing, configuration management, data storage rule\/access and application programing interfaces)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cybersecurity Architecture, Specifications and Standards"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Cybersecurity Architecture, Specifications and Standards funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.890"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop the architectures, specifications, and standards that provide the technical foundation of a single, integrated Navy plan for cybersecurity in accordance with changes in the threat environment, advances in technology, evolving Department of Defense (DoD) guidance, and results of USS SECURE cyber test activities.\n- Continue to assess Navy Programs of Record (PoR) plans for implementation of cybersecurity controls, assess compliance to determine cyber risk with Information Assurance (IA) Technology Authority (TA) cybersecurity architectures and standards, and perform risk assessments that articulate systems' ability to effectively support operational missions in various cyber conditions. \n- Continue Defense-in-Depth Functional Implementation Architecture Network Transformation (DFIANT) work across Naval Systems Commands (SYSCOMs) to develop domain-specific implementations of the Defense-in-Depth Functional Implementation Architecture (DFIA) by defining control points, IA and logical attributes, controlling parameters, and inheritable security controls to establish a layered approach to cybersecurity.\n- Develop detailed design artifacts for PoRs to ensure integration between Navy Cyber Situational Awareness (NCSA) tools and the Defensive Cyber Operations (DCO) enclave to enable command and control of Navy networks under all cyber conditions.\n- Continue to assess Acquisition Category (ACAT) programs compliance with Information Technology (IT) and IA TA architectures, specifications and standards.  Pilot the newly developed Cybersecurity Figure of Merit (CFOM) to refine the process and toolset for quantifying cybersecurity readiness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.793"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.793"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Assess emerging threats, advances in technology, updates to National Institute of Standards and Technology (NIST) and DoD guidance, and results of USS SECURE cyber test activities to inform the need for new technical artifacts that provide cybersecurity guidance to Navy Programs of Record (PoR) and projects.  Continue to develop the architectures, specifications, and standards that provide the technical foundation of the single, integrated Navy plan for cybersecurity.\n- Continue to evaluate and provide feedback on Navy PoRs plans for implementation of cybersecurity controls. Support program reviews and milestones by assessing compliance with Informational Assurance (IA) Technology Authority (TA) cybersecurity architectures and standards, and perform risk assessments that articulate systems' ability to effectively support operational missions in various cyber conditions.\n- Drive implementation of IA TA cybersecurity architectures and standards across programs and projects.\n- Develop detailed design artifacts for PoRs to ensure integration between Navy Cyber Situational Awareness (NCSA) tools and the Defensive Cyber Operations (DCO) enclave to enable command and control of Navy networks under all cyber conditions.\n- Continue to assess Acquisition Category (ACAT) programs compliance with Information Technology (IT) and IA TA architectures, specifications and standards.  Refine the Cybersecurity Figure of Merit (CFOM) to assess Information Warfare programs and projects effectiveness in meeting cybersecurity requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The $1.097 million decrease is attributed to reduced domain-specific implementation of the in Depth Functional Implementation Architecture (DFIA)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cybersecurity Vulnerability & Functional Test Capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Cybersecurity Vulnerability & Functional Test Capability funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.123"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Install Command, Control, Communications, Computers, Intelligence (C4I) components within two test laboratory assets procured in FY18 to allow platforms to test their C4I systems in a threat environment. \n- Utilize lab assets for cross-Systems Command(SYSCOM) USS SECURE serial test events.\n- Continue to develop and mature connectivity (including assessment and authorization) strategies to combine Systems Command (SYSCOM) laboratories, cyber ranges, and Red Teams to develop more accurate simulations of Navy platforms in operational maritime environments allowing for critical, effective, and expeditious evaluation of cyber threats against specified mission threads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.831"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.831"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to utilize lab assets for cross-SYSCOM USS SECURE serial test events."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The $3.292 million decrease is attributed to the availability of prior year execution balances and a decrease in support for cross-SYSCOM USS SECURE test events."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise Architecture"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Enterprise Architecture funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.746"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of an overarching Space and Naval Warfare Systems Command (SPAWAR) Enterprise Architecture with associated specifications, standards and profiles to support effective engineering, design, development, acquisition, and delivery of Navy Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR), Business Information Technology (IT), and Space System capabilities. \n- Continue to develop the capabilities of the Architecture Data Repository. \n- Continue development of Model Based System Engineering (MBSE) capabilities, processes and tools to support technical performance gap analysis and trade recommendations by identifying capability gaps and overlaps, interoperability issues, and cybersecurity risks between Navy System of Systems (SoS) capabilities.  \n- Continue to refine the Integration and Interoperability (I&I) Capability framework to support SoS analyses of how well systems operate together across the Naval enterprise to deliver validated warfighting capabilities. \n- Continue to use Command and Control (C2), Battlespace Awareness, and Integrated Fires (IF) Integrated Capabilities Technical Baseline (ICTBs) to perform analysis of mission performance, identify capability gaps, and perform engineering trade studies, to better inform investment decisions and ensure alignment to all emerging warfighting objectives for increased interoperability and information sharing across weapons, sensors, and shooters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.668"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.668"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Support Navy digital requirements by continuing to grow the capabilities of the Architecture Data Repository to effectively share data across the SPAWAR enterprise and with other Naval Systems Commands (SYSCOMs). Provide the infrastructure critical to implementing an integrated Model Based Systems Engineering environment, and provide configuration management \n- Continue development of Model Based System Engineering (MBSE) capabilities, processes and tools to support complex technical performance gap analysis and trade recommendations by identifying capability gaps and overlaps, interoperability issues, and cybersecurity risks between Navy System of Systems (SoS) capabilities.  \n- Continue to refine the Integration and Interoperability (I&I) Integrated Capability Framework to support SoS analyses of how well systems operate together across the Naval enterprise to deliver validated warfighting capabilities. \n- Continue to use Command and Control (C2), Battlespace Awareness, and Integrated Fires (IF) Integrated Capabilities Technical Baseline (ICTBs) to perform analysis of mission performance, identify capability gaps, and perform engineering trade studies for prioritized missions, to better inform investment decisions and ensure alignment to all emerging warfighting objectives for increased interoperability and information sharing across weapons, sensors, and shooters."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 decrease of $0.078 million is driven by reduced support associated with the development of an overarching SPAWAR Enterprise Architecture."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SYSCOM Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Systems Commands (SYSCOM) Systems Engineering funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.216"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to perform Systems Engineering Technical Reviews (SETRs) of acquisition programs ensuring compliance with statutory and regulatory directives, as well as applicable Information Technology (IT) and Information Assurance (IA) Technical Authority (TA) architectures, specifications, standards and profiles.\n- Continue to develop and perform technical reviews of formal acquisition and engineering documentation to ensure the application of sound systems engineering analysis and design principles to system planning requirements, design, testing, and supportability. Provided independent technical analyses to support Milestone Decisions.\n- Continue to conduct Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) certifications through design and testing analysis, ensuring interoperability with platform, force level, and joint\/allied\/coalition forces.\n- Continue engineering evaluations, assessments of compliance with authoritative architectures and technical standards, and address technical issues in the following domains: Command and Control (C2); Intelligence, Surveillance, & Reconnaissance\/Information Operations (ISR\/IO); Space Systems, Business IT; and Communications & Networks.\n- Continue maturation of the Space and Naval Warfare Systems Command (SPAWAR) Engineering Competency Development Model (CDM) framework."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.979"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.979"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- As the Technical Authority for acquisition programs, continue to perform Systems Engineering Technical Reviews (SETRs) to ensure compliance with statutory and regulatory directives, as well as applicable Information Technology (IT) and IA TA architectures, specifications, standards and profiles.  Provide an independent assessment of technical risk to support milestone decision authority and program manager decisions.\n- Continue to develop and perform technical reviews of formal acquisition and engineering documentation to ensure the application of sound systems engineering analysis and design principles to system planning requirements, design, testing, and supportability. Implement applicable current TA architectures, specifications, standards, policies and processes in documentation. Provide independent technical analyses to support Milestone Decisions.\n- Continue to conduct Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) certifications through design and testing analysis, ensuring interoperability with platform, force level, and joint\/allied\/coalition forces.\n- Continue engineering evaluations, assessments of compliance with authoritative architectures and technical standards, and address technical issues in the following domains: Command and Control (C2); Intelligence, Surveillance, & Reconnaissance\/Information Operations (ISR\/IO); Space Systems, Business IT; and Communications & Networks."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The $0.237 million decrease eliminated the development of the role-based Competency Development Models (CDM), which defines specialty and sub-specialty roles, as well as associated Knowledge, Skills and Abilities (KSAs) required to meet evolving mission requirements for the Space and Naval Warfare Systems Command (SPAWAR) CDM framework."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 CWIX funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop interoperability and information sharing through coalition engagement, technology, demonstrations, and assessments leading to improvements of Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems within the Navy and in conjunction with Joint Services and Coalition efforts.\n-Continue to pursue and utilize greater Pacific Command (PACOM) and Southern Command (SOUTHCOM) Partner Nation engagement by fostering a connected, distributed experimentation environment suitable for expanded experimentation in those areas.\n-Continue to enhance interoperability across North Atlantic Treaty Organization (NATO) and affiliated Coalition Partners by participating in the planning and execution of Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX).\n-Continue to assess Coalition Interoperability assurance, validation, and verification as related to the engineering and execution of the Mission Partner Environment (MPE) in the appropriate venues.\n-Utilize connected environments such as the Combined Federated Battle Laboratories Network (CFBLNet) to experiment with innovative technical solutions in order to evaluate their value in fostering enhanced interoperability across Coalition Partner Nations and the United States (US)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop interoperability and information sharing through coalition engagement, technology, demonstrations, and assessments leading to improvements of Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems within the Navy and in conjunction with Joint Services and Coalition efforts.\n-Coordinate with the MultiNational Maritime Informational Technology and Interoperability Board (M2I2) to facilitate interaction between OPNAV Resource Sponsor guidance and experimentation desires of Coalition Partner Nations.\n-Continue to pursue and utilize greater Pacific Command (PACOM) and Southern Command (SOUTHCOM) Partner Nation engagement by fostering a connected, distributed experimentation environment suitable for expanded experimentation in those areas.\n-Continue to enhance interoperability across North Atlantic Treaty Organization (NATO) and affiliated Coalition Partners by participating in the planning and execution of Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX).\n-Continue to assess Coalition Interoperability assurance, validation, and verification as related to the engineering and execution of the Mission Partner Environment (MPE) in the appropriate venues.\n-Continue to utilize connected environments such as the Combined Federated Battle Laboratories Network (CFBLNet) to experiment with innovative technical solutions in order to evaluate their value in fostering enhanced interoperability across Coalition Partner Nations and the United States (US)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no appreciable changes in funding from FY19 to FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding for this effort was previously funded in the Enterprise Architecture accomplishment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Stand-up the Additive Manufacturing (AM) Test-bed, a rapid prototyping environment that facilitates risk reduction through the integration of AM machines, hardware and software in a controlled environment.\n-Develop architectural baselines supporting the digital thread to be incorporated in Afloat and Ashore networked AM nodes.\n-Develop Risk Management Framework (RMF) Profiles for the various components and interfaces required to network AM hardware and software assets.\n-Establish certification and technical authority for the AM effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.216"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.216"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Utilize the Additive Manufacturing Test-Bed to develop specifications, standards, and architecture to drive interoperability across the Navy Enterprise Digital Thread for Additive Manufacturing.\n-Continue development of Risk Management Framework (RMF) Profiles for the various components and interfaces required to network AM hardware and software assets.\n-Define a Defense-in-Depth Functional Implementation Architecture Network Transformation(DFIANT) architecture for additive manufacturing.\n-Initiate an additive manufacturing data strategy."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 decrease of $2.834K was primarily attributed to the establishment of the AM Test-bed in FY19, and utilizing this AM Test-bed beginning in FY20. Establishing the test-bed required hardware and software purchases in the initial set-up and now that those are in place the program requires less funding for the AM mission efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The SEW engineering program will employ rigorous and consistent system engineering practices in an evolving value model to support development and deployment of shipboard, undersea, and land based capabilities based on mission and performance requirements, integrated enterprise architectures, model-validated solutions, and sustainment and supportability needs for the Command and Control (C2), Intelligence, Networks, Communications, Space, and Business Information Technology (IT) domains.\n\nCWIX Performance Metrics: Three key metrics: (1) Interoperability and compliance with Naval (Navy and Marine Corps), joint, coalition and other non-governmental organization architectures, systems and equipment; (2) Compliance with Defense Information Services Agency (DISA), National Security Agency (NSA), and other joint and coalition information assurance and security standards; and (3) warfighter utility assessment across the joint and coalition spectrum. Specific metrics validate performance of individual technologies participating in CWIX as well as in other venues as appropriate."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2147"
                    },
                    "ProjectTitle": {
                        "val": "ISR  Architecture"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.583"
                        },
                        "BudgetYearOne": {
                            "val": "1.535"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.535"
                        },
                        "BudgetYearTwo": {
                            "val": "1.534"
                        },
                        "BudgetYearThree": {
                            "val": "1.566"
                        },
                        "BudgetYearFour": {
                            "val": "1.593"
                        },
                        "BudgetYearFive": {
                            "val": "1.625"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Integrated architectures provide a technical framework for assessing capability gaps and performance of individual systems and System of Systems (SoS) and their ability to effectively provide the desired effects to support warfighting missions. They also serve as a means to influence and drive Programs of Record (PoR) toward a common, more efficient state that promotes interoperability and security.\n\nThe Naval Intelligence, Surveillance, and Reconnaissance (ISR) Reference Architecture project is intended to guide system of systems capability development and promote interoperability across Navy ISR programs, as well as interoperability and alignment with Department of Defense (DoD)-wide enterprise initiatives including Joint Information Environment and Intelligence Community Information Technology Environment and Space & Naval Warfare Systems Command-wide Enterprise Architecture policies. This effort to develop integrated ISR architectures will instill systems engineering discipline and standardization across the Navy ISR Enterprise and provide a means by which to assess ISR PoR progress in conforming to a single Navy architecture. These efforts will reduce Information Technology\/ISR infrastructure complexity and variances, making it easier to manage, operate and defend our ISR capabilities, and help inform investment decisions across the Navy's ISR enterprise to support Assured Command and Control, Battlespace Awareness and Integrated Fires.\n\nThis effort will encompass the documentation and analysis of current ISR enterprise architectures to inform and guide requirements for target architecture development and performance requirements to support full use and incorporation of ISR capabilities to advance Navy operations afloat. The associated studies will produce both technical and non-technical implementation guidance across the Doctrine, Organization, Training, Material, Leadership, Personnel and Facilities spectrum."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR) Architecture"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 ISR Architecture funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to analyze the current Intelligence, Surveillance, and Reconnaissance(ISR) capabilities of afloat, ashore, joint, and national systems within mission contexts to demonstrate gaps and overlaps in Information Warfare capabilities and document in engineering artifacts and architectures. Perform trade space analysis and develop and quantify solutions using technical and operational performance parameters.\n-Continue to build on the documentation and analysis of the enterprise ISR capabilities to support System of Systems engineering assessments to identify integration and interoperability gaps, trades, and solutions to support investment decision-making across the ISR portfolio.\n-Continue to integrate the National, Joint, and Naval ISR architectures within mission contexts to identify functional capacities, materiel integration and interoperability gaps and overlaps, as well as any policy and doctrine impacts.\n-Continue to perform verification and validation (V&V) to ensure ISR architecture and analytic products accurately capture system performance specifications. \n-Continue to capture all architectural data in the Space & Naval Warfare Systems Command (SPAWAR) analysis tool suite to support rigorous engineering assessments and architecture excursions against solution alternatives.\n-Continue to ensure alignment and interoperability between ISR Architectures and Joint Information Enterprise, Intelligence Community Information Technology Enterprise and SPAWAR Enterprise Architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to analyze the current ISR capabilities of afloat, ashore, joint, and national systems within mission contexts to demonstrate gaps and overlaps in Information Warfare capabilities and document in engineering artifacts and architectures. Perform trade space analysis and develop and quantify solutions using technical and operational performance parameters.\n-Continue to build on the documentation and analysis of the enterprise ISR capabilities to support System of Systems engineering assessments to identify integration and interoperability gaps, trades, and solutions to support investment decision-making across the ISR portfolio.\n-Continue to integrate the National, Joint, and Naval ISR architectures within mission contexts to identify functional capacities, materiel integration and interoperability gaps and overlaps, as well as any policy and doctrine impacts.\n-Continue to perform verification and validation (V&V) to ensure ISR architecture and analytic products accurately capture system performance specifications. \n-Continue to capture all architectural data in the Space & Naval Warfare Systems Command (SPAWAR) analysis tool suite to support rigorous engineering assessments and architecture excursions against solution alternatives.\n-Continue to ensure alignment and interoperability between ISR Architectures and Joint Information Enterprise, Intelligence Community Information Technology Enterprise and SPAWAR Enterprise Architectures."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The $0.048 million decrease is attributed to a reduced amount of support for documenting and analyzing enterprise ISR capabilities due to efficiencies in the decision-making process."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The Naval (Navy and Marine Corps) ISR Reference Architecture effort will use consistent systems engineering practices to support development of integrated ISR enterprise architectures, and model-validated solution recommendations against quantified technical and operational performance parameters."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3319"
                    },
                    "ProjectTitle": {
                        "val": "Fleet Experimentation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.131"
                        },
                        "CurrentYear": {
                            "val": "9.090"
                        },
                        "BudgetYearOne": {
                            "val": "9.281"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.281"
                        },
                        "BudgetYearTwo": {
                            "val": "10.594"
                        },
                        "BudgetYearThree": {
                            "val": "10.525"
                        },
                        "BudgetYearFour": {
                            "val": "10.897"
                        },
                        "BudgetYearFive": {
                            "val": "12.033"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The U.S. Navy's Fleet Experimentation (FLEX) program examines doctrine, organization, training, materiel, leadership and education, personnel, facilities, and policy (DOTMLPFP) solutions to identified warfighter capability gaps within the Future Years Defense Program (FYDP). The Navy's FLEX program considers warfighting gaps identified in: Integrated Prioritized Capability Lists (IPCL) generated by Warfighting Development Centers (WDC); Navy Integrated Priorities Letter (IPL); Navy Commanders' FLEX Guidance; and Navy Urgent Operational Needs Statements. Additionally, the Navy's FLEX program addresses innovative concepts, tactics, techniques, and procedures (TTP), and Fleet Concepts of Operation (CONOPS) that collectively mitigate Fleet-identified warfighting capability gaps. Through experimentation activities such as workshops, system or seminar war simulations, live at-sea events, and experimentation campaigns, the FLEX program examines potential materiel and non-materiel tangible solutions that will enhance the Fleet's ability to execute assigned missions. FLEX events and campaigns are comprised of all facets of experimentation including design, planning, systems engineering and integration, execution, data collection, analysis, assessment, and the delivery of tangible products to the fleet. While Naval-centric, FLEX efforts include joint, coalition, Science and Technology (S&T), academia, and industry partners."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fleet Experimentation"
                                    },
                                    "Description": {
                                        "val": "The U.S. Navy's Fleet Experimentation (FLEX) program is a collaborative effort with multiple partners designed to address fleet prioritized capability gaps to produce doctrine, organization, training, materiel, leadership development, personnel, facilities, and policy (DOTMLPF-P) actions. FLEX program deliverables are focused on operational and tactical warfighting capabilities prioritized near term (within the Future Years Defense Program). U.S. Navy staff manages DOTMLPF-P actions resulting from experiment execution to establish or enhance warfighting capability in Fleet Design, Integrated Air and Missile Defense (IAMD), Amphibious Warfare (AMW), Surface Warfare (SUW), Strike Warfare (STW), Anti-Submarine Warfare (ASW), Expeditionary Warfare (EXW), Information Warfare (IW), Mine Warfare (MIW) and Anti-Terrorism\/Force Protection (AT\/FP).  \n\nFLEX supports Operational\/Tactical venues to experiment, demonstrate, and assess warfighting CONOPS development, concepts, doctrine\/training development, tactics, techniques and procedures (TTPs), and technologies. Multi-year experiment campaigns focus on warfighting capability in accordance with U.S. Navy guidance to evaluate and transition  DOTMLPF-Policy change recommendations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.131"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The U.S. Navy's FLEX program directly supports four of the five elements outlined in the Secretary of the Navy's Innovation Vision: (1) Build the Naval Innovation Network, (2) Improve the Use of DON Information, (3) Accelerate Emerging Operational Capabilities to the Fleet, and (4) Develop Game-Changing Warfighting Concepts. Experimentation is vital to continuously improving naval warfighting capabilities.  The FLEX Execution Plan supported the following events: \n\nELECTROMAGNETIC MANEUVER WARFARE (EMW) EXPERIMENTATION\nNavy conducted multiple events designed to synchronize and align experiment initiatives with EMW campaign tasks to provide solutions to EMW capability gaps and to ensure development of doctrine is synchronized with the introduction of new technology in order to provide the Fleet and Fleet trainers with required capabilities at the tactical and operational levels. Specific events completed in FY18 include:\n\nRIMPAC 18 AT-SEA EXPERIMENT - This event, leveraged the fleet assets and at-sea time associated with a major Pacific fleet training exercise, Rim of the Pacific (RIMPAC) 2018. The effort evaluated technology and\/or TTP-related initiatives to close warfighting gaps identified across multiple POM-20 Integrated Prioritized Capability Lists (IPCLs).\n\nSPECTRAL TSUNAMI 2018 SEMINAR WAR SIMULATION - This event, held 09-13 July 2018 and sponsored by OPNAV N2N6, was comprised of stakeholders from across the Navy to define the baseline warfighting scenario and existing technical capabilities to form an Integrated Technical Capabilities Baseline (ITCB). The war simulation identified areas of strengths and weaknesses, areas for improving operational effectiveness and hardware\/software changes necessary to improve existing POR systems or suggest requirements for new capability. The war simulation built upon the results of the 2017 war simulation and the scope was expanded to include select coalition capabilities and participants.\n\nNAVY TACTICAL GRID ENABLERS 2018 AT-SEA EXPERIMENT - This continued effort to operationalize the Navy Tactical Grid leveraged STORMFORCE 2018, a National Security Agency (NSA)-sponsored Five Eyes tactical signals intelligence (SIGINT) interoperability-focused experiment from 07-11 May 2018 to examine and enhance integration and interoperability of sensors, networks, data fusion, and analytic capabilities across national, theater, and organic platforms. The effort also involved an MQ-4C Triton Workshop completed 22-24 May 2018 that examined concepts of operation and employment of the Triton unmanned air system in preparation for an early operational deployment in late 2018. The final phase of this effort occurred during exercise VALIANT SHIELD 2018 from 11-23 September 2018.\n\nSTRIKE GROUP-ORGANIC, LONG ENDURANCE UNMANNED AERIAL VEHICLE (UAV) experiment (now referred to as the Maritime - Medium Altitude Long Endurance (MALE) UAS Workshop) - This effort, held 24-27 July 2018, examined the employment of long endurance UAVs organic to a Carrier or Expeditionary Strike Group - a capability that will provide unit level ships with the ability to transport intelligence, surveillance, and reconnaissance (ISR) and strike payloads long distances from the host platform.\n\nOFFICE OF NAVAL RESEARCH (ONR) TECHNOLOGY INNOVATION GAMES (TIGS)- This series of workshops executed in conjunction with ONR gave Fleet operators the opportunity to examine emerging capabilities and determine potential concepts of employment to effectively incorporate innovative capabilities into Fleet warfighting missions and tasks.  Technologies examined include: High Power Joint Electromagnetic Non-Kinetic Strike (HIJENKS); Medium Displacement Unmanned Surface Vessel (MDUSV) Anti-Submarine Warfare (ASW) Concept of Employment; and Unmanned System Super Swarms.\n\nASSURED COMMAND AND CONTROL (AC2) PROTOTYPE AT SEA EXPERIMENT - This effort, held in September 2018, leveraged fleet assets and at-sea time to conduct an extended evaluation of an emerging technology in support of EMW objectives.\n\nMARITIME CYBERSPACE EXPERIMENT - This classified effort built upon prior year experiments to further examine U.S. Navy vulnerabilities to adversary cyber threats.\n\nCOUNTER-UNMANNED SYSTEMS (C-UXS) EXPERIMENT SERIES - This effort built upon the 2017 counter-UAV experiment by examining emerging TTPs and technologies to counter the proliferation of unmanned undersea, surface, and air vehicles. The series involved three distinct efforts: the observation of at-sea testing of non-kinetic counter-UAS technologies from October - December 2017; a counter small UAS (C-sUAS) TTP workshop from 13-16 February 2018, and the Black Dart Maritime at-sea experiment of several kinetic and non-kinetic C-UxS capabilities from 04-08 June 2018. Black Dart Maritime also included a demonstration of ONR's unmanned system \"super swarm\" capability.\n\nNAVAL FORCE INTEGRATION EXPERIMENTATION\nNaval Force Integration experimentation in 2018 examined integration and interoperability issues associated with coordinated USN-USMC operations. The primary goal was to reexamine Navy and Marine Corps organizational and command relationships in order to enable effective Naval operations across the maritime domain. Specific events completed in FY18 include:\n\nNAVAL INTEGRATION IN SUPPORT OF DISTRIBUTED MARITIME OPERATIONS (NI-DMO) War Simulation - Originally called Littoral Operations in a Contested Environment (LOCE), this USFF and MARFORCOM sponsored war simulation, completed 05-09 February 2018, focused on operational level objectives and examined how a Fleet Commander task organizes to achieve sea control in complex, contested environments.\n\nMINE WARFARE (MIW) EXPERIMENTATION\nThrough workshops, war simulation and at-sea events, the FY 18 efforts continued to examine TTP and Command and Control (C2) construct for the future Mine Counter Measure (MCM) force as new programs of record and unmanned systems come on line, and legacy systems begin to decommission. Specific events completed in FY18 include:\n\nCOMSIXTHFLT MCM WORKSHOP - This effort, completed 27 February - 02 March 2018, examined current and planned Navy MCM equipment (manned and unmanned) and evaluated concepts of employment with an overall goal of developing a product that merges overall Fleet requirements.\n\nOPERATIONAL LEVEL OF WAR\/TACTICAL LEVEL OF WAR (OLW\/TLW) INTEGRATION EXPERIMENTATION\nAnother CUSFF\/CPF designated focus area for experimentation in 2018, OLW\/TLW Integration experiments examined current and emerging tactics, techniques, and procedures (TTPs) and current and emerging technologies with a goal of identifying innovative solutions that will support the capstone naval concept of a Fleet Design based on integration, distribution, and maneuver. Specific events completed in FY18 include:\n\nNAVY INTEGRATED FIRES ELEMENT (NIFE) Workshop - This June 2018 effort examined and refined a draft NIFE Tactical Memorandum (TACMEMO) to facilitate transition of TTP to formal doctrine and development of training requirements at the OLW and TLW in support of enhanced maritime targeting capabilities.\n\nSPACE EXPERIMENTATION SERIES - This effort built upon the findings and recommendations of the 2017 Space war simulation in order to further explore the optimization of space-based capabilities in support of the maritime environment. The effort included a SATCOM workshop completed 20-22 March 2018 in Colorado Springs, CO and an at-sea evaluation of TTP during exercise Pacific Sentry 18-3."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Navy's FY19 FLEX program aligns to U.S. Navy's Fleet Design and associated Campaign Plan and will drive implementation of Fleet Design by 2023.  Realizing Fleet Design necessitates introduction of three enabling components.\n\n(1) Fleet Fighting Power via Distributed Maritime Operations - materiel\/non-materiel capabilities. \nThe FY19 FLEX program will execute the following events:\na. Command and Control\nb. Operational Level Multi-Domain Joint Enablers\nc. Maneuver Fleet Tactical Grid\nd. Cooperative Engagements Mode Options\n\n(2) Digital and Spectrum Warfare via a Fleet Tactical Grid will integrate communications, command and control systems, computers, sensors, combat systems, and weapons at the technical level to facilitate an intelligent exchange and analysis of data to provide warfighters with actionable knowledge in support of Distributed Maritime Operations. \nThe FY19 FLEX program will execute the following events:\na. Combat Identification and Targeting\nb. Battlespace Management and Decision Aids\nc. Tactical Networking\nd. NET Enabled Weapons\ne. Unmanned Systems Autonomy\nf. Sensor\/Platform\/Weapon Employment\ng. Fleet Tactical Grid\/Netted Sensors\n\n(3) Force Development, Fleet Design implementation requires fleet experimentation to support Force Development and inform Force Generation for fleet-centric fighting power, enabled by integration, distribution and maneuver to simultaneously employ synchronized kinetic\/non-kinetic mission execution across multiple domains in a complex\/contested environment. \nThe FY19 FLEX program will execute the following events:\na. Tactical and technical integration in support of Force Generation, Large Scale Exercise (LSE) 2020; specifically, increased use of Modeling and Simulation (M&S) to accelerate capability development and learning.\n\nFLEX will provide support in the execution of these additional events:\na. Fleet Design Experiments\nb. Human-Machine Integration (HMI) and Artificial Intelligence (AI) Experimentation \nc. Electromagnetic Maneuver Warfare (EMW) Experimentation\nd. Office of Naval Research (ONR) Technology Innovation Games (TIGS)\ne. Maritime Cyberspace Experiment  \nf. Pandarra Wave 19 At-Sea Experiment \ng. Red Nitrum 19 At-Sea Experiment  \nh. Counter-Unmanned Systems (C-UXS) Experiment Series \nI. Naval Force Integration Experimentation\nj. Integrated Fire Control Non-Kinetic Operator in the Loop War Game \nk. F-35C First Deployment War Simulation\nl. Mine Warfare (MIW) Experimentation\nm. Mine Counter Measure (MCM) Adaptive Force Packages (AFP) At-Sea Experiment \nn. Space Experiment Series"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.281"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Navy's FY20 FLEX program aligns to U.S. Navy's Fleet Design and associated Campaign Plan and will drive implementation of Fleet Design by 2023.  \n\nThe Navy will continue to provide experiment, analytical and naval mission subject matter expertise support throughout the planning and execution process; identify fleet warfighting deficiencies through experimentation; identify and capture innovative solutions for fleet experiments that address prioritized fleet warfighting gaps; and identify suitable events to support execution of the following experimentation campaigns:\n\nFLEET DESIGN EXPERIMENTS\nAligning with CNO's Design for Maintaining Maritime Superiority, the emerging \"\"Fleet Design\"\" concept has been developed and promulgated. Development of the supporting doctrine, TTP, Command and control (C2), as well as the integration and interoperability required between weapon systems and decision makers, requires a methodical experimental approach. FY 20 experiments (both at-sea and via war simulations) will strive to achieve the objectives laid out in the Fleet Design action\/implementation plan. \n\nSpecific events planned for FY20 include:\n\nOPERATIONAL LEVEL OF WAR\/TACTICAL LEVEL OF WAR OLW\/TLW) INTEGRATION EXPERIMENTATION\nOLW\/TLW integration experiments (workshops, war simulations and at-sea events) will examine current and emerging tactics, techniques, and procedures TTPs) and current and emerging technologies with a goal of identifying innovative solutions that will support the capstone naval concept of a Fleet Design based on integration, distribution, and maneuver. \n\nHUMAN-MACHINE INTEGRATION(HMI) AND ARTIFICIAL INTELLIGENCE (AI) EXPERIMENTATION - This effort will examine the incorporation of AI capabilities into Naval technologies, TTPs, and C2 processes such as the development of AI-enabled Tactical Decision Aids that autonomously transition data into information.\n\nELECTROMAGNETIC MANEUVER WARFARE(EMW) EXPERIMENTATION\nNavy will conduct multiple events designed to synchronize and align experiment initiatives with EMW tasks to provide solutions to EMW capability gaps and to ensure development of doctrine and TTP is synchronized with the introduction of new technology and provides the Fleet and Fleet trainers with required doctrine tools at the tactical and operational levels. \n\nOFFICE OF NAVAL RESEARCH(ONR) TECHNOLOGY INNOVATION GAMES (TIGS)\nThis series of workshops executed in conjunction with ONR will give Fleet operators the opportunity to examine emerging capabilities and determine potential concepts of employment to effectively incorporate innovative capabilities into Fleet warfighting missions and tasks.  \n\nMARITIME CYBERSPACE EXPERIMENT - This classified effort builds upon prior year experiments to further examine U.S. Navy vulnerabilities to adversary cyber capabilities.\n\nPANDARRA WAVE 20 At-Sea Experiment - This classified effort builds upon prior year experiments to further examine U.S. Navy vulnerabilities to adversary ISR capabilities.\n\nRED NITRUM 20 At-Sea Experiment - This classified effort builds upon prior year experiments to further examine U.S. Navy vulnerabilities to adversary electronic attack capabilities.\n\nCOUNTER-UNMANNED SYSTEMS(C-UXS) EXPERIMENT SERIES - This effort will build upon prior year experimentation by examining emerging TTPs and technologies to counter the proliferation of unmanned undersea, surface, and air vehicles. The series will consist of workshops focused on countering various types of unmanned systems culminating in an at-sea cross domain C-UxS experiment.\n\nNAVAL FORCE INTEGRATION EXPERIMENTATION\nNaval Force Integration experiments (workshops, war simulations, and at-sea events) will examine integration and interoperability issues associated with coordinated USN-USMC operations. The primary goal of the campaign is to reexamine Navy and Marine Corps organizational and command relationships in order to enable effective Naval operations across the maritime domain. \n\nLARGE SCALE EXERCISE(LSE) 2020 - This Naval exercise conducted at the Operational to Tactical Level of War in a maritime theater with assigned live and synthetic assets in stressing competitor conditions will provide a comprehensive assessment of the three enabling components of Fleet Design - Integration, Distribution, and Maneuver.\n\nINTEGRATED FIRE CONTROL KINETIC OPERATOR IN THE LOOP WAR SIMULATION - This effort builds upon prior year experiments to further examine U.S. Navy Carrier Strike Group(CSG) capabilities to successfully employ Navy Integrated Fire Control capabilities with a focus on submarine integration, unmanned systems integration, and Navy\/Marine Corps integration.\n\nMINE WARFARE (MIW) EXPERIMENTATION\nThrough workshops, war games and at-sea events, FY20 efforts will continue to examine TTP and Command and Control(C2) construct for our future Mine Counter Measure(MCM) force as new programs of record and unmanned systems come on line, and legacy systems begin to decommission. \n\nDISTRIBUTED MARITIME OPERATIONS(DMO) Experimentation - Efforts will address key DMO concept action plan items such as the examination of Fleet Command and Maritime Operation Center(MOC) capabilities and the employment of unmanned systems in support of DMO.\n\nSPACE EXPERIMENT SERIES - This effort will build upon prior year experimentation on the employment of space-based capabilities at the OLW\/TLW."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 to FY20 increase will support Large Scale Exercise 2020, specifically in the following areas:\n\n(1)  Assess and refine the enabling components of Fleet Design \n(2)  Validate operational to tactical level of war concepts, CONOPS and TTP\n(3)  Train against stressing competitors\n(4)  Evaluate the Integrated Fleet Training System"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "FLEX is a non-acquisition program."
                        },
                        "PerformanceMetrics": {
                            "val": "Fleet Experimentation Measure of Performance (MOP):\nFLEX funding is used for approximately 20-25 annual experimental efforts which includes 100+ initiatives focused on addressing Fleet-identified capability gaps. The majority of this funding is used to acquire\nintellectual capital, via contracts in areas providing engineering expertise, experiment design, execution and analysis support. This funding is also used to support select engineering and integration costs.\n\nFleet Experimentation Measures of Effectiveness (MOE):\n- CNO\/CUSFF\/CPF directed experimentation for emerging future capabilities\n- Fleet Design outcomes\n- Mitigation of critical capability gaps\n- Informing Doctrine, TTP, and training\n- Informing Fleet platform wholeness or warfighter CONOPS validation\n- Impact to Fleet warfighting within the FYDP"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3320"
                    },
                    "ProjectTitle": {
                        "val": "TRIDENT Warrior"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.200"
                        },
                        "CurrentYear": {
                            "val": "2.284"
                        },
                        "BudgetYearOne": {
                            "val": "2.285"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.285"
                        },
                        "BudgetYearTwo": {
                            "val": "2.330"
                        },
                        "BudgetYearThree": {
                            "val": "2.380"
                        },
                        "BudgetYearFour": {
                            "val": "2.427"
                        },
                        "BudgetYearFive": {
                            "val": "2.475"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "U.S. Navy's Trident Warrior (TW) experiment campaign enables early delivery of Information Warfare (IW) capabilities to the warfighter via Fleet-directed TW operational events. Integrates stand-alone systems and efforts to achieve substantially enhanced capability, demonstrates\/tests these capabilities in both laboratory and operational environments, and evaluates their effectiveness. Develops supporting concepts and Concept of Operations to improve warfighting effectiveness. Coordinates IW efforts with other Service\/Joint\/Department of Defense\/National efforts to ensure Joint\/Interagency\/ Allied\/Coalition applicability and interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trident Warrior"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluated Trident Warrior 2017 (TW17) executed experiments and recommended next steps for Warfighting Development Centers (WDC)s.\n- Promoted broad participation in TW by researching advanced technology solution candidates, in conjunction with other services, commercial entities and academic research in order to fill IW technology gaps.\n- In accordance with standardized procedures, led TW participant efforts with the following: specific goal identification; risk identification; experiment plans (to include data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provided Subject Matter Expertise (SME) for core ship services during the experimentation period. \n- Provided independent experts to ensure compliance with experiment plans, lead analysis effort, and delivered unbiased assessments.\n- Provided results to government sponsors to support the program's engineering recommendations.\n- Planned and executed Trident Warrior 2018 (TW18) experiments to accelerate the transition of IW capability to the Fleet.\n- Completed Trident Warrior 2019 (TW19) planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.284"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluate TW18 executed experiments and recommend next steps for WDCs.\n- Promote broad participation in Trident Warrior (TW) by researching advanced technology solution candidates, in conjunction with other services, commercial entities and academic research in order to fill Information Warfare (IW) technology gaps.\n- In accordance with standardized procedures, lead TW participant efforts with the following: specific goal identification; risk identification; experiment plans (to include data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provide Subject Matter Expertise (SME) for core ship services during the experimentation period. \n- Provide independent experts to ensure compliance with experiment plans, lead analysis effort, and deliver unbiased assessments.\n- Provide results to government sponsors to support the program's engineering recommendations.\n- Plan and execute Trident Warrior 2019 (TW19) experiments to accelerate the transition of IW capability to the Fleet.\n- Begin Trident Warrior 2020 (TW20) planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.285"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.285"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluate TW19 executed experiments and recommend next steps to all stakeholders.\n- Promote broad participation in Trident Warrior (TW) by researching advanced technology solution candidates, in conjunction with other services, and academic research in order to fill Information Warfare (IW) technology gaps.\n- In accordance with standardized procedures, lead TW participant efforts with the following: specific goal identification; risk identification; experiment plans (to include data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provide Subject Matter Expertise (SME) for core ship services during the experimentation period.  \n- Provide independent experts to ensure compliance with experiment plans, lead analysis effort, and deliver unbiased assessments.\n- Provide Subject Matter Expertise to ensure initiative readiness and compliance in the following areas: Information Assurance, Naval Modernization Process, Experimentation Design, Data Collection and Analysis, Report writing and dissemination.\n- Provide results to government sponsors to support the program's engineering recommendations.\n- Plan and execute Trident Warrior 2020 (TW20) experiments to accelerate the transition of IW capability to the Fleet.\n- Begin Trident Warrior 2021 (TW21) planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no appreciable changes from FY19 to FY20."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Confirmation of Fleet and Joint Interoperability with technology candidates, Information Assurance Certification and Accreditation, and alignment with U.S. Navy Guidance, as well as related Program Executive Office (PEO) objectives and stakeholder projected architectures."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3420"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Submarine Fiber Optic Cable (SFOC)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "14.428"
                        },
                        "CurrentYear": {
                            "val": "5.827"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.255"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Maritime Communications Demonstration (MCD) project, also called the Expeditionary Submarine Fiber Optic Cable (SFOC) Communications Project, is a classified program responsible for developing concepts designed to validate material and non-material solutions providing resilient Command and Control (C2) within the maritime domain. The focus is to demonstrate capabilities leveraging existing DOD investments and infrastructure to move data and information. Demonstration will include maritime assets, experimental methodologies, and current backhaul architecture for data movement. Solutions will address technologies across the Radio Frequency (RF) and Optical spectrum using SFOC communications systems. The key deliverable will be a series of at sea demonstrations to validate maritime segment components in an operationally representative environment.  This is not a new start.  In FY17 $2.8M of funding was managed from within the Fleet Experimentation (FLEX) program and used for MCD project tasking for transparency. This effort is part of Secretary of Defense's (SECDEF) third offset initiative and was identified as a required operational capability by USEUCOM, USNORTHCOM, USPACOM, and USSTRATCOM. This effort will fund limited technical development and a series of at-sea demonstrations raising the technical readiness levels of various components with a cable handling and deployment system in an operationally representative environment, with the intent to rapidly transition to an operational capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Submarine fiber Optic Cable (SFOC)"
                                    },
                                    "Description": {
                                        "val": "Classified Project - the Maritime Communications Demonstration (MCD) project is developing and experimenting innovative concepts designed to validate both materiel and non-materiel methodologies to provide resilient command and control within the maritime and littoral domains. The project focus is to demonstrate capabilities that leverage existing industry and DOD investments and infrastructure using non-traditional means to move data and information. The key deliverable will be a series of at-sea demonstrations to validate maritime segment components in an operationally representative environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.428"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "During FY18, USSTRATCOM approved and signed the project Security Classification Guide to guide decision making in support of Maritime Communications Demonstration (MCD).  A MCD task order was completed to support the design of an optimal system concept.  A request for procurement (RFP) for a task order supporting the prototyping and testing a system was issued in Q4 of FY18 and with an expected award in Q1 of FY19."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project will continue to provide funds for the development and refinement of advance networking and communication capabilities in a maritime environment that promote Command and Control (C2) interoperability in Satellite Communications (SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat of Anti-Access Area Denial (A2\/AD). FY19 technical tasking will showcase advanced technologies in deep water cable connection design that will be demonstrated in a harsh and operationally representative environment.\n- Complete Submarine Fiber Optic Cable (SFOC) design and prototyping\n- Complete connection design and prototyping\n- Charter vessel for hardware demonstration\n- Complete cable and connection demonstration\n- Begin deployment subsystem development\n- Additional details provided at a higher classification level"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project 3420 was a short term add to this program element. This project ends after FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Expeditionary SFOC Communications is a non-acquisition program that promotes DoD interoperability to achieve resilient C2 data flows by facilitating maritime architectures in both processes and communications systems, including emerging capabilities, to counter growing high-end asymmetric threats, and is a key enabler of the Combatant Commanders C2 functionality."
                        },
                        "PerformanceMetrics": {
                            "val": "Expeditionary SFOC Communications will employ laboratory testing and at-sea demonstrations to assess specific technologies, operational concepts, and integrated Doctrine, Organization, Training, Materiel, Leadership, Personnel and Facilities (DOTMLPF) solutions pertaining to C2 communications and other aspects of Information Dominance. These assessments will report on identified capability gaps, link capability gaps to technology\/DOTMLPF gaps, and identify technologies and DOTMLPF solutions considered ready for deployment to enhance war fighting capability and enhance interoperability."
                        }
                    }
                }
            ]
        }
    }
}