{
    "id": "2020-AirForce-PB-3600-JBOOK-382320bb9048b22f2f6c609d909765ca9a34e016d8df189cae7ae932db7cf661-62",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V3B-U_RDTE_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1202140F"
        },
        "ProgramElementTitle": {
            "val": "Service Support to U.S. SPACECOM Activities"
        },
        "R1LineNumber": {
            "val": "291"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "11.863"
            },
            "BudgetYearOneBase": {
                "val": "11.863"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "9.014"
            },
            "BudgetYearThree": {
                "val": "9.192"
            },
            "BudgetYearFour": {
                "val": "9.324"
            },
            "BudgetYearFive": {
                "val": "9.567"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Prior to the FY20 PB cycle, The Space Analysis and Application Development Program (WSC 67A011) and the Joint Navigation and Warfare Center (WSC 672486) were reported under PE 1201921F, Service Support to STRATCOM - Space Activities.  Beginning in FY20, the programs will be reported under the newly created PE 1202140F, Service Support to U.S. SPACECOM Activities"
        },
        "ProgramElementMissionDescription": {
            "val": "The Space Analysis and Application Development program integrates space based effects into Department's ‘Model of Record' for joint campaign analysis. Current modeling and simulation (M&S) models are inadequate to represent the contribution that U.S space capabilities make to the air, sea, and land fight and do not accurately portray current and future space threats.  This line of effort integrates effects of space capabilities into the Synthetic Theater Operations Research Model (STORM) and other mission and campaign-level M&S tools. Enhanced space M&S will enable the DoD to make informed decisions regarding the direction of U.S. Space Doctrine, Tactics, Techniques, Procedures, and Resource Decisions. The DoD requires the ability to conduct campaign-level analysis to quantify the holistic operational impacts of adversary space actions on military campaigns and U.S. global operations.\n\nNavigation Warfare (NAVWAR) is deliberate defensive and offensive action to assure positioning, navigation, and timing (PNT) information through coordinated employment of space, cyberspace, and electronic warfare (EW) operations.  Funds are used to create and maintain NAVWAR knowledge. NAVWAR expertise is developed in part by execution of PNT Operational Field Assessments (POFAs). GYPSY POFA's are linked to Combatant Commander's (CCMD) Tier 1 exercises (USSTRATCOM's Global Lightning and Global Thunder are examples) and provide operational realistic threat-representative, GPS-contested environments for analytical assessment of air, ground, maritime, space & cyberspace mission capability.  FORTUNE POFAs are PNT capability and vulnerability assessments associated with a Service exercise or mission event.  PRISM POFAs encompass all Operations, Actions, and Activities (OAAs) associated with events outside of specific CCMD and\/or service exercises or mission events.  Assessments inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations in the anticipated theater NAVWAR threat environments. JNWC assesses Department wide PNT posture through the PNT Annual assessment IAW DoDI 4650.08.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "11.863"
                },
                "BudgetYearOneBase": {
                    "val": "11.863"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "11.863"
                },
                "BudgetYearOneBase": {
                    "val": "11.863"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "11.863"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11.863"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "672486"
                    },
                    "ProjectTitle": {
                        "val": "JOINT NAVWAR CENTER (JNWC) SPACE ACTIVITIES"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.467"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.467"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.513"
                        },
                        "BudgetYearThree": {
                            "val": "7.583"
                        },
                        "BudgetYearFour": {
                            "val": "7.723"
                        },
                        "BudgetYearFive": {
                            "val": "7.862"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY20 all funding from RDT&E funding from PE 1201921F Service Support to STRATCOM - Space Activities, moved to PE 1202140F - Service Support to U.S. SPACECOM Activities"
                        },
                        "ProjectMissionDescription": {
                            "val": "Navigation Warfare (NAVWAR) is deliberate defensive and offensive action to assure positioning, navigation, and timing (PNT) information through coordinated employment of space, cyberspace, and electronic warfare (EW) operations.  Funds are used to create and maintain NAVWAR knowledge. NAVWAR expertise is developed in part by execution of PNT Operational Field Assessments (POFAs). GYPSY POFA's are linked to Combatant Commander's (CCMD) Tier 1 exercises (USSTRATCOM's Global Thunder and Global Lightning are examples) and provide operational realistic threat-representative, GPS-contested environments for analytical assessment of air, ground, maritime, space & cyberspace mission capability.  FORTUNE POFAs are PNT capability and vulnerability assessments associated with a Service exercise or mission event.  PRISM POFAs encompass all Operations, Actions, and Activities (OAAs) associated with events outside of specific CCMD and\/or service exercises or mission events.  Assessments inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations in the anticipated theater NAVWAR threat environments. JNWC assesses department wide PNT posture through the PNT Annual assessment IAW DoDI 4650.08."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PNT Operational Assessments"
                                    },
                                    "Description": {
                                        "val": "The JNWC will investigate, operationally assess, and simulate potential threats and mitigation strategies for denial of blue force PNT capabilities as well as preventing the hostile use of PNT information. Major Performers - Best value to the government selected contractors, universities, government facilities, federally funded research and development centers, laboratories, or other organizations"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Operational assessments - Simulate potential threats and mitigation strategies for potential denial of blue force PNT capabilities - Continuing development to prevent the hostile use of Positioning, Navigation and Timing (PNT) information"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.467"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.467"
                                            },
                                            "Text": {
                                                "val": "Continuing Operational assessments - Simulate potential threats and mitigation strategies for potential denial of blue force PNT capabilities - Continuing development to prevent the hostile use of Positioning, Navigation and Timing (PNT) information."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO requested"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase between FY19 ($7.427M in PE 1201921F) and 20 ($7.467M in PE 1202140F) is due to programmed inflation"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Prior to the FY20 PB cycle, The Joint Navigation Warfare Center was reported under PE 1201921F, WSC 672486.  Beginning in FY20, the program will be reported under the newly created PE 1202140F, Service Support to U.S. SPACECOM Activities"
                        },
                        "AcquisitionStrategy": {
                            "val": "New contracts will be awarded using competitive procedures to the maximum extent possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Prior to the FY20 PB cycle, The Joint Navigation and Warfare Center (JNWC) was reported under PE 1201921F, WSC 672486.  Beginning in FY20, the program will be reported under the newly created PE 1202140F, Service Support to U.S. SPACECOM Activities"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Position Navigation and Timing Operational Field Assessments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple, Kirtland AFB NM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland, NM"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.467"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.467"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Navigation Warfare (NAVWAR)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "NAVWAR Operational Field Assessments"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Create \/ Maintain NAVWAR Knowledge"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "NAVWAR Operational and CONOPS Events"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67A011"
                    },
                    "ProjectTitle": {
                        "val": "Space Analysis and Application Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "4.396"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.396"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.501"
                        },
                        "BudgetYearThree": {
                            "val": "1.609"
                        },
                        "BudgetYearFour": {
                            "val": "1.601"
                        },
                        "BudgetYearFive": {
                            "val": "1.705"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Prior to the FY20 PB cycle, The Space Analysis and Application Development Program was reported under PE 1201921F, WSC 67A011.  Beginning in FY20, the program will be reported under the newly created PE 1202140F, Service Support to U.S. SPACECOM Activities\n\nThis is NOT a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Space Analysis and Application Development program Integrates space based effects into Department's ‘Model of Record' for joint campaign analysis. Current modeling and simulation (M&S) models are inadequate to represent the contribution that U.S space capabilities make to the air, sea, and land fight and do not accurately portray current and future space threats.  This line of effort integrates effects of space capabilities into the Synthetic Theater Operations Research Model (STORM) and other mission and campaign-level M&S tools. Enhanced space M&S will enable the DoD to make informed decisions regarding the direction of U.S. Space Doctrine, Tactics, Techniques, Procedures, and Resource Decisions. The DoD requires the ability to conduct campaign-level analysis to quantify the holistic operational impacts of adversary space actions on military campaigns and U.S. global operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Campaign Modeling and Simulation, Development\/Modification\/Verification\/Validation"
                                    },
                                    "Description": {
                                        "val": "Developed, modifies, verifies, and validates new models for Space mission areas and modifies existing models to portray new capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- Conduct mission-level modeling and analysis to quantify the effects of US and adversary space interactions, with focus on six of the Joint Mission Threads (JMTs) developed in FY17\n\n- Review and update JMTs focused on the Sea Domain, and account for evolved Techniques, Tactics, and Procedures (TTPs) for those missions.  \n\n- In coordination with European Command and Pacific Command, identify and select 4 joint missions for mission-level analysis and integration into campaign-level modeling \n\n- Analyze\/assess modeling results to determine impact\/effects of space activities on U.S. military campaigns and global operations\n\n- Assess and integrate enterprise-level model data for Environmental Monitoring and ISR space-based capabilities into campaign-level modeling \n\n- Coordinate and update Blue space order of battle data, Red counterspace order of battle data, and Red counterspace CONOPS to support integration of space into mission and campaign-level M&S\n\n- Support cost-benefit analyses of Offensive Space Control alternatives with quantifiable impacts to warfighter operations\n\n- Develop change request proposals and submit to STORM Configuration Control Board (CCB) to improve instantiation of denied\/degraded Intelligence, Surveillance, and Reconnaissance (ISR) space-based capability and its effects on the Warfighter in STORM\n\n- In coordination with HAF\/A9 (Headquarters Air Force Studies, Analyses and Assessments), develop schedule and identify funding requirements and sources toward implementation of approved change requests and improved instantiation of space and contested space capabilities in STORM \n\n- Provide Modeling, Simulation, and Analysis support to inform Air Force Space Command's Space Enterprise Vision (SEV)\n\nNo OCO Requested"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.396"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.396"
                                            },
                                            "Text": {
                                                "val": "- In coordination with HAF A\/9 (HQ Air Force Studies, Analysis, and Assessments), develop schedule to identify requirements toward implementation of approved change requests and instantiation of space and contested space capabilities in STORM\n\n- Coordinate and update Blue space order of battle data, Red counter-space order of battle data, and Red counter-space CONOPS to support integration of contested space into mission and campaign-level M&S\n\n- Continue development of software and tools to model Red on Blue contested space (one versus one, many versus many, and space campaign-level)\n\n- Update likelihood assessment data for Red counter-space capability (likelihood to employ, and likelihood to be effective) to inform counter-space risk assessment and enterprise-level modeling\n\n- Review and update JMT consequence assessment used to inform risk analyses and enterprise level modeling\n\n- Utilize updated tools and data to support analytical efforts of new Space Analysis Consortium, and collaborate with partners to inform senior leader forums and decisions on space investments, requirements, acquisition, and operational risk decisions \n\n- Support cost benefit analyses of Space Control activities with quantifiable impacts to warfighter operations\n\n- Provide analysis support to inform Air Force Space Command's Space Enterprise Vision (SEV)\n\nNo OCO Requested"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO requested"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned reduction between FY19 and FY20 is due to realignment of a portion of the RDT&E portfolio into Operations and Maintenance to support capabilities that have transitioned from a development program to an operational capability."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Prior to the FY20 PB cycle, The Space Analysis and Application Development Program was reported under PE 1201921F, WSC 67A011.  Beginning in FY20, the program will be reported under the newly created PE 1202140F, Service Support to U.S. SPACECOM Activities"
                        },
                        "AcquisitionStrategy": {
                            "val": "Any new projects funded in this program will be awarded using competitive procedures to the maximum extent possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Prior to the FY20 PB cycle, The Space Analysis and Application Development Program was reported under PE 1201921F, WSC 67A011.  Beginning in FY20, the program will be reported under the newly created PE 1202140F, USSPACECOM"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Prior to the FY20 PB cycle, The Space Analysis and Application Development Program was reported under PE 1201921F, WSC 67A011.  Beginning in FY20, the program will be reported under the newly created PE 1202140F, USSPACECOM"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Model Space effects for two mission tasks and integrate into STORM for joint campaign analysis"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.396"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.396"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Space Analysis Modeling and Simulation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Complete Mission-level modeling and analysis for 22 Joint Mission Threads"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Complete priority integration of 22 Joint Mission Threads, space-based capabilities, and counter-space effects on the Warfighter in STORM"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Run Improved STORM model and update integrated risk analysis with Combatant Commands"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Identify and develop 10 additional Joint Mission Threads for integration into mission and campaign level modeling"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Develop software and tools to model Red on Blue contested space environment. Develop space playbook to define Red counter-space threat"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Prior to the FY20 PB cycle, The Space Analysis and Application Development Program was reported under PE 1201921F, WSC 67A011.  Beginning in FY20, the program will be reported under the newly created PE 1202140F, USSPACECOM"
                        }
                    }
                }
            ]
        }
    }
}