{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-5a07dc0699c01ee0aa0e25e1d703a9926ea45842c064a371eb5a85ab7f6935f0-2",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601228D8Z"
        },
        "ProgramElementTitle": {
            "val": "Historically Black Colleges and Universities and Minority-Serving Institutions"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.006"
            },
            "CurrentYear": {
                "val": "40.320"
            },
            "BudgetYearOne": {
                "val": "30.708"
            },
            "BudgetYearOneBase": {
                "val": "30.708"
            },
            "BudgetYearTwo": {
                "val": "31.261"
            },
            "BudgetYearThree": {
                "val": "31.791"
            },
            "BudgetYearFour": {
                "val": "32.386"
            },
            "BudgetYearFive": {
                "val": "33.074"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides support for Historically Black Colleges and Universities and Minority-Serving Institutions (HBCU\/MI) in fields of science and engineering that are important to national defense.  The Department of Defense (DoD) HBCU\/MI program encourages participation of small minority schools as well as large minority research institutions.  The program is authorized by 10 U.S.C. § 2362 and is funded by annual appropriations.  This competitive program provides support through grants, cooperative agreements, or contracts for research, education assistance, and instrumentation purchases.\n\nWork in this PE provides a foundation to enhance participation of HBCUs\/MIs in DoD research, including infrastructure; strengthen research and educational opportunities at HBCUs\/MIs and increase the number of minority graduates in the science, technology, engineering, and mathematics (STEM) disciplines important to the national defense; and build a more diverse pool of scientists and engineers to meet future workforce needs.\n\nWork in this PE is performed by the Services’ Research Offices and DoD Laboratories (includes the Army Research Laboratory and the Air Force Research Laboratory) for Centers of Excellence (COE).  Centers currently funded through cooperative agreements include COEs in Autonomy, Cyber Security, Research Data Analysis, and STEM Scholars."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.865"
                },
                "CurrentYear": {
                    "val": "30.412"
                },
                "BudgetYearOne": {
                    "val": "30.796"
                },
                "BudgetYearOneBase": {
                    "val": "30.796"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.006"
                },
                "CurrentYear": {
                    "val": "40.320"
                },
                "BudgetYearOne": {
                    "val": "30.708"
                },
                "BudgetYearOneBase": {
                    "val": "30.708"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "13.141"
                },
                "CurrentYear": {
                    "val": "9.908"
                },
                "BudgetYearOne": {
                    "val": "-0.088"
                },
                "BudgetYearOneBase": {
                    "val": "-0.088"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "14.135"
                    },
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.944"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.050"
                                },
                                "CurrentYear": {
                                    "val": "-0.092"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.088"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.088"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "448"
                    },
                    "ProjectTitle": {
                        "val": "Historically Black Colleges and Universities and Minority-Serving Institutions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.006"
                        },
                        "CurrentYear": {
                            "val": "40.320"
                        },
                        "BudgetYearOne": {
                            "val": "30.708"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.708"
                        },
                        "BudgetYearTwo": {
                            "val": "31.261"
                        },
                        "BudgetYearThree": {
                            "val": "31.791"
                        },
                        "BudgetYearFour": {
                            "val": "32.386"
                        },
                        "BudgetYearFive": {
                            "val": "33.074"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Historically Black Colleges and Universities and Minority-Serving Institutions (HBCU\/MI) program provides support in fields of science and engineering that are important to national defense.  The Department of Defense (DoD) HBCU\/MI Program encourages participation of small minority schools and large minority research institutions.  This competitive program provides support through grants or contracts for research, education assistance, instrumentation purchases, and technical assistance as described below.\n\n•  Research.  The research grants are to further the knowledge in the basic scientific disciplines through theoretical and experimental activities.  Collaborative research allows university professors to work directly with military laboratories or other universities.\n\n•  Education.  Education assistance funds are used by minority institutions to strengthen their academic programs in science, technology, engineering, and mathematics (STEM), thereby increasing the number of under-represented minorities obtaining undergraduate and graduate degrees in these fields.  These grants provide equipment, scholarships, cooperative work\/study opportunities, visiting faculty programs, summer internship programs, and a variety of other enhancements designed to support students and to encourage them to pursue careers in STEM.\n\n•  Instrumentation purchases.  The program allows universities to purchase basic laboratory equipment, such as lasers and spectrometers, for enhancements to the basic research efforts.\n\n•  Technical assistance.  The funds are used to design programs that enhance the ability of minority institutions to successfully compete for future Defense funding by assisting the HBCU\/MI community in areas such as proposal writing and administration of grants and contracts."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "HBCU\/MI Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14.135"
                                        },
                                        "Text": {
                                            "val": "The FY 2018 congressional increase of $14.135 million supported HBCU\/MI program expansion and STEM efforts for minority women. \n\nEstablished Center of Excellence for STEM Scholars supporting a cohort of 16 students at Hampton University to pursue degrees in STEM disciplines important to the defense mission.  Awarded 45 single-investigator research grants with student support for a total of $25.8 million based on the FY 2018 HBCU\/MI Research and Education Program funding opportunity announcement.  Placed 70 HBCU\/MI student interns and 30 faculty fellows at Army, Navy and Air Force research laboratories.  Issued FY 2019 HBCU\/MI funding opportunity announcement for equipment\/instrumentation enhancements.  Hosted a one-day HBCU\/MI proposal and application writing workshop, attended by 210 HBCU\/MI representatives. Conducted ten campus outreach visits to HBCUs\/MIs.  Participated in congressional delegation site visit to five HBCUs funded under the HBCU\/MI program.  Developed FY 2018 Agency Plan in response to the White House Initiative on Historically Black Colleges and Universities (WHIHBCU), and Executive Order 13779, detailing DoD efforts to strengthen the capacity and competitiveness of HBCUs to participate in federal opportunities.  Aligned the DoD WHIHBCU Plan with the ten USD(R&E) priorities and the National Defense Strategy.  Monitored Center of Excellence in Autonomy, Cyber Security, and Research Data Analytics to assess the expansion of education and training for faculty and students.  Hosted a research colloquium and poster workshop for DoD summer interns and faculty fellows to showcase their research to principal investigators and DoD program sponsors at the laboratory facilities."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "The FY 2019 congressional increase of $10 million supports HBCU\/MI program expansion and STEM efforts for minority women.\n\nThese funds will assist with conducting an annual competition of the HBCU\/MI program for equipment\/instrumentation.  Increasing the number of FY 2019 summer interns and faculty research fellows from 100 to 110 participants. Collaboration with the OUSD, Office of Small Business Programs Mentor Protégé Program to enhance HBCU\/MI capabilities to satisfy DoD and other contract requirements. Monitoring established Centers of Excellence in support of the USD(R&E) Science and Technology priorities in the areas of Cyber Security, Research Data Analysis, Autonomy, and the Center for STEM Scholars, needed to expand STEM opportunities for underrepresented minorities. Conducting annual review of the Centers."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Historically Black Colleges and Universities and Minority-Serving Institutions (HBCU\/MI)"
                                    },
                                    "Description": {
                                        "val": "The HBCU\/MI program provides support for research and collaboration with DoD facilities and personnel.  The research grants further knowledge in the basic physical scientific and engineering disciplines through theoretical and empirical activities.  Collaborative research allows university professors to work directly with DoD laboratories or other universities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.871"
                                            },
                                            "Text": {
                                                "val": "Continue efforts from FY 2017.  Conduct annual competition of the HBCU\/MI program for basic research, student support, and\/or equipment\/instrumentation.  Continue the research and educational collaboration with the Thurgood Marshall College Fund (TMCF) Project, a non-profit organization that assists in the selection of HBCU\/MI students and faculty for scholarships, internships, and research in pursuit of science, technology, engineering, and mathematics (STEM) careers.  Work towards the goal of increasing the number of FY 2018 summer interns and faculty research fellows from 85 to 100 participants.  Monitor established Centers of Excellence in support of the Under Secretary of Defense for Research and Engineering (USD(R&E)) Science and Technology priorities in the areas of Cyber Security, Research Data Analysis, Autonomy, and the newly established FY 2017 Center for STEM Scholars, in response to H.R. 114-139 (accompanying H.R. 2685, the FY 2016 DoD appropriations act) using the FY 2017 DoD HBCU\/MI congressional program increase, which required DoD to expand STEM opportunities for underrepresented minorities.  Conduct annual review of the Centers.  Host outreach activities that will include one webinar and two technical assistance workshops to expose HBCUs\/MIs to opportunities in DoD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.320"
                                            },
                                            "Text": {
                                                "val": "Continue efforts from FY 2018.  Conduct annual competition of the HBCU\/MI program for equipment\/instrumentation.  Plan to increase the number of FY 2018 summer interns and faculty research fellows from 100 to 110 participants.  Monitor established Centers of Excellence in support of the USD(R&E) Science and Technology priorities in the areas of Cyber Security, Research Data Analysis, Autonomy, and the Center for STEM Scholars, needed to expand STEM opportunities for underrepresented minorities.  Conduct annual review of the Centers.  Host outreach activities, to include one webinar and two technical assistance workshops to expose HBCUs\/MIs to opportunities in DoD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.708"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.708"
                                            },
                                            "Text": {
                                                "val": "Continue efforts from FY 2019.  Conduct annual competition of the HBCU\/MI program for basic research, student support, and\/or equipment\/instrumentation.  Continue research and educational collaboration with the DoD laboratories.  Monitor established Centers of Excellence in support of the USD(R&E) Science and Technology priorities in the areas of Cyber Security, Research Data Analysis, Autonomy, and the Center for STEM Scholars, needed to expand STEM opportunities for underrepresented minorities.  Conduct annual review of the Centers.  Host outreach activities, to include one webinar and two technical assistance workshops to expose HBCUs\/MIs to opportunities in DoD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The level of effort is consistent between FY 2019 and FY 2020.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "•  Number of students funded other than undergraduates\n•  Number of undergraduate students funded\n•  Number of undergraduates funded who graduated\n•  Number of students participating in the Centers of Excellence for Research and Education\n•  Number of students working in Defense Laboratories\n•  Number of undergraduates funded who graduated with degrees in STEM\n•  Number of graduates who will continue to pursue graduate or Ph.D. degrees in STEM\n•  Number of graduates who intend to work for DoD\n•  Number of undergraduates who will receive scholarships and fellowships for further studies in STEM"
                        }
                    }
                }
            ]
        }
    }
}