{
    "id": "2020-Army-PB-2040-JBOOK-6862ccffed1a667db11cb620e9184b2662501ed68aad7c3c768162a310d4d712-17",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605801A"
        },
        "ProgramElementTitle": {
            "val": "Programwide Activities"
        },
        "R1LineNumber": {
            "val": "193"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "54.383"
            },
            "CurrentYear": {
                "val": "60.921"
            },
            "BudgetYearOne": {
                "val": "58.175"
            },
            "BudgetYearOneBase": {
                "val": "58.175"
            },
            "BudgetYearTwo": {
                "val": "57.559"
            },
            "BudgetYearThree": {
                "val": "58.911"
            },
            "BudgetYearFour": {
                "val": "61.814"
            },
            "BudgetYearFive": {
                "val": "63.874"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "415.637"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports the non-Army Management Headquarters Activity (non-AMHA) Research, Development, Test, and Evaluation (RDTE) functions incident to the local operation and management of United States (U.S.) Army Research, Development and Engineering Command (RDECOM) Research Development and Engineering Centers, not identifiable with specific research and development projects. This PE also supports the management and operation of multiple, globally-located RDECOM International Technology Centers (ITCs). The ITCs play an integral role in the U.S. Army efforts for international cooperative research, development and interoperability, and fulfill international memoranda of understanding requirements.\n\nProgramwide activities also include: Army Science Board studies; non-AMHA Medical Command support at the U.S. Army Medical Research and Materiel Command (USAMRMC); non-AMHA management and administrative functions at the U.S. Army Research Institute (ARI); and travel and administrative support to the North Atlantic Treaty Organization (NATO) Army Armaments Group (NAAG)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "55.06"
                },
                "CurrentYear": {
                    "val": "60.942"
                },
                "BudgetYearOne": {
                    "val": "62.163"
                },
                "BudgetYearOneBase": {
                    "val": "62.163"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "54.383"
                },
                "CurrentYear": {
                    "val": "60.921"
                },
                "BudgetYearOne": {
                    "val": "58.175"
                },
                "BudgetYearOneBase": {
                    "val": "58.175"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.677"
                },
                "CurrentYear": {
                    "val": "-0.021"
                },
                "BudgetYearOne": {
                    "val": "-3.988"
                },
                "BudgetYearOneBase": {
                    "val": "-3.988"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.013"
                    },
                    "CurrentYear": {
                        "val": "-0.021"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.664"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.988"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.988"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EU9"
                    },
                    "ProjectTitle": {
                        "val": "Army Science Board"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.02"
                        },
                        "CurrentYear": {
                            "val": "3.157"
                        },
                        "BudgetYearOne": {
                            "val": "2.25"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.25"
                        },
                        "BudgetYearTwo": {
                            "val": "2.25"
                        },
                        "BudgetYearThree": {
                            "val": "2.25"
                        },
                        "BudgetYearFour": {
                            "val": "2.25"
                        },
                        "BudgetYearFive": {
                            "val": "2.25"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.427"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Army Science Board (ASB) is a federal advisory committee, organized under the Federal Advisory Committee Act (FACA) and the Government in the Sunshine Act, which provides the Secretary of the Army and Secretary of Defense with independent and transparent advice and recommendations on matters relating to scientific, technical, manufacturing, acquisition, logistics, and business management functions. The ASB dates to November 1951 when the Secretary of the Army, Honorable Frank Pace Jr., appointed twelve outstanding scientists and industrialists to a scientific advisory panel to assist him and the Army's leadership in creating an effective, economical, and progressive fighting force using existing technology and industrial resources. Three years later, this panel was expanded and officially designated the Army Scientific Advisory Panel (ASAP), with its first formal meeting held on November 16, 1954. In 1977, with the passage of FACA, the ASB was created to replace the ASAP.\n\nThe ASB provides the Army with a resource of world-class scientists, engineers, technologists and operational experts as well as business, policy and managerial specialists from the private sector, academia, non-DoD government agencies and former senior military officers. Its members volunteer their expertise and time to address those critical national security challenges for which the Army's leadership seeks independent and unbiased technical advice. The ASB focuses on issues of importance to large segments of the Army, and its products are delivered in a candid and timely manner.\n\nThe Board is composed of 20 voting and 20 non-voting members, each serving three-year terms, and consultants who serve one-year terms. Membership is carefully monitored to ensure that diverse disciplines and points of view are represented. The Secretary of the Army appoints the Chair and Vice Chair from the ASB membership. The ASB Chair also serves as a non-voting observer to the Defense Science Board. ASB membership is augmented by a small number of consultants who are appointed to provide specialized expertise for ASB studies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Science Board (ASB)"
                                    },
                                    "Description": {
                                        "val": "The ASB Charter sets the estimated number of Board meetings at four per year. Board members serve without compensation, with the exception of reimbursement for official Board-related travel and per diem. Funds are therefore required to facilitate Board activities and related subcommittee activities. The ASB Charter states that annual requirements will typically entail a personnel cost of seven Full-Time Equivalents.\n\nCurrently, the Secretary of the Army has approved four permanent subcommittees to the Board:\n\n1) The Army Science Board Basic Science and Disruptive Technologies Subcommittee is composed of not more than 15 members and addresses issues relating to the Army's basic research and disruptive technologies, including Soldier performance enhancement, cognition improvement, and training; autonomous systems and human-machine teaming; Chemical, Biological, Radiological, Nuclear and high-yield Explosives (CBRNE); and counter Weapons of Mass Destruction.\n\n2) The Army Science Board Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Subcommittee is composed of not more than 15 members and addresses issues relating to the Army's C41SR core competency, including the tactical edge C3, situational awareness overmatch, and electronic warfare.\n\n3) The Army Science Board Systems Engineering, Integration, and Sustainment Subcommittee is composed of not more than 15 members and addresses relating to the Army's core competency in systems engineering and integration; advanced prototyping and experimentation in operational environments; and sustainment, including engineered resilient systems, agile logistics and health management. These competencies are essential to the performance of the entire acquisition community.\n\n4) the Army Science Board Weapon Systems Subcommittee is composed of not more than 15 members and addresses issues relating to the Army's weapon systems core competency in: Rotorcraft Design Synthesis & Performance Assessment (DS&PA) and airworthiness\/safety; ground combat vehicle DS&PA, Soldier interaction, and system integration; lethality, including impact physics, energetics, warhead DS&PA, effects modeling and simulation; survivability and protection, including armor and balanced approach for detection\/hit\/kill avoidance; and air and missile defense DS&PA, precision fires, seekers, and precision guidance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.02"
                                            },
                                            "Text": {
                                                "val": "Conducting four to six studies on behalf of the Secretary of the Army, including continued in-depth study of issues in Multi-Domain Battle (MDB) and Manned-Unmanned Teaming (MUM-T). Additional studies are being carried out as requested in areas of Basic Science and Disruptive Technology; Weapons Systems; Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR); and Systems Engineering, Integrations, and Sustainment related to the future of the force.\n\nMeetings were held at the Maneuver Center of Excellence in January 2018 and Georgia Institute of Technology Research Institute in April 2018. The summer plenary was held in Irvine California, with the Fall plenary scheduled for Arlington Virginia in September 2018."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.056"
                                            },
                                            "Text": {
                                                "val": "Conduct four to six studies on behalf of the Secretary of the Army; likely in areas of Basic Science and Disruptive Technology; Weapons Systems; C4ISR; and Systems Engineering, Integrations, and Sustainment or other concerns related to the future of the force. \n\nPlans for the ASB Winter Plenary for Fiscal Year 2019 list Lawrence Livermore National Laboratory in Livermore, California as the Plenary location."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.25"
                                            },
                                            "Text": {
                                                "val": "Conduct four to six studies on behalf of the Secretary of the Army; likely in areas of Basic Science and Disruptive Technology; Weapons Systems; C4ISR; and Systems Engineering, Integrations, and Sustainment or other concerns related to the future of the force."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change in support of the Army's modernization efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.101"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M02"
                    },
                    "ProjectTitle": {
                        "val": "Med Cmd Spt (Non-AMHA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.998"
                        },
                        "CurrentYear": {
                            "val": "26.457"
                        },
                        "BudgetYearOne": {
                            "val": "24.052"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.052"
                        },
                        "BudgetYearTwo": {
                            "val": "24.022"
                        },
                        "BudgetYearThree": {
                            "val": "24.603"
                        },
                        "BudgetYearFour": {
                            "val": "25.059"
                        },
                        "BudgetYearFive": {
                            "val": "25.534"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "175.725"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides funding for authorized civilian workforce performing medical research, development, acquisition management and oversight that support the medical Research, Development, Test, and Evaluation (RDTE) programs at the United States (U.S.) Army Medical Research and Materiel Command (USAMRMC), Fort Detrick, Maryland to: (1) perform planning, programming, and budgeting; (2) manage resources; and (3) ensure compliance with U.S. Food and Drug Administration (FDA) and other regulatory and safety requirements. It also provides for continued operations of contracting and acquisition management functions performed by the U.S. Army Medical Research Acquisition Activity (USAMRAA) in support of the USAMRMC Medical RDTE Program.    \n    \nAdditionally, this Project provides funding for the special immunization program (SIP). The SIP program provides FDA licensed vaccines and investigational new drug (IND) vaccines under informed consent to laboratory workers at the U.S. Army Medical Research Institute of Infectious Diseases, and to other military, government, or contractor personnel who may be at risk of exposure to highly hazardous pathogenic microorganisms or toxins."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Authorized Salaries and other operational requirements"
                                    },
                                    "Description": {
                                        "val": "Funding is provided to the U.S. Army Medical Research and Materiel Command (USAMRMC) for Medical Research Development Acquisition (RDA) Management and Oversight to include the payroll of civilians as well as nominal operating expense. Expertise helps establish and maintain the capabilities that Army medicine needs to sustain life, limb, and eyesight for our warfighters. Civilian labor performs centralized management of Medical RDA (many areas required by law and\/or regulation) including animal & human research protections, health and safety compliance, environmental management, and U.S. Food and Drug Administration regulatory compliance, legal support (including intellectual property protection), quality assurance, contracting services, personnel management, and planning, programming, and budgeting, and execution management. Funding also supports the Army's portion of the Special Immunization Program that protects individuals engaged in infectious disease research if exposed to pathogens or toxins."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.998"
                                            },
                                            "Text": {
                                                "val": "Funded authorized civilian salaries and associated expenses (supplies, equipment, travel, etc) USAMRMC and USAMRAA. Also, provides regulatory, clinical monitoring and data support for the Special Immunization Program (SIP). This program provided non licensed vaccines under FDA oversight to personnel at risk of exposure to selected infectious diseases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.223"
                                            },
                                            "Text": {
                                                "val": "Fund authorized civilian salaries and associated expenses (supplies, equipment, travel, etc) at USAMRMC and USAMRAA. Also, provide regulatory, clinical monitoring and data support for the SIP. This program will provide non licensed vaccines under FDA oversight to personnel at risk of exposure to selected infectious diseases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.052"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.052"
                                            },
                                            "Text": {
                                                "val": "Will fund authorized civilian salaries and associated expenses (supplies, equipment, travel, etc) at USAMRMC and USAMRAA. Also, will provide regulatory, clinical monitoring and data support for the Special Immunization Program. This program will provide non licensed vaccines under FDA oversight to personnel at risk of exposure to selected infectious diseases."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels are designed to align program requirements with Army modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.234"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M15"
                    },
                    "ProjectTitle": {
                        "val": "ARI Mgmt\/ADM Act"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.437"
                        },
                        "CurrentYear": {
                            "val": "1.513"
                        },
                        "BudgetYearOne": {
                            "val": "1.55"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.55"
                        },
                        "BudgetYearTwo": {
                            "val": "1.585"
                        },
                        "BudgetYearThree": {
                            "val": "1.629"
                        },
                        "BudgetYearFour": {
                            "val": "1.661"
                        },
                        "BudgetYearFive": {
                            "val": "1.679"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.054"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The United States (U.S.) Army Research Institute for the Behavioral and Social Sciences (ARI) is the only Science and Technology (S&T) laboratory that conducts research to enhance the Soldier lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g. culture of dignity, respect, and inclusion). This Project supports the non-AMHA (Army Management Headquarters Activity) management and administrative functions to enable ARI to accomplish its research mission and includes activities such as budget execution, procurement oversight, Research Development Test & Evaluation (RDTE) program planning and evaluation, management control, security\/safety, logistics, information technology, and personnel\/manpower execution and oversight. ARI's behavioral and social science research provides effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ARI Management\/Administrative Actions"
                                    },
                                    "Description": {
                                        "val": "This effort supports the non-AMHA management and administrative functions to enable ARI to accomplish its research mission and includes activities such as personnel\/manpower execution and oversight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.437"
                                            },
                                            "Text": {
                                                "val": "Provided operation of management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance research and development (R&D) program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.465"
                                            },
                                            "Text": {
                                                "val": "Provide operation of management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance R&D program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.55"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.55"
                                            },
                                            "Text": {
                                                "val": "Will provide operation of management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance R&D program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.048"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M16"
                    },
                    "ProjectTitle": {
                        "val": "Standardization Groups"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.351"
                        },
                        "CurrentYear": {
                            "val": "3.793"
                        },
                        "BudgetYearOne": {
                            "val": "4.297"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.297"
                        },
                        "BudgetYearTwo": {
                            "val": "4.339"
                        },
                        "BudgetYearThree": {
                            "val": "4.433"
                        },
                        "BudgetYearFour": {
                            "val": "4.475"
                        },
                        "BudgetYearFive": {
                            "val": "4.521"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "29.209"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports nine International Technology Centers (formerly known as Standardization Groups) in North America, South America, Asia, and Europe for personnel, travel and overhead costs, leases on buildings, and mandatory permanent change of station.  \n\nThe mission of the International Technology Centers is to support the United States (U.S.) Army Rationalization, Standardization and Interoperability (RSI) mission around the globe as specified in Army Regulation (AR) 34-1 \"Multinational Force Interoperability\" and AR 70-41 \"International Cooperative Research, Development and Acquisition (ICRDA)\". ITCs represent the U.S. Army in their geographic areas of responsibility (AOR) with foreign ministries of defense on ICRDA programs. ITCs also facilitate U.S. Army interaction in their geographic AOR with foreign non-governmental entities, such as foreign private industry and academia."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Technology Centers Management"
                                    },
                                    "Description": {
                                        "val": "This activity funds the U.S. Army Rationalization, Standardization, and Interoperability mission conducted by the nine International Technology Centers around the globe. These funds support the infrastructure, personnel and travel requirements to support the mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.351"
                                            },
                                            "Text": {
                                                "val": "Represented the U.S. Army's interests in engagements with foreign ministries of defense on International Cooperative Research, Development and Acquisition (RDA) programs. Facilitated U.S. Army interaction with foreign non-government entities, such as foreign private industry and academia."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.728"
                                            },
                                            "Text": {
                                                "val": "Represent the U.S. Army's interests in engagements with foreign ministries of defense on International Cooperative Research, Development and Acquisition (RDA) programs. Facilitate U.S. Army interaction with foreign non-government entities, such as foreign private industry and academia."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.297"
                                            },
                                            "Text": {
                                                "val": "Will represent the U.S. Army's interests in engagements with foreign ministries of defense on International Cooperative Research, Development and Acquisition (RDA) programs. Will facilitate U.S. Army interaction with foreign non-government entities, such as foreign private industry and academia."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.065"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M42"
                    },
                    "ProjectTitle": {
                        "val": "ARDEC Cmd\/Ctr Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.067"
                        },
                        "CurrentYear": {
                            "val": "7.318"
                        },
                        "BudgetYearOne": {
                            "val": "7.419"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.419"
                        },
                        "BudgetYearTwo": {
                            "val": "7.277"
                        },
                        "BudgetYearThree": {
                            "val": "7.477"
                        },
                        "BudgetYearFour": {
                            "val": "7.466"
                        },
                        "BudgetYearFive": {
                            "val": "7.863"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "48.887"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Non-AMHA (Army Management Headquarters Activity) functions incident to the local operation and management of the United States (U.S.) Army Armament Research, Development and Engineering Center (ARDEC), Picatinny Arsenal, NJ, not identifiable with specific research and development Projects financed under other Program Elements.  \n\nFunds only select, critical, overarching functions that enable the ARDEC to accomplish its research, development and engineering mission, to include ARDEC Headquarters staff, safety, physical security, anti-terrorism, operations security (OPSEC), information security and intelligence services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "ARDEC management \/ administrative efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.067"
                                            },
                                            "Text": {
                                                "val": "Provided management and administrative functions at a level consistent with mission requirements and support needs at ARDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.318"
                                            },
                                            "Text": {
                                                "val": "Provide management and administrative functions at a level consistent with mission requirements and support needs at ARDEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.419"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.419"
                                            },
                                            "Text": {
                                                "val": "Will provide management and administrative functions at a level consistent with mission requirements and support needs at ARDEC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to economic adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M44"
                    },
                    "ProjectTitle": {
                        "val": "CECOM Cmd\/Ctr Spt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.388"
                        },
                        "CurrentYear": {
                            "val": "4.574"
                        },
                        "BudgetYearOne": {
                            "val": "3.819"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.819"
                        },
                        "BudgetYearTwo": {
                            "val": "3.906"
                        },
                        "BudgetYearThree": {
                            "val": "3.986"
                        },
                        "BudgetYearFour": {
                            "val": "4.805"
                        },
                        "BudgetYearFive": {
                            "val": "5.016"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.494"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports the Non-AMHA (Non-Army Management Headquarters Activity) functions incident to the local operation and management of the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC), Aberdeen Proving Ground, MD, not identifiable with specific research and development projects financed under other program elements.  \n\nFunds only select, critical, overarching functions that enable CERDEC to accomplish its research, development and engineering mission, to include CERDEC Headquarters staff, resource management, human resources, safety, security, protocol, public affairs, information management, facility management and audit readiness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "CERDEC management and administrative efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.388"
                                            },
                                            "Text": {
                                                "val": "Provided management and administrative functions at a level consistent with mission requirements and support needs at CERDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.522"
                                            },
                                            "Text": {
                                                "val": "Provide management and administrative functions at a level consistent with mission requirements and support needs at CERDEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.819"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.819"
                                            },
                                            "Text": {
                                                "val": "Will provide management and administrative functions at a level consistent with mission requirements and support needs at CERDEC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.052"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M46"
                    },
                    "ProjectTitle": {
                        "val": "AMCOM Cmd\/Ctr Spt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.225"
                        },
                        "CurrentYear": {
                            "val": "0.228"
                        },
                        "BudgetYearOne": {
                            "val": "3.596"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.596"
                        },
                        "BudgetYearTwo": {
                            "val": "3.435"
                        },
                        "BudgetYearThree": {
                            "val": "3.536"
                        },
                        "BudgetYearFour": {
                            "val": "3.92"
                        },
                        "BudgetYearFive": {
                            "val": "4.097"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.037"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in Fiscal Year (FY) 2017, portions of Project M46 (Anti-Tamper effort) were realigned to Program Element (PE) 0602705A (Electronics and Electronic Devices) \/ Project H94 (Elec & Electronic Dev) and PE 0605024A (Anti-Tamper Technology Support) \/ Project FB1 (Anti-Tamper Technology Support)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports Non-AMHA (Army Management Headquarters Activity) functions incident to the local operation and management of the U.S. Army Aviation and Missile Research, Development and Engineering Center (AMRDEC), Redstone Arsenal, AL. Such functions are not identifiable with specific research and development Projects financed under other Program Elements.  \n\nMinimally funds select, critical, overarching functions in support of AMRDEC accomplishing its research, development and engineering mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "AMRDEC management and administrative efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.225"
                                            },
                                            "Text": {
                                                "val": "Provided management and administrative functions at a level consistent with mission requirements and support needs at AMRDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.228"
                                            },
                                            "Text": {
                                                "val": "Provide management and administrative functions at a level consistent with mission requirements and support needs at AMRDEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.596"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.596"
                                            },
                                            "Text": {
                                                "val": "Will provide management and administrative functions at a level consistent with mission requirements and support needs at AMRDEC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 increase realigned from other RDECOM non-AMHA projects within this Program Element. Not a mission change."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M47"
                    },
                    "ProjectTitle": {
                        "val": "TACOM Cmd\/Ctr Spt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.3"
                        },
                        "CurrentYear": {
                            "val": "3.294"
                        },
                        "BudgetYearOne": {
                            "val": "3.629"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.629"
                        },
                        "BudgetYearTwo": {
                            "val": "3.707"
                        },
                        "BudgetYearThree": {
                            "val": "3.808"
                        },
                        "BudgetYearFour": {
                            "val": "3.857"
                        },
                        "BudgetYearFive": {
                            "val": "4.088"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.683"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Non-AMHA (Army Management Headquarters Activity) functions incident to the local operation and management of the United States (U.S.) Army Tank and Automotive Research, Development and Engineering Center (TARDEC), Warren, MI, not identifiable with specific research and development Projects financed under other Program Elements.  \n\nFunds only select, critical, overarching management functions that enable TARDEC to accomplish its research, development and engineering mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "TARDEC management and administrative efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.3"
                                            },
                                            "Text": {
                                                "val": "Provided management and administrative functions at a level consistent with mission requirements and support needs at TARDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.294"
                                            },
                                            "Text": {
                                                "val": "Provide management and administrative functions at a level consistent with mission requirements and support needs at TARDEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.629"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.629"
                                            },
                                            "Text": {
                                                "val": "Will provide management and administrative functions at a level consistent with mission requirements and support needs at TARDEC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to economic adjustment."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M55"
                    },
                    "ProjectTitle": {
                        "val": "Edgewood Chemical Biological Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.491"
                        },
                        "CurrentYear": {
                            "val": "6.035"
                        },
                        "BudgetYearOne": {
                            "val": "3.027"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.027"
                        },
                        "BudgetYearTwo": {
                            "val": "2.583"
                        },
                        "BudgetYearThree": {
                            "val": "2.643"
                        },
                        "BudgetYearFour": {
                            "val": "3.724"
                        },
                        "BudgetYearFive": {
                            "val": "4.139"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.642"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Non-AMHA (Army Management Headquarters Activity) functions incident to the local operation and management of the United States (U.S.) Army Edgewood Chemical Biological Center (ECBC), Aberdeen Proving Ground, MD, not identifiable with specific research and development Projects financed under other Program Elements.  \n\nFunds only select, critical, overarching functions that enable ECBC to accomplish its mission to include the ECBC Headquarter staff, resource management, safety, and surety programs. In addition, this program includes the management and oversight of Army chemical surety operations as directed by DoD Instruction 5210.65, \"Minimum Security Standards for Safeguarding Chemical Agents\"."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "ECBC management and administrative efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.491"
                                            },
                                            "Text": {
                                                "val": "Provided continued management and administrative functions at a level consistent with mission requirements and support needs at ECBC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.893"
                                            },
                                            "Text": {
                                                "val": "Provide continued management and administrative functions at a level consistent with mission requirements and support needs at ECBC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.027"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.027"
                                            },
                                            "Text": {
                                                "val": "Will provide continued management and administrative functions at a level consistent with mission requirements and support needs at ECBC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 decrease realigned to other RDECOM non-AMHA efforts within this Program Element. Not a mission change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.142"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M58"
                    },
                    "ProjectTitle": {
                        "val": "SECOM CMD\/CTR Spt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.454"
                        },
                        "CurrentYear": {
                            "val": "2.429"
                        },
                        "BudgetYearOne": {
                            "val": "2.35"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.35"
                        },
                        "BudgetYearTwo": {
                            "val": "2.234"
                        },
                        "BudgetYearThree": {
                            "val": "2.28"
                        },
                        "BudgetYearFour": {
                            "val": "2.318"
                        },
                        "BudgetYearFive": {
                            "val": "2.367"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.432"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Non-AMHA (Army Management Headquarters Activity) functions incident to the local operation and management of the United States (U.S.) Army Natick Soldier Research, Development and Engineering Center (NSRDEC), Natick, MA, not identifiable with specific research and development Projects financed under other Program Elements.  \n\nFunds only select, critical, overarching functions that enable NSRDEC to accomplish its research, development and engineering mission, to include: Manpower\/Personnel, Intelligence\/Security, Operations, Logistics, Training, Resource Management and Headquarter administrative staff."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Management Support"
                                    },
                                    "Description": {
                                        "val": "NSRDEC management and administrative functions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.454"
                                            },
                                            "Text": {
                                                "val": "Provided continued management and administrative functions at a level consistent with mission requirements and support needs at NSRDEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.429"
                                            },
                                            "Text": {
                                                "val": "Provide continued management and administrative functions at a level consistent with mission requirements and support needs at NSRDEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.35"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.35"
                                            },
                                            "Text": {
                                                "val": "Will provide continued management and administrative functions at a level consistent with mission requirements and support needs at NSRDEC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to adjustment of economic assumptions, e.g. inflation rate."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M76"
                    },
                    "ProjectTitle": {
                        "val": "Armament Group Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.652"
                        },
                        "CurrentYear": {
                            "val": "2.123"
                        },
                        "BudgetYearOne": {
                            "val": "2.186"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.186"
                        },
                        "BudgetYearTwo": {
                            "val": "2.221"
                        },
                        "BudgetYearThree": {
                            "val": "2.266"
                        },
                        "BudgetYearFour": {
                            "val": "2.279"
                        },
                        "BudgetYearFive": {
                            "val": "2.32"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.047"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The goal of this Project is to expand worldwide allied standardization and interoperability through cooperative R&D and technology sharing per Secretary of Defense guidance and especially in support of the United States (U.S.) Army. This Project partially funds the travel costs and administrative support (studies, analysis, interpretation, equipment, etc.) required to participate in international forums, such as the North Atlantic Treaty Organization (NATO) Army Armaments Group (NAAG), Defense Against Terrorism (DAT) and to pursue new cooperative R&D initiatives and international cooperative agreements such as memoranda of understanding. This Project also includes the United States' share of costs of the NATO Civil Budget, Chapter IX, which funds the NATO Industrial Advisory Group (NIAG) and the Special Fund for Cooperative Planning (U.S. Army is Executive Agent for this NATO bill). This Project also partially funds the Five Power Senior National Representatives, Army (SNR (A)), the Technical Cooperative Program, Bilateral SNR(A)s, and Army armaments working groups with many nations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Scientific Support NATO Army Armaments Group (NAAG)"
                                    },
                                    "Description": {
                                        "val": "Funds supported Army subject matter experts to attend scientific and technological exchange, meetings, demonstrations, and\/or simulations having military application and mutual benefits to the U.S. and its Allies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.199"
                                            },
                                            "Text": {
                                                "val": "Funds supported NAAG Army Subject Matter Experts' attendance at scientific and technological exchange, meetings, demonstrations, and\/or simulations having military application and mutual benefits to the United States and its Allies. FY18 funding continues to fund different working\/capability groups."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.307"
                                            },
                                            "Text": {
                                                "val": "Funds will support NAAG Army Subject Matter Experts' attendance at scientific and technological exchange, meetings, demonstrations, and\/or simulations having military application and mutual benefits to the United States and its Allies. FY19 funding will continue to fund different working\/capability groups."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.313"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.313"
                                            },
                                            "Text": {
                                                "val": "FY20 Base funded Requirements of $313K will support Army Subject Matter Experts (SMEs) to attend scientific and technological exchange, meetings demonstrations, and\/or simulations having military application and mutual benefits to the United States and its Allies. FY 20 will fund 8 different working\/capability groups that will meet twice a year."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase is to cover the 2% inflations and additional support to NATO Army Armaments Group meetings for 8 Working Groups."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Executive Agent"
                                    },
                                    "Description": {
                                        "val": "Funds the U.S. share of the Mandatory NATO Civil Budget, Chapter IX (Defense Support Programs). U.S. Army is Executive Agent for this Mandatory NATO bill."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.453"
                                            },
                                            "Text": {
                                                "val": "Funded the United States' share of the NATO Civil Budget, Chapter IX (Defense Support Programs). U. S. Army is Executive Agent for this NATO bill."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.755"
                                            },
                                            "Text": {
                                                "val": "Will fund the United States' share of the NATO Civil Budget, Chapter IX (Defense Support Programs). U.S. Army is Executive Agent for this NATO bill."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.873"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.873"
                                            },
                                            "Text": {
                                                "val": "FY20 Base funded Requirements of $1,873K will fund the United States share of the NATO Civil Budget, Chapter IX (Defense Support Program).  U.S. Army is the Executive Agent for this mandatory NATO Bill."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase is to cover the Euro exchange rate and the increase of the share of the NATO Bill."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.061"
                                            },
                                            "Text": {
                                                "val": "FY2019 SBIR\/STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}