{
    "id": "2020-Army-PB-2040-JBOOK-57289821184020429f22b377c8d8ec2b7ea1aa2758df17e0ae58ba36035ae75c-15",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604017A"
        },
        "ProgramElementTitle": {
            "val": "Robotics Development"
        },
        "R1LineNumber": {
            "val": "88"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "38.051"
            },
            "CurrentYear": {
                "val": "74.368"
            },
            "BudgetYearOne": {
                "val": "115.222"
            },
            "BudgetYearOneBase": {
                "val": "115.222"
            },
            "BudgetYearTwo": {
                "val": "105.332"
            },
            "BudgetYearThree": {
                "val": "132.978"
            },
            "BudgetYearFour": {
                "val": "83.910"
            },
            "BudgetYearFive": {
                "val": "65.971"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "615.832"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2020 funding within this Program Element will transition\/realign as follows:\n - Project FD9 Robotics Systems: Robotic Combat Vehicle - Experimental Unit Prototypes (TARDEC) effort will remain in this PE but realign to Project CF4 Robotic Combat Vehicle (RCV) NGCV-CFT.\n - Project FD9 Robotics Systems: Leader Follower efforts will transition to PE 0604622A Family of Heavy Tactical Vehicles Project EZ8, Leader Follower."
        },
        "ProgramElementMissionDescription": {
            "val": "Soldier Robotics Systems for Robotics Development (RD) improves robotic and autonomous program acquisition schedules by supporting the development of integrated and synchronized capability documents (e.g. JCIDS, Department Directed, etc.) and by maturing\/transitioning technology. Activities include studies, assessments, and document development such as Technology Readiness Levels, Manufacturing Readiness Levels, Analysis of Alternatives\/Letter of Sufficiency determinations, draft acquisition documents, and draft contract documents. Efforts include robotics and autonomous systems technology maturation\/transition from Science & Technology (S&T) projects and Robotic Enhancement Program (REP) initiatives, Milestone Decision Documentation (MDD), and activities leading up to formal program initiation at Milestone B or C. The pre-acquisition activities conducted under this line intend to reduce acquisition cost, schedule, and performance risk by conducting market surveys, technical risk assessments, developing performance specifications, scopes of work, acquisition strategies, systems engineering plans, test and evaluation master plans, lifecycle sustainment plans, engaging in early test planning, and prototype development activities. This line is for robotic systems that are transported by vehicle and maneuver under their own power. \n\nFY 2020 funding in the amount of $1.258 million will support program management activities to include salaries and travel, conduct Analysis of Alternatives (AoA) on Enhanced Robotic Payload (ERP) programs, Chemical, Biological, Radiological, and Nuclear (CBRN), Common Robotic System (Light Reconnaissance) Robot (LRR) (CRS(LR)), and payload technology maturation efforts.\n\nThe Battery Modernization & Interface Standardization (BMIS) program was established to help bring greater power efficiency and effectiveness to the dismounted Soldier and reduce the proliferation of proprietary batteries across the Army. BMIS will develop the Army Standard Family of Batteries (SFoB), a central acquisition management authority, and reduce 38 Communications-Electronics (C-E) battery types, currently in use, to just 3. Battery standardization and policy enforcement will support Operational Readiness at a reduced cost to the Army while maintaining configuration management, life cycle support, safety standards, and technological upgrades.\n\nRobotics Systems for Applique and Large Unmanned Ground Systems (ALUGS) Robotics Development (RD) improves robotic and autonomous program acquisition schedules by supporting the development of integrated and synchronized capability documents (e.g. JCIDS, Department Directed, etc.) and by maturing\/transitioning technology. Activities include studies, assessments, and document development such as Technology Readiness Levels, Manufacturing Readiness Levels, Analysis of Alternatives\/Letter of Sufficiency determinations, draft acquisition documents, and draft contract documents. Efforts include robotics and autonomous systems technology maturation\/transition from Science & Technology (S&T) projects and Robotic Enhancement Program (REP) initiatives, Milestone Decision Documentation (MDD), and activities leading up to formal program initiation at Milestone B or C. The pre-acquisition activities conducted under this line intend to reduce acquisition cost, schedule, and performance risk by conducting market surveys, technical risk assessments, developing performance specifications, scopes of work, acquisition strategies, systems engineering plans, test and evaluation master plans, lifecycle sustainment plans, engaging in early test planning, and prototype development activities. This line is for large robotic systems that are transported by vehicle, maneuver under their own power, or are installed as robotic applique kits. RDTE funds enable support to capability development of Tactical Wheeled Vehicle - Leader Follower (TWV-LF), Automated Convoy Operations (ACO), Dismounted Engineer Mobility System (DEMS), modular mission payloads, Route Clearance & Interrogation System (RCIS) Type II. Funds prepare these capabilities for entrance into the Defense Acquisition System (i.e. Milestone decision). RDTE Product Manager Applique and Large Unmanned Ground Systems funding supports Leader Follower and Robotic Combat Vehicle program transitions from Technology Demonstrations to Program of Record through Modeling and Simulation (M&S) development and initial prototype testing. This will stress the autonomy systems and ultimately reduce Program of Record testing requirements, technical risks, and costs through studies and validated simulations.\n\nRobotic Combat Vehicle (RCV) Prototyping effort will produce unmanned combat vehicle prototypes with the purpose of providing vehicles that Soldiers will use to develop new Concepts of Operations (CONOPS) and new requirements for unmanned combat vehicles to support Army Modernization priorities. Within RCV there are two major lines of effort executed in 3 phases: RCV Surrogate Experimental Unit Prototyping (Phase 1 & 2) and RCV Purpose Built Experimental Unit Prototyping (Phase 3). These efforts provide the basis for the Army to make the decision to move forward with a  Robotic Combat Vehicle program transitioning from Technology Demonstrations to Program of Record through Modeling and Simulation (M&S) development and initial prototype testing and iterative Soldier evaluations. This will stress the autonomy systems developed within the Science and Technology (S&T) base and ultimately reduce Program of Record testing requirements, technical risks, and costs through studies and validated simulations in addition to helping the Next Generation Combat Vehicle Cross Functional Team (NGCV CFT) refine their RCV requirements and develop the CONOPS and Tactics, Techniques and Procedures (TTPs) for Manned \/ Unmanned Teaming (MUMT) in combat relevant missions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "39.608"
                },
                "CurrentYear": {
                    "val": "95.66"
                },
                "BudgetYearOne": {
                    "val": "15.677"
                },
                "BudgetYearOneBase": {
                    "val": "15.677"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "38.051"
                },
                "CurrentYear": {
                    "val": "74.368"
                },
                "BudgetYearOne": {
                    "val": "115.222"
                },
                "BudgetYearOneBase": {
                    "val": "115.222"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.557"
                },
                "CurrentYear": {
                    "val": "-21.292"
                },
                "BudgetYearOne": {
                    "val": "99.545"
                },
                "BudgetYearOneBase": {
                    "val": "99.545"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.031"
                    },
                    "CurrentYear": {
                        "val": "-0.092"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-21.2"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.526"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "99.545"
                                },
                                "BudgetYearOneBase": {
                                    "val": "99.545"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2020 increase of $73.845 million supports the Army's modernization priorities in support of the National Defense Strategy, to include experimental prototyping."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CF4"
                    },
                    "ProjectTitle": {
                        "val": "Robotic Combat Vehicle (RCV) NGCV-CFT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "109.4"
                        },
                        "BudgetYearOneBase": {
                            "val": "109.4"
                        },
                        "BudgetYearTwo": {
                            "val": "99.008"
                        },
                        "BudgetYearThree": {
                            "val": "126.676"
                        },
                        "BudgetYearFour": {
                            "val": "77.594"
                        },
                        "BudgetYearFive": {
                            "val": "57.382"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "470.060"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2020, funding realigns from PE 0604017A Project FD9 Robotics Systems to PE 0604017A Project CF4 Robotic Combat Vehicle (RCV) NGCV-CFT.  This is not a new start Project.  This Project supports the Cross Functional Team (CFT)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Robotic Combat Vehicle (RCV) Prototyping effort will produce unmanned combat vehicle prototypes with the purpose of providing vehicles that Soldiers will use to develop new Concepts of Operations (CONOPS) and new requirements for unmanned combat vehicles to support Army Modernization priorities. Within RCV there are two major lines of effort executed in 3 phases: RCV Surrogate Experimental Unit Prototyping (Phase 1 & 2) and RCV Purpose Built Experimental Unit Prototyping (Phase 3). These efforts provide the basis for the Army to make the decision to move forward with a  Robotic Combat Vehicle program transitioning from Technology Demonstrations to Program of Record through Modeling and Simulation (M&S) development and initial prototype testing and iterative Soldier evaluations. This will stress the autonomy systems developed within the Science and Technology (S&T) base and ultimately reduce Program of Record testing requirements, technical risks, and costs through studies and validated simulations in addition to helping the Next Generation Combat Vehicle Cross Functional Team (NGCV CFT) refine their RCV requirements and develop the CONOPS and Tactics, Techniques and Procedures (TTPs) for Manned \/ Unmanned Teaming (MUMT) in combat relevant missions.\n\nIn order to accelerate user involvement with RCV platform capabilities, the RCV Surrogate Experimental Unit Prototyping effort will be executed through a two (2) phase activity.  The RCV surrogate platform build (Phase 1) was initiated in FY19 under 0604017A Robotics Development, Project FD9 Robotics Systems and will conclude in this project with test and demonstration. This project will finalize Phase 1's rapid prototype build of surrogate RCV platforms using existing robotized vehicles and conduct Soldier evaluations at the platoon level (4 RCVs) through MUMT evaluations. Lessons learned from the platoon experiment will inform development of the purpose built RCV platforms (Phase 3) as well as inform S&T investment to help close gaps identified in unmanned vehicle performance. In order to conduct larger scale MUMT maneuvers and to continue to advance the autonomous performance of the robotic platforms, two additional platoons of surrogate RCVs will be built leveraging existing contractor unmanned platforms for a total of a company set (12) RCV.  The surrogate company of RCVs (Phase 2) will be used for a second round of Soldier experimentation building off of the platoon exercises and providing additional refinement of CONOPs\/TTPs with a representative operational formation and will provide a test bed for the latest autonomous capabilities developed in S&T.\n\nThe RCV Purpose Built Experimental Unit Prototyping line of effort (Phase 3) will develop and produce innovative, unmanned platforms that take advantage of being designed specifically for unmanned combat operations such as reduced platform size and improved mobility. The intent is to award a minimum of two contracts to design and build up to a company of twelve (12) RCV platforms for user evaluation and experimentation starting at the end of FY 2022. The  RCV platforms will incorporate mature technology capabilities transitioned from S&T as they become available to include the latest autonomous mobility capability, improved user control interfaces and advanced sensing and aided target recognition.  The Purpose Built RCV platform requirements will be informed by the initial surrogate platoon experimentation (Phase 1) and Soldier feedback.  The surrogate company experimentation (Phase 2) will inform how the purpose built RCVs will be used in a representative formation as well as reducing risk on critical software enabled capabilities such as the latest autonomous behaviors, mission command of multiple RCVs in an effective MUMT formation and Soldier control stations for RCV.  Ultimately the purpose of this line of effort is to determine if RCV is ready to enter a rapid acquisition program of record or if the capability needs more development before it is operationally effective."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotic Combat Vehicle ? Prototype Platforms"
                                    },
                                    "Description": {
                                        "val": "Robotic Combat Vehicle (RCV) ? Prototype Platforms effort will produce unmanned combat vehicle prototypes with the purpose of creating an experimental unit that Soldiers will use to create new Concepts of Operations (CONOPS) and new requirements for unmanned combat vehicles to support Army Modernization priorities. Several variants of prototypes will be created, starting first with surrogate platforms which adapt existing platforms into surrogate RCVs for early experimentation in several different weight classes.  Based off of lessons learned from the surrogate vehicle builds, platforms optimized to be RCVs will be built which maximize the capability advantages that unmanned platforms can offer such as reduced platform size and weight. The platforms will be built with the purpose of going through ATEC safety release and ultimately for Soldier evaluation through iterative User experimentation."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "89.18"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "89.18"
                                            },
                                            "Text": {
                                                "val": "In FY 2020, contracts for surrogate RCVs (Phase 2) using existing platforms will be awarded to up to two (2) contractors based off of requirements generated from a platform evaluation funded under PE 0605053A Ground Robotics, Project FB7 Robotics Enhancement Program (REP).  Surrogate RCV platforms will focus on reconnaissance and decisive lethality mission roles.  Direct fire, missile systems and advanced sensors will be integrated on to the platforms designed for remote operation.  Remote mobility functions will be improved and autonomy sensor suite will be integrated to ensure safety critical operation for ATEC safety assessment in FY 2021.  These platforms will be combined with M113 surrogates built under PE 0604017A Robotics Development, Project FD9 Robotics Systems in FY 2019 for company level RCV Surrogate Experimentation scheduled in FY 2021.  In addition, based on the results of Phase 1 experimentation (see RCV Test and Evaluation bullet below), a competitive contract will be awarded to up to two (2) industry partners to initiate designs of a purpose built RCV for award in 4QFY2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, funding for Robotic Combat Vehicle realigns from PE 0604017A Robotics Development, Project FD9 Robotics Systems to PE 0604017A Robotics Development, Project CF4 Robotic Combat Vehicle (RCV) NGCV-CFT. This is not a new start Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotic Combat Vehicle ? Modeling and Simulation"
                                    },
                                    "Description": {
                                        "val": "Robotic Combat Vehicle (RCV) Modeling and Simulation effort will produce the ability to experiment in a virtual environment to conduct data collection and results that will form the physical testing desires. This will provide the initial data set to inform the operational experimentation in the RCV Campaign of Learning as well as feed initial data to the Requirements Community as they  build  new manned-unmanned teaming (MUMT) CONOPs and TTPs.  As test data is collected, high fidelity simulations for unmanned operation of combat platforms will be refined in a virtual test environment to enable virtual test ? fix ? test cycles in a virtual developmental space."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.27"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.27"
                                            },
                                            "Text": {
                                                "val": "This effort will conduct a series of virtual experiments of multiple RCV concepts in different weight-class designs that factor in the mobility, lethality, and aided target recognition systems (AiTR) capabilities using accurate technology models simulated in an operational environment and tested with trained soldiers to provide a RCV understanding for future BCT formations. The models will be based upon input from industry science advisory groups to inform near-term art-of-the-possible. Soldier feedback on how to implement that will be assessed to help inform the purpose built prototype and evaluate capability sets in platoon level force-on-force simulation experimentation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, funding for Robotic Combat Vehicle realigns from PE 0604017A Robotics Development, Project FD9 Robotics Systems to PE 0604017A Robotics Development, Project CF4 Robotic Combat Vehicle (RCV) NGCV-CFT. This is not a new start Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotic Combat Vehicle ? Testing and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Robotic Combat Vehicle (RCV) Testing effort will perform system verification testing and system safety testing on the RCV surrogate platforms and purpose-built platforms. This will expose unexpected issues and ensure that the RCV systems are safe for Soldier operation prior to conducting Field Experimentation."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.17"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.17"
                                            },
                                            "Text": {
                                                "val": "RCV Risk Reduction effort will complete safety testing on the integrated Phase 1 surrogate M113 platforms. Following safety testing, the surrogate platforms begin the Soldier MUM-T Experimentation to get User assessment on the performance of the vehicles and to begin CONOP and TTP development based on actual system performance. Surrogate RCV platforms will be controlled by manned fighting control vehicles developed under PE 0603645A \/ Armored Systems Modernization Adv Dev, Project EV7 Combat Vehicle Prototyping during the Soldier MUM-T Experimentation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, funding for Robotic Combat Vehicle realigns from PE 0604017A Robotics Development, Project FD9 Robotics Systems to PE 0604017A Robotics Development, Project CF4 Robotic Combat Vehicle (RCV) NGCV-CFT. This is not a new start Project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotic Combat Vehicle ? Program Management"
                                    },
                                    "Description": {
                                        "val": "Robotic Combat Vehicle (RCV) Program Management effort will enable RCV concepting, modeling and simulation, detailed design, system integration and build, testing, and all Manned Unmanned Teaming Field Experimentation."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.78"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.78"
                                            },
                                            "Text": {
                                                "val": "This effort will manage all activity under the RCV line of effort to include but not limited to government and contractor labor, travel, supplies, equipment and facilities.  Manage RCV concept development, analysis, and modeling and simulation of RCV concepts.  Manage detailed design, build integration, and evaluation of the RCV platform solutions.  Manage the execution of the Phase 1 testing and operational experimentation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2020, funding for Robotic Combat Vehicle realigns from PE 0604017A Robotics Development, Project FD9 Robotics Systems to PE 0604017A Robotics Development, Project CF4 Robotic Combat Vehicle (RCV) NGCV-CFT. This is not a new start\nProject."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Robotic Combat Vehicle (RCV) Experimental Unit Prototyping will provide unmanned combat vehicles to enable users to assess the capability of the platforms and create new CONOPS and doctrine for manned\/unmanned teaming based operations. Efforts will inform new ways to fight, identify system limitations and benefits and provide an achievable, analytically backed basis for future RCV requirements documents to drive future acquisition programs.  Opportunity to take advantage of rapid acquisition processes if experimental prototypes meet soldier expectations which would get unmanned ground combat vehicles quicker into the field.  Decision point in FY23 on decisive lethality path forward for the Army which determines if RCV is ready to enter rapid acquisition or needs additional development."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Robotic Combat Vehicle - Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.78"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.78"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "15.550"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.330"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "RCV Surrogate Platform Built (Company Set)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "75.9"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "75.9"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "25.300"
                                                    },
                                                    "TotalCost": {
                                                        "val": "101.200"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RCV Purpose Built Platform (Company Set)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TDB"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.28"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.28"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "222.850"
                                                    },
                                                    "TotalCost": {
                                                        "val": "236.130"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "RCV Modeling and Simulation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.27"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.27"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "10.820"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.090"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RCV Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.17"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.17"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "28.780"
                                                    },
                                                    "TotalCost": {
                                                        "val": "35.950"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_CF4.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "20190306_1_444560_CF4.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Robotic Combat Vehicle (RCV)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase I Vehicle Saftey Testing and Safety Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Phase I -  Soldier Operational Exercise"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Phase II ? Vehicle Design"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Phase II ? Vehicle Integration \/ Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Phase II ? Vehicle Shakedown Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV  Phase II ? Vehicle Safety Testing and Safety Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV  Phase II ? Soldier Operational Exercise"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV  Phase III - Contracting"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV  Phase III ? Vehicle Design"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Phase III ? Vehicle Integration \/ Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Phase III ? Vehicle Shakedown Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Phase III ? Vehicle Safety Testing and Safety Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV  Phase III ? Soldier Operational Exercise"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FD2"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Robotics Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.477"
                        },
                        "CurrentYear": {
                            "val": "2.105"
                        },
                        "BudgetYearOne": {
                            "val": "2.771"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.771"
                        },
                        "BudgetYearTwo": {
                            "val": "3.261"
                        },
                        "BudgetYearThree": {
                            "val": "3.29"
                        },
                        "BudgetYearFour": {
                            "val": "3.352"
                        },
                        "BudgetYearFive": {
                            "val": "3.423"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.679"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Soldier Robotics Systems for Robotics Development (RD) improves robotic and autonomous program acquisition schedules by supporting the development of integrated and synchronized capability documents (e.g. JCIDS, Department Directed, etc.) and by maturing\/transitioning technology. Activities include studies, assessments, and document development such as Technology Readiness Levels, Manufacturing Readiness Levels, Analysis of Alternatives\/Letter of Sufficiency determinations, draft acquisition documents, and draft contract documents. Efforts include robotics and autonomous systems technology maturation\/transition from Science & Technology (S&T) projects and Robotic Enhancement Program (REP) initiatives, Milestone Decision Documentation (MDD), and activities leading up to formal program initiation at Milestone B or C. The pre-acquisition activities conducted under this line intend to reduce acquisition cost, schedule, and performance risk by conducting market surveys, technical risk assessments, developing performance specifications, scopes of work, acquisition strategies, systems engineering plans, test and evaluation master plans, lifecycle sustainment plans, engaging in early test planning, and prototype development activities. This line is for robotic systems that are transported by vehicle and maneuver under their own power. \nFunding supports modernization of the current Ground Robotic fleets by investigating technology insertions including, but not limited to: condition based maintenance, vetronics, Robotic Architecture, autonomous operations and other emerging technologies.   Funding also supports developing initial prototypes to enable refinement of Operational Requirements and early user feedback to support future sustainment and operational movement operating concepts.\"\n\nFY 2020 funding in the amount of $1.258 million will support program management activities to include salaries and travel, conduct Analysis of Alternatives (AoA) on Enhanced Robotic Payload (ERP) programs, Chemical, Biological, Radiological, and Nuclear (CBRN), Common Robotic System (Light Reconnaissance) Robot (LRR) (CRS(LR)), and payload technology maturation efforts.\n\nFunding supports modernization of the current Ground Robotic fleets by investigating technology insertions including, but not limited to: condition based maintenance, vetronics, Robotic Architecture, autonomous operations and other emerging technologies. Funding also supports developing initial prototypes to enable refinement of Operational Requirements and early user feedback to support future sustainment and operational movement operating concepts.\n\nSoldier Exoskeleton amplifies the strength, endurance, and mobility of its operator, the Soldier. The Soldier Exoskeleton capabilities provide the Army with a deployable, personal tactical performance enhancer. Soldier Exoskeleton variants will be capable of operating in a wide range of environments enhancing combat operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Borne Sensor (SBS) \/ Exoskeleton"
                                    },
                                    "Description": {
                                        "val": "The SBS provides the small unit a \"quick look\" capability with improved Situational Awareness of routes, buildings, tunnels, obstacles blocking line of sight, and similar concealed threat locations.  The budget activity enables payload improvements including camera enhancements, target identification algorithms, display\/controller improvements and user notifications for specific items of interest.  Soldier Exoskeleton variants, ranging from Commercial-Off-The-Shelf solutions, will be capable of operating in a wide range of environments enhancing combat operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.33"
                                            },
                                            "Text": {
                                                "val": "Developed initial program cost estimates, conducted market surveys, performed Analyses of Alternatives (AoA), and initiated Request for Proposal (RFP) work for incorporation in the CDD\/CPD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.483"
                                            },
                                            "Text": {
                                                "val": "Provide for the capability of transitioning and continuing development of Industry and DoD Exoskeleton efforts to augment the warfighter strengths and human performance to reduce Soldier load.  Provide for the integration and evaluation of potential exoskeleton solutions and completion of initial technical and programmatic data to inform capability requirement generation and subsequent materiel development decision."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.513"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.513"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide for the capability of transitioning and continuing development of Industry and DoD Exoskeleton efforts to augment the warfighter strengths and human performance to reduce Soldier load.  Continue to provide for the integration and evaluation of potential exoskeleton solutions and completion of initial technical and programmatic data to inform capability requirement generation and subsequent materiel development decision."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding change due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UGV Soldier Robotics Development"
                                    },
                                    "Description": {
                                        "val": "Soldier Robotics Development is designed to facilitate the transition of robotics and autonomous systems technology into Programs of Record. It informs the acquisition process beforehand allowing the Maneuver Center of Excellence, Sustainment Center of Excellence, Maneuver Support Center of Excellence, and the Cyber Center of Excellence the ability to make integration decisions and affordability trades while writing requirements. UGV Robotics Development will fund Common Robotics System (Vehicle), Common Robotic System (Light Reconnaissance) Robot (LRR) (CRS(LR)), Common Robotic System (Communication Link) (CRS(CL)), Common Robotic System (Mission Command\/Artificial Intelligence) (CRS(MS\/AI)), Render Safe - Sets, Kits and Outfits (RS-SKO), Enhanced Robotics Payload (ERP), payload technology maturation efforts, Chemical, Biological, Radiological, and Nuclear (CBRN); small, pocket sized, airborne sensors, etc."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.147"
                                            },
                                            "Text": {
                                                "val": "Developed initial program cost estimates, conducted market surveys, performed Analyses of Alternatives (AoA), and initiated Request for Proposal (RFP) work for incorporation into the CDD\/CPD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.573"
                                            },
                                            "Text": {
                                                "val": "Develop initial program cost estimates, conduct market surveys, perform\/update Analysis of Alternatives (AoA) or letter of sufficiency, perform risk reduction activities and maturation technology efforts, initiate milestone documentation and prepare Request for Proposal (RFP)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.258"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Text": {
                                                "val": "Funding is provided for program management matrix support to include salaries and travel, conduct Analysis of Alternatives (AoA) on Enhanced Robotic Payload (ERP) programs, Chemical, Biological, Radiological, and Nuclear (CBRN), Common Robotic System (Light Reconnaissance) Robot (LRR) (CRS(LR)), and payload technology maturation efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 funding increase due to additional robotics development requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "SBIR \/ STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.049"
                                            },
                                            "Text": {
                                                "val": "SBIR \/ STTR"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Adjusted for FY 2019 SBIR \/ STTR transfer."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "FB8"
                                    },
                                    "Title": {
                                        "val": "Soldier Borne Sensor (SBS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.197"
                                        },
                                        "CurrentYear": {
                                            "val": "3.465"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "W63798"
                                    },
                                    "Title": {
                                        "val": "Soldier Borne Sensor (SBS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24"
                                        },
                                        "CurrentYear": {
                                            "val": "21.68"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.362"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.362"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.927"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.16"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.101"
                                        },
                                        "BudgetYearFive": {
                                            "val": "25.293"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Pre-acquisition program activities funded by this line transition to a separate Program Element and Project prior to their first program acquisition Milestone (B or C)."
                        },
                        "AcquisitionStrategy": {
                            "val": "Soldier Robotics Systems will utilize a Robotics Development funding for internal systems engineering, requirements and architecture analysis, AoAs and Technology Readiness Assessments with PdM UGV S&T partners, technology maturation efforts, and studies and analysis in support of program initiation with industry.\n\nInitial Exoskeleton efforts will focus on prototyping emerging Industry and DoD Exoskeleton initiatives, assessing their performance through demonstrations and Soldier feedback that will inform capability requirement definition and subsequent materiel develop decision.  These initiatives may range from Commercial-Off-The Shelf (COTS) solutions to developmental efforts."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "UGV Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.418"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.39"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.208"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBS and Exoskeleton Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.33"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.483"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.513"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.513"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.326"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AoA CRS(H)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.258"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.258"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AoA ERP"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.421"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.098"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.519"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AoA CRS(LR)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.085"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.085"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Payload maturation and integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.429"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.429"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.429"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Capability Development Studies"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.429"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.429"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.429"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JCAUS IOP V4"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Picatinny, NJ"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.05"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.050"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.049"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.049"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_FD2.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "UGV Robotics Development (ERP, CBRN, CRS-LR, etc.)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBS MDD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBS Analysis of Alternatives \/ Letter of Sufficiency"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBS Market Survey"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBS Request for Proposal (Development\/Staffing)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBS RFP Release Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBS SSEB"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBS MS B\/C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SBS Studies\/Analysis"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FD3"
                    },
                    "ProjectTitle": {
                        "val": "Battery Modernization & Interface Standardization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.813"
                        },
                        "CurrentYear": {
                            "val": "0.848"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.661"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY 2018 funding for Unmanned Ground Vehicles (UGV) Robotics Development (RD) transitioned from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0604017A Robotics Development, Project FD2 Soldier Robotics Systems, and funding for Applique and Large Unmanned Ground Systems (ALUGS) Robotics Development (RD) transitioned from PE 0604641A Tactical Unmanned Ground Vehicles, Project DV7 Small Unmanned Ground Vehicle to PE604017A Robotics Development, Project FD9 Robotics Systems."
                        },
                        "ProjectMissionDescription": {
                            "val": "Note: Project Battery Modernization & Interface Standardization complete in FY19.\n\nThe Battery Modernization & Interface Standardization (BMIS) program was established to help bring greater power efficiency and effectiveness to the dismounted Soldier and to reduce the proliferation of proprietary batteries across the Army. BMIS will develop the Army Standard Family of Batteries (SFoB), a central acquisition management authority, and reduce 38 Communications-Electronics (C-E) battery types, currently in use, to just 3. Expand to include batteries for generators and hybrids, robotics, vehicles, and low density\/usage systems.  Battery standardization and policy enforcement will support Operational Readiness at a reduced cost to the Army while maintaining configuration management, life cycle support, safety standards, and technological upgrades.\n\nFunding supports modernization of the current battery types.  Funding also supports developing initial prototypes to enable refinement of Operational Requirements and early user feedback to support future sustainment and operational movement operating concepts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Acquisition Strategy"
                                    },
                                    "Description": {
                                        "val": "Complete advanced development pre-milestone B assessments and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.212"
                                            },
                                            "Text": {
                                                "val": "Completed advanced development pre-milestone B technology assessments and analysis. Conducted C-E battery market research\/Requests for Information (RFI). Developed Acquisition Strategy and Requests for Proposals (RFPs)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.21"
                                            },
                                            "Text": {
                                                "val": "Finalize advanced development technology assessments and analysis. Conduct C-E battery analysis of market research\/Requests for Information (RFI). Develop Acquisition Strategy for the BMIS program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Army efforts complete in FY19 and thereafter funding reallocated to support the Army's modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BMIS Standard Family of Batteries (SFoB) Design"
                                    },
                                    "Description": {
                                        "val": "Finalize research and complete assessment of technology and portfolios. Once the SFoB has been established, maintenance and updates will be made as technology advances."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.601"
                                            },
                                            "Text": {
                                                "val": "Assessed the current C-E Battery Portfolio. Completed the C-E Battery technology assessment. Determined a solid and integrated core Standard Family of Batteries that will align with the BMIS mission. Prepared solicitation for development of advanced prototype requirements for C-E batteries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Text": {
                                                "val": "Finalize the C-E Battery technology assessment. Determine a solid and integrated core Standard Family of Batteries to include batteries for generators and hybrids, robotics, vehicles, and low density\/usage systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Army efforts complete in FY19 and thereafter funding reallocated to support the Army's modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "BMIS will expand the Army Standard Family of Batteries to include C-E, batteries for generators and hybrids, robotics, vehicles, and low density\/usage systems.  BMIS will continue to investigate technology advancements of batteries for these systems and provide information and recommendations to applicable Program Managers."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "BMIS Design"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Belvoir"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.269"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.272"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.541"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "BMIS SFoB Prototype Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.332"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.371"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.703"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "BMIS Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Belvoir"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.212"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.205"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.417"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_FD3.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Battery & Interface Technical Assessment & Prototype Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Battery Portfolio Assessment\/Design"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "C-E Battery Tech Assessment\/Adv Prototype"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "C-E Battery Requirements Analysis"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Vehicle-Generator Battery Tech Assessment\/Adv Prototype"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army Standard Family of Batteries (SFoB) Updates"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FD9"
                    },
                    "ProjectTitle": {
                        "val": "Robotics Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "35.761"
                        },
                        "CurrentYear": {
                            "val": "71.415"
                        },
                        "BudgetYearOne": {
                            "val": "3.051"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.051"
                        },
                        "BudgetYearTwo": {
                            "val": "3.063"
                        },
                        "BudgetYearThree": {
                            "val": "3.012"
                        },
                        "BudgetYearFour": {
                            "val": "2.964"
                        },
                        "BudgetYearFive": {
                            "val": "5.166"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "124.432"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY20 funding within this Project will transition\/realign as follows:\n - Robotic Combat Vehicle - Experimental Unit Prototypes (TARDEC) will remain in this PE 0604017A, but realign to Project CF4 Robotic Combat Vehicle (RCV) NGCV-CFT.\n - Leader Follower efforts will transition to PE 0604622A Family of Heavy Tactical Vehicles Project EZ8, Leader Follower."
                        },
                        "ProjectMissionDescription": {
                            "val": "Robotics Systems for Applique and Large Unmanned Ground Systems (ALUGS) Robotics Development (RD) improves robotic and autonomous program acquisition schedules by supporting the development of integrated and synchronized capability documents (e.g. JCIDS, Department Directed, etc.) and by maturing \/ transitioning technology.  Activities include studies, assessments, and document development such as Technology Readiness Levels, Manufacturing Readiness Levels, Analysis of Alternatives \/ Letter of Sufficiency determinations, draft acquisition documents, and draft contract documents. Efforts include robotics and autonomous systems technology maturation \/ transition from Science & Technology (S&T) projects and Robotic Enhancement Program (REP) initiatives, Milestone Decision Documentation (MDD), and activities leading up to formal program initiation at Milestone B or C. The pre-acquisition activities conducted under this line intend to reduce acquisition cost, schedule, and performance risk by conducting market surveys, technical risk assessments, developing performance specifications, scopes of work, acquisition strategies, systems engineering plans, test and evaluation master plans, lifecycle sustainment plans, engaging in early test planning, and prototype development activities. This line is for large robotic systems that are transported by vehicle, maneuver under their own power, or are installed as robotic applique kits.\n\nFunding will expand Modeling and Simulation (M&S) including CASTLE capability to test and evaluate Manned Unmanned teaming, combat scenarios or other emerging Robotics program needs.  RD funding will utilize the M&S environment to mature and evaluate S&T for inclusion to program requirements, Engineering Change Proposals (ECPs) and\/or technical insertions, utilize gaming technology in conjunction with Autonomy Software to develop Training, Tactics and Procedures (TTPs), requirements and CONOPS.\n\nFunding also supports modernization of the current Ground Robotic fleets by investigating technology insertions including, but not limited to: condition based maintenance, vetronics, Robotic Architecture, autonomous operations and other emerging technologies. Funding will also support developing initial prototypes to enable refinement of Operational Requirements and early user feedback to support future sustainment and operational movement operating concepts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Wheeled Vehicle - Leader Follower (TWV-LF) - RD for PdM Applique & Large Unmanned Ground Systems (ALUGS)"
                                    },
                                    "Description": {
                                        "val": "Tactical Wheeled Vehicle (TWV) Leader Follower (LF) Program in PdM Applique & Large Unmanned Ground Systems (ALUGS) builds upon the Tank Automotive Research Development & Engineering Center (TARDEC) Expedient Leader Follower (ELF) Operational Technology Demonstration (OTD) to provide a limited automation capability to the Palletized Load System (PLS) A1. Current PdM efforts will lay the groundwork for future Program of Record (PoR) capability, expanding the TARDEC efforts to include up to seven (7) unmanned Follower vehicles.  Funding will support cost, schedule and performance risk reduction efforts to include Capabilities Document input, close monitoring of ELF OTD activities that feed cost estimates, capture technical and test data, provide test support, develop Modeling and Simulation (M&S) use cases, and develop a Software Integration Lab (SIL)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.959"
                                            },
                                            "Text": {
                                                "val": "FY18 funding initiated Continuous Autonomous Simulation Laboratory Environment (CASTLE) supported by Tank Automotive Research, Development and Engineering (TARDEC), ERDC, AMSAA and Army Research Lab (ARL)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.65"
                                            },
                                            "Text": {
                                                "val": "FY19 funding supported the capability development of incremental technology insertions for Program of Records (PoR), technology transitions, testing, and milestone document preparation. Modeling and Simulation (M&S) development and initial prototype testing will refine the system performance to meet required Tactical Wheeled Vehicle- Leader Follower (TWV-LF) system capabilities.  Development of a TWV-LF Software Integration Lab (SIL), in addition to M&S efforts, will stress the TWV-LF systems and ultimately reduce Program of Record testing requirements, technical risks and costs through validated simulations.  Supports capability development of RCIS Type II, Dismounted Engineer Mobility System (DEMS), and other emerging programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY 2020, Leader Follower (LF) transitions to funding line 0604622A Family of Heavy Tactical Vehicles Project EZ8 Leader Follower. The initiation of the new Project EZ8 for LF causes the decrease from $7.002 million in FY 2019 to  $0 in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Wheeled Vehicle - Leader Follower - Tank Automotive Research Development & Engineering Center (TARDEC) Tech Demo"
                                    },
                                    "Description": {
                                        "val": "Tactical Wheeled Vehicle - Leader Follower (TWV-LF) provides a limited autonomous vehicle software and applique kit to 10 ALUGS test Palletized Load System (PLS) A1s. For the TARDEC Tech Demo, the applique kit provides a designated manned Leader vehicle which leads a line of 3 optionally manned Follower vehicles. The Leader vehicle wirelessly provides directional and speed guidance to the Follower vehicles to follow the Leader vehicle with no driver input or unmanned. The primary purposes for Leader Follower is to improve Force Protection and increase logistics throughput. Funding allows the Army to demonstrate and operationally assess an unmanned vehicle capability with operational units and users to validate the technology. The Army will build, and test prototype systems for safety release, Soldier use, and further technology maturation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.802"
                                            },
                                            "Text": {
                                                "val": "FY 2018 funding provided for the maturation and build of 10 Applique initial prototype Tactical Wheeled Vehicle - Leader Follower systems for testing and safety assessment, applied to the ALUGS acquired 10 PLS A1 test vehicles. The prototypes integrated a by-wire kit to the existing tactical vehicle to enable remote operation of steering, braking, throttle control and other functions. An autonomy kit also enabled the platforms to operate in leader\/follower mode by providing sensor information and control algorithms to control the by-wire kit. M&S development and Initial prototype testing refined the system performance to meet required Tactical Wheeled Vehicle Leader Follower system capabilities. In addition, the funding initiated long lead item purchases for up to 140 Applique systems for user operational assessment, testing, and development planned in FY19 and FY20 on additional PLS trucks in FORSCOM identified units."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.33"
                                            },
                                            "Text": {
                                                "val": "FY 2019 funding continued the fabrication and testing of up to 140 Leader Follower PLS A1 vehicles for user operational assessment in FORSCOM identified units.  Systems will go through an Army Test and Evaluation Command (ATEC) safety assessment and plan for Urgent Materiel Release based on the signed Leader Follower Directed Requirement.  The issued Leader Follower systems will go through a 12 month Operational Technology Demonstration on CONUS installations to provide user feedback and assessment on the truck performance to inform a future milestone decision for a follow on Leader Follower program of record. Funding supports Robotic Combat Vehicle - Robotic Wingman (RCV-RW) Joint Capabilities Technology Demonstration (JCTD)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort ends in FY19 and transitions to PE 0604622A Family of Heavy Tactical Vehicles Project EZ8 Leader Follower in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Emerging Robotics Systems"
                                    },
                                    "Description": {
                                        "val": "Validation and verification of incremental system software capability upgrades for emerging robotic systems through M&S Software-in-the-loop (SIL) and Hardware-in-the-loop (HIL) allowing for transition into Program of Record."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.298"
                                            },
                                            "Text": {
                                                "val": "Funding supports Systems Engineering, Requirements, Cost Analysis and Technology Transition Plans, Software Integration Lab (SIL), and Robotic Combat Vehicle - Robotic Wingman (RCV-RW) Joint Capabilities Technology Demonstration (JCTD) transition to Program of Record. This will include cost, schedule and performance risk reduction efforts (e.g. M&S environment development). Funding also supports Squad Multipurpose Equipment Transport (SMET) Modular Mission Payloads (MMP) and Automation Concept Development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.051"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.051"
                                            },
                                            "Text": {
                                                "val": "FY2020 funding will expand Modeling and Simulation including CASTLE capabilities to test and evaluate Manned Unmanned Teaming, combat scenarios or other emerging program needs. RD funding will utilize the M&S environment to mature and evaluate S&T for inclusion to program requirements, Engineering Change Proposals (ECPs) and\/or technical insertions and various mission payload development, utilize gaming technology in conjunction with Autonomy Software to develop Training, Tactics and Procedures (TTPs), requirements and CONOPS and continue validating simulation scenarios to expand test capability. Funding will support Rapid prototyping to inform emerging programs with a Buy, Try, Decide strategy."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase supports all emerging Robotic programs and increased Validation and Verification."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotic Combat Vehicle ? Experimental Unit Prototypes - Tank Automotive Research Development & Engineering Center (TARDEC)"
                                    },
                                    "Description": {
                                        "val": "Robotic Combat Vehicle (RCV) Experimental Unit Prototyping effort will produce unmanned combat vehicle prototypes with the purpose of creating an experimental unit that Soldiers will use to create new Concepts of Operations (CONOPS), and new requirements for unmanned combat vehicles to support Army Modernization priorities. Effort will leverage a three phase approach to promote multiple industry partners to provide innovative, armed unmanned platforms for soldier experimentation with the intent of defining requirements for future RCV program of record.  The first two phases will focus on surrogate RCV platforms to get armed unmanned systems into Soldier?s hands for experimentation as quickly as possible. Phase 1 delivers a platoon set of modified M113s with remote weapons stations in order to start to define how an RCV can augment combat capability and to help refine requirements based on user feedback for a follow-on purpose built RCV effort which will start in Phase 3.  Phase 2 adds an additional two platoons of surrogate RCVs to enable soldiers to execute company level maneuvers to better understand how RCVs will be used in the future fight and to refine software behaviors and control strategies of the RCVs.. Lessons learned from the phase 1 soldier experimentation will directly shape the requirements for the Phase 3 purpose built RCV effort which will competitively deliver up to a company set of RCVs through at least 2 industry partners for an extended Soldier evaluation.  CONOPs and TTPS developed under Phase 2 will inform extended operations experiment in phase 3 and ultimately form the basis for a decision point to move forward with a procurement of RCVs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.84"
                                            },
                                            "Text": {
                                                "val": "RCV Phase 1 Surrogate Experimentation effort will install by-wire kits onto four (4) M113 and one Stryker vehicles to enable them to be operated remotely. Remote Weapon Stations (both small and medium caliber) and advanced sensors will be integrated onto unmanned platforms to enable computer aided target recognition and remoted lethality on the RCVs.  The surrogate RCVs will be completed by the end of FY19 for integration with autonomy package and follow on shake out and safety testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, funding realigns to PE 0604017A \/ Project CF4 Robotic Combat Vehicle (RCV) NGCV-CFT."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR\/STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.297"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Adjusted for FY 2019 SBIR\/STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Pre-acquisition program activities funded by this line transition to a separate Program Element and Project prior to their first program acquisition Milestone (B or C)."
                        },
                        "AcquisitionStrategy": {
                            "val": "Robotics Development (RD) is designed to facilitate the transition of robotics and autonomous systems technology from Science and Technology (S&T) projects into emerging programs of record.  It informs the acquisition process early in the development cycle allowing key stakeholders the ability to make integration decisions and affordability trades while writing requirements.\n\nProduct Manager Applique and Large Unmanned Ground Systems (PdM ALUGS) builds upon the TARDEC Expedient Leader Follower (ELF) Operational Technology Demonstration (OTD) to provide a limited autonomous vehicle capability to Tactical Wheeled Vehicles including the Palletized Load System (PLS) A1. Efforts include Capabilities Document input, close monitoring of OTD activities that feed cost estimates, capture technical and test data, provide test support, develop Modeling and Simulation (M&S) capabilities, and develop a Software Integration Lab (SIL). Efforts may support Rapid prototyping to inform emerging programs. A \"buy\/lease, try and inform\" methodology may be used to evaluate Commercial Off the Shelf (COTS), Government Off the Shelf (GOTS) and Non-Developmental Item (NDI) robotics products that have the potential to enhance Soldier combat effectiveness. Actual operational user feedback and evaluation results obtained will inform emerging capabilities and requirements documents in support of a return on investment to support future Army decision making.\n  \nRobotic Combat Vehicle (RCV) funding supports Systems Engineering, Requirements, Cost Analysis, Joint Capabilities Technology Demonstration (JCTD) support, and technology transition plans.  \n\nTank Automotive Armaments Research Development & Engineering Center (TARDEC) funding allows the Army to demonstrate and operationally assess an unmanned vehicle capability with operational units and users to validate the technology.  The Army will build, and test prototype systems for safety release, Soldier use, and further technology maturation.  \n\nRobotic Combat Vehicle (RCV) Experimental Unit Prototyping will provide unmanned combat vehicles to enable users to assess the capability of the platforms and created new CONOPS and doctrine for manned\/unmanned teaming based operations.  Efforts will inform new CONOPS, identified system limitations and benefits and provide an achievable, analytically backed basis for future RCV requirements documents to drive future acquisition programs."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PM FP PdM ALUGS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM FP"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.35"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.025"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.875"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RCIS Type II ALUGS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PdM ALUGS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.725"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.225"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "RCV\/ACO M&S SIL ALUGS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.100"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMET Modular Mission Payloads ALUGS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Leader Follower (TARDEC) Tech Demo  A Kit"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Robotic Research"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Baltimore, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.4"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.400"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Leader Follower (TARDEC) Tech Demo B Kit"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oshkosh"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Oshkosh, WI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.402"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.902"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Leader Follower (TARDEC)  Integrated System Integrator"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dallas, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.5"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Leader Follower (TARDEC) Warfighter Machine Interface"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCS Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Boston, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.5"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RCV Risk Reduction Platform Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "To Be Determined"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "To Be Determined"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "16.84"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.840"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RD M&S SIL ALUGS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TARDEC and various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.54"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.54"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.540"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY2019 SBIR\/STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.297"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.297"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PdM ALUGS Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple locations"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.109"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.398"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.011"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.011"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.518"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SMET Modular Mission Payloads ALUGS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PdM ALUGS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.55"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.550"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Demo support (TARDEC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.100"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Leader Follower (TARDEC) Tech Demo Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.700"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Leader Follower (TARDEC) Tech Demo Data Logger"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.700"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Leader Follower (TARDEC)  Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test and Evaluation Command (ATEC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.83"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.830"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Leader Follower (TARDEC)  Data Logger"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test and Evaluation Command (ATEC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PdM ALUGS RD ATEC support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.15"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.150"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190306_0_444560_FD9.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "20190306_1_444560_FD9.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "20190306_2_444560_FD9.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "LEADER FOLLOWER ALUGS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF ALUGS MODELING & SIMULATION (M&S)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF M&S Data Source Matrix Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF M&S Initial Capability Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF  Improve M&S Functionality & increase utility"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF M&S continued testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF M&S Use Case Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF M&S Validation, Verification Accreditation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF  Milestone C Documentation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ALUGS Emerging Systems Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RD Emerging Systems Capability Upgrade Validation and Verification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TARDEC LEADER FOLLOWER Operational Technology Demonstration (OTD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TARDEC LF Applique Prototype Build (10) for test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TARDEC LF Order Items for 140 Applique Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TARDEC LF Contractor Engineering Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ATEC LF Urgent Material Release (UMR) & Safety Test (TARDEC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TARDEC LF Applique Build  (140) for Tech Demo"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TARDEC LF Urgent Material Release (UMR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TARDEC LF First Unit of Issue"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TARDEC LF Tech Demo Assessment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Robotic Combat Vehicle (RCV) Risk Reduction"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Experimental Unit Prototyping - Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Risk Reduction - M113 By-Wire Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Risk Reduction - Unmanned M113 Shake Out Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Risk Reduction - ATEC Safety Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Risk Reduction - Advanced Technology Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Robotic Combat Vehicle (RCV) Experimental Unit Prototyping"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Experimental Unit Prototyping - Industry Mobility Platform Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Experimental Unit Prototyping - Industry Lethality Systems Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Experimental Unit Prototyping - Industry AiTR System Prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RCV Experimental Unit Prototyping - Prototype Evaluation and Runoff"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}