{
    "id": "2020-AirForce-PB-3600-MJBOOK-0-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-17",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603199F"
        },
        "ProgramElementTitle": {
            "val": "Sustainment Science and Technology (S&T)"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.724"
            },
            "CurrentYear": {
                "val": "15.150"
            },
            "BudgetYearOne": {
                "val": "16.249"
            },
            "BudgetYearOneBase": {
                "val": "16.249"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "16.938"
            },
            "BudgetYearThree": {
                "val": "17.731"
            },
            "BudgetYearFour": {
                "val": "18.324"
            },
            "BudgetYearFive": {
                "val": "18.690"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.811"
                },
                "CurrentYear": {
                    "val": "15.150"
                },
                "BudgetYearOne": {
                    "val": "16.249"
                },
                "BudgetYearOneBase": {
                    "val": "16.249"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.724"
                },
                "CurrentYear": {
                    "val": "15.150"
                },
                "BudgetYearOne": {
                    "val": "16.249"
                },
                "BudgetYearOneBase": {
                    "val": "16.249"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.087"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.134"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.953"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2018 in Other Adjustments is due to realignment of funds to PE 0602212F to support Research and Development Projects, 10 U.S.C. Section 2358."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635351"
                    },
                    "ProjectTitle": {
                        "val": "Technology Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.724"
                        },
                        "CurrentYear": {
                            "val": "15.150"
                        },
                        "BudgetYearOne": {
                            "val": "16.249"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.249"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.938"
                        },
                        "BudgetYearThree": {
                            "val": "17.731"
                        },
                        "BudgetYearFour": {
                            "val": "18.324"
                        },
                        "BudgetYearFive": {
                            "val": "18.690"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program develops and demonstrates mature Air Force Research Laboratory (AFRL) sustainment technologies such as: materials, corrosion, maintenance\/repair techniques, state awareness\/non-destructive inspection, health management, life prediction, low observable materials and processes, composite materials and logistics for transition into fielded Air Force systems to reduce life cycle sustainment costs and increase readiness. Technologies matured and demonstrated impact affordability and availability of fielded aerospace weapon systems by reducing sustainment costs, extending service life, and maintaining  mission readiness and capability. This program develops and demonstrates maintenance, life cycle management, and system\/fleet decision making technologies that can be implemented to address operational sustainment issues and could influence future system sustainability decisions via risk reduction to support inclusion into new systems. Studies are conducted to analyze processes and methodologies for application of technologies to address sustainment issues across the force, identifying cross cutting applications for fielded systems, and opportunities for building in sustainability into future applications. This program also develops and demonstrates affordable advanced composites for aircraft structures of fielded and emerging systems.  This includes studies, analysis, and tests for application of composites to address sustainment and affordability issues across the force. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) process to harmonize efforts and eliminate duplication.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602602F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Health Management\/Assessment Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition state awareness\/system health management technologies. Conduct studies and analyses to design sustainability into future applications. The short-term tasks in this area are selected based on warfighter needs identified via a semi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.305"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.171"
                                            },
                                            "Text": {
                                                "val": "Complete development of automated software release capability to assess and maintain system health. Continue development of diagnostic system to assess aircraft wiring and avionics subsystems. Continue development of system to reduce maintenance requirements of carbon monoxide detection system. Continue health assessments capability development for fielded air\/space\/cyber systems and components. Continue development and demonstration of diagnostic technology to monitor\/assess health of airframe\/engine, launch vehicle, spacecraft, intercontinental ballistic missiles (ICBMs), and components. These efforts are in Air Force Air, Space, and Cyber mission areas. Continue development of testing systems to assess aircraft electrical subsystems. Initiate new efforts based on competitive selection processes in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "Complete development of diagnostic system to assess aircraft wiring and avionics subsystems.  Complete development of system to reduce maintenance requirements of carbon monoxide detection system.  Continue health assessments capability development for fielded air\/space\/cyber systems and components. Continue development and demonstration of diagnostic technology airframe\/engine, launch vehicle, spacecraft, intercontinental ballistic missiles (ICBMs), and components. These efforts are in Air Force Air, Space, and Cyber mission areas. Initiate new efforts based on competitive selection processes in FY 2019."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $0.071 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prevention\/Enhanced Maintainability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, replacement, and concepts for performance improvement and reduced maintenance burden. The short-term tasks in this effort are selected based on warfighter needs identified via a semi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.305"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.171"
                                            },
                                            "Text": {
                                                "val": "Complete thermal spray coating process development for engine components. Complete development of an improved method for removal of biofilms from in ground fuel storage systems. Complete improved durability conductive tape and enhanced edge treatment repair development for transition to the B-2. Continue Rapid Repair Requirements materials development for aircraft battle damage repair of advanced fighter aircraft.  Continue Advanced Canopy Technology development. Initiate total body non-destructive evaluation system for outer mold line inspection of advanced fighter aircraft. Continue development of materials and processes to reduce maintenance burden on low observable systems. Continue efforts to demonstrate high reliability of repair and maintenance technologies to increase service time between maintenance actions. Continue to develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, repair, replacement, and concepts for maintainer training, extending part life, and reduced maintenance burden spanning Air Force Air, Space, and Cyber mission areas. Initiate new efforts based on competitive selection processes in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.896"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.896"
                                            },
                                            "Text": {
                                                "val": "Complete adaptive gaming concept development for maintainer training.  Continue Rapid Repair Requirements materials development for aircraft battle damage repair of advanced fighter aircraft.  Continue Advanced Canopy Technology development. Continue total body nondestructive evaluation system for outer mold line inspection of advanced fighter aircraft. Continue development of materials and processes to reduce maintenance burden on low observable systems. Continue efforts to demonstrate high reliability of repair and maintenance technologies to increase service time between maintenance actions. Continue to develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, repair, replacement, and concepts for maintainer training, extending part life, and reduced maintenance burden spanning Air Force Air, Space, and Cyber mission areas. Initiate Abrasion Resistance Coating development to protect composite material substrates for low observable systems.  Initiate development on a flexible crack-blunting primer. Initiate development on a mid-temp flexible light weight Radiation-absorbent material (RAM) system. Initiate other new efforts based on competitive selection processes in FY 2019."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $0.725 million. Justification for the increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management\/Improved Reliability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition technologies to improve existing and new components, fleet management\/ decision-making tools, and supply chain\/sustainment infrastructure to decrease downtime and costs, and increase reliability. The short-term tasks in this effort are selected based on warfighter needs identified via a semi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.107"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.024"
                                            },
                                            "Text": {
                                                "val": "Complete data mining software development to determine asset availability. Continue effort to assess and accurately determine B-2 exhaust liner thermal profile and structural environment, and demonstrate performance of exhaust structures coatings. Continue software development to increase speed and accuracy of solid rocket motor inspections to reduce sustainment costs and improve reliability.  Continue development of analysis techniques to extend engine component service life. Continue efforts to develop system fleet management decision-making tools, maintenance\/repair data base technologies and techniques, and supply chain\/infrastructure approaches to reduce sustainment costs. These efforts span Air Force Air, Space, and Cyber mission areas. Initiate new efforts based on competitive selection processes in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.253"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.253"
                                            },
                                            "Text": {
                                                "val": "Complete effort to assess and accurately determine B-2 exhaust liner thermal profile and structural environment, and demonstrate performance of exhaust structures coatings.  Complete software development to increase speed and accuracy of solid rocket motor inspections to reduce sustainment costs and improve reliability. Continue system development to provide prognostic capabilities for avionics components and analysis techniques to extend engine component service life. Continue efforts to develop system fleet management decision-making tools, maintenance\/repair data base technologies and techniques, and supply chain\/infrastructure approaches to reduce sustainment costs. These efforts span Air Force Air, Space, and Cyber mission areas.  Initiate new efforts based on competitive selection processes in FY 2019."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $1.229 million. Funding increased due to short-term tasks being selected based on warfighter needs identified via a semi-annual competitive process."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Composite Certification"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate and transition reliability-based design of advanced composites for aircraft structures. This includes studies and analysis of processes and methodologies for application of composites to address sustainment and affordability issues across the force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.007"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.784"
                                            },
                                            "Text": {
                                                "val": "Continue service life extension demonstration on a legacy fleet aircraft composite part."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 Composite Certification efforts were transferred to PE 0603211F, Aerospace Technology Dev\/Demo, Project 634920, Flight Vehicle Technology Integration in order to integrate engineering efforts for transition."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 compared to FY 2019 decreased by $0.784 million.  Funding decreased due composite certification work moved and consolidated under PE 0603211F."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}