{
    "id": "2020-Army-PB-2040-JBOOK-6862ccffed1a667db11cb620e9184b2662501ed68aad7c3c768162a310d4d712-0",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604256A"
        },
        "ProgramElementTitle": {
            "val": "Threat Simulator Development"
        },
        "R1LineNumber": {
            "val": "176"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "31.401"
            },
            "CurrentYear": {
                "val": "47.322"
            },
            "BudgetYearOne": {
                "val": "14.117"
            },
            "BudgetYearOneBase": {
                "val": "14.117"
            },
            "BudgetYearTwo": {
                "val": "15.229"
            },
            "BudgetYearThree": {
                "val": "14.823"
            },
            "BudgetYearFour": {
                "val": "14.139"
            },
            "BudgetYearFive": {
                "val": "7.35"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "144.381"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports the design, development, acquisition, integration and fielding of realistic mobile threat simulators and realistic threat simulation products utilized in Army\/Department of Defense (DoD) training and developmental and operational tests. This PE originally funded simulators representing Soviet equipment, but scope was expanded to address emerging world threats. Army Threat Simulator and Threat Simulation products are utilized to populate test battlefields for United States (U.S.) Army Test and Evaluation Command (ATEC), to conduct developmental and operational tests, and to support Program Executive Office (PEO) required user testing in System Integration Laboratories (SILs) and hardware\/simulation in-the-loop facilities. These battlefield simulators represent adversary systems (e.g. missile systems, command, control and communications systems, electronic warfare systems, etc.) in order to portray a realistic threat environment during testing of U.S. weapon systems.\n\nArmy Threat Simulator and Threat Simulation products developed or fielded under this PE support Army-wide, non-system-specific threat product requirements. Each capability is pursued in concert and coordination with existing Army\/DoD and Tri-Service capabilities to eliminate duplication of effort. Simulator development is responsive to Office of the Secretary of Defense and Government Accountability Office guidance for the Army to conduct operational testing in a realistic threat environment. Actual threat equipment is acquired when appropriate (in lieu of development) and total package fielding is still required (i.e., instrumentation, operations and maintenance, manuals, new equipment training, etc.). Threat simulator development is accomplished under the auspices of the Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) and the Director, Operational Test and Evaluation (DOT&E) Threat Simulator Investment Working Group."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.862"
                },
                "CurrentYear": {
                    "val": "12.835"
                },
                "BudgetYearOne": {
                    "val": "15.284"
                },
                "BudgetYearOneBase": {
                    "val": "15.284"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "31.401"
                },
                "CurrentYear": {
                    "val": "47.322"
                },
                "BudgetYearOne": {
                    "val": "14.117"
                },
                "BudgetYearOneBase": {
                    "val": "14.117"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "8.539"
                },
                "CurrentYear": {
                    "val": "34.487"
                },
                "BudgetYearOne": {
                    "val": "-1.167"
                },
                "BudgetYearOneBase": {
                    "val": "-1.167"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.009"
                    },
                    "CurrentYear": {
                        "val": "-0.013"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "9"
                    },
                    "CurrentYear": {
                        "val": "34.5"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.452"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.167"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.167"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2018 Congressional Add of $9.000 million for Integrated Threat Force. \nFY19 Congressional Adds of $34.500 million for: Integrated Force Cyber Threat Simulators ($6.000 million); Threat Cyberspace Operations ($10.000 million); and Cyber Security Operations Center ($18.500 million)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "976"
                    },
                    "ProjectTitle": {
                        "val": "Army Threat Sim (ATS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.401"
                        },
                        "CurrentYear": {
                            "val": "47.322"
                        },
                        "BudgetYearOne": {
                            "val": "14.117"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.117"
                        },
                        "BudgetYearTwo": {
                            "val": "15.229"
                        },
                        "BudgetYearThree": {
                            "val": "14.823"
                        },
                        "BudgetYearFour": {
                            "val": "14.139"
                        },
                        "BudgetYearFive": {
                            "val": "7.35"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "144.381"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year 2020, management and oversight of Cyber Blue Team vulnerability assessments was moved from Project 976 to Program Element 0604759A (Major Test & Evaluation Investment), Project FF1 (Cyber Blue Team)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports the design, development, acquisition, integration, and fielding of realistic mobile threat simulators and realistic threat simulation products utilized in Army\/DOD training and developmental and operational tests. Army Threat Simulator and Threat Simulation products are utilized to populate test battlefields for United States (U.S.) Army Test and Evaluation Command (ATEC), to conduct developmental and operational tests, and to support Program Executive Office (PEO) required user testing in System Integration Laboratories and hardware\/simulation in-the-loop facilities. \n\nArmy Threat Simulator and Threat Simulation products developed or fielded under this Project support Army-wide, non-system-specific threat product requirements. Each capability is pursued in concert and coordination with existing Army\/DoD and Tri-Service capabilities to eliminate duplication of effort. These battlefield simulators represent systems (e.g. missile systems, command, control and communications systems, electronic warfare systems, etc.) that are used to portray a realistic threat environment during testing of U.S. weapon systems. Simulator development is responsive to Office of the Secretary of Defense and General Accounting Office guidance for the Army to conduct operational testing in a realistic threat environment. Actual threat equipment is acquired when appropriate (in lieu of development) and total package fielding is still required (i.e., instrumentation, operations and maintenance, manuals, new equipment training, etc.). Threat simulator development is accomplished under the auspices of the Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) and the Director, Operational Test and Evaluation, Threat Simulator Investment Working Group."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Add: Integrated Threat Force"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9"
                                        },
                                        "Text": {
                                            "val": "Congressional Add: Integrated Threat Force"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Threat Force Cyber Threat Simulators"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "6"
                                        },
                                        "Text": {
                                            "val": "Integrated Threat Force Cyber Threat Simulators"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Cyberspace Operations"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Threat Cyberspace Operations"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Security Operations Center"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "18.5"
                                        },
                                        "Text": {
                                            "val": "Cyber Security Operations Center"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Network Exploitation Test Tool (NETT)."
                                    },
                                    "Description": {
                                        "val": "NETT is a comprehensive Threat Cyberspace Operations (TCO) tool designed for Test and Evaluation (T&E) to portray evolving hostile and malicious Threat effects within the Cyber domain. Program will continue to provide an integrated suite of open-source\/open-method exploitation tools to be integrated with robust reporting and instrumentation capabilities. NETT is used by TCO teams to replicate the tactics of state and non-state Threats and is supported by a robust TCO development environment. The Cyber domain is the most rapidly changing domain in which our systems operate. NETT program will continue research of these capabilities and will use an in-depth process to clean, fix, sustain, modernize, and integrate required Threat tools, tactics, and techniques that will be needed during T&E. Focus areas include: continued Threat integration, instrumentation, distributed collaboration between multiple users, targets and attack visualization, data collection and remote agent development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.289"
                                            },
                                            "Text": {
                                                "val": "The NETT program delivered 100+ comprehensive TCO systems and a zero-client distributed threat infrastructure in support of 200+ threat assessment events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.45"
                                            },
                                            "Text": {
                                                "val": "Continue EMD phase for the NETT including the integration of new tools, tactics, and techniques into the NETT to portray evolving Threat environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.849"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.849"
                                            },
                                            "Text": {
                                                "val": "Continue EMD phase for the NETT including the integration of new tools, tactics, and techniques into NETT in order to portray the evolving threat environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor adjustment in Army requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Systems Management Office's (TSMO) Threat Operations"
                                    },
                                    "Description": {
                                        "val": "The Threat Operations program will fund the operation, maintenance, management, and sustainment capability for Threat systems used to portray a realistic threat environment during Army testing and training within the Army's Threat inventory in order to support multiple Army\/DoD test events including Network Integration Evaluation \/ Army Warfighting Assessment (NIE \/ AWA) and anticipated excursion test events for numerous Systems Under Test \/ Programs of Record (SUT \/ POR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.552"
                                            },
                                            "Text": {
                                                "val": "Supported multiple Army test events including NIE \/ AWA and anticipated excursion test event for numerous SUT \/ PR in FY18."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.256"
                                            },
                                            "Text": {
                                                "val": "Will continue to support multiple Army test events including NIE \/ AWA and anticipated excursion test events for numerous SUT \/ POR currently identified through FY2019."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.429"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.429"
                                            },
                                            "Text": {
                                                "val": "Will continue to support multiple Army test events including NIE \/ AWA and anticipated excursion test events for numerous SUT \/ POR currently identified through FY2020."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor adjustment in Army requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Cyberspace Operations (TCO), formerly named Threat Computer Network Operations Team (TCNOT)"
                                    },
                                    "Description": {
                                        "val": "TCO supports Army\/DoD events by maintaining a team of highly qualified, trained, and certified TCO professionals who execute Cyber operations against systems under test. The TCO program was designated a \"Threat CNO Team\" under Army Regulation (AR) 380-53 and is accredited as a United States Cyber Command (USCYBERCOM) \/ National Security Agency (NSA) certified \"Red Team\"."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.764"
                                            },
                                            "Text": {
                                                "val": "The TCO program executed 200+ events in support of Red Team threat assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.565"
                                            },
                                            "Text": {
                                                "val": "Funding provides for Contractor subject matter expertise within the Cyber Red Team workforce to support critical threat assessments. Beginning in FY2019, O&M funds will enable Cyber Red Team Department of the Army Civilian (DAC) subject matter expertise to execute this unique threat intelligence based mission (hence the reduction in FY2019 RDTE requirement)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.444"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.444"
                                            },
                                            "Text": {
                                                "val": "TCO funding provides for Contractor subject matter expertise within the Cyber Red Team workforce to support critical threat assessments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased contract support in FY20 for critical threat assessments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Cyberspace Operations (TCO) Fidelity Enhancements. formerly named Threat Computer Network Operations (CNO) Fidelity Enhancements"
                                    },
                                    "Description": {
                                        "val": "Establishes high-fidelity Threat malware and real-world tools, tactics, techniques, and procedures of Threat employment of TCO using commercial Information Technologies (IT) intended to engage complex U.S. operations. Threat packages range from \"technological nomads\" operating autonomously to state level forces using both active and passive network attack to selectively degrade or disrupt C4ISR (Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance) and Enterprise Business Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.402"
                                            },
                                            "Text": {
                                                "val": "The TCO-FI program provided intelligence-based tools, techniques and procedures (TTPs) in support of 200+ TCO events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.762"
                                            },
                                            "Text": {
                                                "val": "Program will continue the validation of high-fidelity threat malware and real-world tools, tactics, techniques, and procedures of threat TCO employment using commercial IT technologies intended to engage complex U.S. operations. Will continue to develop state and non-state threat targeting packages that are current, accurately profiling attack trends and timelines, intent, levels of sophistication, and threat training. These threat packages represent state and non-state level forces using both active and passive network attack to selectively degrade or disrupt Army C4ISR and Enterprise Business Systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.778"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.778"
                                            },
                                            "Text": {
                                                "val": "The TCO-FI program will continue the validation of high-fidelity threat malware and real-world tools, tactics, techniques, and procedures of threat TCO employment using commercial IT technologies intended to engage complex U.S. operations. Will continue to develop state and non-state threat targeting packages that are current, accurately profiling attack trends and timelines, intent, levels of sophistication, and threat training. These threat packages represent state and non-state level forces using both active and passive network attack to selectively degrade or disrupt C4ISR and Enterprise Business Systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor adjustment in Army requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Jammer Suite (AJS)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Jammer Suite expanded the Army's open air and alternatives for Electronic Attack (EA) in a test environment by using variations of jamming to include direct jamming, open air jamming and GPS jamming. It kept the current jamming Threat as an asset to the Army for use in testing at lower test costs while expanding the Army alternative EA in a test environment by using appropriate jamming techniques for the applied testing environment. This program provided Threat representation for the Army\/DoD in the jamming domain, developing new and future jamming threats, to include satellite jamming."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Threat development will include, but is not limited to, techniques such as Frequency Follower Direct Sequence Spread Spectrum (DSSS) threat jamming; Digital Radio Frequency Memory (DRFM) \"spoofing,\" and extended Radio Frequency (RF) range into the Extremely High Frequency (EHF) range."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.979"
                                            },
                                            "Text": {
                                                "val": "Threat development will include, but is not limited to, techniques such as Frequency Follower Direct Sequence Spread Spectrum (DSSS) threat jamming; Digital Radio Frequency Memory (DRFM) \"spoofing,\" and extended Radio Frequency (RF) range into the Extremely High Frequency (EHF) range."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "End of RDTE efforts for Advanced Jammer Suite in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Battle Command Force (TBCF), formerly named Integrated Threat Force (ITF)"
                                    },
                                    "Description": {
                                        "val": "The Threat Battle Command Force (TBCF) incorporates remote operations via distributed Command and Control (C2) while maintaining valid Threat TTP during Tes & Evaluation (T&E) and training events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.237"
                                            },
                                            "Text": {
                                                "val": "TBCF began integration of the Advanced NESTS suite of direction finding systems. TBCF also began additional development into distributed operations as well as integration of additional threat systems in support of FY19 Test and Evaluation events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.27"
                                            },
                                            "Text": {
                                                "val": "Integrate the Advanced Jammer Suite and additional Threat systems as identified by Threat assessments. Develop parsing tools to increase situational awareness for the Threat operations commander. Increase remote operations capabilities to decrease test costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.977"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.977"
                                            },
                                            "Text": {
                                                "val": "Integrate Advanced Electronic Support Sensor Suite (AESSS) initial capabilities and additional threat systems as identified by threat assessments. Increase on the move command and control capabilities to provide threat representative on the move capabilities to the threat operations commander."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 increase for Threat Battle Command Force (TBCF) for parsing tool development to increase situational awareness for the Threat Operations Commander, increase remote operations capabilities to decrease test costs and integrate the Advanced Electronic Support Sensor Suite (AESSS) capabilities to provide remote C2 capability network of unmanned sensors."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Mobile Communication Network Infrastructure Test Range (Next GEN MCNITR)"
                                    },
                                    "Description": {
                                        "val": "Next Generation MCNITR provides a mobile, scalable closed-loop cellular communications network infrastructure implementing multiple technologies capable of providing a realistic commercial Radio Frequency (RF) signals environment needed for testing and training of U.S. forces in urban and suburban battle space environments. The Next Generation MCNITR program acquires a capability that simulates real-world RF signals environment and that supports representative Threat force reliance of network enabled devices dependent on advanced cellular technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.657"
                                            },
                                            "Text": {
                                                "val": "Identified lowest risk forward for development of highly mobile Fourth Generation Long Term Evolution (4GLTE)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.166"
                                            },
                                            "Text": {
                                                "val": "Integrate commercial RF technologies to create a threat faithful communications environment based upon results of the risk reduction phase."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.003"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.003"
                                            },
                                            "Text": {
                                                "val": "Continue development of 4GLTE IOC through Full Operational Capability (FOC). FOC will create threat representative commercial cellular environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 increase will be used to develop the 4GLTE FOC (IOC) baseline interoperable with Threat Battle Command Force creating threat representative commercial cellular environments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronic Support Sensor Suite (AESSS)"
                                    },
                                    "Description": {
                                        "val": "AESSS provides expansion of Army's ability to portray acoustic, seismic, radio frequency, and electro-optical \/ infrared (EO\/IR) sensor capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.859"
                                            },
                                            "Text": {
                                                "val": "Conduct risk reduction phase to decompose Threat requirements into system and sub-system functional requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.637"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.637"
                                            },
                                            "Text": {
                                                "val": "Develop threat representative unmanned sensor mesh network leveraging lessons learned on prior programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 requirement represents expected cost of threat representative unmanned sensor mesh network development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management and oversight of Cyber Blue Team vulnerability assessments"
                                    },
                                    "Description": {
                                        "val": "In 2016 the Army Acquisition Executive (AAE) designated PM ITTS as the Office of Primary Responsibility for Acquisition Blue Teams, to provide management and execution of relevant Cyber Blue Team assessment capabilities in support of the acquisition and test communities. Cyber Blue Teams refer to the cyber team which works cooperatively with the system owner to ensure programs can defend against attackers and\/or Red Teams. These Cyber Blue Team capabilities are essential to enable military operators to assess and defeat the presence of cyber security threats across Army networks. PM ITTS will also serve as the primary point of contact for cyber-related testing and vulnerabilities assessments with U.S. Cyber Command and Army Cyber. This Project executes the establishment and management of certification standards for Acquisition Blue Teams and coordination of Blue Team requirements on behalf of the Assistant Secretary of the Army for Acquisition, Logistics, and Technology (ASA ALT)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.925"
                                            },
                                            "Text": {
                                                "val": "This activity will establish and manage certification standards for Cyber Blue Teams in coordination with all Project Managers on behalf of Assistant Secretary of the Army for Acquisition, Logistics, and Technology. It will be the single point of contact with United States Cyber Command (CYBERCOM) for open and closed networks, and will develop and field a central repository for vulnerability assessments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Requirement is transferred to Program Element 0604759A (Major Test & Evaluation Investment) Project FF1 (Cyber Blue Team)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Networked Electronic Support Threat Sensors (NESTS)"
                                    },
                                    "Description": {
                                        "val": "In FY2018, Program began prototype design and implementation to deliver advanced threat Electronic Support (ES) platforms. The Advanced NESTS program aims to increase existing Threat ES capabilities to match U.S. Intelligence Community performance assessments of real-world Threat capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.5"
                                            },
                                            "Text": {
                                                "val": "The Advanced NESTS program increased existing threat ES capabilities to match U.S. Intelligence Community performance assessments of real-world threat capabilities. This program replicated emerging real-world threat capabilities targeting advanced U.S. communication systems operating up to 18GHz. System achieved FOC in FY18. Beginning in FY19, this program will transition to AESSS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY19 SBIR\/STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "Small Business Innovation Research (SBIR) \/ Small Business Technology Transfer (STTR)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.59"
                                            },
                                            "Text": {
                                                "val": "Accounting for full funding amount."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Accounting for full funding amount."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}