{
    "id": "2020-AirForce-PB-3600-JBOOK-1f56cfb9f313f92c9f99f7c96eb27810cd0b22209e58d76543a013712d83a603-56",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V3A-U_RDTE_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0208087F"
        },
        "ProgramElementTitle": {
            "val": "Distributed Cyber Warfare Operations"
        },
        "R1LineNumber": {
            "val": "210"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "38.241"
            },
            "CurrentYear": {
                "val": "40.168"
            },
            "BudgetYearOne": {
                "val": "35.178"
            },
            "BudgetYearOneBase": {
                "val": "35.178"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "33.620"
            },
            "BudgetYearThree": {
                "val": "33.678"
            },
            "BudgetYearFour": {
                "val": "34.292"
            },
            "BudgetYearFive": {
                "val": "46.897"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "PE 0208087F, Distributed Cyber Warfare Operations, changed from AF Offensive Cyber Operations."
        },
        "ProgramElementMissionDescription": {
            "val": "Distributed Cyber Warfare Operations (DCWO) provides advanced offensive cyber warfare capabilities to the 24th Air Force in direct support of US Cyber Command (USCYBERCOM), AF Major Commands(MAJCOMs), unified commands, and national agency cyber warfighting requirements. DCWO efforts directly support the Joint Network Attack Initial Capabilities Document (ICD), the National Military Strategy for Cyberspace Operations (NMS-CO), Department of Defense Cyber Strategy, USCYBERCOM operational directives, MAJCOM directive and guidance documentation, and other formal requirements documents in the delivery of offensive cyber effects.\n\nActivities within the DCWO deliver operations-ready cyberspace superiority capabilities through the research, development, testing, evaluation, accelerated prototyping, demonstration, and fielding of advanced offensive cyber technologies and capabilities. The ongoing development of peculiar support equipment, facilities, operations, fielding, maintenance, and logistical support of fielded systems permits the rapid adaptation of current cyber capabilities to capitalize on emerging opportunities and mitigate adversary actions. This portfolio of capabilities permits Combatant Commanders the ability to operate in and through cyberspace to manipulate, disrupt, deny, degrade, or destroy targeted computers, information systems, or networks, and actively gather information from computers, information systems, and networks.\n\nDCWO effectiveness comes from balancing three modular and interoperable elements necessary for the successful presentation of offensive cyber capabilities: Platforms, Access\/Infrastructure, and Payloads. When unified these three elements combine to form a cyber mission thread capable of delivering cyber effects to Combatant Commanders to include cyber operational preparation of the environment, offensive counter-cyber, cyber-attack, electronic warfare operations, mission planning, intelligence, cybersecurity products and services and Command and Control\/Situational Awareness (C2SA) tools needed to attack enemy networks, telephony, Integrated Air Defense Systems (IADS), command and control systems, and create cyber effects through the Electromagnetic Spectrum (EMS).\n\nEfforts within DCWO may include the expedited development of innovative solutions for existing and emerging technologies required for the continued superiority within the cyber domain.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver Air Force Distributed Cyber Warfare Operations capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "39.693"
                },
                "CurrentYear": {
                    "val": "40.526"
                },
                "BudgetYearOne": {
                    "val": "35.178"
                },
                "BudgetYearOneBase": {
                    "val": "35.178"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "38.241"
                },
                "CurrentYear": {
                    "val": "40.168"
                },
                "BudgetYearOne": {
                    "val": "35.178"
                },
                "BudgetYearOneBase": {
                    "val": "35.178"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.452"
                },
                "CurrentYear": {
                    "val": "-0.358"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.358"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.452"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "670375"
                    },
                    "ProjectTitle": {
                        "val": "Network Warfare Systems and Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.241"
                        },
                        "CurrentYear": {
                            "val": "40.168"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "11.428"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY20, PE 0208087F, Distributed Cyber Warfare Operations, Project 670375, Network Warfare Systems and Support efforts were distributed to PE 0208087F, Distributed Cyber Warfare Operations, Project 674540, Cyber Tech Projects - Payloads, Project 674541, Platforms, and Project 674542, Cyber Tech Projects - Access\/Infrastructure in order to provide additional clarity and structure to the Distributed Cyber Warfare Operations portfolio."
                        },
                        "ProjectMissionDescription": {
                            "val": "Distributed Cyber Warfare Operations (DCWO) conducts Research, Development, Testing and Evaluation (RDT&E) leading to operations-ready cyberspace superiority capabilities including the transition of efforts from laboratory, industry, and academia via studies, accelerated prototyping, and technology demonstrations. DCWO consists of a portfolio of programs and projects providing the rapid acquisition of operational cyber capabilities. DCWO effectiveness comes from balancing funding among three capability thrust areas required for cyber warfare operations: Air Force Platforms, Access and Payloads. The DCWO portfolio provides capabilities in these three areas that when tied together provide cyber effects to Combatant Commanders.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver Air Force Distributed Cyber Warfare Operations capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\nSome aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platforms"
                                    },
                                    "Description": {
                                        "val": "The Cyber Mission Platform (CMP) program is an ACAT III program of record that provides a modular, configurable framework for Cyber Operations. The CMP framework is currently being applied to offensive cyber operations and may also be applied to defensive cyber operations in the future as prioritized by CMP stakeholders. CMP uses an Agile acquisition strategy that allows the USAF to dynamically prioritize the delivery of operational capabilities. CMP develops capability enhancements on a regular cadence and delivers them to operations based on operational need and acceptance timelines. The platform major thrust also includes platform integration development activities necessary to integrate CMP into DCWO mission threads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.925"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.803"
                                            },
                                            "Text": {
                                                "val": "- Continue enhancements to the CMP Platform and other platform components to satisfy prioritized requirements from USAF Offensive Cyber Operations Mission Threads.  \n\n- Execute an approved FY18 NDAA Pilot Program for Agile Software Development.\n\n- At a minimum, conduct delta accreditation and fielding of CMP Increment 2 Build 3 and Build 4.  More frequent deliveries will be based on user demand.\n\n- Transition from 6 month delivery Builds to a Continuous Delivery program structure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- Funding decreased due to transfer to Project 674541, Cyber Tech Projects - Platforms"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Access"
                                    },
                                    "Description": {
                                        "val": "The Access capability provides connectivity and required infrastructure by leveraging industry and other Government\/non-Government mission partners' applications and programs.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.827"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.123"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop Air Force unique connectivity and required infrastructures across multiple spectrums leveraging industry and other Government\/non-Government mission partner's applications and programs.\n \n- Continue to develop and transition OCO quick reaction capabilities for next-generation OCO weapon system supporting requirements from USAF Offensive Cyber Operations Mission Threads.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- Funding decreased due to transfer to Project 674542, Cyber Tech Projects - Access\/Infrastructure"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Payloads"
                                    },
                                    "Description": {
                                        "val": "The payloads capability develops and fields cyber tools and payloads leveraging industry and other Government\/non-Government mission partnered applications and programs.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.489"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.242"
                                            },
                                            "Text": {
                                                "val": "- Continue the development of cyber tools and payloads by leveraging industry and other Government\/non-Government mission partnered developed applications and programs.\n\n- Continue to develop and transition cyber tool and payload quick reaction capabilities for current and next-generation OCO weapon systems supporting requirements from USAF OCO Mission Threads.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- Funding decreased due to transfer to Project 674540, Cyber Tech Projects - Payloads"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 Line Item 834320"
                                    },
                                    "Title": {
                                        "val": "C3 Countermeasures"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.990"
                                        },
                                        "CurrentYear": {
                                            "val": "23.931"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "40.921"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 Line Item 834010"
                                    },
                                    "Title": {
                                        "val": "General Information Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.781"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "8.781"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 Line Item 831010"
                                    },
                                    "Title": {
                                        "val": "COMSEC Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.070"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.070"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Distributed Cyber Warfare Operations program office will utilize Concept, Development, Risk Management, Production, or Deployment Plans as part of a streamlined approach to acquisition planning. All plans will contain sufficient information for the Milestone Decision Authority (MDA) to determine readiness to enter into the applicable phase of the acquisition process. Distributed Cyber Warfare Operations will utilize both new and existing contractual vehicles, such as Government-Wide Acquisition Contract (GWAC) vehicles (Alliant, Encore II, Solutions for Enterprise-Wide Procurement IV (SEWP IV)), and General Services Administration (GSA) Federal Supply Schedules and a Cyber Indefinite Delivery Indefinite Quantity (IDIQ) contract.  The use of multiple-award contractual vehicles will provide a wide range of commercially-available products and services that should be able to meet many requirements related to Offensive Cyberspace Operations.  These multiple-award contractual vehicles have already met the statutory requirements of the Competition in Contracting Act (CICA), which requires a fair opportunity to all contract holders, in accordance with Federal Acquisition Regulation (FAR) 16.505, unless an exception to fair opportunity applies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Platform"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "16.684"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "14.028"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Access\/Infrastructure"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.202"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "17.229"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Payloads"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.583"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.924"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Platforms"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "47 CTS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.576"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.694"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Access\/Infrastructure"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "47 CTS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.191"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.407"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Payloads"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.378"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PSC - Advisory & Assistance Services (A&AS & FFRDC Support) - Platforms"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.665"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.081"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PSC - Acquisition Support - Access"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.435"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.486"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PSC - Engineering & Technical Assistance Support Services (ETASS & FFRDC) - Payloads"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.527"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.319"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Platform"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "CMP Development Increment 2 Build 1"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "CMP Development Increment 2 Build 2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "CMP Development Increment 2 Build 3"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "CMP Development Increment 2 Build 4"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "CMP Continuous Delivery per Section 874 Pilot Program Plan"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Platform Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Access"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "AF Unique Access"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Next-Gen OCO WS"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DCWO Infrastructure Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Payloads"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Payload Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Corner Series Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Tools Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "674540"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Tech Products - Payloads"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.615"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.615"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.110"
                        },
                        "BudgetYearThree": {
                            "val": "7.053"
                        },
                        "BudgetYearFour": {
                            "val": "6.579"
                        },
                        "BudgetYearFive": {
                            "val": "6.805"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY20, PE 0208087F, Distributed Cyber Warfare Operations, Project 670375, Network Warfare Systems and Support payload efforts were transferred to PE 0208087F, Distributed Cyber Warfare Operations, Project 674540, Cyber Tech Projects - Payloads, in order to provide additional clarity and structure to the Distributed Cyber Warfare Operations portfolio."
                        },
                        "ProjectMissionDescription": {
                            "val": "Distributed Cyber Warfare Operations (DCWO) conducts Research, Development, Testing and Evaluation (RDT&E) leading to operations-ready cyberspace superiority capabilities including the transition of efforts from laboratory, industry, and academia via studies, accelerated prototyping, and technology demonstrations. DCWO consists of a portfolio of programs and projects providing the rapid acquisition of operational cyber capabilities. DCWO effectiveness comes from balancing funding among three capability thrust areas required for cyber warfare operations: Air Force Platforms, Access and Payloads. The DCWO portfolio provides capabilities in these three areas that when tied together provide cyber effects to Combatant Commanders. Cyber payload capabilities are required to have deliver cyber effects through the DCWO platform and access.\n\nThe payloads capability develops and fields cyber tools and payloads leveraging industry and other Government\/non-Government mission partnered applications and programs.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver Air Force Distributed Cyber Warfare Operations capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Payloads"
                                    },
                                    "Description": {
                                        "val": "The payloads capability develops and fields cyber tools and payloads leveraging industry and other Government\/non-Government mission partnered applications and programs.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.615"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.615"
                                            },
                                            "Text": {
                                                "val": "- Will continue the development of cyber tools and payloads by leveraging industry and other government\/non-Government mission partnered developed applications and programs.\n\n- Will continue the development and transition of cyber tool and payload quick reaction capabilities for current and next-generation DCWO weapon systems supporting requirements from DCWO Mission Threads.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- Funding increased due to relative operational priorities between DCWO efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 834320"
                                    },
                                    "Title": {
                                        "val": "C3 Countermeasures"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.939"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.939"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.811"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.550"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.595"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.751"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Distributed Cyber Warfare Operations program office will utilize Concept, Development, Risk Management, Production, or Deployment Plans as part of a streamlined approach to acquisition planning. All plans will contain sufficient information for the Milestone Decision Authority (MDA) to determine readiness to enter into the applicable phase of the acquisition process. Distributed Cyber Warfare Operations will utilize both new and existing contractual vehicles, such as Government-Wide Acquisition Contract (GWAC) vehicles (Alliant, Encore II, Solutions for Enterprise-Wide Procurement IV (SEWP IV)), and General Services Administration (GSA) Federal Supply Schedules and a Cyber Indefinite Delivery Indefinite Quantity (IDIQ) contract. The use of multiple-award contractual vehicles will provide a wide range of commercially-available products and services that should be able to meet many requirements related to Offensive Cyberspace Operations. These multiple-award contractual vehicles have already met the statutory requirements of the Competition in Contracting Act (CICA), which requires a fair opportunity to all contract holders, in accordance with Federal Acquisition Regulation (FAR) 16.505, unless an exception to fair opportunity applies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Payload Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.346"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.346"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Payload Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "47 CTS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PSC - Engineering & Technical Assistance Support Services (Various))"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.069"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.069"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Payload Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Payloads Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Corner Series Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Tools Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "674541"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Tech Projects - Platforms"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "10.054"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.054"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.268"
                        },
                        "BudgetYearThree": {
                            "val": "10.713"
                        },
                        "BudgetYearFour": {
                            "val": "10.743"
                        },
                        "BudgetYearFive": {
                            "val": "11.112"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY20, PE 0208087F, Distributed Cyber Warfare Operations, Project 670375, Network Warfare Systems and Support platform efforts were transferred to PE 0208087F, Distributed Cyber Warfare Operations, Project 674541, Platforms, in order to provides additional clarity and structure to the Distributed Cyber Warfare Operations portfolio."
                        },
                        "ProjectMissionDescription": {
                            "val": "DCWO conducts Research, Development, Testing and Evaluation (RDT&E) leading to operations-ready cyberspace superiority capabilities including the transition of efforts from laboratory, industry, and academia via studies, accelerated prototyping, and technology demonstrations. DCWO consists of a portfolio of programs and projects providing the rapid acquisition of operational cyber capabilities. DCWO effectiveness comes from balancing funding among three capability thrust areas required for cyber warfare operations: Air Force Platforms, Access and Payloads. The DCWO portfolio provides capabilities in these three areas that when tied together provide cyber effects to Combatant Commanders. Cyber platforms serve as the primary operator interface in the DCWO portfolio and projects encompass hardware and software development.\n\nThe platform capability provides user interface and controls by leveraging industry and other Government\/non-Government mission partners' applications and programs.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver Air Force Distributed Cyber Warfare Operations capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platforms"
                                    },
                                    "Description": {
                                        "val": "The Cyber Mission Platform (CMP) program is an ACAT III program of record that provides a modular, configurable framework for Cyber Operations. The CMP framework is currently being applied to offensive cyber operations and may also be applied to defensive cyber operations in the future as prioritized by CMP stakeholders. CMP uses an Agile acquisition strategy that allows the USAF to dynamically prioritize the delivery of operational capabilities. CMP develops capability enhancements on a regular cadence and delivers them to operations based on operational need and acceptance timelines. The platform project also includes platform integration development activities necessary to integrate CMP into DCWO mission threads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.054"
                                            },
                                            "Text": {
                                                "val": "- Will continue enhancements to the CMP Platform to satisfy prioritized requirements from USAF Distributed Cyber Warfare Operations Mission Threads.\n\n- Will continue to conduct delta accreditation and fielding of updated CMP software. \n\n- Will continue to execute a continuous delivery program structure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- Funding decreased due to relative operational priorities between DCWO efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 834320"
                                    },
                                    "Title": {
                                        "val": "C3 Countermeasures"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.944"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.944"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.296"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.967"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.197"
                                        },
                                        "BudgetYearFive": {
                                            "val": "39.417"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 831010"
                                    },
                                    "Title": {
                                        "val": "Comsec Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.790"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.790"
                                        },
                                        "CostToComplete": {
                                            "val": "2.790"
                                        },
                                        "TotalCost": {
                                            "val": "5.580"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Distributed Cyber Warfare Operations program office will utilize Concept, Development, Risk Management, Production, or Deployment Plans as part of a streamlined approach to acquisition planning. All plans will contain sufficient information for the Milestone Decision Authority (MDA) to determine readiness to enter into the applicable phase of the acquisition process. Distributed Cyber Warfare Operations will utilize both new and existing contractual vehicles, such as Government-Wide Acquisition Contract (GWAC) vehicles (Alliant, Encore II, Solutions for Enterprise-Wide Procurement IV (SEWP IV)), and General Services Administration (GSA) Federal Supply Schedules and a Cyber Indefinite Delivery Indefinite Quantity (IDIQ) contract. The use of multiple-award contractual vehicles will provide a wide range of commercially-available products and services that should be able to meet many requirements related to Offensive Cyberspace Operations. These multiple-award contractual vehicles have already met the statutory requirements of the Competition in Contracting Act (CICA), which requires a fair opportunity to all contract holders, in accordance with Federal Acquisition Regulation (FAR) 16.505, unless an exception to fair opportunity applies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Platform Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.969"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.969"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Platform Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "47 CTS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.750"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.750"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PSC - Advisory & Assistance Services (A&AS & FFRDC Support)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.335"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.335"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Platform Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Cyber Mission Platform Continuous Delivery"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Platform Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "674542"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Tech Projects - Access\/Infrastructure"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "18.509"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.509"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.242"
                        },
                        "BudgetYearThree": {
                            "val": "15.912"
                        },
                        "BudgetYearFour": {
                            "val": "16.970"
                        },
                        "BudgetYearFive": {
                            "val": "17.552"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY20, PE 0208087F, Distributed Cyber Warfare Operations, Project 670375, Network Warfare Systems and Support access and infrastructure efforts were transferred to PE 0208087F, Distributed Cyber Warfare Operations, Project 674542, Cyber Tech Projects - Access\/Infrastructure, in order to provide additional clarity and structure to the Distributed Cyber Warfare Operations portfolio."
                        },
                        "ProjectMissionDescription": {
                            "val": "Distributed Cyber Warfare Operations (DCWO) conducts Research, Development, Testing and Evaluation (RDT&E) leading to operations-ready cyberspace superiority capabilities including the transition of efforts from laboratory, industry, and academia via studies, accelerated prototyping, and technology demonstrations. DCWO consists of a portfolio of programs and projects providing the rapid acquisition of operational cyber capabilities. DCWO effectiveness comes from balancing funding among three capability thrust areas required for cyber warfare operations: Air Force Platforms, Access and Payloads. The DCWO portfolio provides capabilities in these three areas that when tied together provide cyber effects to Combatant Commanders. Cyber access capabilities enables a variety of DCWO missions and projects encompass hardware and software development.\n\nThe Access capability provides connectivity and required infrastructure by leveraging industry and other Government\/non-Government mission partners' applications and programs.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver Air Force Distributed Cyber Warfare Operations capabilities. The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Access"
                                    },
                                    "Description": {
                                        "val": "The Access capability provides connectivity and required infrastructure by leveraging industry and other Government\/non-Government mission partners' applications and programs.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.509"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.509"
                                            },
                                            "Text": {
                                                "val": "- Will continue to develop Air Force unique connectivity and required infrastructures across multiple spectrums leveraging industry and other Government\/non-Government mission partner's applications and programs.\n\n- Will continue to develop and transition Offensive Cyber Operations (OCO) quick reaction capabilities for next-generation DCWO weapon system supporting requirements from DCWO Mission Threads.\n\n- Some aspects of the effort are classified and will be provided on a need to know basis. For further information please contact AFLCMC\/HNCO, 210-925-6653."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- Funding decreased due to relative operational priorities between DCWO efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 834320"
                                    },
                                    "Title": {
                                        "val": "C3 Countermeasures"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.154"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.154"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.843"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.207"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.318"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.869"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Distributed Cyber Warfare Operations program office will utilize Concept, Development, Risk Management, Production, or Deployment Plans as part of a streamlined approach to acquisition planning. All plans will contain sufficient information for the Milestone Decision Authority (MDA) to determine readiness to enter into the applicable phase of the acquisition process. Distributed Cyber Warfare Operations will utilize both new and existing contractual vehicles, such as Government-Wide Acquisition Contract (GWAC) vehicles (Alliant, Encore II, Solutions for Enterprise-Wide Procurement IV (SEWP IV)), and General Services Administration (GSA) Federal Supply Schedules and a Cyber Indefinite Delivery Indefinite Quantity (IDIQ) contract. The use of multiple-award contractual vehicles will provide a wide range of commercially-available products and services that should be able to meet many requirements related to Offensive Cyberspace Operations. These multiple-award contractual vehicles have already met the statutory requirements of the Competition in Contracting Act (CICA), which requires a fair opportunity to all contract holders, in accordance with Federal Acquisition Regulation (FAR) 16.505, unless an exception to fair opportunity applies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Access Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.386"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.386"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Access Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "47 CTS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.760"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.760"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PSC - Acquisition Support (Various)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.363"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.363"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Access Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "AF Unique Access"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Next-Gen Offensive Cyber Operations Weapon System"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DCWO Infrastructure Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}