{
    "id": "2020-Army-PB-2040-JBOOK-caa98a5fe7b001fc6e9636b55add742024da70b1a5204a85a180c10adbb25455-6",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602143A"
        },
        "ProgramElementTitle": {
            "val": "Soldier Lethality Technology"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "0"
            },
            "BudgetYearOne": {
                "val": "115.274"
            },
            "BudgetYearOneBase": {
                "val": "115.274"
            },
            "BudgetYearTwo": {
                "val": "126.345"
            },
            "BudgetYearThree": {
                "val": "136.958"
            },
            "BudgetYearFour": {
                "val": "140.057"
            },
            "BudgetYearFive": {
                "val": "141.390"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "660.024"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020, this Program Element (PE) is realigned with continuity of effort from the following PEs:\n* 0602105A Materials Technology\n* 0602308A Advanced Concepts and Simulation\n* 0602618A Ballistics Technology\n* 0602623A Joint Service Small Arms Program\n* 0602624A Weapons and Munitions Technology\n* 0602705A Electronics and Electronic Devices\n* 0602709A Night Vision Technology\n* 0602712A Countermine Systems\n* 0602716A Human Factors Engineering Technology\n* 0602786A Warfighter Technology"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE conducts fundamental research on Soldier Lethality technologies to develop an integrated Soldier and Squad architecture of equipment and systems that improve Soldier and Small Combat Unit survivability, sustainability, mobility, combat effectiveness, and individual cognitive and physical readiness. To address the challenges of integrating multiple technologies and sub-systems, research conducted in this PE, significant Science and Technology applied research investments in all areas of Soldier Lethality focus on how to improve the effectiveness of the technologies a Soldier utilizes and apply systems-level practices to mitigate constraints from size and weight of the equipment. Research areas encompass individual and crew-served weapon designs and technologies as well as applied research in lightweight and transparent armor materials to mitigate effects from blast and ballistic threats, counter explosive hazard detection, counter-sensor capabilities, and signature management of weapons, equipment, personnel and high value targets. This PE investigates, develops and designs materials, technologies, methodologies and system models required to experiment and optimize Soldier lethality and survivability through investments in mobility, human-agent teaming, and improved situational awareness interfaces and display technologies as well as to provide Soldier-borne power and energy materials and components that support multiple Soldier-borne systems. This PE also investigates Warfighter training technologies and develops the underpinning technologies to establish architecture standards and interfaces necessary for creating realistic synthetic environments to create a single, interconnected synthetic training system to enable Army units and leaders to conduct realistic multi-echelon \/ multi-domain combined arms maneuver and mission command training, increasing proficiency through repetition. Human Factors Engineering projects conduct applied research to design weapon systems standards, guidelines, handbooks, and Soldier training curriculum and tools. \n\nResults of these efforts are transitioned within the Army Futures Command, the Program Executive Offices, Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC).\n\nWork in this PE complements PE 0603118A, Soldier Lethality Advanced Technology.\n\nThere are no new starts in this Program Element.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "115.274"
                },
                "BudgetYearOneBase": {
                    "val": "115.274"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "115.274"
                },
                "BudgetYearOneBase": {
                    "val": "115.274"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "115.274"
                                },
                                "BudgetYearOneBase": {
                                    "val": "115.274"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 increase related to Science and Technology financial restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AN1"
                    },
                    "ProjectTitle": {
                        "val": "Narrowband SATCOM Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4"
                        },
                        "BudgetYearOneBase": {
                            "val": "4"
                        },
                        "BudgetYearTwo": {
                            "val": "1"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is realigned from: \nProgram Element (PE) 0602782A Command, Control, Communications Technology Project:\n* Project H92 Communications Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs and develops technologies to enable gateway communications across disparate Narrowband Satellite Communications (SATCOM) networks, enabling resiliency in contested environments.  The Narrowband SATCOM network is the largest tactical network operated by the Army to provide situational understanding across all echelons.  This project investigates technologies and protocols to enable risk mitigation solution sets and awareness through adaptive learning capabilities. Fiscal Year (FY) 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project complements PE 0603463A (Network C3I Advanced Technology) \/ Project AN2 (Narrowband SATCOM Advanced Technology).  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Narrowband Satellite Communication Technology"
                                    },
                                    "Description": {
                                        "val": "This research effort designs and develops technologies to enable gateway communications across disparate Narrowband SATCOM networks, enabling resiliency in contested environments.  The Narrowband SATCOM network is the largest tactical network operated by the Army to provide situational understanding across all echelons. This project investigates technologies and protocols to enable risk mitigation solution sets and awareness through adaptive learning capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Will design and develop an agile, network-defined architecture to enable core network transport capabilities that can interface with, and control traditional and non-traditional Narrowband networks; and develop and mature functional components required to integrate assured, resilient network transport operations in a mobile, congested and contested environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort is realigned from PE 0602782A (Command, Control, Communications Technology) \/ Project H92 (Communications Technology) in FY 2020 as part of the financial restructure, and supports the Army?s Modernization Priorities."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AY6"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Squad Small Arms Armaments Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "18.345"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.345"
                        },
                        "BudgetYearTwo": {
                            "val": "18.316"
                        },
                        "BudgetYearThree": {
                            "val": "17.577"
                        },
                        "BudgetYearFour": {
                            "val": "14.988"
                        },
                        "BudgetYearFive": {
                            "val": "15.145"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "84.371"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nPE 0602623A Joint Service Small Arms Program\n* Project H21 Joint Service Small Arms Program (JSSAP)\nPE 0602618A Ballistics Technology\n* Project H80 Soldier Protection Technology - Vulnerability \nPE 0602716A Human Factors Engineering Technology\n* Project H70 Human Factors Engineering System Development"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates individual and crew-served weapon designs and technologies that enhance the fighting capabilities and survivability of the dismounted Warfighter in support of all of the Services. In addition, it conceives and advances weapon concepts based on innovative ballistic and advanced incapacitation technologies that will enhance the defeat of hard and soft infantry targets at extended ranges based upon the Joint Service Small Arms Technology Development Strategy (JSATDS). The Project will continue to support technology needs from the all Services to include the Next Generation Family of Weapons. In addition, this Project will develop the technology\/weapons concepts that will upgrade medium and heavy support weapons at echelons. Finally, this Project will perform research directed toward non-kinetic modalities to incapacitate combatants. \n\nWork in this Project supports key Army needs and leverages the technical research of several PEs to include PE 0601102A (Defense Science Research) \/ Project AA7 (Mechanics and Ballistics), PE 0603118A (Soldier Lethality Advanced Technology) and PE 0602141A (Lethality Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier\/Squad Lethality Technology"
                                    },
                                    "Description": {
                                        "val": "This effort conceives, investigates and demonstrates advanced weapons concepts based on innovative ballistic technologies that will enhance the defeat of hard and soft infantry targets at extended ranges to ensure overmatch in Soldier and squad lethality. This effort will also perform research directed toward non-ballistic modalities to incapacitate combatants."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.239"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.239"
                                            },
                                            "Text": {
                                                "val": "Will identify novel lethal mechanisms for future weapons concepts and technical approaches to for increased lethality at reduced energy for behind armor\/barrier threats; identify and characterize technology concepts to enable a 50% reduction in dispersion for complex design projectiles; identify and demonstrate mechanisms for incapacitation through synthetic motor control in animal models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602623A (Joint Service Small Arms Program) \/ Project H21 (Joint Service Small Arms Program (JSSAP)), PE 0602618A (Ballistics Technology) \/ Project H80 (Soldier Protection Technology - Vulnerability), and PE 0602716A (Human Factors Engineering Technology) \/ Project H70 (Human Factors Engineering System Development) in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Agent Interactions for Intelligent Squad Weapons"
                                    },
                                    "Description": {
                                        "val": "This effort investigates enhanced target acquisition, situational awareness, and shooting performance through Soldier-centered integration of intelligent technologies and distributed information in augmented squad weapons. Enhances operational performance of individuals and teams of Soldiers through novel weapon and human-agent interaction technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.575"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques to improve the Automated Target Recognition (ATR) training algorithms based on Soldier feedback to mitigate the severe size, weight and power (SWAP) constraints inherent in Soldier-carried weapons."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602623A (Joint Service Small Arms Program) \/ Project H21 (Joint Service Small Arms Program (JSSAP)), PE 0602618A (Ballistics Technology) \/ Project H80 (Soldier Protection Technology - Vulnerability), and PE 0602716A (Human Factors Engineering Technology) \/ Project H70 (Human Factors Engineering System Development) in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Carbine Technology (NGCT)"
                                    },
                                    "Description": {
                                        "val": "This effort develops next generation squad weapon systems and ammunition by providing tech insertions to augment capabilities and mitigate risks. Mature small arms weapon system components and validate them through experimentation in support of the Joint Warfighter?s capability needs. Mature weapon system technology readiness levels and validate confidence of functionality in advanced operating scenarios."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Will validate recoil and shock pressures and determine metrics to compensate for increased muzzle velocity; conduct experiments on Next Generation Carbine Technology systems to ascertain probability of incapacitation effects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602623A (Joint Service Small Arms Program) \/ Project H21 (Joint Service Small Arms Program (JSSAP)), PE 0602618A (Ballistics Technology) \/ Project H80 (Soldier Protection Technology - Vulnerability), and PE 0602716A (Human Factors Engineering Technology) \/ Project H70 (Human Factors Engineering System Development) in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Family of Ammo (NGFoA)"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops a family of ammunition for automatic rifles and carbine weapons with the objective of decreasing weight, increasing lethality and hit performance over current fielded systems; develop capabilities to defeat threat targets out to 600 meters."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.5"
                                            },
                                            "Text": {
                                                "val": "Will conduct propulsion research and experiments to determine pressure, time and velocity of weapon systems; develop the Next Generation Family of Ammunition Combat Tracer; mature component technologies for projectile design, soft\/hard target and launch optimization, and modeling and simulation support for validation of capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602623A (Joint Service Small Arms Program) \/ Project H21 (Joint Service Small Arms Program (JSSAP)), PE 0602618A (Ballistics Technology) \/ Project H80 (Soldier Protection Technology - Vulnerability), and PE 0602716A (Human Factors Engineering Technology) \/ Project H70 (Human Factors Engineering System Development) in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops small arms weapon systems, enablers, and ammunition technologies that will maintain decisive lethal overmatch capabilities to the Joint Warfighter. This effort matures small arms weapon system designs through experimentation in support of Joint Warfighter?s capability needs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.531"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.531"
                                            },
                                            "Text": {
                                                "val": "Will investigate the advanced weapon operating technologies (recoil, accuracy, signature, materials, controllability, maintainability, materials, and coatings); conduct experiments on Small Arms Remote Weapon Stations to include component technology in the areas of advanced target recognition, next generation weapon system and lightweight stabilized mounts to enable an increase in the probability of hit on a target."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602623A (Joint Service Small Arms Program) \/ Project H21 (Joint Service Small Arms Program (JSSAP)), PE 0602618A (Ballistics Technology) \/ Project H80 (Soldier Protection Technology - Vulnerability), and PE 0602716A (Human Factors Engineering Technology) \/ Project H70 (Human Factors Engineering System Development) in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "AY8"
                    },
                    "ProjectTitle": {
                        "val": "Small Arms Fire Control Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "4.228"
                        },
                        "BudgetYearFour": {
                            "val": "4.122"
                        },
                        "BudgetYearFive": {
                            "val": "4.168"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.518"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "AZ2"
                    },
                    "ProjectTitle": {
                        "val": "Body Armor & Integrated Headborne Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "8.427"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.427"
                        },
                        "BudgetYearTwo": {
                            "val": "8.081"
                        },
                        "BudgetYearThree": {
                            "val": "8.753"
                        },
                        "BudgetYearFour": {
                            "val": "8.928"
                        },
                        "BudgetYearFive": {
                            "val": "9.027"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "43.216"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing & Equipment Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops materials for Soldier-borne protective equipment, such as body armor and combat helmets, to increase protection from ballistic, blast, and blunt impact threats. This Project also investigates and executes systematic studies to mature and develop materials, devices, systems and methods that enable the identification of protective solutions against ballistic, blast and directed energy threats. Included are investigations of emerging technologies, novel materials, and test methods and integration of personnel armor, combat helmets, hearing protection, eyewear, and other personal protective equipment items. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Body Armor & Integrated Headborne Technology"
                                    },
                                    "Description": {
                                        "val": "This research effort supports the investigation of novel materials, component designs, and material modeling to design and develop technologies that protect Soldiers against ballistic, blast, and directed energy threats. This effort utilizes a cross-disciplinary, human-focused approach to develop technologies which optimize tradeoffs in ballistic and blast protective component design. This effort addresses the Army challenge of easing overburdened Soldiers in small units and aligns to Soldier protection modernization priorities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.427"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.427"
                                            },
                                            "Text": {
                                                "val": "Will advance research toward material and technology development in support of an integrated single lens substrate for use in a Soldier vision protection systems that improves variable light transmission lenses with laser flash and dazzle protection, will investigate high hardness coatings, as well as experiments on alternative technologies to mitigate lens deterioration and extend operational life; will mature the performance envelope of a repeatable laboratory test method that is capable of evaluating the performance of head-borne equipment in a simulated near free-field blast overpressure environment; will develop modeling and analysis tools to quantify the terminal ballistic loading of small arms threats to the combat helmet and head to assist the scaling of head injury criteria to inform future helmet performance and injury biomechanics; will systematically investigate material composite pre-stress processing methods to increase ballistic material mechanical properties during composite laminate processing to enhance ballistic performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project H98 (Clothing & Equipm Tech) in FY20 as part of the financial restructure.."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AZ5"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Protection Technology - Vulnerability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "8.104"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.104"
                        },
                        "BudgetYearTwo": {
                            "val": "12.26"
                        },
                        "BudgetYearThree": {
                            "val": "13.671"
                        },
                        "BudgetYearFour": {
                            "val": "15.162"
                        },
                        "BudgetYearFive": {
                            "val": "15.33"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "64.527"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602105A Materials Technology\n* Project H84 Materials\nPE 0602618A Ballistics Technology\n* Project H80 Survivability and Lethality Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops materials, methods, and models that enable design and integration of emerging material technologies into lightweight, flexible and modular Soldier equipment to protect against the range of existing and emerging threats for head, torso, and extremity protection. Specific research thrusts include the development of materials and mechanisms to enhance ballistic protection; computational models and associated experiments to provide a fundamental understanding of material properties and failure mechanisms, as well as correlation to ballistic\/blast\/blunt impact performance of Soldier personal protective equipment (PPE) and improved fibers, composite and ceramic materials.  Specific technologies include experimental helmets that reduce impact and blast loading to the head, Soldier torso protection systems to increase protection from ballistic and blunt impacts, and novel fibers and fabrics that provide additional survivability mechanisms.   \n\nWork in this Project supports key Army needs and is fully coordinated with several PEs to include PE 0602143A (Soldier Lethality Technology) and 0603118A (Soldier Lethality Advanced Technology); and leverages the technical research of several PEs to include PE 0601102A (Defense Research Sciences) \/ Project AA7 (Mechanics and Ballistics) and 0602144A (Ground Technology) \/ Project BL1 (Materials and Manufacturing Research Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops integrated lightweight, flexible and modular protection equipment that is tailored to support the 'Soldier as a system' approach for defeat of emerging threats. Research areas encompass high fidelity ballistic impact injury models for hard and soft tissues, novel ceramic architectures to include graded and hierarchically structured ceramics, and novel fiber solutions for backing materials to deliver soldier protection systems to meet emerging ballistic and signature management threats. This effort supports small caliber lethal mechanisms research in PE 0602143A (Soldier Lethality Technology) \/ Project AY6 (Soldier Squad Small Arms Armaments Technology)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.131"
                                            },
                                            "Text": {
                                                "val": "Will perform computational\/experimental analysis of disruption mechanisms against legacy bullet technologies; simulate helmet\/pad\/head interaction for various loading scenarios; investigate soft tissue and hard tissue injury mechanisms; explore new concepts in limb protection from blast events; develop armor model to explore behind armor blunt trauma metrics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602105A (Materials Technology) \/ Project H84 (Materials) and PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability And Lethality Technology) in FY 2020 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier-Borne Composite Materials"
                                    },
                                    "Description": {
                                        "val": "Utilizing understanding of fibers, fabrics, and composite materials, conduct applied research of emerging lightweight materials and structures to enable affordable designs for head, torso, and extremity protection systems. Provide quantitative scientific basis for modeling and simulation that result in materials that utilize new schemes to enhance Warfighter survivability. This effort supports Soldier Protection Technologies bullet."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.679"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate efficient and complete synthesis of novel fibers and films for soft body armor and head protection solutions; demonstrate computational framework of multi-physics-based helmet process models that simulate the thermoforming of compound curvature geometries providing process-induced microstructure and process histories that serve as critical input into ballistic impact simulations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602105A (Materials Technology) \/ Project H84 (Materials) and PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability And Lethality Technology) in FY 2020 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier-Borne Advanced Protection Materials"
                                    },
                                    "Description": {
                                        "val": "Utilizing understanding of protection materials such as armor ceramics and associated failure mechanisms, conduct applied research of emerging armor materials to enable affordable design of lightweight ballistic protective systems for the future Soldier. Provide quantitative scientific basis for modeling and simulation that result in materials that utilize new lethal mechanisms\/protection schemes for the individual Warfighter. This effort supports Soldier Protection Technologies bullet and small caliber lethal mechanisms research in PE 0602143A (Soldier Lethality Technology) \/ Project AY6 (Soldier Squad Small Arms Armaments Technology),"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.294"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.294"
                                            },
                                            "Text": {
                                                "val": "Will develop processing pathways to fabricate armor ceramic with novel multiscale heterogeneity and characterize ballistic performance; create experimental technique to characterize ceramic blends and ceramic failure to include the fragment size distribution and the subsequent flow of damaged material under tri-axial states of stress."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602105A (Materials Technology) \/ Project H84 (Materials) and PE 0602618A (Ballistics Technology) \/ Project H80 (Survivability And Lethality Technology) in FY 2020 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "AZ9"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Protection Advanced Tech - Detectability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.5"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.5"
                        },
                        "BudgetYearTwo": {
                            "val": "5.294"
                        },
                        "BudgetYearThree": {
                            "val": "7.181"
                        },
                        "BudgetYearFour": {
                            "val": "6.883"
                        },
                        "BudgetYearFive": {
                            "val": "6.964"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "30.822"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A  Warfighter Technology\n* Project H98  Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and designs novel materials, technologies, techniques and applications increasing the capabilities of camouflage and concealment against known and emerging sensor threats.  The results of this project enable effective deception capabilities, combinations of physical and electronic signature decoy components, and determination of analytical processes for modeling signature management technologies during multi-domain operations. These technologies will provide subsystems and concepts that shall decrease the probability of detection and targeting by peer and near-peer adversaries, enabling freedom of movement of semi-independent and dispersed formations and increased protection of high-valued assets.  Components designed under this project will transition to Advanced Technology Development efforts in Soldier Lethality protection\/survivability Projects to provide disruptive Camouflage, Concealment and Deception technologies to the Operational Army to support expeditionary maneuver in the Multi-Domain Battle Environment and retain windows of advantage. \n\nWork in this Project supports key Army needs and leverages\/complements the technical research of several PEs to include PE 0601102A (Defense Research Sciences), PE 0602143A (Soldier Lethality Technology) \/ Project BB4 (Dismounted Soldier Survivability Materials), Project AZ5 (Soldier Protection Technology - Vulnerability), Project BE1 (Support Technology to Mission Command), PE 0603118A (Soldier Lethality Advanced Technology) \/ Project AZ8, (Soldier - Small Unit Detectability Adv Technology),  and PE 0602712A (Countermine Systems) \/ Project H35 (Camouflage and Counter-Recon Tech).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Camouflage, Concealment and Decoys Technologies for Soldier and High-Value Assets"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs materials, processes, and concepts for innovative camouflage, concealment and deception technologies for Soldier and High-Value assets to defeat advanced current and emerging adversary Intelligence, Surveillance and Reconnaissance (ISR) threats including, multispectral, hyperspectral and Light Detection and Ranging (LiDAR) sensors, and to reduce the probability of detection in multi-domain operations.  Investigates analytical processes to model material and system performance and predict probability of detection in the multi-domain operational environment, assisting in closing the capability gap between current camouflage, concealment, and deception technologies and defeating enemy sensorial capabilities in future operating environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.5"
                                            },
                                            "Text": {
                                                "val": "Will validate preliminary performance effectiveness of camouflage technologies under development; determine design metrics to discern performance of candidate camouflage system solutions in support of future hyperspectral and LiDAR sensor defeat; investigate analytical models for predicting performance; determine the effectiveness of candidate decoy systems in deceiving peer and near-peer adversaries; mature versatile optical film technology for standoff-based signature concealment in visual and near infrared spectral ranges to camouflage to conceal Soldiers and small ground assets; conduct experiments to assess dismounted Soldier vulnerability against enemy ground surveillance radar; investigate flexible Soldier worn materials to reduce Soldier radar cross section; explore active color changing materials for potential Soldier clothing and individual equipment; Investigate near infrared, identification of friend versus foe capability for the individual Soldier."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project H98 (Clothing & Equipm Tech) in FY 2020 as part of financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB4"
                    },
                    "ProjectTitle": {
                        "val": "Dismounted Soldier Survivability Materials"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.946"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.946"
                        },
                        "BudgetYearTwo": {
                            "val": "3.946"
                        },
                        "BudgetYearThree": {
                            "val": "5.187"
                        },
                        "BudgetYearFour": {
                            "val": "5.539"
                        },
                        "BudgetYearFive": {
                            "val": "5.615"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.233"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A  Warfighter Technology\n* Project H98 Clothing and Equipment Technologies"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates fibers, textiles, components, and materials focused on enhancing Soldier survivability from combat threats (flame and thermal, blast and ballistic, multispectral sensor, and laser threats) and environmental threats (e.g., cold, heat, wet, vector, antimicrobial, etc.) to increase operational effectiveness while decreasing the Soldier's physical and cognitive burden. The results from this Project will transition knowledge, materials, subcomponents and methods to Advanced Technology Development efforts in support of enhancing Soldier Lethality by providing protective material solutions focused on the aspects of dismounted movement and maneuver operations of the Army. This Project develops and applies validation methods that enable systematic studies of human systems integration principles and practices to protective equipment materials and designs to advance the understanding of trade-offs between protection, lethality and mobility.\n\nWork in this Project supports key Army needs and leverages\/complements the technical research of several PEs to include PE 0601102A (Defense Research Sciences), PE 0602143A (Soldier Lethality Technology) \/ Project AZ5 (Soldier Protection Technology - Vulnerability), Project BB4 (Dismounted Soldier Survivability Materials), and PE 0603118A Soldier Lethality Advanced Technology\/ Project BB3,Dismounted Soldier Survivability Equip\/Tech Integ.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Survivability Materials"
                                    },
                                    "Description": {
                                        "val": "This effort investigates materials, devices and methods that aid in the design and development of multifunctional materials for Soldier protective clothing and individual equipment. This effort conducts research to investigate and identify multi-functional material properties at the micron and sub-micron level to mitigate Soldiers susceptibility and vulnerability to operational threat, i.e., flame, thermal, environmental, and multispectral sensors. Efforts also investigate and develop devices and systems that enable extended dismounted mission durations by reducing the demand for water resupply and enabling squad organic water filtration systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.946"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.946"
                                            },
                                            "Text": {
                                                "val": "Will develop and conduct experiments on novel textile architectures and weaves to provide protection against microwave frequency threats through reflection and scattering of directed energy; determine the efficacy of novel sensors that systematically measure heat flux during system and component flame resistance testing to quantify body region burn injuries; and explore materials and processes that enable individual Soldiers to desalinate contaminated water for hydration during emergency and extended semi-independent operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project H98 (Clothing and Equipment Technologies) in FY 2020 as part of the financial structure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB5"
                    },
                    "ProjectTitle": {
                        "val": "Physical Augmentation: Tech for Human Interactions"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.5"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.5"
                        },
                        "BudgetYearTwo": {
                            "val": "1.5"
                        },
                        "BudgetYearThree": {
                            "val": "1.5"
                        },
                        "BudgetYearFour": {
                            "val": "1.5"
                        },
                        "BudgetYearFive": {
                            "val": "1.517"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.517"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project advances the understanding of human augmentation and interaction for enhanced operational performance with a focus on adaptation, training, human variability, metrics\/methodologies for assessment, and task quantification.  Research encompasses conducting applied research to develop metrics, measures, tools, and techniques to quantify and understand the relationships that enable maximum effectiveness of integrated Soldier-augmentation technologies. The resulting data are the basis for physical augmentation systems and equipment design standards, guidelines, and intelligent agent requirements to improve equipment operation and Soldier-system synergy. Application of this research will yield reduced workload, reduced Soldier training requirements, enhanced Soldier lethality\/survivability, user acceptance, and allow Soldiers to achieve maximum performance. Major efforts explore novel techniques for Soldier assessment, characterization of individual variability effects on performance, development of evidence based design guidance for the application of augmentation technologies, exploration of the relationship of exoskeleton and physical assist device adaptation and baseline Soldier parameters such as gait, neuromuscular motor control and proprioception. This Project will also explore novel training paradigms for reduced Soldier-augmentation technology adaptation times to address current and future warrior performance issues. Individual efforts exploit wearable sensor technologies, translate surrogate task performance to operational outcomes, develop approaches to distinguish tasks and individual state and intent of movement, establish database of human movement variability to inform intelligent system design, and identify high impact applications of augmentation. \n\nWork in this Project supports key Army needs and leverages the technical research of several PEs to include PE 0602143A (Soldier Lethality Technology) \/ Project BC2 (Next Gen Mobility & Lethality Tech for Warfighters), Project BB9 (Human Performance Tech for Mobility & Lethality), and Project BC6 (Human Perf - Tech for Warfighter Enhancement) and supports PE 0603118A (Soldier Lethality Advanced Technology) \/ Project BC1 (Human Performance AdvTech for Mobility & Lethality), Project BB6 (Physical Augmentation: Adv Tech for Field Demo), and Project BB8 (Soldier Centric Advanced Technology).  Additionally, work in this Project complements and is fully coordinated with the Medical Research and Materiel Command under the Military Operational Medicine Research Program within PE 0602787A (Medical Technology) \/ Project 869 (Warfighter Health Prot & Perf Stnds), and the Veteran Administration's exoskeleton research area. This Project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Protection, Sustainment, and Warfighter Performance and with our international partners through The Technical Cooperation Program \/ Human Resources and Performance Group \/ Panel JP1 (TTCP HUM JP1).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Training Adaptation and Movement Science"
                                    },
                                    "Description": {
                                        "val": "This effort investigates the science behind movement for physical augmentation to maximize mobility capacity and training adaptation to decrease learning curve with physical augmentation systems (e.g. physical assist devices, exoskeletons).  This work will enable the Army to make informed decisions on the ultimate effectiveness of human augmentation technologies before significant resources are expended."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to understand how Soldiers adapt to using physical augmentation\/exoskeleton type devices; investigate factors that predict slow vs fast adaptation to design training interventions so physical augmentation systems are utilized optimally for the greatest performance benefit; investigate bio-signals that predict change in human movement to develop design criteria for augmentation systems that are capable of anticipating changes in movement states (e.g. walk to sprint) and adjusting in real time."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project H98 (Clothing and Equipm Tech, and PE 0602716A Human Factors Engineering Technology \/Project H70 (Human Fact Eng Sys Dev) in FY 2020 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB7"
                    },
                    "ProjectTitle": {
                        "val": "Exoskeleton: Technology for Man-Machine Interface"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.6"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.6"
                        },
                        "BudgetYearTwo": {
                            "val": "1.6"
                        },
                        "BudgetYearThree": {
                            "val": "1.632"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.832"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602716A Human Factors Engineering Technology\n* Project H70 Human Fact Eng Sys Dev"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research on metrics, measures, tools, and techniques to understand the relationships which enable maximum effectiveness of integrated Soldier-augmentation technologies. The resulting data are the basis for physical augmentation systems and equipment design standards, guidelines, and intelligent agent requirements to improve equipment operation and Soldier-system synergy. Application of this research will yield reduced workload, reduced Soldier training requirements, enhanced Soldier lethality\/survivability, user acceptance, and allows the Soldier and systems to jointly achieve maximum performance. Major efforts explore novel techniques for Soldier assessment, characterization of individual variability effects on performance, and development of evidence based design guidance for the application of augmentation technologies to address current and future warrior performance issues. Individual efforts exploit wearable sensor technologies, translate surrogate task performance to operational outcomes, develop approaches to distinguish tasks and individual state, establish database of human movement variability to inform intelligent system design, and identify high impact applications of augmentation.\n\nResults of these efforts are transitioned to the Research, Development, and Engineering Centers, Program Executive Offices (PEO), Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Exoskeleton"
                                    },
                                    "Description": {
                                        "val": "This effort will accelerate Soldier lifting and mobility capabilities through exoskeleton systems with improved safety and reduced training requirements."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.6"
                                            },
                                            "Text": {
                                                "val": "Will refine surrogate tasks and associated performance metrics for dismounted operations scenario and begin developing consolidated assessment approach; investigate relationships between human movement variability and performance outcomes for quasi-operational dismounted Soldier tasks; investigate trade-offs between physical task requirements and performance outcomes, and develop approaches to classify and discriminate between tasks to support optimization of intelligent system design and control parameters."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602716A (Human Factors Engineering Technology) \/ Project H70 (Human Fact Eng Sys Dev) in FY 2020 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BB9"
                    },
                    "ProjectTitle": {
                        "val": "Human Performance Tech for Mobility & Lethality"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.5"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.5"
                        },
                        "BudgetYearTwo": {
                            "val": "1.5"
                        },
                        "BudgetYearThree": {
                            "val": "1"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates human performance based information portrayal system design parameters that integrate mobility & lethality considerations (such as cognitive workload, target discrimination and engagement, and fatigue) into training\/education tools, mission command platforms, and technologies that help Soldiers more rapidly and efficiently acquire complex skills and make decisions quickly from training through mission planning and execution. \n\nWork in this Project directly supports integration of design guidance for multiple PE\/Projects including PE 0603118A (Soldier Lethality Advanced Technology) \/ Project BD7 (Soldier Sys Interfaces\/ Integration-Sensor Adv Tech), Project AY9 (Body Armor & Integrated Headborne Advanced Tech), and Project BC9 (Adv Soldier Sensors\/Displays AdvTech for Dismounts). \n\nWork in this Project complements and is fully coordinated with the Medical Research and Materiel Command under the Military Operational Medicine Research Program as well as Defense Medical Research and Development Program under Military Operational Medicine (JPC-5). This Project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Systems Interfaces & Cognitive Processes. Work in this Project supports key Army needs and leverages the technical research efforts at the Simulation and Training Technology Center to support synthetic training environments.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy, as well as the Office of the Secretary of Defense Close Combat Lethality Task Force.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Interaction for Situational Understanding"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and develops design guidance for information portrayal systems and sub-systems in augmented\/virtual reality that enable Soldiers to make better, faster decisions for close combat operations at the small unit level. This effort also conduct experiments to populate performance models that have application across materiel and non-materiel solutions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.5"
                                            },
                                            "Text": {
                                                "val": "Will investigate impact of multimodal cuing (e.g. audio, visual, haptic) in augmented and virtual reality on decision making with navigation and target engagement in simulated operational environments; measure Soldiers response time, cognitive burden, behavioral, physiological and neurophysiological responses to inform what and how information should be portrayed to a Soldier in order for it to be meaningful and actionable."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project H98 (Clothing and Equipm Tech) in FY 2020 as part of the financial structure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC2"
                    },
                    "ProjectTitle": {
                        "val": "Next Gen Mobility & Lethality Tech for Warfighters"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5.678"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.678"
                        },
                        "BudgetYearTwo": {
                            "val": "5.221"
                        },
                        "BudgetYearThree": {
                            "val": "5.827"
                        },
                        "BudgetYearFour": {
                            "val": "2.596"
                        },
                        "BudgetYearFive": {
                            "val": "2.625"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.947"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates the means to monitor, assess and predict Soldier and squad shoot and move performance to provide design guidance for individual and mission specific equipment (e.g. individual protection, small arms, load carriage, etc.). Research conducted focuses on translating mission tasks to measures of human performance. These measures of human performance will inform predictive algorithms and human based modeling and simulation that enable Soldier performance trade space analysis for acquisition, training, and operations. These data and algorithms will allow us to determine the impact of new capabilities on Soldier and Squad performance and effectiveness. \n\nWork in this Project supports key Army needs and leverages the technical research of several PE\/Projects to include PE 0602143A (Soldier Lethality Technology) \/ Project BB9 (Human Performance Technology for Mobility & Lethality), Project BC2 (Next Gen Mobility & Lethality Tech for Warfighters), and Project BC6 (Human Perf - Tech for Warfighter Enhancement). This Project supports multiple Projects within PE 0603118A (Soldier Lethality Advanced Technology) including Project BB8 (Soldier Centric Advanced Technology), Project BC1 (Human Performance AdvTech for Mobility & Lethality), Project AY9 (Body Armor & Integrated Headborne Advanced Tech), Project AY5 (Soldier Squad Small Arms Armaments Advanced Technology), and Project BD7 (Soldier Sys Interfaces\/Integration-Sensor AdvTech), and Project BB6 (Physical Augmentation: Adv Tech for Field Demo). \n\nWork in this Project complements and is fully coordinated with the Medical Research and Materiel Command under the Military Operational Medicine Research Program as well as Defense Medical Research and Development Program under Military Operational Medicine (JPC-5). This Project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Protection, Sustainment, and Warfighter Performance. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy, as well as the Office of the Secretary of Defense Close Combat Lethality Task Force.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Interaction for Mobility & Lethality"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops human performance based design guidance for protection and weapon systems and sub systems to enable the mobility and lethality of individuals and small units. The applied research translates traditional means for measuring and understanding human performance to the means to conduct assessment for Warfighter and small unit readiness and\/or new capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.678"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.678"
                                            },
                                            "Text": {
                                                "val": "Will investigate physical and cognitive tolerances and fatigue on task performance with head borne systems with varying weight distribution properties (e.g. moment of inertia, center of gravity, etc.) to inform protective equipment designs; conduct experiments to populate movement & maneuver performance models that integrate with Nett Warrior and other programmed situational awareness systems; investigate, validate, and mature wearable sensor components that are surrogates for tactical tasks of shoot and move in order to provide the means for Soldier and Squad assessment for both training and test & evaluation purposes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project H98 Clothing and Equipm Tech) in FY 2020 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC3"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Decision Making & Comms Performance Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "10.759"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.759"
                        },
                        "BudgetYearTwo": {
                            "val": "9.875"
                        },
                        "BudgetYearThree": {
                            "val": "9.992"
                        },
                        "BudgetYearFour": {
                            "val": "6.112"
                        },
                        "BudgetYearFive": {
                            "val": "6.181"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "42.919"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602716A  Human Factors Engineering Technology\n* Project H70 Human Fact Eng Sys Dev\nPE 0602308A Advanced Concepts and Simulation\n* Project C90 Advanced Distributed Simulation"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research on Cyber Electromagnetic (CEMA) threat and friendly\/coalition counter CEMA efforts as well as human behavior variables that influence CEMA operations and the outcomes of CEMA attacks. The resulting outcomes create analytical and empirical capabilities to characterize, model, and forecast human behavior related to CEMA events through experimentation and field data collection.  The result is increased mission effectiveness that enables strong mission command, intelligence operations, and cyber defenses, which lead to high information sharing, situational awareness, and collaboration. Major efforts focus on applied research to understand the conduct of effective CEMA operations in that knowledge is required to create and effectively deploy cyber work systems that optimize human-machine interactions and account for operator and adversary behavior to achieve maximum effects.  This Project addresses Army gaps and needed capabilities by conducting cyber cognition and teaming assessments as well as studying human behaviors in CEMA-physical environments, attacker-defender-user dynamics, and Soldier-system integration challenges that underlie forces ability to converge kinetic, cyber and electromagnetic activities.  Results will inform technology selection and development, training assessments, system specifications, and operational planning.\n\nResults of these efforts are transitioned to Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Program Managers, Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy, as well as the Office of the Secretary of Defense Close Combat Lethality Task Force.\n\nFY 2020 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Performance in Sociotechnical Environments"
                                    },
                                    "Description": {
                                        "val": "This effort directly supports the Army?s Network\/C3I and Soldier Lethality modernization priority by enabling effective human performance in distributed network-enabled and Cyber Mission Force operations. The research provides human cyber operations assessment and advanced human decision-support capabilities required by our transition partners Communications and Electronics Research Development and Engineering Command (CERDEC) and Cyber Command (CYBERCOM) to deploy cyber work systems that optimize human-machine interactions and account for operator and adversary behavior.  Without these capabilities, future cyber work systems will be too complex and burdensome for operator use and training resulting in critical bottlenecks as operators have to \"catch-up\" with the speed of cyber activity."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.759"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.759"
                                            },
                                            "Text": {
                                                "val": "Will complete work on the mission monitoring and team workflow modeling capabilities effort; develop knowledge engineering (ontologies) and inferencing techniques to enable intelligent systems to draw conclusions about the state of the world and make recommendations for decision making; develop and document knowledge products capturing best-practices for the Cyber Mission Force in response to previously developed cyber-attacks and scenario events; initiate a decision-support technology research effort; create a decision aid to enable individuals and teams to respond more effectively to the cognitive challenges of networked operations and cyber domain by optimizing human-machine interactions; develop initial prototype development by integrating workflow and mission monitoring prototype with data sources; and apply tools in a representative mission environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This this research effort was realigned from PE 0602716A (Human Factors Engineering Technology) \/Project H70 Human Fact Eng Sys Dev) and PE 0602308 (Advanced Concepts and Simulation) \/ Project C90 Advanced Distributed Simulation) in FY 2020 as part of the financial structure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BC6"
                    },
                    "ProjectTitle": {
                        "val": "Human Perf - Tech for Warfighter Enhancement"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.676"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.676"
                        },
                        "BudgetYearTwo": {
                            "val": "2.826"
                        },
                        "BudgetYearThree": {
                            "val": "3.395"
                        },
                        "BudgetYearFour": {
                            "val": "1.419"
                        },
                        "BudgetYearFive": {
                            "val": "1.377"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.693"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98  Clothing and Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops mechanisms for safely and effectively optimizing and enhancing Warfighter ability to shoot, move, communicate, and decide. These mechanisms have the potential to exploit the Soldier and Squad as the capability platform beyond materiel solutions provided to the individual and small unit. This project also conducts experiments to populate human performance models that enable tradespace analysis for portions of doctrine, organization, training, materiel, leadership and education, personnel and facilities (DOTMLPF) analysis.\n\nThis Project is also fully coordinated and complementary with the following projects within PE 0602143A Soldier Lethality Technology: Projects BC2 (Next Gen Mobility & Lethality Tech for Warfighters), BB9 (Human Performance Tech for Mobility & Lethality) and BE3 (Joint Service Combat Feeding Technology).  It directly supports the following projects within PE 0603118A (Soldier Lethality Advanced Technology),  Projects BC1 (Human Performance AdvTech for Mobility & Lethality), BB8 (Soldier Centric Advanced Technology), BD7 (Soldier Sys Interfaces\/Integration-Sensor AdvTech)), BE2 (Joint Service Combat Feeding Advanced Technology). It also has potential to inform material solutions within PE 0603118A Soldier Lethality Advanced Technology for the Soldier\/Small unit.\n\nWork in this Project complements and is fully coordinated with the Medical Research and Materiel Command under the Military Operational Medicine Research Program as well as Defense Medical Research and Development Program under Military Operational Medicine (JPC-5). This Project also complements and is fully coordinated with work performed across Army, Navy, and Air Force under the Reliance 21 Human Systems Community of Interest: Protection, Sustainment, and Warfighter Performance. Work in this Project complements and is fully coordinated with research at the Army Research Laboratory (ARL).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy, as well as the Office of the Secretary of Defense Close Combat Lethality Task Force.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Performance Technology for Warfighter Enhancement"
                                    },
                                    "Description": {
                                        "val": "This effort investigates mechanisms for exploiting human physiology to develop safe and effective interventions that create smarter, faster, more lethal Close Combat Warfighters. This work will result in a Soldier?s ability to shoot, move, communicate and decide faster than an adversary.  Findings from these experiments will leverage existing systems and platforms to get the greatest human performance return in training and operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.676"
                                            },
                                            "Text": {
                                                "val": "Will conduct neurostimulation experiments to determine efficacy for tactically relevant improvements in skill acquisition and Warfighting tasks; conduct experiments with a benchtop gut microbiome model to identify ration components that use the gut\/brain connection to enhance and inform leap ahead gains in Soldier performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project H98 (Clothing and Equipm Tech) in FY 2020 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "@suppressProjectPDF": "true",
                    "ProjectNumber": {
                        "val": "BC7"
                    },
                    "ProjectTitle": {
                        "val": "Training Technology (Other than STE)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "9.174"
                        },
                        "BudgetYearThree": {
                            "val": "11.881"
                        },
                        "BudgetYearFour": {
                            "val": "13.306"
                        },
                        "BudgetYearFive": {
                            "val": "13.465"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "47.826"
                        }
                    },
                    "R2aExhibit": []
                },
                {
                    "ProjectNumber": {
                        "val": "BD1"
                    },
                    "ProjectTitle": {
                        "val": "Adv Soldier Sensors\/Displays Tech for Dismounts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.967"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.967"
                        },
                        "BudgetYearTwo": {
                            "val": "5.085"
                        },
                        "BudgetYearThree": {
                            "val": "5.208"
                        },
                        "BudgetYearFour": {
                            "val": "18.286"
                        },
                        "BudgetYearFive": {
                            "val": "18.49"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "52.036"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602709A Night Vision Technology\n* Project H95  Night Vision And Electro-Optic Technology\nPE 0602712A Countermine Systems\n* Project H24 Countermine Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops low power, next generation modular sensor and display components for detection and identification of both threats and friendlies in all environments. Work in this Project supports the Army Science and Technology Soldier Lethality, Next Generation Combat Vehicle, and Future Vertical Lift modernization priorities.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Soldier Sensors\/Displays Technology for Dismounts"
                                    },
                                    "Description": {
                                        "val": "This effort models, simulates, investigates, designs and develops novel low power, modular electro-optic \/ infrared (EO\/IR) and explosive hazard (EH) technologies, displays, augmented reality approaches and aided\/automatic target detection and recognition algorithms that enable improved Soldier maneuver and lethality through greater information fidelity and automated algorithms to increase Soldier probability of recognition\/identification and tracking of all threats. This effort is coordinated with PE 0603118A (Soldier Lethality Advanced Technology), PE 0603462A (Next Generation Combat Vehicle Advanced Technology), PE 0603463A (Network C3I Advanced Technology), PE 0603465A  (Future Vertical Lift Advanced Technology), and PE 0602145A (Next Generation Combat Vehicle Technology)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.967"
                                            },
                                            "Text": {
                                                "val": "Will develop methods to model and simulate EO\/IR system performance for computer-aided prototyping design models and augmented reality applications; model emerging active and passive EO\/IR technologies, applications, and threats (e.g. hostile fire and unmanned aerial systems) to support sensor system designs and combinations; investigate target acquisition performance measures to address EO\/IR signature countermeasures; and validate performance of novel augmented and mixed reality software in a variety of environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602709A (Night Vision Technology) \/ Project H95 (Night Vision And Electro-Optic Technology), and PE 0602712A Countermine Systems \/Project H24 (Countermine Tech in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BD6"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Sys Interfaces\/Integration- Sensor Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.124"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.124"
                        },
                        "BudgetYearTwo": {
                            "val": "1.12"
                        },
                        "BudgetYearThree": {
                            "val": "0.921"
                        },
                        "BudgetYearFour": {
                            "val": "0.967"
                        },
                        "BudgetYearFive": {
                            "val": "0.797"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.929"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H98 Clothing & Equipm Tech"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and validates advanced technologies and algorithms for enhancing dismounted Soldier deployed robotics and autonomous systems used to improve the Small Unit's situational awareness, survivability, and lethality.  Technologies to be investigated may include: algorithms for dismounted robotic systems to enable autonomous navigation, automated object recognition, persistent surveillance, launch and recovery from vehicles, networked lethality, manned-unmanned teaming, and collaborative behaviors; and advanced user interfaces to optimize human-robotic interaction during dismounted operations.  These advanced technologies will enable Squad and Platoon level autonomous reconnaissance using robotic systems to minimize the operator's dedicated control of the systems and reduce their cognitive burden, thus allowing Soldiers to be more lethal and survivable.\n\nWork in this Project supports key Army needs and leverages the technical research of several PEs to include PE 0603118A (Soldier Lethality Advanced Technology) \/ Project BD7 (Soldier Sys Interfaces\/Integration-Sensor AdvTech), and Project BC9 Adv Soldier Sensors\/Displays AdvTech for Dismounts(.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier System Interfaces & Integration (Sensor Technology)"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate, design, and validate advanced dismounted Soldier robotic and autonomous systems technologies to enable autonomous navigation, manned-unmanned teaming, and networked reconnaissance to improve Soldier lethality, situational awareness, and survivability during tactical operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.124"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.124"
                                            },
                                            "Text": {
                                                "val": "Will investigate and develop algorithms for dismounted Small Unit level Small Unmanned Aerial Systems (SUAS) to enable autonomous operations; investigate and design soldier-robotic user interfaces to minimize soldier dedicated control of robotic assets; investigate and develop modular robotics architectures to allow for a common platform to conduct validation of algorithms and enable integration of third party software and hardware components; and validate emerging technologies in controlled laboratory and simulated environments to assess functionality, reduce risk, and improve system design."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from\\y PE 0602786A (Warfighter Technology) \/ Project H98 Clothing and Equipm Tech in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BD8"
                    },
                    "ProjectTitle": {
                        "val": "Soldier & Sm Unit Tactical Energy Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "9.145"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.145"
                        },
                        "BudgetYearTwo": {
                            "val": "9.052"
                        },
                        "BudgetYearThree": {
                            "val": "9.162"
                        },
                        "BudgetYearFour": {
                            "val": "11.434"
                        },
                        "BudgetYearFive": {
                            "val": "11.585"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "50.378"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602705A Electronics and Electronic Devices\n* Project H11 Tactical and Component Power Technology \n* Project H94 Elec & electronic Dev"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research and development on materials and component level power and energy technologies in the areas of energy storage, power generation, alternative energy, and intelligent power distribution and thermal management designs that support Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Soldier power needs to include next generation squad weapons and advanced optical devices and sensors. Enables future Soldier lethality and mobility for longer mission durations at lighter weights to provide enhanced lethality and tactical overmatch of adversaries, and to reduce the burden on the Soldier. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Power for Soldier Lethality"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and develops innovative materials and component level power generation and energy storages technologies that support next generation weapons, sensors, radios and human augmentation devices to enable Soldiers and Small Units to maximize probability of target hits, improve collective situational awareness, ensure multiple communication streams and assist with tactical tasks in order to decrease Soldier load and power burden, and increase power capabilities by providing more energy to prolong mission run-time."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.9"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.9"
                                            },
                                            "Text": {
                                                "val": "Will conduct lab-based experiments on advanced cathode materials and pairings to assess its ability to increase the runtime of Soldier borne devices in small, lightweight, flexible form factors; optimize Silicon Anode materials for both primary and rechargeable configurations to enable greater energy densities from 300-500 WH\/Kg for Soldier and Small Units that require more Power & Energy, with longer runtimes, in distributed operations, with limited resupply; investigate and develop small, power generation devices that are powered by logistically available fuels to enable integrated Soldier borne\/operated sensors and radios for critical applications; assess small, electromechanical components with greater efficiency and power density to support Soldier and Squad level battery recharging; investigate recoil, thermal and acoustic energy harvesting technologies that scavenge unused signatures from the Next Gen Squad Weapon to provide power for fire control technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project H11 (Tactical and Component Power Technology), and Project H94 (Elec & Electronic Devices) as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials & Component Technologies for Energy Independence"
                                    },
                                    "Description": {
                                        "val": "The effort develops technologies to substantially reduce the number of batteries required to accomplish dismounted Soldier\/Squad mission objectives by developing more efficient power and thermal management for small systems and harvesting energy and alternative energy technologies thereby significantly reducing Soldier-borne load and logistics requirements for Soldier\/Squad power and energy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.245"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.245"
                                            },
                                            "Text": {
                                                "val": "Will develop aqueous electrolytes and other high voltage electrolytes\/additives for conformal, flexible, safe, abuse tolerant lithium ion and lithium metal batteries; research and develop a multifuel-fired power generator with high fuel efficiency and reduced noise signatures, emphasizing logistics fueled heat source, thermal selective emitter and photovoltaic cell; develop and design inductors and other power components using novel materials; explore technologies to harvest electrical power by converting and storing energy via kinetic, elastocaloric thermal materials and catalytic synthesis of fuel-like chemicals from indigenous resources; develop more efficient catalysts for carbon dioxide electroreduction to useful energy carriers; and develop higher efficiency plasmonic catalysts to catalyze the breakdown of fuels to produce usable energy."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602705A (Electronics and Electronic Devices) \/ Project H11 (Tactical and Component Power Technology), and Project H94 (Elec & Electronic Devices) as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE1"
                    },
                    "ProjectTitle": {
                        "val": "Support Technology to Mission Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0.726"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.726"
                        },
                        "BudgetYearTwo": {
                            "val": "0.908"
                        },
                        "BudgetYearThree": {
                            "val": "0.9"
                        },
                        "BudgetYearFour": {
                            "val": "0.9"
                        },
                        "BudgetYearFive": {
                            "val": "0.892"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.326"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project XW5 Small Unit Expeditionary Maneuver Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and designs technologies that support Soldier\/Small Unit survivability, mobility, and combat effectiveness during mission command operations at operational and tactical levels in lethal and contested environments, enabling decentralized and dispersed operations in the future operating environment. This Project designs innovative mission command node platforms with enhanced mobility and agility, increased protection and survivability against electro-magnetic interference (EMI) and other threats, and rapid movement and emplacement, resulting in increased lethality and coordination of dispersed formations during operations and supporting resilient formations in multi-domain operations. Component technologies designed under this Project will transition to Advanced Technology Development efforts in the Soldier Lethality Modernization priority in support of decentralized and dispersed mission command operations in future operating environments and expeditionary maneuver in the Multi-Domain Operations Environment. \n\nWork in this Project supports key Army needs and leverages\/complements the technical research of several PEs to include PE 0601102A (Defense Research Sciences), and the following Projects within PE 0602143A (Soldier Lethality Technology): Project BB4 (Dismounted Soldier Survivability Materials), Project BD8 (Soldier & Sm Unit Tactical Energy Tech), Project AZ9 (Soldier Protection Advanced Tech - Detectability), PE 0603118A Soldier Lethality Advanced Technology \/ Project AZ8 (Soldier - Small Unit Detectability Adv Technology) and PE 0602712A (Countermine Systems) \/ Project H35 Camouflage and Counter-Recon Tech).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Small Unit Expeditionary Mission Command Research"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs components of agile, modular, non-traditional Command Post platforms designed to enable the mission command network, supporting decentralized and distributed mission command operations in the future operating environment. Investigates material node platforms and other component concepts supporting rapid emplacement and displacement with enhanced survivability, mobility, signature management protection, and secured\/non-degraded communication capabilities. Investigates and conducts experiments to validate component performance in a multi-domain battle operations. The large-footprint and logistics-intensive nature of current mission command systems compromise Soldier Lethality and mission effectiveness and do not provide the enhanced mobility and protection necessary to effectively execute mission command operations in the extremely expeditionary, multi-domain environment of the future. This research effort will enable tactical leaders to make timely decisions, integrate more seamlessly into the battlefield through a decrease in size, signature, and logistics burden, and will increase both maneuverability and survivability by enabling the development of agile Command Posts that support Multi-Domain Operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.726"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.726"
                                            },
                                            "Text": {
                                                "val": "Will investigate tactical Command Post design and component concepts to identify individual component metrics that support mission command effectiveness based upon critical operational partner needs such as rapid emplacement, displacement and survivability in the future operating environment; conduct experiments on Command Post components for EMI protection and secure communications to validate component performance to allow defeat of adversary efforts to disrupt mission command operations, as well as to open and retain windows of advantage in the multi-domain environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project XW5 (Small Unit Expeditionary Maneuver Technology) FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE3"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Combat Feeding Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "3.996"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.996"
                        },
                        "BudgetYearTwo": {
                            "val": "4.713"
                        },
                        "BudgetYearThree": {
                            "val": "4.677"
                        },
                        "BudgetYearFour": {
                            "val": "4.768"
                        },
                        "BudgetYearFive": {
                            "val": "8.439"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "26.593"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A Warfighter Technology\n* Project H99 Joint Service Combat Feeding Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops nutrient compositions and stabilization techniques to maximize the warfighter's physical and cognitive performance on the battlefield, investigates technologies to enhance detection and identification capabilities of chemical and biological threats in foods, and develops innovative ration and field feeding technologies to reduce resupply requirements for the multi-domain battlefield. The Army serves as the Executive Agent for this Department of Defense (DoD) program, with oversight and coordination provided by the DoD Combat Feeding Research and Engineering Board.\n\nIn FY20, work in this PE is related to and fully coordinated with PE 0602787A (Medical Technology)\/ Project 869 (Warfighter Health Prot & Perf Stnds) to develop technologies and concepts; Army Additive Manufacturing Community of Practice (3D Printing) to enable customization, increase readiness, and improve sustainment due to fabrication of end-use items at point of need; Office of the Assistant Secretary of Defense (OASD) Applied Research for Army Priorities (ARAP)  to transition and develop materiel solutions in the synthetic biology and microbiome technical area; Defense Health Agency (DHA) Joint Program Committee-5, which seeks to develop effective nutritional countermeasures against stressors and to maximize health, performance, and well-being; and Office of Navy Research (ONR) PE 0601153N Defense Research Sciences Biosciences program to evaluate nutritional countermeasures to physiological environmental extremes.  \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Combat Feeding Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and develops nutrient compositions and stabilization techniques to maximize the warfighter?s physical and cognitive performance on the battlefield. The effort investigates technologies to enhance detection and identification capabilities of chemical and biological threats in foods and develops innovative ration and field feeding technologies to reduce resupply requirements.  Work in this area results in increased performance, less food-borne illness, and overall increased readiness of the warfighter."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.996"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.996"
                                            },
                                            "Text": {
                                                "val": "Will identify and test nutritional interventions that prevent performance decrements associated with known degraded immune function and consequential weight loss in extreme environments; identify and test novel prophylactic nutrition to mitigate or prevent cause of illness in deployed troops globally such as gastrointestinal dysbiosis that affects operational readiness; investigate and design nutrient stabilization techniques to retain or improve quality of products when stored\/utilized in environmental extremes and multi-domain battlefields to ensure that nutrients required for optimal performance are both retained and are bioavailable at the point of consumption; transition weight reduction concepts for Close Combat Assault Ration formulations for advanced technology demonstration; investigate chemical agent permeability in ration packaging in support of Chemical Biological Radiological Nuclear and Energy (CBRNE) threats; transition novel energy ration components to advanced development; develop and model food formulations that retain desired sensory and organoleptic (appearance, odor, flavor, texture) characteristics after processing, storage and distribution to enable the customization of nutrients tailored to each individual warfighter?s need based on real time health status and operational scenario for rapid recovery and\/or mission preparation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project H99 (Joint Service Combat Feeding Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE6"
                    },
                    "ProjectTitle": {
                        "val": "Reactive\/Resp Surfaces & Matls-Soldiers & Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "2.745"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.745"
                        },
                        "BudgetYearTwo": {
                            "val": "2.987"
                        },
                        "BudgetYearThree": {
                            "val": "3.024"
                        },
                        "BudgetYearFour": {
                            "val": "3.156"
                        },
                        "BudgetYearFive": {
                            "val": "3.558"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.470"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602105A Materials Technology\n* Project H84 Materials"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, fabricates, and evaluates a variety of bio-based materials through the application of biotechnology advances to develop material capabilities that respond and adapt to a wide range of external stimuli and biological processes for protection, situational awareness, and sustainment.  Innovative materials will be sought that are capable of sensing and responding, as well as adapting response, to a broad spectrum of environmental variables. Research will develop materials that are able to self-monitor, self-heal and self-sustain. Research will explore new biology-based methods for controlled synthesis and assembly to create materials with precise chemistries, microstructures, properties, and responsive functionalities through controlled molecular placement, spatial architectures, and interfacial structures. These materials have potential to enable more survivable, situationally aware, lighter weight Soldier systems and electronics. Research conducted focuses on unique and\/or novel material properties, developing models, materials characterization techniques, non-destructive testing methods and advanced fabrication\/processing methodologies.\n\nWork in this PE complements PE 0601102A (Defense Research Sciences) \/ Project AA3 (Single Investigator Basic Research) , Project H57 (Single Investigator Basic Research), Project H42: (Materials & Mechanics), and Project AA5 (Biotechnology and Systems Biology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Bio-enabled Materials and Processes"
                                    },
                                    "Description": {
                                        "val": "The effort conducts fundamental research through the application of biotechnology advances to develop materials with capabilities to respond and adapt to a wide range of external stimuli and biological processes. Investment in Bio-enabled materials research allows the design of materials that are capable of sensing and responding, as well as adapting to a broad spectrum of environmental variables with ability to self-monitor, self-heal and self-sustain. Investments in this area could lead to future applications in Solider performance, situational awareness, protection and sustainment.  Research from this effort has potential to transition to multiple end items and applications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.745"
                                            },
                                            "Text": {
                                                "val": "Will investigate the integration of rapidly selected peptide reagents for applications in improved sensors for human performance and situational awareness; investigate a more information-driven peptide reagent design process drawn from previous studies; and design and synthesize biological materials, including a focus on diatoms for improved logistics, increased robustness and new capabilities in gradient \/ hierarchical materials with nanoscale resolution of features to control optical, structural and reactive performance for potential application in adaptive coatings for vehicles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602105A (Materials Technology) \/Project H84 (Materials) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BE8"
                    },
                    "ProjectTitle": {
                        "val": "Synthetic Training Environment (STE) Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "15.438"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.438"
                        },
                        "BudgetYearTwo": {
                            "val": "18.159"
                        },
                        "BudgetYearThree": {
                            "val": "17.72"
                        },
                        "BudgetYearFour": {
                            "val": "16.036"
                        },
                        "BudgetYearFive": {
                            "val": "16.215"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "83.568"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602308A Advanced Concepts and Simulation\n* Project C90 Advanced Distributed Simulation\n* Project D02 Modeling and Simulation For Training And Design\nPE 0602716A Human Factors Engineering Technology\n* Project H70 Human Factors Eng Sys Dev"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops technologies supporting the Army's Synthetic Training Environment (STE) priority, a comprehensive live-virtual-constructive architecture that will enable Soldiers to train the spectrum of missions in virtual environments involving thousands of virtual combatants and miles of complex terrain including megacities. The STE will enable Army units and leaders to conduct realistic multi-echelon \/ Multi-Domain Operations, combined arms maneuver, and mission command training at the point of need anywhere in the world, increasing Soldier and Small Unit proficiency through repetition. Units can then master collective training tasks in the live environment.\n\nThis Project investigates and designs STE enabling technologies to include networking of models representing complex human behavior, complex data\ninterchange between simulations, synthetic natural environments, virtual representation of combined arms environments, adaptive tutoring for individuals and teams, and collaborative training.\n\nProject efforts include techniques and methods for integrating different sensory cues into virtual environments that result in enhanced training and leader development and the design of virtual humans utilizing Artificial Intelligence (AI) enabled attributes that embody natural language, speech recognition in noisy environments, gesture, gaze, and conversational speech\nand other complex human tasks.\n\nThe Project leverages the capabilities of industry and the research and development community through the synthesis of creativity and technology, including work conducted at the Institute for Creative Technologies (ICT). \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Innovative Synthetic Training Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs methods of applying Artificial Intelligence into the STE in order to simulate a fully immersive environment in large urban settings with a population of adaptable, noncombatant virtual human agents to increase the realism and complexity of training scenarios.  In addition, develops tools, techniques and technologies for improving the immersion of human senses within simulation environments with the goal of creating enhanced realism within the simulated environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.078"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.078"
                                            },
                                            "Text": {
                                                "val": "Will investigate artificially intelligent individuals and groups of virtual humans as role-players to support increased scenario complexity and social interactions with trainees and reduce the need for costly live role-players and simulation support teams; develop artificially intelligent virtual humans with adaptable human behaviors driven by their own beliefs, desires, and intentions; apply methods for natural language understanding allowing for social dialogue with the virtual humans.  Will expand and apply knowledge in cognitive architectures, social simulations, and virtual human research areas to provide design, development, and improvement of new technology products focused on the accurate and immersive inclusion of the human dimension in virtual and mixed reality context."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602308 (Advanced Concepts and Simulation) \/ Project C90 (Advanced Distributed Simulation) Project D02 Modeling & Simulation For Training And Design), PE 0602716A (Human Factors Engineering Technology) \/Project H70 (Human Fact Eng Sys Dev) FY20 as part of the financial structure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STE One World Terrain"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs tools and methods to improve the speed and fidelity of a terrain capability that provides a fully accessible representation of the globe, accessible through the Army network and usable by all simulation trainers; develop complex representations (including Megacities and Subterranean) of the Operational Environment and the Multi-Domain battlefield in synthetic training environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.168"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.168"
                                            },
                                            "Text": {
                                                "val": "Will research alternative data sources for applicability to modeling & simulation (M&S), with emphasis on providing accurate representation (geometry) and visuals (quality at ground level); investigate alternative data sources to improve availability of rich data for next-generation terrain representation; research data fusion techniques by exploiting data sources and processed data to demonstrate a behavior pattern of disparate data over the same geographic area, initiating the need for automated processes to combine and de-conflict different data into a single, consistent dataset for end-use applications; and develop tools and procedures for merging data sources into a single, consistent dataset."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602308 (Advanced Concepts and Simulation) \/ Project C90 (Advanced Distributed Simulation), Project D02 (Modeling & Simulation For Training And Design), PE 0602716A (Human Factors Engineering Technology) \/ (Project H70 Human Fact Eng Sys Dev in FY 20 as part of the financial restructure."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STE Training Management Tool"
                                    },
                                    "Description": {
                                        "val": "This effort investigates Adaptive Training (AT) methods to facilitate authoring, distribution, management, and evaluation of tailored instruction for both individuals and teams; and evaluates the impact of training and educational tools \/ methods on comprehension, reasoning, learning, performance, retention, and transfer of knowledge and acquired skills to assess Training Effectiveness (TE) in Synthetic Training Environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.192"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.192"
                                            },
                                            "Text": {
                                                "val": "Will validate a base authoring concept for adaptive training; expand concepts for authoring tools, team modeling, team instruction, and Army team domains to support the development of team (unit level) tutoring systems; mature training strategies for autonomous software systems; and develop tools to rapidly author scenario variants to customize training. Will develop models and tools for automated measurement of critical training outcomes for selected individual and collective tasks; and explore and identify new sensors for measuring effectiveness in collective training events."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602308 (Advanced Concepts and Simulation) \/ Project C90 (Advanced Distributed Simulation), Project D02 (Modeling & Simulation For Training And Design), PE 0602716A (Human Factors Engineering Technology) \/ (Project H70 Human Fact Eng Sys Dev in FY 20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "BR9"
                    },
                    "ProjectTitle": {
                        "val": "Personnel & Airdrop Safety Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "4.098"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.098"
                        },
                        "BudgetYearTwo": {
                            "val": "3.728"
                        },
                        "BudgetYearThree": {
                            "val": "3.522"
                        },
                        "BudgetYearFour": {
                            "val": "3.955"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.303"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0602786A  Warfighter Technology\n* Project XW5  Small Unit Expeditionary Maneuver Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project funds the research and investigation of component technologies to enhance cargo and personnel airdrop capabilities for global precision delivery, rapid deployment, and insertion for force projection into hostile regions. Areas of emphasis include parachute technologies, parachutist injury reduction, precision offset aerial delivery, soft landing technologies, and airdrop simulation.  Technologies support the Soldier Lethality Army Modernization Priority.  New operational concepts call for increased precision of personnel and cargo in austere environments in which small units are dispersed and logistical supply is limited.  The Army requires enhanced payload extraction and other increased capabilities to support the airdrop requirement for current and future vehicles exceeding aircraft payload weight capacity. The U.S. Army Airborne Board (Chaired by the XVIII Airborne Corps Commanding General) identified increased payload capabilities as a critical requirement to support the mission readiness profile for the Global Response Force (GRF), and will support Joint Forcible Entry requirements while maximizing the capacity of a C-17 aircraft.  \n\nWork in this Project supports key Army needs and complements the technical research of several PEs to include PE 0601102A (Defense Research Sciences),  PE 0602143A (Soldier Lethality Technology) \/ Project BD6 (Soldier Sys Interfaces\/ Integration- Sensor Tech), and PE 0603118A (Soldier Lethality Advanced Technology) \/Project BE5 (Personnel & Airdrop Safety Advanced Technology).\n \nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nAll FY20 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nWork in this Project is performed by the United States Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel & Airdrop Safety Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies that enhance payload extraction, which will allow current vehicles to be dropped with more armor and support equipment, and reduce the design constraint on future vehicles that have airdrop as an operational requirement, increase parachute gliding capabilities, and mature delivery accuracy of cargo aerial delivery systems that support varying payload weights. Research in the area of novel parachute materials will provide increased capabilities for cargo and personnel aerial delivery systems. This effort will support an investigation of new Modeling and Simulation (M&S) tools in order to develop validation methods for airdrop concepts. This effort also investigates technologies that advance airborne personnel insertion safety requires to modernize the Airborne Soldier and provide the ability to effectively execute the airborne mission through reducing safety risk and increasing capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.098"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.098"
                                            },
                                            "Text": {
                                                "val": "Will explore multi-modal sensing methods and control techniques to study the efficacy of precision aerial delivery via a variety of decelerator systems deployed via conventional and non-traditional methods in GPS denied\/degraded and anti-access \/ area denial (A2\/AD) environments to address future operational challenges; investigate augmentation of personnel airdrop systems to enhance airborne jumper performance while expanding operational footprint opportunities; conduct experiments fundamental to understanding aerodynamic characteristics of airdrop systems; and develop advanced modeling techniques applicable to the full spectrum of the acquisition process to improve airdrop safety and reduce the cost of future development efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research effort was realigned from PE 0602786A (Warfighter Technology) \/ Project XW5 (Small Unit Expeditionary Maneuver Technology) in FY20 as part of the financial restructure."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}