{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-46",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604341D8Z"
        },
        "ProgramElementTitle": {
            "val": "DIU Prototyping"
        },
        "R1LineNumber": {
            "val": "99"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "92.000"
            },
            "BudgetYearOneBase": {
                "val": "92.000"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "13.378"
            },
            "BudgetYearThree": {
                "val": "12.930"
            },
            "BudgetYearFour": {
                "val": "12.489"
            },
            "BudgetYearFive": {
                "val": "12.784"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This is a new Program Element and new projects for DIU Prototyping and the National Security Innovation Capital (NSIC) programs. \n\nDefense Innovation Unit Experimental (DIUx) was established in April 2015 and DIUx 2.0 in May 2016. Defense Innovation Unit Experimental (DIUx) was transferred from OSD (PE 0602230D8Z) to Washington Headquarters Services (WHS) (PE 0603342D8W).  In July 2018, DIUx was realigned from WHS to the Office of the Under Secretary of Defense, Research and Engineering (OUSD(R&E)).  In August 2018, DIUx was re-designated the Defense Innovation Unit (DIU) to signify a permanence of the program.  Effective FY 2020, DIU funding transferred from WHS to OSD consistent with the realignment and establishment of USD(Research & Engineering), and disestablishment of USD(Acquisition, Technology, & Logistics)."
        },
        "ProgramElementMissionDescription": {
            "val": "DIU mission is to accelerate innovation in the commercially-focused technology sector to the warfighter.  The 2018 National Defense Strategy asserts that we have returned to an era of inter-state strategic competition with Russia and China, heightening the sense of urgency with which the nation, and Department of Defense (DoD) in particular, must reform our acquisition policies and approach to sustaining military-technical superiority. Adversaries are challenging the U.S. across several dimensions.  Most importantly, adversaries are at par or ahead of the U.S. in critical technology areas.  Consistent with the FY 2020 Office of Management and Budget (OMB)\/Office of Science and Technology Policy (OSTP) research and development budget priorities, this new era of competition requires technological superiority to ensure ability to project power, maintain international norms and rule of law, and to serve as a credible deterrence.  Notably, the critical technologies that forge military-technical superiority are increasingly dual-use and rapidly developed by the commercial sector.\n\nThe U.S. DoD relies on innovation to maintain our nation's ability to deter, and if need be, prevail in conflict. The DIU increases the Department's access to leading-edge technologies and talent that reside in the commercial sector, with the ultimate goal of accelerating innovation into the hands of the warfighter. Working across the country, and in collaboration with allied international partners, DIU is developing new ways of doing business, growing our defense industrial base to include \"non-traditional\" companies that had previously not collaborated with the military, working with traditional vendors in novel ways to increase efficiency, and challenging innovators to share their knowledge and expertise in support of our nation's defense.\n\nThe DIU Prototyping program will find and provide access to technology companies on behalf of DoD organizations.  Additionally, DIU will execute projects to leverage commercial sector technology analogous to military application thereby increasing dual-use technology agility for the DoD.  DIU Prototyping funds will facilitate the award of projects that can augment commercial technologies, existing government-owned capabilities or concepts for defense application.  The National Security Innovation Capital (NSIC) will fund the commercialization and scaling dual-use, hardware-based technologies that are critical to the military.  These technology areas are currently severely under-served by the private U.S. venture capital industry and often funded by strategic and persistent capital from China.  In FY 2020, NSIC plans to attract private capital to leverage investments in about 8-12 selected projects that include batteries, drones, and quantum sensors."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "92.000"
                },
                "BudgetYearOneBase": {
                    "val": "92.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "92.000"
                },
                "BudgetYearOneBase": {
                    "val": "92.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY 2020 Transfer from DIU O&M"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "17.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "17.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 2020 DIU Increase for NSIC"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "75.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "75.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "This is a new Program Element with two new Project Codes for DIU Prototyping\/Project 843, $17.000 million, and National Security Innovation Capital (NSIC)\/Project 844, $75.000 million programs.  For Project 843, FY 2020 $17.000 million was transferred from WHS O&M 0901583D8W to RDT&E, DW PE 0604341D8Z\/843 DIU Prototyping.  Project 844 NSIC is a new program add. The overall increase of $92.000 million will fund prototype projects to leverage commercial sector technology analogous to military application thereby increasing dual-use technology agility for the DoD.  The DIU Prototyping and NSIC focus areas are complementary and we envision that this integration will not only save funds in the future, but more importantly, grow the National Security Innovation Base (NSIB) by attracting new NSIB suppliers and improve the adoption of commercial technologies for the warfighter."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "843"
                    },
                    "ProjectTitle": {
                        "val": "DIU Prototyping"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "17.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "13.378"
                        },
                        "BudgetYearThree": {
                            "val": "12.930"
                        },
                        "BudgetYearFour": {
                            "val": "12.489"
                        },
                        "BudgetYearFive": {
                            "val": "12.784"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is a new program element and new project, P843, for DIU Prototyping."
                        },
                        "ProjectMissionDescription": {
                            "val": "DIUx mission is to accelerate innovation in the commercially-focused technology sector to the warfighter.  Initially, DIUx was managed by the Under Secretary of Defense Acquisition, Technology and Logistics (OUSD(AT&L)) when it was established in July 2015.  In May 2016, DIUx was placed under the control of the Secretary of Defense and administratively managed by WHS.  In July 2018, DIUx was realigned from WHS to the OUSD(R&E).  In August 2018, DIUx was re-designated the Defense Innovation Unit (DIU) to signify a permanence of the program.  Effective FY 2020, DIU funding will transfer from WHS to OSD consistent with the functional realignment to OUSD(R&E). \n\nThe 2018 National Defense Strategy asserts that we have returned to an era of inter-state strategic competition with Russia and China, heightening the sense of urgency with which the nation, and DoD in particular, must reform our acquisition policies and approach to sustaining military-technical superiority.  Adversaries are challenging the U.S. across several dimensions.  Most importantly, adversaries are at par or ahead of the U.S. in critical technology areas.  Consistent with the FY 2020 OMB\/OSTP research and development budget priorities, this new era of competition requires technological superiority to ensure ability to project power, maintain international norms and rule of law, and to serve as a credible deterrence.  Notably, the critical technologies that forge military-technical superiority are increasingly dual-use and rapidly developed by the commercial sector.\n\nThe DIU Prototyping program will find and provide access to technology companies on behalf of DoD organizations.  Additionally, DIU will execute projects to leverage commercial sector technology analogous to military application thereby increasing dual-use technology agility for the DoD.  In FY 2020, DIU Prototyping funds will facilitate the award of projects that can augment commercial technologies, existing government-owned capabilities or concepts for defense application."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Innovation Unit (DIU) Prototyping"
                                    },
                                    "Description": {
                                        "val": "In FY 2020, DIU will execute projects to leverage commercial sector technology analogous to military application thereby increasing dual-use technology agility for the DoD.  DIU Prototyping funds will facilitate the award of projects that can augment commercial technologies, existing government-owned capabilities or concepts for defense application."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020, DIU Prototyping funds will facilitate follow-on prototype contract awards of projects that can augment commercial technologies, existing government-owned capabilities or concepts for defense application."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase of $17.000 million will fund the commercialization and scaling dual-use, hardware-based technologies that are critical to the military."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "For Project 843, FY 2020 $17.000 million was transferred from WHS O&M 0901583D8W to RDT&E, DW PE 0604341D8Z\/843 DIU Prototyping."
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1. Speed - average days to award a prototype project at the close of a solicitation compared to the traditional acquisition system.\n2. Cost Savings - estimated amount saved as a result of DIU-driven solutions.\n3. Scale - measures the success of transitioning successful projects or methodologies, and increasing the number \/ diversity of partnerships within the National Security Innovation Base."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DIU Prototyping"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "17.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "17.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "DIU Prototyping"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "DIU Prototyping"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "844"
                    },
                    "ProjectTitle": {
                        "val": "National Security Innovation Capital"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "75.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "75.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is a new program element and new project 844 for the National Security Innovation Capital (NSIC)."
                        },
                        "ProjectMissionDescription": {
                            "val": "DIUx mission is to accelerate innovation in the commercially-focused technology sector to the warfighter.  Initially, DIUx was managed by the Under Secretary of Defense Acquisition, Technology and Logistics (OUSD(AT&L)) when it was established in July 2015.  In May 2016, DIUx was placed under the control of the Secretary of Defense and administratively managed by WHS.   In July 2018, DIUx was realigned from WHS to the OUSD(R&E).  In August 2018, DIUx was re-designated the Defense Innovation Unit (DIU) to signify a permanence of the program.  Effective FY 2020, DIU funding will transfer from WHS to OSD consistent with the functional realignment to OUSD(R&E). \n\nThe 2018 National Defense Strategy asserts that we have returned to an era of inter-state strategic competition with Russia and China, heightening the sense of urgency with which the nation, and DoD in particular, must reform our acquisition policies and approach to sustaining military-technical superiority.  Adversaries are challenging the U.S. across several dimensions.  Most importantly, adversaries are at par or ahead of the U.S. in critical technology areas.  Consistent with the FY 2020 OMB\/OSTP research and development budget priorities, this new era of competition requires technological superiority to ensure ability to project power, maintain international norms and rule of law, and to serve as a credible deterrence.  Notably, the critical technologies that forge military-technical superiority are increasingly dual-use and rapidly developed by the commercial sector.\n\nThe National Security Innovation Capital (NSIC) will fund the commercialization and scaling dual-use, hardware-based technologies that are critical to the military. These technology areas are currently severely under-served by the private U.S. venture capital industry and often funded by strategic and persistent capital from China."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "National Security Innovation Capital (NSIC)"
                                    },
                                    "Description": {
                                        "val": "The National Security Innovation Capital (NSIC) will fund the commercialization and scaling dual-use, hardware-based technologies that are critical to the military.  These technology areas are currently severely underserved by the private U.S. venture capital industry and often funded by strategic and persistent capital from China.  NSIC will attract private capital to leverage DoD investments in select priority projects that include batteries, drones, and quantum sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "75.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "75.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2020, NSIC plans to attract private capital to leverage investments in about 8-12 selected projects that include batteries, drones, and quantum sensors."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase of $75.000 million will fund the commercialization and scaling dual-use, hardware-based technologies that are critical to the military."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "This is a new project, 844 for NSIC $75.000 million."
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1. Percent of NSIC-funded companies that secure a DoD contract in 3, 5, 7 years.\n2. Increasing the number \/ diversity of partnerships within the National Security Innovation Base.\n3. Stimulating private venture capitalists to invest in dual-use hardware based technologies that service military needs."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "NSIC"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "75.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "75.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "National Security Innovation Capital (NSIC)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "NSIC"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}