{
    "id": "2020-Army-PB-2040-JBOOK-762258d5394183dd88c896efee4f13d51ebc5ad251a7098a5b8c0dd85e164773-7",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA5A-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604622A"
        },
        "ProgramElementTitle": {
            "val": "Family of Heavy Tactical Vehicles"
        },
        "R1LineNumber": {
            "val": "116"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.086"
            },
            "CurrentYear": {
                "val": "11.935"
            },
            "BudgetYearOne": {
                "val": "16.745"
            },
            "BudgetYearOneBase": {
                "val": "16.745"
            },
            "BudgetYearTwo": {
                "val": "26.889"
            },
            "BudgetYearThree": {
                "val": "12.507"
            },
            "BudgetYearFour": {
                "val": "8.857"
            },
            "BudgetYearFive": {
                "val": "117.913"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "204.932"
            }
        },
        "ProgramElementNote": {
            "val": "PdM ALUGS Leader\/Follower efforts transition from the 0604017A Robotics Development FD9 Robotic Systems line in FY 2018 and FY 2019 to a Program of Record under 0604622A Family of Heavy Tactical Vehicles EZ8 Leader\/Follower in FY 2020."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) aligns system development and demonstration of Heavy Tactical Vehicles (HTV) with Future Force requirements to support combat and combat support missions, to include line haul, local haul, and unit resupply. HTV trucks transport water, ammunition, and general cargo over all terrains and throughout the battle-space. Systems include the Heavy Expanded Mobility Tactical Truck (HEMTT), Palletized Load System (PLS), Heavy Equipment Transporter System (HETS), Line Haul, Heavy Dump Truck (HDT) as well as recovery systems such as the Modular Catastrophic Recovery System (MCRS) that rescue large wheeled vehicle platforms in severe off-road conditions. Funding will also be used for developing the Army's next generation of tactical trucks as part of the Army's Tactical Wheeled Vehicle (TWV) Modernization Strategy. This Program Element also supports the development and demonstration of enablers, active safety technologies, and heavy and medium tactical trailers. Periodic evolutionary upgrade of survivability and crew protection as described in the Long Term Protection Strategy (LTPS) is supported by this PE for both the HTV family of vehicles and the Family of Medium Tactical Vehicles (FMTV). The Tactical Wheeled Vehicle - Leader Follower (TWV-LF) program provides transportation units with the capability to unman Tactical Wheeled Vehicles (TWVs), initially the Palletized Loading System (PLS) vehicles, while operating in a convoy. This is accomplished by integrating technology to the unmanned vehicles which enables them to follow a manned Lead vehicle. This is done in a March Unit of up to (8) TWVs initially PLS vehicles, with (1) manned Lead vehicle and (3) to (7) unmanned Follower vehicles. This capability provides increased Soldier Force Protection and increased convoy logistics throughput by giving Commanders more options on Soldier utilization, removing Soldiers from threat zones and\/or utilizing vehicle operators for convoy security, and allowing supply convoys to run more often.\n\nFunding also supports modernization of the current Tactical Wheeled Vehicle fleets by investigating technology insertions including, but not limited to: condition based maintenance, vetronics, Victory Architecture, autonomous operations and other emerging technologies.  Funding also supports developing initial prototypes to enable refinement of Operational Requirements and early user feedback to support future sustainment and operational movement operating concepts. \n\nFY 2020 Project 659 Base funds in the amount $6.921 million will support the development, test and evaluation of solutions to upgrade HEMTT and PLS suspensions, cranes, winches and PLS Trailer anti-lock braking system (ABS), system-level test and evaluation of modified HETS M1070A1 tractors and new commercial trailers capable of 85 ton capacity, feasibility testing of 25-Ton Semi-Trailer Low-Bed (STLB) prototype semitrailers, and the development of contracting\/acquisition milestone documentation and systems engineering plans for the Enhanced Heavy Equipment Transporter System (EHETS) program. The EHETS is the replacement system for the Heavy Equipment Transporter System (HETS).  It is intended to transport, deploy, and evacuate payloads up to the weight of a combat configured M1A2 main battle tank.  It will provide increased payload, highway transportability, and force protection over its predecessor. \n\nFY 2020 Project VR5 Base funds in the amount of $4.824 million will be used for the test and evaluation of Heavy Dump Truck (HDT) armored cabs and armored trucks, and testing on the improvements to the Family of Medium Tactical Vehicles (FMTV) Armor Kits that are required to support Full Material Release. The Heavy Dump Truck supports construction by loading, transporting and dumping payloads during engineering operations needed to establish or improve infrastructure.  \n\nFY 2020 Project EZ8 Base funds in the amount of $5.000 million will execute testing for the Tactical Wheeled Leader Follower program for safety and performance evaluations by Army Test & Evaluation Command (ATEC) to support production decision by the Milestone Decision Authority, fund Program Management office lifecycle planning, and engagements with industry to plan and solicit proposals for the production contracts. FY20 funds will enable the Tactical Wheeled Leader Follower program to transition to the Program Office from the Tank Automotive Research and Development Center (TARDEC), to complete Engineering and Manufacturing Development (EMD), prepare for and execute a production decision (Milestone C), and begin contract planning and actions for Low Rate Initial Production (LRIP), Production Qualification Testing (PQT), and Initial Operational Testing (IOT).  \nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.507"
                },
                "CurrentYear": {
                    "val": "11.95"
                },
                "BudgetYearOne": {
                    "val": "11.745"
                },
                "BudgetYearOneBase": {
                    "val": "11.745"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.086"
                },
                "CurrentYear": {
                    "val": "11.935"
                },
                "BudgetYearOne": {
                    "val": "16.745"
                },
                "BudgetYearOneBase": {
                    "val": "16.745"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.421"
                },
                "CurrentYear": {
                    "val": "-0.015"
                },
                "BudgetYearOne": {
                    "val": "5"
                },
                "BudgetYearOneBase": {
                    "val": "5"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.009"
                    },
                    "CurrentYear": {
                        "val": "-0.015"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.412"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020 has an increase of approximately 30% ($5.000 million) to the total program element between the Current President's Budget (CPB) and Previous President's Budget (PPB). $5.000 million was added to project EZ8 Leader\/Follower program to provide transportation units with the capability to remove Soldier operators from Palletized Loading System (PLS) vehicles while operating in a convoy."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "659"
                    },
                    "ProjectTitle": {
                        "val": "Family Of Hvy Tac Veh"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.988"
                        },
                        "CurrentYear": {
                            "val": "1.977"
                        },
                        "BudgetYearOne": {
                            "val": "6.921"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.921"
                        },
                        "BudgetYearTwo": {
                            "val": "13.42"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "109.102"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "138.408"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funding supports modernization of the current Tactical Wheeled Vehicle fleets by investigating technology insertions including, but not limited to: condition based maintenance, vetronics, Victory Architecture, autonomous operations and other emerging technologies.  Funding also supports developing initial prototypes to enable refinement of Operational Requirements and early user feedback to support future sustainment and operational movement operating concepts.\n\nThe Heavy Equipment Transporter System (HETS) is comprised of a M1070A1 Tractor and M1000 Trailer for transport, recovery and evacuation of heavy, oversized combat equipment such as the M1A1 Abrams main battle tank (MBT) and M88 recovery vehicle or similar loads. The current HETS has two capability gaps: Payload and Road Network Accessibility. The current HETS is not capable of transporting or loading\/unloading the heaviest combat platform in the ABCT since it exceeds the HETS rated payload of 70 tons (U.S.). Road Network Accessibility of the current HETS is restricted due to exceeding axle load limits CONUS\/OCONUS, which prevents the HETS from obtaining road permits. In the near term, the interim solution is to modify current HETS tractors and procure new HETS trailers. The long term solution is the Enhanced Heavy Equipment Transporter System (EHETS) that will address these capability gaps. \n\nThe near term interim solution is in response to a United States Army Europe (USAREUR) Operational Needs Statement (ONS# 17-22207) for Heavy Equipment Transporter Systems with deliveries beginning the first quarter of FY2020. The USAREUR HETS ONS solution will be capable of carrying 78.5 Tons of payload while achieving host country road permits at a reduced weight of 75 tons. The recommended course of action for satisfying the ONS is to utilize a modified version of the M1070A1 tractor combined with a commercial 8-axle trailer.  Per the 1 DEC 17 Army Requirements Oversight Council (AROC) decision, this trailer will be capable of carrying 85 tons.  The AROC also directed an additional modification to the tractor that will allow it to achieve an ultimate carrying capacity of 85 tons.\n\nThe Enhanced Heavy Equipment Transporter System (EHETS) is the replacement system for the Heavy Equipment Transporter System (HETS). It is intended to transport, deploy, and evacuate payloads up to the weight of a combat configured M1A2 MBT. It will provide increased payload, highway transportability, and force protection over its predecessor. \n\nThe Heavy Expanded Mobility Tactical Truck (HEMTT) and the Palletized Load System (PLS) are designed for cross-country military missions to transport ammunition, petroleum, oils and lubricants, unit resupply, and other missions throughout the tactical environment to support modern and highly mobile combat units. \n\nThe Semi-Trailer Low-Bed (STLB) is a 25-ton payload capacity semi-trailer with a fixed goose neck, step deck, and rear loading ramps.  The STLB is interoperable with a variety of trucks residing across the U.S. Army equipment and will be introduced into a theater of operations to transport construction equipment (CE) employed by U.S. Army Engineers to execute horizontal and vertical construction projects in support of sustainment operations, exercises\/deployments, disaster relief, and other nation building operations. The STLB will be capable of supporting mobility, counter mobility, survivability, counter improvised and sustainment needs and all applicable North Atlantic Treaty Organization (NATO) interoperability criteria.\n\nFY 2020 Project 659 Base funds in the amount of $2.221 million are for the system level test and evaluation of modified HETS M1070A1 tractors and new commercial trailers that will be capable of 85 ton capacity. \n\nFY 2020 Project 659 Base funds in the amount of $1.200 million are for the development of contracting\/acquisition milestone documentation and systems engineering plans for the Enhanced Heavy Equipment Transporter System (EHETS) program. The EHETs program is expected to enter at Milestone B after completion of the Analysis of Alternatives (AoA).\n\nFY 2020 Project 659 Base funds in the amount of $1.500 million are for the development, test and evaluation of Heavy Expanded Mobility Tactical Truck (HEMTT) and Palletized Load System (PLS) truck suspension upgrades that are required due to increased vehicle weight as a result of armor kits and Objective Gunner Protection Kit (OGPK) integration. Truck crane and winch replacements are required due to obsolescence of these systems. PLS trailers will be upgraded with anti-lock braking systems (ABS) to meet current Department of Transportation (DOT) and European Agreement concerning the International Carriage of Dangerous Goods by Road (ADR) requirements.\n\nFY 2020 Project 659 Base funds in the amount of $2.000 million are for feasibility testing and evaluation of 25-ton STLB prototype semitrailers. \n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EHETS Acquisition Planning and Documentation Development"
                                    },
                                    "Description": {
                                        "val": "Acquisition planning and documentation development includes matrix personnel program support for the development of contracting\/acquisition milestone documentation and systems engineering plans for the Enhanced Heavy Equipment Transporter System (EHETS) program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.364"
                                            },
                                            "Text": {
                                                "val": "Program Management and Engineering Support"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.3"
                                            },
                                            "Text": {
                                                "val": "Program Management and Engineering Support to prepare contracting documentation, Systems Engineering Plans (SEP) and Test and Evaluation Master Plans (TEMP)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.2"
                                            },
                                            "Text": {
                                                "val": "Matrix staffing required for program development and systems engineering support to prepare acquisition program documents, Systems Engineering Plans (SEP), test and evaluation plans and contracting Request for Proposal (RFP) documentation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2020 increase due to an anticipated affirmative Materiel Development Decision (MDD) in 4QFY2019, resulting in a requirement for additional matrix staffing to generate acquisition program documents, develop systems engineering plans, test and evaluation plans and contracting Request for Proposal (RFP) documentation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HETS M1070A1 Tractor Modifications & System-level Testing"
                                    },
                                    "Description": {
                                        "val": "HETS M1070A1 tractor modifications and system-level testing are required to develop a near term interim solution in response to the USAREUR ONS for a transportation system capable of carrying 78.5 Tons of payload while achieving host country road permits at a reduced weight of 75 tons with an ultimate carrying capacity of 85 tons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.159"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.614"
                                            },
                                            "Text": {
                                                "val": "Research and develop a solution to modify the current M1070A1 HETS tractor to ultimately carry an 85 tons payload when paired with the commercial trailer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.221"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.221"
                                            },
                                            "Text": {
                                                "val": "HET System-level testing and evaluation of modified M1070A1 tractors and new commercial trailers required for the USAREUR ONS to meet 85 ton capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to requirement for system level testing of modified HETS tractors and new commercial trailers."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HEMTT\/PLS Upgrades"
                                    },
                                    "Description": {
                                        "val": "Research, development, test and evaluation of HEMTT and PLS truck suspension upgrades that are required due to increased vehicle weight as a result of armor kits and OGPK integration. Truck crane and winch replacements are required due to obsolescence of these systems. PLS trailers will be upgraded with ABS to meet current DOT and ADR requirements."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Award System Technical Support (STS) Task Orders and fund the development, test and evaluation of HEMTT and PLS truck suspension upgrades that are required due to increased vehicle weight as a result of armor kits and OGPK integration. Truck crane and winch replacements are required due to obsolescence of these systems. PLS trailers will be upgraded with ABS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Award STS Task Orders and fund the development, test and evaluation of HEMTT and PLS truck suspension upgrades."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HDT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.465"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "25T STLB"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Feasibility testing required to evaluate prototype semitrailers from two vendors produced under Other Transaction (OT) project agreement award. Test results will be evaluated to determine single vendor for project agreement production award."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increase due to lack of FY 2020 funding in Project E50 TRAILER DEVELOPMENT. Other Transaction (OT) project agreement prototype awards were made with Project E50 FY 2019 funds."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.063"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "DA0924"
                                    },
                                    "Title": {
                                        "val": "Modification Of In Svc Equip"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "146.587"
                                        },
                                        "CurrentYear": {
                                            "val": "256.642"
                                        },
                                        "BudgetYearOne": {
                                            "val": "86.946"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "58.946"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "28"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.25"
                                        },
                                        "BudgetYearThree": {
                                            "val": "46.05"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "585.475"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DA0500"
                                    },
                                    "Title": {
                                        "val": "Family Of Heavy Tactical Vehicles (FHTV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "110.195"
                                        },
                                        "CurrentYear": {
                                            "val": "160.897"
                                        },
                                        "BudgetYearOne": {
                                            "val": "36.886"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.969"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "26.917"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "80.903"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "388.881"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "D16506"
                                    },
                                    "Title": {
                                        "val": "PLS ESP"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "59.729"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.221"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.28"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "16.941"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.163"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "98.113"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DV0021"
                                    },
                                    "Title": {
                                        "val": "Hvy Expanded Mobile Tactical Truck Ext Serv"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "150.878"
                                        },
                                        "CurrentYear": {
                                            "val": "109.764"
                                        },
                                        "BudgetYearOne": {
                                            "val": "93.575"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "30.841"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "62.734"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "354.217"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "DA0924 - Modification Of In Svc Equip is a shared funding line with other product offices."
                        },
                        "AcquisitionStrategy": {
                            "val": "The current interim solution for the Heavy Equipment Transporter System (HETS) is in response to a United States Army Europe (USAREUR) Operational Needs Statement (ONS# 17-22207) with deliveries beginning the first quarter of FY 2020. The USAREUR HETS ONS solution shall be capable of carrying 78.5 Tons of payload while achieving host country road permits at a reduced weight of 75 tons. The recommended course of action for satisfying the ONS is to utilize a modified version of the M1070A1 tractor combined with a commercial 8-axle trailer.  Per the 1 DEC 17 Army Requirements Oversight Council (AROC), this trailer will be capable of carrying 85 tons.  The AROC also directed an additional modification to the tractor that will allow it to achieve an ultimate carrying capacity of 85 tons.\n\nBased on the outcome of the Analysis of Alternatives (AoA) and Materiel Development Decision (MDD), the Enhanced Heavy Equipment Transporter System (EHETS) is expected to enter at MS B and the acquisition will be a full and open competition.  Planned efforts include: Requirements Analysis (FY18), Milestone B, Test plans and RFP documentation preparation (FY19-FY23), RFP release (FY22), and EMD Contract Award (FY23).\n\nHEMTT\/PLS upgrades will be developed through System Technical Support (STS) task orders in FY20, tested and evaluated in FY21, and then applied through block upgrades on the FHTV V contract, which is projected for award in September 2020. Block upgrades to the HEMTT and PLS platforms will be incorporated into the FHTV V production contract in 4QFY2022.\n\nThe 25-Ton Semi-Trailer Low-Bed (STLB) will pursue an Other Transaction (OT) prototype project strategy, with prototype award anticipated in 3QFY2019. Prototype feasibility testing will begin in 2QFY2020. Feasibility testing required to evaluate prototype semitrailers from two vendors produced under the OT project agreement award. Test results will be evaluated to determine single vendor for project agreement production award. MS C is projected for 1QFY2021. Low rate initial production (LRIP) is expected to begin 3QFY2021. \n\nThe Heavy Dump Truck (HDT) entered the acquisition cycle pre-Milestone C, based on a competitive source selection process that resulted in the award of a five year plus two option years firm-fixed price (FFP) indefinite delivery indefinite quantity (IDIQ) contract. The contract award was for one Original Equipment Manufacturer (OEM) to develop an armor solution for a commercially-based dump truck. The commercially-based dump truck will be armor-capable and will be produced concurrently with the development of the armor solution, which will ensure that the armor solution correctly interfaces with the commercially-based dump truck. LRIP began in 3QFY2018. Full rate production (FRP) is expected to begin 4QFY2020."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "EHETS - Technical Reports and Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TRADOC Analysis Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Lee, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.3"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.364"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.664"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HETS M1070A1 Tractor Modification"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oshkosh Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Oshkosh, WI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.337"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.614"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.951"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEMTT\/PLS Upgrades Development (STS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oshkosh Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Oshkosh, WI"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.75"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.75"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.750"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT - IETM Authoring System Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMRDEC - Redstone Arsenal"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.465"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.465"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM HTV"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.063"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.063"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "EHETS Acquisition Planning and Documentation Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM LCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.148"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.2"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.648"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "USAREUR HETS ONS System Level Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.5"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.822"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.221"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.221"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.543"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEMTT\/PLS Upgrades Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.75"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.75"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.750"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "25T STLB Prototype Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443328_659.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "20190304_1_443328_659.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Enhanced Heavy Equipment Transporter System (EHETS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Perform pre-MDD Studies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Materiel Development Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Analysis of Alternatives"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Milestone B Documentation Preparation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Contract Documentation and Test Plans Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Request for Proposal Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Source Selection Evaluation Board"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Engineering and Manufacturing Development Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "USAREUR HETS ONS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "USAREUR HETS ONS Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HEMTT\/PLS Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development Engineering"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Upgrades Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "25-Ton Semitrailer Lowbed (25T STLB)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "25T STLB Prototype Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "E50"
                    },
                    "ProjectTitle": {
                        "val": "TRAILER DEVELOPMENT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.52"
                        },
                        "CurrentYear": {
                            "val": "5.286"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.806"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "There is no FY 2020 funding for Project E50 \/ TRAILER DEVELOPMENT. The project was previously funded in FY 2019. 25-Ton Semitrailer prototype test and evaluation will be funded in FY 2020 from Project 659 \/ Family of Heavy Tactical Vehicles."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Semi-Trailer Low-Bed (STLB) is a 25-ton payload capacity semi-trailer with a fixed goose neck, step deck, and rear loading ramps.  The STLB is interoperable with a variety of trucks residing across the U.S. Army equipment and will be introduced into a theater of operations to transport construction equipment (CE) employed by U.S. Army Engineers to execute horizontal and vertical construction projects in support of U.S. Military or other national goals and objectives. The STLB is employed to transport CE, miscellaneous equipment, disabled equipment, Class IV (construction materials), and logistical provisions. The STLB supports units in the execution of the following tasks: expand the lodgment, construction\/upgrade\/rehabilitation and maintenance of main supply routes (MSR), alternate supply routes (ASR), logistical facilities, bituminous roads, helipads, airfields, landing strips, motor pools, parking areas, etc. These types of facilities are required for sustainment operations during decisive action operations. The STLB will also be used during routine exercises\/deployments, disaster relief, and other nation building operations. The STLB will be capable of supporting mobility, counter mobility, survivability, counter improvised and sustainment needs and all applicable North Atlantic Treaty Organization (NATO) interoperability criteria. \n\nThe Heavy Equipment Transporter System (HETS) is comprised of a M1070A1 Tractor and M1000 Trailer for transport, recovery and evacuation of heavy, oversized combat equipment such as the M1A1 Abrams main battle tank (MBT) and M88 recovery vehicle or similar loads. The current HETS has two capability gaps: Payload and Road Network Accessibility. The current HETS is not capable of transporting or loading\/unloading the heaviest combat platform in the ABCT since it exceeds the HETS rated payload of 70 tons (U.S.). Road Network Accessibility of the current HETS is restricted due to exceeding axle load limits CONUS\/OCONUS, which prevents the HETS from obtaining road permits. In the near term, the interim solution is to modify current HETS tractors and procure new HETS trailers. The long term solution is the Enhanced Heavy Equipment Transporter System (EHETS) that will address these capability gaps. \n\nThe near term interim solution is in response to a United States Army Europe (USAREUR) Operational Needs Statement (ONS# 17-22207) for Heavy Equipment Transporter Systems with deliveries beginning the first quarter of FY2020. The USAREUR HETS ONS solution will be capable of carrying 78.5 Tons of payload while achieving host country road permits at a reduced weight of 75 tons. The recommended course of action for satisfying the ONS is to utilize a modified version of the M1070A1 tractor combined with a commercial 8-axle trailer.  Per the 1 DEC 17 Army Requirements Oversight Council (AROC) decision, this trailer will be capable of carrying 85 tons.  The AROC also directed an additional modification to the tractor that will allow it to achieve an ultimate carrying capacity of 85 tons.  \n\nThe Enhanced Heavy Equipment Transporter System (EHETS) is a force protected tractor and trailer to operationally move and load\/unload the heaviest combat platform in the ABCT.  EHETS will be capable of transporting at a higher rated payload and will self-load\/unload heavy and outsized equipment such as the Abrams SEPv2 and SEPv3, which currently exceeds the existing Heavy Equipment Transporter System rated capacity of 70-tons (U.S.), while achieving road network accessibility (e.g. road permits) and mobility on primary and secondary roads. \n\nThe Heavy Dump Truck (HDT) supports construction projects by loading, transporting and dumping payloads of sand and gravel aggregates, crushed rock, hot asphalt mixes, earth, clay, rubble, large boulders and other materials up to gross vehicle weight rating to job sites under world-wide climatic conditions.  The HDT also serves as a quarry truck for the quick transport of bulk raw earth material to and from the crushing, screening and washing plant and the asphalt mixing plant.  The HDT also serves as a transportation asset for organizational equipment.  The HDT is Long Term Armor Strategy (LTAS) compliant with MRAP 1.1 underbody protection.  The armor solution is developed concurrently with the production of armor capable HDTs. \n\nFunding supports modernization of the current Tactical Wheeled Vehicle fleets by investigating technology insertions including, but not limited to: condition based maintenance, vetronics, Victory Architecture, autonomous operations and other emerging technologies.   Funding also supports developing initial prototypes to enable refinement of Operational Requirements and early user feedback to support future sustainment and operational movement operating concepts\n\nThere is no FY 2020 funding for Project E50 \/ TRAILER DEVELOPMENT. The above activities were funded with Project E50 funds prior to FY 2020.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "25-Ton STLB Prototypes"
                                    },
                                    "Description": {
                                        "val": "Award of 25-Ton STLB prototypes, test services support and data item deliverables for test."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.3"
                                            },
                                            "Text": {
                                                "val": "Preparation of solicitation, scope of work, and other acquisition documentation leading to Other Transaction (OT) prototype project agreement awards to two vendors. Prototype builds of ten semitrailers (five trailers per vendor) expected to begin 4QFY2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019: Preparation of solicitation, scope of work, and other acquisition documentation leading to prototype awards.  There is no FY 2020 funding for Project E50."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Engineering\/Program Management (SEPM) Support"
                                    },
                                    "Description": {
                                        "val": "SEPM includes PM and System Engineering oversight required to conduct requirements analysis, specification development, program management and contractor oversight. Salaries, Benefits, Travel, Personnel Training and other Government costs are included for retaining a professional acquisition workforce."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.61"
                                            },
                                            "Text": {
                                                "val": "Program management and systems engineering support for 25-Ton STLB program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HDT Prototypes"
                                    },
                                    "Description": {
                                        "val": "Build six (6) armored Heavy Dump Trucks (HDTs) and one (1) armored cab. The armor solution will be developed concurrently with the armor capable truck."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.792"
                                            },
                                            "Text": {
                                                "val": "The armor solution is developed concurrently with the production of armor capable HDTs. Upon development of the armor solution, the Government procures a total of six (6) armored HDT prototypes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Prototype production will be complete with FY 2019 RDTE funding. Prototype testing will be conducted with FY 2020 funds under Project VR5."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HETS M1070A1 Tractor Modification"
                                    },
                                    "Description": {
                                        "val": "Modify M1070A1 tractors that were required for the USAREUR HETS ONS to meet an 85 tons capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.91"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.194"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "D01650"
                                    },
                                    "Title": {
                                        "val": "SEMITRAILER LOW BED 25 TON"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "1.618"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.619"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.619"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "16.116"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.425"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.639"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.363"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "71.780"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DV0012"
                                    },
                                    "Title": {
                                        "val": "HEAVY EQUIPMENT TRANSPORTER SYS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "37.398"
                                        },
                                        "CurrentYear": {
                                            "val": "72.169"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "109.567"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "D16001"
                                    },
                                    "Title": {
                                        "val": "TRUCK, DUMP, 20T (CCE)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.083"
                                        },
                                        "CurrentYear": {
                                            "val": "5.061"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.838"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.838"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.339"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.06"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "46.381"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DA0924"
                                    },
                                    "Title": {
                                        "val": "Modification Of In Svc Equip"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "146.587"
                                        },
                                        "CurrentYear": {
                                            "val": "256.642"
                                        },
                                        "BudgetYearOne": {
                                            "val": "86.946"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "58.946"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "28"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.25"
                                        },
                                        "BudgetYearThree": {
                                            "val": "46.05"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "585.475"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "DA0924 - Modification Of In Svc Equip is a shared funding line with other product offices."
                        },
                        "AcquisitionStrategy": {
                            "val": "The 25-Ton Semi-Trailer Low-Bed (STLB) will pursue an Other Transaction (OT) prototype project strategy, with prototype award anticipated in 3QFY2019. Prototype feasibility testing projected to begin 2QFY2020 and will evaluate prototype semitrailers from two vendors produced under the OT project agreement award. Test results will be evaluated to determine single vendor for project agreement production award. MS C projected for 1QFY2021. Low rate initial production (LRIP) expected to begin 3QFY2021. \n\nThe Heavy Dump Truck (HDT) entered the acquisition cycle pre-Milestone C, based on a competitive source selection process that resulted in the award of a five year plus two option years firm-fixed price (FFP) indefinite delivery indefinite quantity (IDIQ) contract. The contract award was for one Original Equipment Manufacturer (OEM) to develop an armor solution for a commercially-based dump truck. The commercially-based dump truck will be armor-capable and will be produced concurrently with the development of the armor solution, which will ensure that the armor solution correctly interfaces with the commercially-based dump truck. LRIP began in 3QFY2018. Full rate production (FRP) is expected to begin 4QFY2020."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Heavy Dump Truck (HDT) Prototype Design of Armored Cab"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.792"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.792"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HETS M1070A1 Tractor Modification"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oshkosh Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Oshkosh, WI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.91"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.910"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "25-Ton STLB Prototypes"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.300"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM HTV"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.194"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.194"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering\/Program Management (SEPM)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.61"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.610"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443328_E50.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "SEMI-TRAILER LOW-BED 25-Ton Trailer"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Materiel Development Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prototype Project Agreement Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prototype Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Feasibility Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "USAREUR HETS ONS Tractor Mods"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HEAVY DUMP TRUCK (HDT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armor Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored Prototype Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EZ8"
                    },
                    "ProjectTitle": {
                        "val": "Leader\/Follower"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5"
                        },
                        "BudgetYearOneBase": {
                            "val": "5"
                        },
                        "BudgetYearTwo": {
                            "val": "10.649"
                        },
                        "BudgetYearThree": {
                            "val": "9.422"
                        },
                        "BudgetYearFour": {
                            "val": "5.886"
                        },
                        "BudgetYearFive": {
                            "val": "5.329"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "36.286"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "PdM ALUGS Leader Follower efforts transitioned from the  0604017A Robotics Development FD9 Robotic Systems line in FY 2018 and FY 2019 to a Program of Record under 0604622A Family of Heavy Tactical Vehicles EZ8 Leader\/Follower in FY 2020. ."
                        },
                        "ProjectMissionDescription": {
                            "val": "Tactical Wheeled Vehicle Leader Follower program provides transportation units with the capability to unman Tactical Wheeled Vehicles (TWVs), beginning with the Palletized Loading System (PLS) vehicles, while operating in a convoy.  This is accomplished by integrating technology to the unmanned vehicles which enables them to follow a manned lead vehicle. This is done in a March Unit of up to (8) TWVs initially PLS vehicles, with (1) manned Lead vehicle and (3) to (7) unmanned follower vehicles.  This capability provides increased Soldier Force Protection and increased convoy logistics throughput by giving commanders more options on Soldier utilization, removing Soldiers from threat zones and\/or utilizing vehicle operators for convoy security, and allowing supply convoys to run more often.\n\nFY20 RDT&E funds will execute testing for the Tactical Wheeled Leader Follower program for safety and performance evaluations by Army Test & Evaluation Command (ATEC) to support production decision by the Milestone Decision Authority, fund Program Management office lifecycle planning, and engagements with industry to plan and solicit proposals for the production contracts.FY20 funds will enable the Tactical Wheeled Leader Follower  program to transition to the Program Office from TARDEC, to complete Engineering and Manufacturing Development (EMD), prepare for and execute a production decision (Milestone C), and begin contract planning and actions for Low Rate Initial Production (LRIP), Production Qualification Testing (PQT), and Initial Operational Testing (IOT)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Wheeled Vehicle Leader Follower"
                                    },
                                    "Description": {
                                        "val": "Funding line is new in FY20 for Project Manager Force Projection, Product Manager Applique and Large Unmanned Systems, to execute the program of record for the Leader Follower capability of removing Soldier Operators from the PLS.  This provides increased Soldier protection and logistics throughput."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "FY20 funding will be used for the execution and management of the Leader Follower Transition Agreement (TA) and support LF Capability requirements development. It will also fund the chartering and support of the Test and Evaluation Working Integrated Product Team (T&E WIPT), Risk Management support, Logistics planning and IPT initiation.Technical Manual Validation and Logistics Demo will be funded in FY20. Funding will complete testing of the Expedient Leader Follower system design as it completes the engineering and operational demonstration phase under a directed requirement. Pre-Production Qualification Testing which includes RAM testing, Obstacle Detection and Avoidance Testing and Degraded System Testing will occur in FY20.   Funding will support formal validation of the demonstrated capability, and manpower support for production planning and Milestone C execution."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This funding line is new in FY20 to execute the program of record for the Leader Follower capability of unmanning Tactical Wheeled Vehicles initially the Palletized Load System (PLS)."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0604017A"
                                    },
                                    "Title": {
                                        "val": "Robotics Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "38.051"
                                        },
                                        "CurrentYear": {
                                            "val": "74.368"
                                        },
                                        "BudgetYearOne": {
                                            "val": "115.222"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "115.222"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "105.332"
                                        },
                                        "BudgetYearThree": {
                                            "val": "132.978"
                                        },
                                        "BudgetYearFour": {
                                            "val": "83.91"
                                        },
                                        "BudgetYearFive": {
                                            "val": "65.971"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "615.832"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Prior to FY20, PM LF efforts were funded under the Robotics Development 6.4 line along with TARDEC who had most of the funding."
                        },
                        "AcquisitionStrategy": {
                            "val": "The TWV LF Acquisition Strategy leverages prior developed and demonstrated technology, developed under a HQDA G-8 Directed Requirement effort by TARDEC and transitions to the Program Manager Force Projection, PdM ALUGS, for Milestone C, Production Qualification Testing in FY20-21, and Full Rate Production in FY23.  PdM ALUGS will award a production contract after the MS C decision to build Low Rate Initial Production (LRIP) assets for testing.  This configuration and technology will be what was approved under the prior directed requirement effort and will fulfill the user's requirements as identified in the Capabilities Development Document (CDD).  The funding allows for the Army to mature the technology demonstrated under the directed requirement, fully validate the production solution and ensure safe and suitable operation, develop the appropriate logistics products, operations manuals, and supportability strategy, and field an enduring unmanned, robotic, autonomous PLS convoy capability to Soldiers."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LF Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM FP"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI; Harrison Twp, MI"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.95"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.95"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.950"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LF Tech Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TARDEC, TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.41"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.41"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.410"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "LF Test Support ATEC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.64"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.64"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.640"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443328_EZ8.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "LEADER FOLLOWER (LF) ALUGS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2027"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Pre-Production Qualification testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF PoR Technology Readiness Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Life Cycle Sustainment Plan (LCSP) final"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Tech Manual Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Logistics Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Low Rate Initial Production (LRIP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Production Qualification Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF First Unit Equipped"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Initial Operational Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Full Rate Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2027"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LF Full Materiel Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VR5"
                    },
                    "ProjectTitle": {
                        "val": "TWV Protection Kits"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.578"
                        },
                        "CurrentYear": {
                            "val": "4.672"
                        },
                        "BudgetYearOne": {
                            "val": "4.824"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.824"
                        },
                        "BudgetYearTwo": {
                            "val": "2.82"
                        },
                        "BudgetYearThree": {
                            "val": "3.085"
                        },
                        "BudgetYearFour": {
                            "val": "2.971"
                        },
                        "BudgetYearFive": {
                            "val": "3.482"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "23.432"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element supports periodic, evolutionary upgrade of survivability and crew protection for Heavy Tactical Vehicles (HTV) and Medium Tactical Vehicles (MTV) as described in the Tactical Wheeled Vehicle (TWV) Strategy and individual variants' Capability Production Documents (CPDs). The upgrades will leverage the Army Technology Objective's (ATO) survivability and Army Research Laboratory's (ARL) research and development activities to develop and evaluate armor kits which increase the protection level of all HTVs to the Mine-Resistant Ambush Protected (MRAP) protection level as well as anticipating changing threat environments, protection gaps, or improving the operating performance, efficiency, and reliability through armor weight reduction. This Program Element (PE) also supports increasing crew protection by leveraging advancements in autonomous ground vehicle technology via development and evaluation of autonomous applique kits that can be applied to the current and future HTV fleet. Funding supports modernization of the current Tactical Wheeled Vehicle fleets by investigating technology insertions including, but not limited to: condition based maintenance, vetronics, Victory Architecture, autonomous operations and other emerging technologies.  Funding also supports developing initial prototypes to enable refinement of Operational Requirements and early user feedback to support future sustainment and operational movement operating concepts.\n\nThe Heavy Dump Truck (HDT) supports construction projects by loading, transporting and dumping payloads of sand and gravel aggregates, crushed rock, hot asphalt mixes, earth, clay, rubble, large boulders and other materials up to gross vehicle weight rating to job sites under world-wide climatic conditions. The HDT also serves as a quarry truck for the quick transport of bulk raw earth material to and from the crushing, screening and washing plant and the asphalt mixing plant. The HDT also serves as a transportation asset for organizational equipment. The HDT is Long Term Armor Strategy (LTAS) compliant with MRAP 1.1 underbody protection. The armor solution is developed concurrently with the production of armor capable HDTs. \n\nThe Heavy Equipment Transporter System (HETS) is comprised of a M1070A1 Tractor and M1000 Trailer for transport, recovery and evacuation of heavy, oversized combat equipment such as the M1A1 Abrams main battle tank (MBT) and M88 recovery vehicle or similar loads. The current HETS has two capability gaps: Payload and Road Network Accessibility. The current HETS is not capable of transporting or loading\/unloading the heaviest combat platform in the ABCT since it exceeds the HETS rated payload of 70 tons (U.S.). Road Network Accessibility of the current HETS is restricted due to exceeding axle load limits CONUS\/OCONUS, which prevents the HETS from obtaining road permits. In the near term, the interim solution is to modify current HETS tractors and procure new HETS trailers. The long term solution is the Enhanced Heavy Equipment Transporter System (EHETS) that will address these capability gaps. The EHETS will provide increased payload, highway transportability, and force protection over its predecessor. \n\nThe near term interim solution is in response to a United States Army Europe (USAREUR) Operational Needs Statement (ONS# 17-22207) for Heavy Equipment Transporter Systems with deliveries beginning the first quarter of FY2020. The USAREUR HETS ONS solution will be capable of carrying 78.5 Tons of payload while achieving host country road permits at a reduced weight of 75 tons. The recommended course of action for satisfying the ONS is to utilize a modified version of the M1070A1 tractor combined with a commercial 8-axle trailer. Per the 1 DEC 17 Army Requirements Oversight Council (AROC) decision, this trailer will be capable of carrying 85 tons. The AROC also directed an additional modification to the tractor that will allow it to achieve an ultimate carrying capacity of 85 tons.\n\nThe Family of Medium Tactical Vehicles (FMTV) Armor Kit design was greatly enhanced and requires testing to support Full Material Release. The FMTV requirements document issued for a Medium Tactical Vehicle (MTV) truck delineates model configuration upgrades needed to support required transport capabilities, armor capabilities, and load dimensions. This Acquisition Strategy reduces operation and support costs, displaces vehicles which cannot be armored, and results in a more reliable fleet.\n\nFY 2020 Project VR5 Base funds in the amount of $4.324 million will be used to test six (6) armored Heavy Dump Trucks. Armored truck testing costs include system testing, evaluation and report production for the HDT program. The Government will conduct Production Verification Testing (PVT), which includes First Production Vehicle Inspection (FPVI), Reliability, Availability, and Maintainability (RAM) testing, Operational Testing (OT), and Live Fire Testing (LFT), as well as OEM test services support, familiarization training and refurbishment of test assets. \n                     \nFY 2020 Project VR5 Base funds in the amount of $0.500 million will be used for testing of the improvements to the Family of Medium Tactical Vehicles (FMTV) Armor Kit that are required to support Full Material Release.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HEMTTA4\/PLSA1 Suspension and Weapon Station Upgrade CROWS"
                                    },
                                    "Description": {
                                        "val": "Design new HEMTTA4 and PLSA1 axle and suspension components and integrate protected weapon station."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.168"
                                            },
                                            "Text": {
                                                "val": "Conduct studies, modeling and simulation, and Computer Aided Design (CAD) model and drawing creation, and create bill of materiel."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HEMTTA4\/PLSA1 Weapon Station Upgrade \/ Testing"
                                    },
                                    "Description": {
                                        "val": "Integrate and test HEMTTA4 \/ PLSA1 weapon station ring mount kit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.112"
                                            },
                                            "Text": {
                                                "val": "Order and receive parts, verify quality and assemble."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HDT Prototypes"
                                    },
                                    "Description": {
                                        "val": "Build six (6) armored Heavy Dump Trucks (HDTs) and one (1) armored cab.  The armor solution will be developed concurrently with the armor capable truck."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.169"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.701"
                                            },
                                            "Text": {
                                                "val": "The armor solution will be developed concurrently with the production of armor capable HDTs. Upon development of the armor solution, the Government will procure six (6) armored HDTs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Prototype production will be complete with FY 2019 RDTE funding. Prototype testing will be conducted with FY 2020 funds."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HDT Testing"
                                    },
                                    "Description": {
                                        "val": "Reliability, Availability, and Maintainability (RAM) testing and system performance testing \/ evaluation of the armored HDTs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.324"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.324"
                                            },
                                            "Text": {
                                                "val": "Armored HDT testing costs include system testing, evaluation and report production for the HDT program. The Government will conduct Production Verification Testing (PVT), First Production Vehicle Inspection (FPVI), Reliability, Availability, and Maintainability (RAM) testing and Live Fire Testing (LFT), as well as OEM test services support, familiarization training and refurbishment of test assets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Majority of HDT test costs are funded with FY 2020 funds."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FMTV Armor Kit Testing"
                                    },
                                    "Description": {
                                        "val": "Development and testing of improvements to the FMTV Armor Kit that simplifies the design and reduces installation cost and complexity."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.8"
                                            },
                                            "Text": {
                                                "val": "FY19 funding will be used for Live Fire Testing of the FMTV Underbody Armor Kit improvements to support Full Material Release."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.5"
                                            },
                                            "Text": {
                                                "val": "FY 2020 funding will be used for testing of the FMTV Underbody Armor Kit improvements to support Full Material Release."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to less extensive testing requirements in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUSK"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.129"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.171"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "D04017"
                                    },
                                    "Title": {
                                        "val": "HEAVY TACTICAL VEHICLE PROTECTION KITS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.778"
                                        },
                                        "CurrentYear": {
                                            "val": "49.8"
                                        },
                                        "BudgetYearOne": {
                                            "val": "51.094"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.743"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "25.351"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "51.668"
                                        },
                                        "BudgetYearThree": {
                                            "val": "55.736"
                                        },
                                        "BudgetYearFour": {
                                            "val": "70.783"
                                        },
                                        "BudgetYearFive": {
                                            "val": "71.195"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "367.054"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "D04016"
                                    },
                                    "Title": {
                                        "val": "MEDIUM TACTICAL VEHICLE PROTECTION KITS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.916"
                                        },
                                        "CurrentYear": {
                                            "val": "38.328"
                                        },
                                        "BudgetYearOne": {
                                            "val": "44.019"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.37"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "24.649"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "44.562"
                                        },
                                        "BudgetYearThree": {
                                            "val": "49.767"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.933"
                                        },
                                        "BudgetYearFive": {
                                            "val": "33.622"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "266.147"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "D16001"
                                    },
                                    "Title": {
                                        "val": "TRUCK, DUMP, 20T (CCE)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.083"
                                        },
                                        "CurrentYear": {
                                            "val": "5.061"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.838"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.838"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.339"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.06"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "46.381"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DA0500"
                                    },
                                    "Title": {
                                        "val": "Family Of Heavy Tactical Vehicles (FHTV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "110.195"
                                        },
                                        "CurrentYear": {
                                            "val": "160.897"
                                        },
                                        "BudgetYearOne": {
                                            "val": "36.886"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.969"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "26.917"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "80.903"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "388.881"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Heavy Dump Truck (HDT) entered the acquisition cycle pre-Milestone C, based on a competitive source selection process that resulted in the award of a five year plus two option years firm-fixed price (FFP) indefinite delivery indefinite quantity (IDIQ) contract. The contract award was for one Original Equipment Manufacturer (OEM) to develop an armor solution for a commercially-based dump truck. The commercially-based dump truck will be armor-capable and will be produced concurrently with the development of the armor solution, which will ensure that the armor solution correctly interfaces with the commercially-based dump truck. LRIP began in 3QFY2018. Full rate production (FRP) is expected to begin 4QFY2020.\n\nThe current interim solution for the Heavy Equipment Transporter System (HETS) is in response to a United States Army Europe (USAREUR) Operational Needs Statement (ONS# 17-22207) with deliveries beginning the first quarter of FY 2020. The USAREUR HETS ONS solution shall be capable of carrying 78.5 Tons of payload while achieving host country road permits at a reduced weight of 75 tons. The recommended course of action for satisfying the ONS is to utilize a modified version of the M1070A1 tractor combined with a commercial 8-axle trailer.  Per the 1 DEC 17 Army Requirements Oversight Council (AROC), this trailer will be capable of carrying 85 tons.\n\nConduct FMTV Underbody Armor Kit Testing.  This effort will utilize Government test facilities.\n\nHEMTTA4\/PLSA1 Suspension and Weapon Station Upgrades includes the design, development, prototypes and testing of new axles, suspension components, and protected weapon station components. The new components will be tested and approved to be released as a stand-alone kit or revision to the current underbody armor kit (aka C-Kit). Technical Data Package (TDP) Conversion from Prototype-level to Production-level will convert and release a Production-level TDP. When complete, the kit can be procured competitively."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Heavy Dump Truck (HDT) Prototype Design of Armored Cab"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.169"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.701"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.870"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Weapon Station OGPK\/CROWS - STS Task Order"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oshkosh Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Oshkosh, WI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.326"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.168"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.494"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HUSK TDP Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TARDEC CSI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.129"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.129"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FY 2019 SBIR \/ STTR Transfer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM HTV"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.171"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.171"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HDT - Production Verification Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.9"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.9"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.900"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT - Live Fire Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.4"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.4"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.400"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT -  Familiarization Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.05"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.05"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.050"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT - Test Services Representative"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT - Test System Support Package"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.35"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.35"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HDT - Refurb of Test Assets"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mack Defense"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Allentown, PA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.124"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.124"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-09"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.124"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FMTVA1P2 Underbody Armor Kit Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Grounds, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.8"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.5"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.300"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEMTTA4 \/ PLSA1 Weapons Station Ring Mount Kit"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Test Center (ATC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.112"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.112"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20190304_0_443328_VR5.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "HEAVY DUMP TRUCK (HDT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armor Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored LRIP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored Cab Live Fire Exploitation Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored PVT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored Live Fire Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Armored Operational Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Type Classification\/Materiel Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HDT Initial Operating Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HEMTTA4\/PLSA1 Suspension and Weapon Station OGPK\/CROWS Task Order 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FMTV Armor Kit Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}