{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-78",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605804D8Z"
        },
        "ProgramElementTitle": {
            "val": "Development Test & Evaluation"
        },
        "R1LineNumber": {
            "val": "171"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "79.102"
            },
            "PriorYear": {
                "val": "19.810"
            },
            "CurrentYear": {
                "val": "20.133"
            },
            "BudgetYearOne": {
                "val": "22.203"
            },
            "BudgetYearOneBase": {
                "val": "22.203"
            },
            "BudgetYearTwo": {
                "val": "22.249"
            },
            "BudgetYearThree": {
                "val": "22.592"
            },
            "BudgetYearFour": {
                "val": "20.977"
            },
            "BudgetYearFive": {
                "val": "21.422"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) establishes the dedicated funding line to carry out the duties in accordance with Department of Defense Instruction (DoDI) 5000.02 Change 3 dated August 10, 2017 and the FY 2018 National Defense Authorization Act (NDAA) section 838.  Specific responsibilities are outlined in DoDI 5134.17 Change 1 dated September 2015.  The Deputy Director for Developmental Test and Evaluation (DT&E) is the principal advisor to the Secretary of Defense, the Under Secretary of Defense, Research and Engineering (OUSD(R&E)) on Development Test and Evaluation (DT&E) in the DoD.\n\nThe DT&E program element supports the three strategic lines of effort within the National Defense Strategy (NDS).  DT&E supports the NDS line of effort of Building a More Lethal Force by continuously engaging with programs throughout the acquisition lifecycle with the goal of helping them to succeed and providing acquisition leaders timely decision-quality information of demonstrated program performance before major program reviews for fielding modernized key capabilities to the warfighter. The DT&E program element supports the NDS reforming the Department for Greater Performance and Affordability line of effort through streamlining T&E policy and guidance for legacy and rapid acquisition programs to reduce acquisition cost, schedule, and performance risks and enhancing the experience and qualification of the 8,700 (+) DoD T&E workforce to support priority emerging technologies.\n\nThe DT&E program element is budgeted in the Research Development Test and Evaluation (RDT&E) budget activity to support and improve the DT&E efforts of Major Defense Acquisition Program (MDAP), Major Automated Information System (MAIS) \/ Priority Defense Business Systems, Rapid Fielding efforts, and other Special Interest (SI) acquisition programs designated by OUSD(R&E) as they progress through the acquisition\/development lifecycle; Lead the Test and Evaluation (T&E) career field of the defense acquisition workforce; develop policy and guidance for the conduct of DT&E within the DoD; and prepare reports to Congress as required."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.571"
                },
                "CurrentYear": {
                    "val": "20.179"
                },
                "BudgetYearOne": {
                    "val": "20.261"
                },
                "BudgetYearOneBase": {
                    "val": "20.261"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.810"
                },
                "CurrentYear": {
                    "val": "20.133"
                },
                "BudgetYearOne": {
                    "val": "22.203"
                },
                "BudgetYearOneBase": {
                    "val": "22.203"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.761"
                },
                "CurrentYear": {
                    "val": "-0.046"
                },
                "BudgetYearOne": {
                    "val": "1.942"
                },
                "BudgetYearOneBase": {
                    "val": "1.942"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.721"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.040"
                                },
                                "CurrentYear": {
                                    "val": "-0.046"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.058"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.058"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Scientific Test and Analysis Techniques Center of Excellence Sustainment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "804"
                    },
                    "ProjectTitle": {
                        "val": "Development Test & Evaluation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "79.102"
                        },
                        "PriorYear": {
                            "val": "19.810"
                        },
                        "CurrentYear": {
                            "val": "20.133"
                        },
                        "BudgetYearOne": {
                            "val": "22.203"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.203"
                        },
                        "BudgetYearTwo": {
                            "val": "22.249"
                        },
                        "BudgetYearThree": {
                            "val": "22.592"
                        },
                        "BudgetYearFour": {
                            "val": "20.977"
                        },
                        "BudgetYearFive": {
                            "val": "21.422"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides resources to support Acquisition Program Managers, Chief Developmental Testers, and Lead DT&E Organizations in the development of comprehensive, efficient, and innovative DT&E strategies\/plans to support key acquisition milestones and engineering\/programmatic decisions.  This project also manages the Test & Evaluation (T&E) career field and curriculum for the DoD acquisition workforce, develops policy and guidance for the conduct of DT&E within DoD, and prepares reports to Congress as required.  On behalf of the USD(R&E) this project executes the following activities:\n\n- Develop policy and guidance to ensure efficient and effective DT&E across the DoD, including policy and guidance for developmental testing of interoperability and cybersecurity in coordination with the Joint Staff and DoD Chief Information Officer (CIO).\n- Review and oversee developmental test processes across the services, especially during the formative stages of programs, to include prototyping and experimentation.\n- Ensures that developmental test strategies beginning at Milestone A, are documented in Test and Evaluation Master Plans (TEMPs).  Reviews and approves\/disapproves the developmental test and evaluation strategy\/plans within TEMPs.\n- Provide DT&E subject matter experts to assist programs in constructing Developmental Evaluation Frameworks (DEFs) for inclusion in the TEMP.\n- Provide cybersecurity subject matter experts to assist programs in focusing DT&E efforts to identify potential threat vectors and associated risks early in development.\n- Provide independent DT&E Sufficiency Assessments prior to Milestone B and C decisions with the goal of reducing discovery of performance issues later in the acquisition cycle.\n- When requested by the Secretary or Deputy Secretary of Defense, provide independent developmental test assessments in support of USD(A&S) and Service Major Defense Acquisition Programs.\n- Support the development of independent technical risk assessments and advise the Secretary on the progress toward meeting Key Performance Parameters, technology maturation, reliability growth projections, interoperability, and cybersecurity posture before any decision to grant Milestone A or B approval, or enter into low-rate initial production or full rate production for ACAT ID programs or when requested by the Secretary.\n- Support rapid prototyping, rapid fielding, and technology demonstrations efforts in the development of tailored Middle Tier of Acquisition DT&E strategies\/plans.\n- Serve as the Functional Leader for the T&E acquisition career field.  Establish, oversee, and maintain the education, training, and experience requirements including competencies and certification standards to enhance the T&E acquisition workforce.  Monitor and facilitate Defense Acquisition University (DAU) updates of T&E courses to ensure the curriculum supports the certification standards and provides the appropriate education and training.\n- Manage the Scientific Test and Analysis Techniques Center of Excellence (STAT COE).  Over the last four years, the STAT COE has supported over 40 Acquisition Program Managers in the development of statistically optimized test programs.  These efforts have resulted in 175 more efficient and effective test plans and a test cost avoidance of about $160M.\n- Coordinate with the Test Resources Management Center (TRMC) to identify DoD test infrastructure gaps and support development of the TRMC strategic plan.\n- Coordinate with the Deputy Director for Mission Engineering & Integration (ME&I) to ensure that the DT&E activities of the DoD are fully integrated into, and consistent with, the ME&I and development planning processes of the Department."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "This program supports and improves the DT&E efforts of Major Defense Acquisition Program (MDAP), Major Automated Information System (MAIS) \/Business System Category Programs, and other Special Interest (SI) acquisition programs as they progress through the acquisition\/development lifecycle; oversee the Test and Evaluation (T&E) career field of the defense acquisition workforce; develop policy and guidance for the conduct of DT&E within the DoD; and prepare DT&E reports to Congress."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.810"
                                            },
                                            "Text": {
                                                "val": "- Work with Acquisition Program Managers, Chief Developmental Testers, and Lead DT&E organizations to improve DT&E planning and develop comprehensive and efficient DT&E strategies through the use of disciplined Evaluation Framework Matrices and STAT.\n- Continue to implement the DASD(DT&E) 'Shift Left' philosophy that focuses on ensuring DT&E strategies are developed in advance of releasing Technology Maturation and Risk Reduction (TMRR) and Engineering and Manufacturing Development (EMD) Request For Proposals (RFPs), and increasing the amount and quality of data available to support production decisions with specific focus on cybersecurity, interoperability, and reliability.\n- Review\/approve all TEMPs submitted to support milestone reviews.  Ensure DT&E planning is complete prior to the start of DT&E activities.\n- Refine DT&E policies and methodologies addressing DT&E across all Acquisition programs.\n- Publish DT&E data-based system performance assessments to support Defense Acquisition Board (DAB) review of MDAP and Business System Category programs proceeding to major milestones.\n- Promote the application of sound DT&E and related technical disciplines across the Department's acquisition community and programs.\n- Convene the T&E Key Leadership Position Certification Board to review T&E key leadership candidates.\n- Serve as Functional Manager of the T&E acquisition workforce.\n- Review the DAU T&E education, training, and experience requirements including competencies and certification standards; position category description(s); and content of the DAU courses.  Provide direction on needed changes.\n- Sustain the Scientific Test and Analysis Techniques Center of Excellence (STAT COE).\n- Prepare reports to Congress as required."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.133"
                                            },
                                            "Text": {
                                                "val": "- Work with Acquisition Program Managers, Chief Developmental Testers, and Lead DT&E organizations to improve DT&E planning and develop comprehensive and efficient DT&E strategies\/plans through the use of disciplined Developmental Evaluation Framework Matrices and Scientific Test and Analysis Techniques (STAT).\n- Continue to implement the DT&E 'Shift Left' initiative that focuses on ensuring DT&E strategies\/plans are developed in advance of releasing Technology Maturation and Risk Reduction (TMRR) and Engineering and Manufacturing Development (EMD) RFPs, and increasing the amount and quality of data available to support production decisions with specific focus on cybersecurity, interoperability, and reliability.\n- Review\/approve all TEMPs submitted to support milestone reviews.  Ensure DT&E planning is complete prior to the start of DT&E activities.\n- Refine DT&E policies and methodologies addressing DT&E across all Acquisition programs.\n- Publish independent DT&E Sufficiency Assessments for ACAT ID MDAP programs prior to Milestone B and C decisions with the goal of reducing discovery of performance issues later in the acquisition cycle.\n- When requested by the Secretary or Deputy Secretary of Defense, provide independent developmental test assessments in support of USD(A&S) and Service Major Defense Acquisition Programs.\n- Promote the application of sound DT&E and related technical disciplines across the Department's acquisition community and programs.\n- Support USD (R&E) by developing DT&E related policy & guidance.\n- Convene the T&E Key Leadership Position Certification Board to review T&E key leadership candidates.\n- Serve as Functional Leader of the T&E acquisition workforce.\n- Review the DAU T&E education, training, and experience requirements including competencies and certification standards; position category description(s); and content of the DAU courses.  Provide direction on needed changes.\n- Manage the Scientific Test and Analysis Techniques Center of Excellence (STAT COE) and work with the Services to identify funding to sustain the STAT COE.\n- Prepare reports to Congress as required."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.203"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.203"
                                            },
                                            "Text": {
                                                "val": "- Work with Acquisition Program Managers, Chief Developmental Testers, and Lead DT&E organizations to improve DT&E planning and develop comprehensive and efficient DT&E strategies\/plans through the use of disciplined Developmental Evaluation Framework Matrices and Scientific Test and Analysis Techniques (STAT).\n- Continue to implement the DT&E 'Shift Left' initiative that focuses on ensuring DT&E strategies\/plans are developed in advance of releasing Technology Maturation and Risk Reduction (TMRR) and Engineering and Manufacturing Development (EMD) RFPs, and increasing the amount and quality of data available to support production decisions with specific focus on cybersecurity, interoperability, and reliability.\n- Review\/approve all TEMPs submitted to support milestone reviews.  Ensure DT&E planning is complete prior to the start of DT&E activities.\n- Refine DT&E policies and methodologies addressing DT&E across all Acquisition programs.\n- Publish independent DT&E Sufficiency Assessments prior to Milestone B and C decisions with the goal of reducing discovery of performance issues later in the acquisition cycle.\n- When requested by the Secretary or Deputy Secretary of Defense, provide independent developmental test assessments in support of USD(A&S) and Service Major Defense Acquisition Programs..\n- Promote the application of sound DT&E and related technical disciplines across the Department's acquisition community and programs.\n- Convene the T&E Key Leadership Position Certification Board to review T&E key leadership candidates.\n- Serve as Functional Leader of the T&E acquisition workforce.\n- Review the DAU T&E education, training, and experience requirements including competencies and certification standards; position category description(s); and content of the DAU courses.  Provide direction on needed changes.\n- Prepare required reports to Congress."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of program priorities."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "- Engaged with Program Managers and Chief Developmental Testers to develop and review developmental test strategies on all A&S-designated MDAP, MAIS, and SI programs.\n- Advised Milestone Decision Authorities at Defense Acquisition Board (DAB), Overarching Integrated Product Teams (OIPT), and Nunn-McCurdy Reviews or other reviews.\n- Reviewed DT&E strategy in Test and Evaluation Master Plans (TEMPs) for MDAP, MAIS, and Special Interest programs.\n- Prepared formal DT&E assessments to inform Acquisition decision makers of readiness to enter EMD or begin Low Rate Initial Production.\n- Supported OSD led Peer Reviews.\n- The Scientific Test and Analysis Techniques Center of Excellence (STAT COE) supported development of disciplined test strategies."
                        }
                    }
                }
            ]
        }
    }
}