{
    "id": "2020-Army-PB-2040-JBOOK-bbfb861aa2459c788128b03572c321536da98358a56d59849bf889b375dfd80d-31",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603794A"
        },
        "ProgramElementTitle": {
            "val": "C3 Advanced Technology"
        },
        "R1LineNumber": {
            "val": "72"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "32.404"
            },
            "CurrentYear": {
                "val": "52.332"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "84.736"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned with continuity of effort provided in the following PE:\n* PE 0603463A Network C3I Advanced Technology\n* PE 0603457A C3I Cyber Advanced Development"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE matures and demonstrates technologies to address the integrated tactical communications challenge with distributed, secure, mobile, wireless, and self-organizing communications networks and networked transceivers that must operate reliably in diverse and complex terrains and environments. Efforts demonstrate seamlessly integrated communications and information security technologies across all network tiers, ranging from unattended networks and sensors, through maneuver elements using airborne and space assets. Project EL4 matures and integrates antennas, wireless networking devices, protocols, and software; network operations tools and techniques; and combines these with current fielded networks and systems in a series of command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) network modernization demonstrations to measure their technology readiness levels and assess them against currently fielded network architectures in an operationally relevant environment. Project EL5 matures information security devices, techniques, services, software and algorithms to protect tactical wired and wireless networks against modern network attacks; generates and distributes tactical cyber situational awareness; and focuses on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions.\n\nWork in this PE complements PE 0602782A (Command, Control, Communications Technology), and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602783A (Computer and Software Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603270A (Electronic Warfare Technology) and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by U.S. Army Futures Command (AFC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.426"
                },
                "CurrentYear": {
                    "val": "52.387"
                },
                "BudgetYearOne": {
                    "val": "60.802"
                },
                "BudgetYearOneBase": {
                    "val": "60.802"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.404"
                },
                "CurrentYear": {
                    "val": "52.332"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.022"
                },
                "CurrentYear": {
                    "val": "-0.055"
                },
                "BudgetYearOne": {
                    "val": "-60.802"
                },
                "BudgetYearOneBase": {
                    "val": "-60.802"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.021"
                    },
                    "CurrentYear": {
                        "val": "-0.055"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.001"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-60.802"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-60.802"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 decrease realigns program requirements to other PEs in the Science and Technology portfolio."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EL4"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Comms and Networking Technology Int"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.822"
                        },
                        "CurrentYear": {
                            "val": "37.787"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "54.609"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603463A Network C3I Advanced Technology, Projects: \n* AM7 Modular RF Communications Advanced Technology\n* AM9 Protected SATCOM Advanced Technology\n* AN2 Narrowband SATCOM Advanced Technology\n* AN4 Non Traditional Waveforms Advanced Technology\n* AN6 Prot SATCOM-WB Global SATCOM Inter Canc Adv Tech\n* AO3 Robust Grey C3I Advanced Technology\n* AP6 C4ISR Integrated Demonstrations Advanced Tech\n* AP8 Comms Supp to CSA\/Horizontal Int Fields Adv Tech\n* AP9 Next Generation HF Advanced Technology\n* AQ1 Spectrum Obfuscation Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates key communications and mobile networking technologies, such as antennas, transceivers, transceiver components, networking software and novel techniques to provide secure, reliable, mobile network solutions that function in complex and diverse terrains. This Project concentrates on four major goals: to provide a series of technology demonstrations of new and emerging command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) technology enabled capabilities to significantly reduce risk associated with the network-of-networks concept; to lower the size, weight, power and cost of wireless networking systems deployed on Army platforms through hardware and software convergence; to provide critical improvements in the ability to communicate and move large amounts of information in radio frequency (RF) contested environments, in a seamless, integrated manner across the Army's highly mobile manned and unmanned force structure; and to assess the technology readiness level (TRL) of emerging network technologies in an operationally relevant environment.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n\nThis work is performed by U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enabling C4ISR Infrastructure, formerly C4ISR On the Move (OTM)"
                                    },
                                    "Description": {
                                        "val": "This effort provides a venue for the demonstration of new and emerging Command, Control, Communications, computers, Intelligence, Surveillance and Reconnaissance (C4ISR) technologies. This venue performs field based risk reduction (FBRR) and technology readiness assessments (TRAs) by evaluating the Technology Readiness Levels (TRLs) of candidate Army science and technology (S&T) and best of Industry efforts to support tactical network modernization. The yearly themes for the integrated capabilities event are determined by the maturity of the tech base programs across the Army S&T command, control, communications and intelligence (C3I) portfolio. On an annual basis, those programs at or approaching TRL 6 will be solicited for participation based on their maturity to enter TRA in the FBRR environment located at Joint Base McGuire-Dix- Lakehurst (JB-MDL) (Fort Dix). Upon the completion of technology selection, themes will be developed that inform Army S&T, CERDEC Thrust Areas, Army Warfighting Challenges, Training and Doctrine Command (TRADOC) key technology imperatives, and the overall development of the Mission Command Network of 2025 and beyond."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.107"
                                            },
                                            "Text": {
                                                "val": "Provided event-driven FBRR demonstrations at Joint Base McGuire-Dix-Lakehurst (JB-MDL), NJ; provided early performance feedback to S&T efforts that require robust tactical networks; served as a precursor event for S&T efforts that will later participate in Network Integration Evaluations to assure that problems are identified early enough to be corrected before further assessment; conducted several events in a Cyber Blitz campaign of learning, teaming with TRADOC, operational units, Program Executive Officer and Project Manager partners in an operationally relevant setting to inform cyber doctrine and requirements and investment decisions as well as demonstrate the technical and operational value of Army cyber S&T capabilities (e.g., Tactical Public Key Infrastructure, Cyber Electromagnetic Activities Situational Awareness Tactical Analytics Framework Science and Technology Objective, cyber analytics, and cyber framework); conducted an Uninterrupted Communications event (i.e. resilient in a contested and congested environment), exercising advanced directional networking technologies, communications in a global positioning system (GPS)-denied environment, interference management technologies for integrated electronic warfare\/communications systems, and other related technologies; and conducted an integrated Networking to Improve Maneuver\/Expeditionary event (i.e. communications technologies that improve capability while on the move), exercising cellular-enabled communications, Intra- Soldier Wireless, and software-defined network technologies at the tactical edge, and other related technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.524"
                                            },
                                            "Text": {
                                                "val": "Mature and optimize S&T efforts through FBRR demonstration events; support excursions to assess early S&T efforts that are developing technologies to provide robust and adaptive networks; validate technologies prior to integration and assessment at larger Army-wide events, such as Cyber Quest; conduct an annual event for field demonstration of defensive cyber techniques to provide opportunities for red-team exploitation of  defensive techniques to identify mature technologies and optimize current S&T efforts; exercise novel waveform and non-traditional spectrum technologies to demonstrate sustained communications in congested and contested radio frequency (RF) environments with high throughput and reliability; conduct a demonstration of electromagnetic spectrum signal protection technologies exercising systems to cloud the spectrum and\/or directing enemy systems to non-priority platforms through techniques such as decoying to optimize management of the Army tactical network spectrum signature."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, work in this PE 0603794A\/Project EL4 has been realigned to PE 0603463A\/Projects AP6 in FY20 as part of the financial restructure in support of Army Modernization Priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications, Adaptive Networks to Improve Maneuver Operations, formerly Networking to Improve Maneuver Operations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies and capabilities to provide a range of robust, reliable, scalable, interoperable and resource efficient communications capabilities to expeditionary forces and troops on the move. These capabilities will allow forces to conduct maneuver operations, develop situational understanding, and sustain operations while maintaining freedom of movement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.054"
                                            },
                                            "Text": {
                                                "val": "Completed the design, coding and fabrication of an ISW personal area networking device providing a seamless, wireless capability to the dismounted Soldier in a tactical environment; completed the design for a cellular enabled communications capability that will overcome the current vulnerabilities and limitations of using commercial Long Term Evolution (LTE) cellular technology for tactical operations in an active adversarial radio frequency (RF) environment; designed a system to enhance the non-SATCOM beyond line of sight (troposcatter) capabilities in terms of expanded RF range, increased data range, robustness, stability, automated antenna alignment and setup; and completed an architecture design for a software defined network (SDN) in support of Army tactical edge networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.374"
                                            },
                                            "Text": {
                                                "val": "Exploit technologies operating at higher frequencies to move communications from congested spectrum; validate unconventional waveforms to provide increased capacity and reduced interference for operations such as distributed mission command while remaining elusive to adversary detection; validate mesh networking adaptation to adjust low probability of detection \/ low probability of intercept (LPI\/LPD) and anti-jam enhancements, enabling to ability to adjust to the electromagnetic environment, such as enemy interference from jamming or localized congestion; optimize dismounted distributed beam-forming techniques that will enable distant network nodes to collectively operate as a single emitter to provide enhanced directivity to distant nodes ; provide enhanced situational understanding to enable an increased ability to maintain the network in a near-peer contested environment; optimize and demonstrate standard protocols and interfaces to leverage additional sensing devices and existing transceivers (e.g. spectrum sensing on networking radios); provide data analytics to parse increased spectrum sensing data to provide functional outputs);  demonstrate network technologies in support of the priority Army operational capabilities (e.g. Long Range Precision Fires, Next Generation Combat Vehicle, Future Vertical Lift, Air and Missile Defense, and Soldier Lethality); optimize networking solutions to meet the needs of autonomous platforms to support manned\/unmanned-teaming (MUM-T)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20 work in this PE 0603794A\/Project EL4 has been realigned to PE 0603463A\/Projects AM7, AM9, AN2, AN4, AN6, AN9, AO3, AP6, AP7, AP8, AP9, AQ1."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications, Robust Tactical Systems, formerly Uninterrupted Communications"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates components, software, algorithms and technologies that enable Army tactical wireless networks to operate more efficiently in congested, contested and competitive electromagnetic environments across a multi-domain architecture for mission success. The capabilities developed in this effort provide assured uninterrupted access to critical communications and information links. Efforts will result in robust, reliable and secure terrestrial and satellite communication networks in austere, congested and hostile electromagnetic environments using cost-effective solutions while ensuring that the capability is interoperable and resource efficient. Work accomplished under PE 0602782A\/Project H92 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.661"
                                            },
                                            "Text": {
                                                "val": "Matured advanced Satellite Communication signal processing techniques and algorithms to provide interference suppression for enterprise and tactical ground terminals; mature techniques to improve tactical radio communications by implementing interference cancellation algorithms to provide electronic protection from enemy and unintentional blue force interference; designed and brassboarded conformal antenna apertures for directional beamforming and integrate them with signal processing algorithms for beamforming to demonstrate them in a simulation environment; matured and demonstrated reduced size, weight, power and cost directional networking beam switching distributed antenna array and mast mounted antenna with network controller; mature modules and algorithms for Highband Networking Waveform version 3.0; matured and implemented protocols and algorithms to improve robustness of Long Term Evolution (LTE) cellular based tactical communications systems; matured and implemented a next generation robust narrowband waveform that operates in radio frequency (RF) congested and contested environments; matured a multi-mission networking waveform framework to enable integrated cooperative communication, electronic warfare, position navigation and timing and signal intelligence functionalities; and implemented spectrally efficient algorithms with low out-of-band emissions to support dense channel assignments, flexible resource allocation, variable data rate, anti-jam, and low probability of interception and low probability of detection capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.121"
                                            },
                                            "Text": {
                                                "val": "Demonstrate interference cancellation to maintain uninterrupted satellite communications for a Wideband Global Satellite Communications (WGS) Ka-band configuration; validate ground-based beam-forming algorithms to provide anti-jam access to WGS in close proximity to enemy jamming; validate interference cancellation systems to demonstrate the increased protection for different interferer types and optimize interference cancellation for the satellite modem; mature and demonstrate a cost effective solution to provide protection and operations management in the WGS communications frequency bands; validate interference cancellation systems within a laboratory environment to demonstrate the increased level of protection provided for different interferer types; optimize performance of interference cancellation integrated into satellite modems for enhanced suppression of interference in Army satellite terminals; demonstrate a solution to maintain communications in the presence of enemy jammers and prevent exploitation of the characteristics of Army communication signals through management of spectrum signatures; validate the ability to reduce the probability of detection of tactical waveforms through the use of techniques to camouflage the communications, such as the use of pseudo representative transmissions to cloud the spectrum environment with non-network emissions; improve performance of spectrum accessing waveforms through the implementation of techniques to sense the environment and avoid emissions that would result in interference; optimize deconfliction methods to limit systems from self-jamming; demonstrate protection of tactical networks and tactical assets through the use of decoying; demonstrate brassboard devices to generate varied decoying signals to present multiple signals at a given time, providing the ability to vary the platform projected; validate that decoy signals redirect threats away from valued platform and onto the decoy to enable continued operation of the valued platform; improve performance of assured long range terrestrial communications, such as high-frequency (HF), with the incorporation of low probability of detection \/ low probability of intercept techniques in contested environments; validate interfaces between developed reach back communication solutions and joint service solutions to enable interoperability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20 work in this PE 0603794A\/Project EL4 has been realigned to PE 0603463A\/Projects AM7, AM9, AN2, AN4, AN6, AN9, AO3, AP6, AP7, AP8, AP9, AQ1."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Modular Radio Frequency (RF)"
                                    },
                                    "Description": {
                                        "val": "This effort will enable connectivity in contested & congested spectrum environments by applying modular radio frequency (RF) technologies within an automated network to adapt and continue operation under interference signals. This capability will reduce the rigorous network management through intelligent selection of diverse network connections to seamlessly transmit data and maintain communications within a contested RF environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.525"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a system architecture for an automated network to provide a common interface to an automation algorithm with the capability to optimally select and negotiate across diverse communication links to execute an automated Primary, Alternative, Contingency, Emergency (PACE) military operational plan in support of maintaining resilient tactical communications in a contested and congested environments; demonstrate detection of locally available network products (e.g. Long Term Evolution [LTE], etc.) and incorporation of these products into the automated PACE plan process, including the ranking of the available networks for the PACE plan execution; optimize the mapping of the nodes into the network topology by the automated network through the association of the nodes and users connected to the sub-networks created by the networking technologies and products; validate standard interface specifications between the automated network and networking technologies to provide adaptability to incorporate a wide range of networking techniques and technologies into the automated network processing; mature and optimize algorithms to perform autonomous selection between network links based on link status and other established criteria in an electromagnetic environment to provide maintain communications and overall network connectivity across multiple disparate network connections; optimize switching algorithms to seamlessly transition data flow between network connections available to the automated network as viable network connections become degraded, disrupted, or otherwise unavailable in order to maintain data integrity and throughput; optimize a common user device as the user?s input mechanism and interface to an automated network and demonstrate the reduced burden place on the user from this single device and the ability of the operator to focus on essential mission tasks rather than establishment and maintenance of the network; demonstrate techniques that will incorporate into an autonomous networking system, an ability to detect available communication systems that are both accessible and viable for the data need, and incorporate the sub-network mapping topology of each system within the autonomous mapping to identify diverse link paths; develop and mature situation-adaptive communications polling and reporting methods to inform contributing networks as to the to status of current spectrum environment changes (e.g. interference, congestion, link loss, etc.) for the network links, to optimize the functional performance based on available resiliency features of the principal links."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, work in PE 0603794A\/Project EL4 has been realigned to PE 0603463A\/Projects AM7, AM9, AN2, AN4, AN6, AN9, AO3, AP6, AP7, AP8, AP9, AQ1."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.243"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EL5"
                    },
                    "ProjectTitle": {
                        "val": "Secure Tactical Information Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.582"
                        },
                        "CurrentYear": {
                            "val": "14.545"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "30.127"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0603463A Network C3I Advanced Technology, Projects: \n* AO9 Information Trust Advanced Technology\n* AP2 Decoy and Deterrence Advanced Technology\nPE 06034457A C3I Cyber Advanced Development, Project:\n* 6CY Autonomous Cyber Advanced Technology"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates software, algorithms and services that focus on tactical cyber and cyberspace electromagnetic activities (CEMA) situational understanding (SU), autonomous network defense, cross domain security and encryption solutions to secure the Army's tactical network. Efforts focus on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions. This Project codes, optimizes, and demonstrates software based technologies for intrusion detection, high assurance internet protocol (IP) encryption, seamless communications across security boundaries, as well as information sharing across operations and intelligence functions. These capabilities to automate, protect, monitor, report and access cyber elements of the tactical network are intended to greatly reduce Soldier burden and protect the Army's tactical network by building upon enterprise solutions from commercial, Department of Defense, Department of the Army and other government agencies. This Project cumulatively builds science and technology capabilities in accordance with Army Cyber Material Development Strategy and the Office of the Secretary of Defense Cyber Community of Interest.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nThis work is performed by U.S. Army Futures Command (AFC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defensive Cyber Operations, Cyber Situational Understanding, formerly titled Cyber\/CEMA Operations, Situational Awareness\/Understanding"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates software and algorithms that facilitate actionable decision making through mission critical Cyber Electro Magnetic Activity (CEMA) information knowledge and by applying analysis and judgment to relevant information to help determine the relationships among the operational and mission variables across cyberspace."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.004"
                                            },
                                            "Text": {
                                                "val": "Coded and matured secure data transfer algorithms to efficiently move defensive cyber sensor data across tactical networks for incorporation into common data stores; matured and integrated efficient analytic capabilities to tailor analysis for cyber situational awareness (SA) visualization; matured correlation algorithms to fuse defensive cyber, spectrum management, offensive cyber, and Department of Defense Information Network (DoDIN) Operations data to enable brigade combat team (BCT) analysts to perform hunt operations for cyber actors in an incident response friendly environment; mature spectrum and DoDIN operations awareness algorithms to support CEMA domain information fusion and course of action development; matured models and algorithms to reason on adversary intent and predict next action; and matured and implemented cyber analysis algorithms to improve SA\/SU\nof cyber threats and their impacts to mission success for all CEMA elements (electronic warfare (EW), cyber and spectrum management) and allow actionable decisions and enable self-defending qualities within Army networks that can absorb, deflect, evade, and deceive adversarial cyber actions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.456"
                                            },
                                            "Text": {
                                                "val": "Mature CEMA workflow management tools to assist automation and decision support for Electronic Warfare Operations (EWO) and CEMA staff elements in execution and coordination of cyber SU across CEMA domains; mature a cyber SU security architecture that supports data and platform convergence across the Intel, cyber, EWO, and IO functions within a BCT TOC; mature machine learning based algorithms supporting the synchronization and correlation of DoDIN Ops management and Electromagnetic Spectrum (EMS) management within the cyber SU construct."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, work in PE 0603794A\/Project EL5 has been realigned to PE 633463A\/Projects AO9 and AP2."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defensive Cyber Operations, Tactical Cyber Resilient Architectures & Platforms , formerly Cyber\/CEMA Operations, Tactical Cyber Resilient Architectures & Platforms"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates software, architectures and frameworks to allow systems and networks to withstand cyber-attacks, sustain or recover critical functions, and dynamically reshape cyber systems as conditions\/goals change to escape harm."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.572"
                                            },
                                            "Text": {
                                                "val": "Matured, integrated and demonstrated virtual containers on blue force networks to protect mission command applications and prevent the spread of malicious cyber effects and block and restrict the spread of malware within tactical mission command applications; mature, code and fabricate a NSA Type 1 certifiable anti-tamper, reprogrammable cryptographic engine with integrated information security (INFOSEC) functions; matured capabilities to map cyber threats to mission impact to provide traceability between intruder actions and brigade combat team (BCT) networks, systems, and applications; matured and coded algorithms to secure tactical SATCOM against cyber-attacks; matured and integrated tactical radio wide band networking waveform anomalous behavior detection techniques into tactical radio waveforms; matured and integrated anomalous behavior and insider threat detection techniques and algorithms into tactical radio waveforms; designed and matured an integrated security architecture that supports convergence across the intelligence, network operations, cyber, electronic warfare operations, fires, and information operations functions within a tactical Command Post; coded and matured cyber behavior monitoring algorithms and models for anomalous cyber behavior detection across Soldier Radio Waveform (SRW) and Wideband networking Waveform (WNW) tactical radio networks; and matured a security architecture to support diversity and protection for tactical SATCOM to improve resistance to cyber-attacks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.875"
                                            },
                                            "Text": {
                                                "val": "Mature cyber virtualization containment technologies to restrict and block the spread of malware within tactical command applications; mature stealthy container migration service algorithms to inhibit adversarial knowledge of virtual machine migration\/reconstitution; exploit scanning techniques to monitor, manage, and maintain virtual machine elements to facilitate the detection of anomalies within the element; provide reference implementation of computing environment to enable system to revert to a known secure state for rapid recovery after a known or suspected intrusion, exploit, or anomaly on a disadvantaged tactical network; enhance network display capabilities to map an entire network state through the sharing of network configurations via software defined networking message structures; demonstrate display tools for network state to the end user and associated tools to manipulate network state data; mature software defined networking controller algorithms to support virtual instantiations of tactical network elements to deceive and adversary?s knowledge of actual blue force elements; mature user-tailorable visualization overlays that enhance convergence and representation of information across Cyber Electro Magnetic Activity (CEMA) elements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, work in this PE 0603794A\/Project EL5 has been realigned to PE 633463A\/Projects AO9 and AP2."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defensive Cyber Operations, Trusted Self Defending Networks & Systems, formerly Cyber\/CEMA Operations, Trusted Self Defending Networks & Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates software, architectures and frameworks to support establishment of a known degree of assurance that devices, networks and cyber dependent functions perform as expected, despite attack or error and allow the Warfighter to maintain confidence in network information, resources, and identities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.006"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated derived virtual identity token and robust wearable non-intrusive tattooed token (removable tattoo worn on the Soldier's skin) to eliminate physical hardware tokens for secure authentication to tactical networks; matured a tactical identity and access control management capability and techniques supporting both physical and virtual tokens; matured and demonstrated physical and behavioral biometric algorithms to detect and identify malicious insider threat actors and activities; matured robust two factor (i.e. token plus password, password plus biometric, etc.) identity and network access capabilities; matured common tactical public key infrastructure architecture for certificate validation service and token lifecycle management functions (i.e. issue tokens, revoke tokens, reset personal identification number for tokens) and non-person (e.g. computer, router, sensor and etc.) entity lifecycle management capability; and matured data provenance algorithms to track information flows and maintain assured pedigree."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.798"
                                            },
                                            "Text": {
                                                "val": "Develop a framework to support a common federated identity and access management solution for the Command Post computing environment by coupling next generation non Public Key Infrastructure (PKI) based wearable multi-factor authentication and access control technologies with authorization techniques; demonstrate access control improvements through removal of hardware focused identification methods (such as card based tokens) and instantiation of virtualized identifications with associated management and distribution solutions for tactical environments; mature application services (hashing, labeling, and integrity) to capture the lineage of tactical information flows as they traverse the network; mature data provenance techniques to enable trusted messages between producers and consumers through methods such as concealed file history; mature an enhanced reprogrammable miniaturized encryption module for tactical handhelds and Internet of Things (IoT) sensors\/devices optimized for low power and low cost requirements to enable integration into smaller footprint platforms such as unmanned aerial vehicles  and dismount Soldier systems; optimize a framework incorporating machine learning algorithms to capture data, model, understand, and dynamically tailor user experience and software vulnerability analysis results based on evidence collected; and provide a plug-in to enable rapid insertion of new software assurance methods through automated incorporation and application of the methods to existing software and firmware."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY20, work in this PE 0603794A\/Project EL5 has been realigned to PE 633463A\/Projects AO9 and AP2."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.416"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}