{
    "id": "2020-MissileDefenseAgency-PB-0400-MJBOOK-0-0-88aefefd5dbc6ef9e6f5430cef5914b0d21e1d4ae6f9b2f071dcf710b0e5bc03-0",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-MDA-U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603176C"
        },
        "ProgramElementTitle": {
            "val": "Advanced Concepts and Performance Assessment"
        },
        "R1LineNumber": {
            "val": "29"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "43.305"
            },
            "PriorYear": {
                "val": "17.683"
            },
            "CurrentYear": {
                "val": "13.017"
            },
            "BudgetYearOne": {
                "val": "14.208"
            },
            "BudgetYearOneBase": {
                "val": "14.208"
            },
            "BudgetYearTwo": {
                "val": "14.904"
            },
            "BudgetYearThree": {
                "val": "15.142"
            },
            "BudgetYearFour": {
                "val": "16.262"
            },
            "BudgetYearFive": {
                "val": "16.574"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "N\/A"
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Concepts and Performance Assessment (ACPA) Program Element delivers an integrated government concept definition, simulation, and analysis capability. It also centralizes assessment of advanced missile defense technology.  Delivering insight into the performance of proposed concepts extends the Missile Defense Agency's (MDA) ability to address evolving threats for the warfighter.\n\nSubject Matter Experts (SMEs) provide independent assessments of government, university, and industry technology concepts, used in concert with systems engineering requirements, to support acquisition strategy decisions and define technology focus areas.  The innovative structured concept definition and assessment methodology enables MDA to quickly validate focus areas, verify contractor technology solutions, and evaluate promising concepts in future Ballistic Missile Defense System (BMDS) architectures.   This methodology significantly enhances MDA's ability to assess technology concepts while decreasing the cost of development through:\n- Independent model-based simulations of industry technology concepts to inform the systems engineering process\n- Digital simulation and hardware-in-the-loop performance assessments of algorithms and hardware concepts prior to expensive live fire test events\n- End-to-end testing of technology concepts integrated with weapon systems and Command, Control, Battle Management and Communications (C2BMC)\n\nPerformance assessment of advanced concepts incorporates Better Buying Power philosophy in the earliest stages of technology development to maximize the efficiency of technology investments. Performance assessment supports evaluation of advanced threats and analysis of capabilities left through right of launch integration."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.996"
                },
                "CurrentYear": {
                    "val": "13.017"
                },
                "BudgetYearOne": {
                    "val": "14.267"
                },
                "BudgetYearOneBase": {
                    "val": "14.267"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.683"
                },
                "CurrentYear": {
                    "val": "13.017"
                },
                "BudgetYearOne": {
                    "val": "14.208"
                },
                "BudgetYearOneBase": {
                    "val": "14.208"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.687"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.059"
                },
                "BudgetYearOneBase": {
                    "val": "-0.059"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.375"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.287"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Missile Defeat and Defense Enhancement"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "2.599"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.059"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.059"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2018 from PB19 to PB20 of $2.375M reflects the Above Threshold Reprogramming for compliance with cyber security requirements as required in the Department of Defense (DoD) Instruction Number 8510.01 which establishes Risk Management Framework (RMF) requirements for DoD information technology (IT). \n\nIncrease in FY 2018 from PB19 to PB20 of $2.599M reflects the investment in artificial intelligence (AI) infrastructure to develop, test, and demonstrate machine learning solutions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD71"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Concepts and Performance Assessments"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "41.702"
                        },
                        "PriorYear": {
                            "val": "13.958"
                        },
                        "CurrentYear": {
                            "val": "11.628"
                        },
                        "BudgetYearOne": {
                            "val": "11.552"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.552"
                        },
                        "BudgetYearTwo": {
                            "val": "11.768"
                        },
                        "BudgetYearThree": {
                            "val": "12.016"
                        },
                        "BudgetYearFour": {
                            "val": "12.243"
                        },
                        "BudgetYearFive": {
                            "val": "12.488"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "ACPA centralizes advanced technology concept modeling, simulation, software, and analysis.  Integrating models of promising technical solutions into BMDS system-level simulations enables leadership to make data driven acquisition and technology investment decisions.  This funding capitalizes on the innovation of small businesses, universities, Federally Funded Research and Development Centers (FFRDCs), and University Affiliated Research Centers (UARCs) to pursue a broad range of hardware, software, models, algorithms, trade studies, and analysis.  These innovations bring together government developed models representing existing and future missile defense architectures, technology concepts, and advanced algorithms to provide detailed assessments of concept performance and inform investment decisions. These innovations, combined with a robust high performance computing infrastructure, provide a unique in-house government capability to demonstrate and assess technology concepts for emerging technology risk reduction, to mature concepts with laboratory, ground, and flight test data, and where possible, apply concepts in simulated exercises with weapon systems across representative communication architectures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Description": {
                                        "val": "Provide quantitative assessments that define the benefits of technology investments and inform requirements using an integrated concept definition, simulation, and performance analysis capability.  A staff of diverse Subject Matter Experts (SMEs) deliver independent government performance evaluations which exercise kinetic and non-kinetic missile defense concept representations against the broad spectrum of evolving threats.  \n\n- Assess forward-based airborne electro-optical infrared and advanced sensors\n- Provide independent government assessments of industry sensor (e.g. Advanced Sensor), directed energy (e.g. Low Power Laser Demonstrator), and kill vehicle technology concepts\n- Examine directed energy pathfinder solutions\n- Study low earth orbit satellite capabilities\n- Assess and identify promising boost phase intercept capabilities\n- Perform concept performance against emerging advanced threats including hypersonic threat testing scenarios\n- Mature advanced technology concepts through lab, ground, and flight test data\n- Apply concepts in simulated exercises with weapon systems \n- Work with the BMDS Architect and MDA Systems Engineer to design concepts, build models and assess technology concepts for the future BMDS \n- Develop and extend modeling techniques\n- Focus research and engineering activities from university and small business partners to identify suitable technology and concepts that improve BMDS performance through a rapid innovation model based on an engineering test bed\n\n\nSpecific and\/or unique accomplishments to each FY are as follows:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.958"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.628"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In addition to efforts identified above, FY 2019 concept assessment activities will focus on development of key technology areas including:\n-\tHypersonic Defense\n-\tAI and Machine Learning Initiatives\n-\tLeft through Right of Launch Integration"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Due to the evolving nature of the threat, ACPA's diverse staff of SMEs develop advanced concepts across a broad spectrum of missile defense technology initiatives.  FY 2019 concept assessment initiatives identified above will be matured and coupled with increased emphasis on the following: \n\n- Quantify the contribution of emerging concepts by integrating representative performance with C2BMC networks (eg. MDA C2BMC, Integrated Air and Missile Defense, Cooperative Engagement Capability, AI enabling end-to-end capability demonstrations with weapon systems) \n- Develop the computing infrastructure for AI Testbed and the development of deep neural networks to exercise advanced algorithms and assess potential applications to machine learning\n- Extend the Government's capability to evaluate engagement decision timelines and evaluate concept of operations that could possibly expand engagement opportunities \n- Develop an initial integrated modeling and analysis capability to assess new technology concepts associated with the complex interactions between left through right of launch integration\n- Address the capability gap in testing\/simulation of advanced sensors in a credible environment by developing an advance photonics testbed capable of providing foundational truth for advanced sensor performance assessment of industry concepts"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603178C"
                                    },
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.894"
                                        },
                                        "CurrentYear": {
                                            "val": "13.400"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603180C"
                                    },
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.765"
                                        },
                                        "CurrentYear": {
                                            "val": "42.565"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.674"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.674"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.154"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.521"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.041"
                                        },
                                        "BudgetYearFive": {
                                            "val": "22.465"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603294C"
                                    },
                                    "Title": {
                                        "val": "Common Kill Vehicle Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "55.562"
                                        },
                                        "CurrentYear": {
                                            "val": "56.753"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.600"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.600"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.475"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.187"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.232"
                                        },
                                        "BudgetYearFive": {
                                            "val": "22.949"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Employ various contracting strategies in a flexible manner to maximize the contribution to MDA.  Execute through utilization of small businesses, leverage the Nation's engineering centers of excellence (FFRDCs and UARCs); generate cooperatives with other Government Agencies to provide concept modeling and assessment capability.  This strategy uses agency and partner SMEs and government model-based assessments to inform Better Buying Power acquisition decisions."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.603"
                        },
                        "PriorYear": {
                            "val": "0.816"
                        },
                        "CurrentYear": {
                            "val": "0.605"
                        },
                        "BudgetYearOne": {
                            "val": "0.605"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.605"
                        },
                        "BudgetYearTwo": {
                            "val": "0.699"
                        },
                        "BudgetYearThree": {
                            "val": "0.673"
                        },
                        "BudgetYearFour": {
                            "val": "0.802"
                        },
                        "BudgetYearFive": {
                            "val": "0.805"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Program Wide Support (PWS) contains non-headquarters management costs in support of MDA functions and activities across the entire BMDS.  It Includes Government Civilians and Contract Support Services.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes personnel to support global deployments performing deployment site preparation and activation, and provides facility capabilities for MDA Executing Agent locations.  Other MDA wide costs include:  physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office, equipment, vehicle, and warehouse leases; utilities and base operations; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. PWS is allocated on a pro-rata basis across most Agency PEs and therefore, fluctuates by year based on the adjusted RDT&E profile."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MC71"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Operations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.909"
                        },
                        "CurrentYear": {
                            "val": "0.784"
                        },
                        "BudgetYearOne": {
                            "val": "2.051"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.051"
                        },
                        "BudgetYearTwo": {
                            "val": "2.437"
                        },
                        "BudgetYearThree": {
                            "val": "2.453"
                        },
                        "BudgetYearFour": {
                            "val": "3.217"
                        },
                        "BudgetYearFive": {
                            "val": "3.281"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.132"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The increase from FY 2019 to FY 2020 re-establishes the baseline requirement to meet Risk Management Framework (RMF) requirements which map to the Office of Management and Budget (OMB) and Office of the Secretary of Defense (OSD) vision of improved management of cybersecurity risk and on the ability to provide actionable and timely cybersecurity performance information.  This provides resources to sustain and improve IT toolsets, maintain hardware currency, and sustain the IT and information assurance (IA) workforce."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the monitoring and tracking of Cybersecurity mitigations as required in the Department of Defense (DoD) Instruction Number 8510.01 which establishes RMF requirements for DoD IT.  Funds in this project implement and sustain DoD-required RMF and associated Controls Validation Testing (CVT) activities, analysis of validation results, risk assessments and reviews of proposed Program Manager\/Information Assurance System Security Manager (ISSAM) Plans of Action and Milestones for enabling modeling and simulation mission systems.  This project captures the RMF documentation (artifacts, validation results, IA risk assessment results, and MDA authorizing official and chief information officer accreditation decisions) into the Defense Information Systems Agency's Enterprise Mission Assurance Support Service system.  Hardware and software upgrades required to meet DoD standards are supported by funding in this project. Independent verification and validation team actions ensure the availability, integrity, authentication, confidentiality and non-repudiation of the MDA mission, test and administrative systems.  Activities in the project are necessary to comply with the Federal Information Security Management Act."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Assurance\/Cyber Network Defense"
                                    },
                                    "Description": {
                                        "val": "Funds network defense and ISSAM activities including: \n- Conduct cybersecurity\/IA engineering and architecture planning \n- Plan and test IA controls  \n- Develop DoD RMF certification and accreditation packages\n- Conduct controls validation testing of systems and provide plan of action and milestones to mitigate IA deficiencies \n- Conduct annual IA reviews to assess compliance in implementing and maintaining IA controls\n\nSpecific and\/or unique accomplishments to each FY are as follows:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.909"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.784"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In addition to baseline efforts identified above, primary emphasis in FY 2019 will be to sustain the IT and IA workforce."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.051"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.051"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In addition to baseline efforts identified above emphasis in FY 2020 will be expanded to:\n- Explore cyber effects on emerging technology concepts\n- Sustain and improve IT toolsets, maintain hardware currency, and sustain the IT and IA workforce"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY 2019 to FY 2020 re-establishes the baseline requirement to meet RMF requirements which map to the OMB and OSD vision of improved management of cybersecurity risk and on the ability to provide actionable and timely cybersecurity performance information.  This provides resources to sustain and improve IT toolsets, maintain hardware currency, and sustain the IT and IA workforce."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}