{
    "id": "2020-OperationalTestandEvaluationDefense-PB-0460-JBOOK-c24a837f06408400c8cbf90afb23987f2e0d5f29aa55f88ed3d6fd00b1e0e932-2",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OTANDE-U_RDTE_JustificationBook_Operational_Test_and_Evaluation__Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Operational_Test_and_Evaluation__Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Operational Test and Evaluation, Defense",
        "appropriation_code": "0460",
        "appropriation_name": "Operational Test and Evaluation, Defense"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605814OTE"
        },
        "ProgramElementTitle": {
            "val": "Operational Test Activities and Analyses"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "AppropriationCode": {
            "val": "0460"
        },
        "AppropriationName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "59.566"
            },
            "PriorYear": {
                "val": "66.447"
            },
            "CurrentYear": {
                "val": "226.984"
            },
            "BudgetYearOne": {
                "val": "58.737"
            },
            "BudgetYearOneBase": {
                "val": "58.737"
            },
            "BudgetYearTwo": {
                "val": "59.028"
            },
            "BudgetYearThree": {
                "val": "60.928"
            },
            "BudgetYearFour": {
                "val": "51.027"
            },
            "BudgetYearFive": {
                "val": "52.184"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Operational Test Activities and Analyses (OTA&A) programs are continuing efforts that provide management and oversight of test and evaluation functions and expertise to the Department of Defense (DoD).  The OTA&A programs consist of three activities:  Joint Test and Evaluation (JT&E); Threat Systems (TS); and Center for Countermeasures (CCM).\n\nJoint Test and Evaluation projects are test and evaluation activities conducted in a joint military environment that develop process improvements.  These multi-Service projects, chartered by the Office of the Secretary of Defense and coordinated with the Joint Staff, appropriate combatant commanders, and the Services, provide non-materiel solutions that improve:  joint interoperability of Service systems, technical and operational concepts, joint operational issues, development and validation of joint test methodologies, and test data for validating models, simulations, and test beds.  New projects are also encouraged to align their efforts to supporting the 2018 National Defense Strategy.  The JT&E projects address relevant joint war fighting issues in a joint test and evaluation environment by developing and providing new tactics, techniques, and procedures to improve joint capabilities and methodologies.\n\nThreat Systems, based on a memorandum of agreement between the Director, Operational Test and Evaluation (DOT&E) and the Defense Intelligence Agency, provides DOT&E support in the areas of threat resource analysis, intelligence support and threat systems investments.  As DOT&E’s agent, Threat Systems provides threat resource analyses on the availability, capabilities and limitations of threat representations (threat simulators, targets, models, U.S. surrogates, and foreign materiel) and analysis of test resources used for operational testing to support DOT&E’s assessment of the adequacy of testing for those programs designated for oversight by DOT&E and the Office of the Under Secretary of Defense Acquisition and Sustainment (OUSD (A&S)).  Threat Systems provides DOT&E action officers and other DOT&E activities with program specific threat intelligence support.  Threat Systems also funds management, oversight, and the actual development of common-use threat specifications for threat simulators, threat representative targets, and digital threat models used for test and evaluation.\n\nThe Center, a Joint Service Countermeasure (CM) Test & Evaluation (T&E) Activity, directs, coordinates, supports, and conducts independent countermeasure\/counter-countermeasure (CCM) T&E activities of U.S. and foreign weapon systems, subsystems, sensors, and related components. The Center accomplishes this work in support of DOT&E, Deputy Assistant Secretary of Defense (DASD) for Developmental Test and Evaluation (DT&E), weapon system developers, and the Services. The Center’s testing and analyses directly supports operational effectiveness and suitability evaluations of CM\/CCM systems, such as missile warning and aircraft survivability equipment (ASE), used on rotary-wing and fixed-wing aircraft. The Center develops unique CM\/CCM test equipment to support testing in operationally realistic environments. The Center determines the effectiveness of precision-guided weapon (PGW) systems and subsystems when operating in an environment degraded by CMs. Analysis and recommendations on CM\/CCM effectiveness are provided to Service Program Offices, DOT&E, DASD (DT&E), and the Services. The Center also supports Service member exercises, training, and pre-deployment activities with expertise on CM\/CCM technology and capabilities.\n\nThis Program Element includes funds to obtain Federally Funded Research and Development support and travel funds."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "67.897"
                },
                "CurrentYear": {
                    "val": "70.992"
                },
                "BudgetYearOne": {
                    "val": "59.650"
                },
                "BudgetYearOneBase": {
                    "val": "59.650"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "66.447"
                },
                "CurrentYear": {
                    "val": "226.984"
                },
                "BudgetYearOne": {
                    "val": "58.737"
                },
                "BudgetYearOneBase": {
                    "val": "58.737"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.450"
                },
                "CurrentYear": {
                    "val": "155.992"
                },
                "BudgetYearOne": {
                    "val": "-0.913"
                },
                "BudgetYearOneBase": {
                    "val": "-0.913"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.450"
                    },
                    "CurrentYear": {
                        "val": "-4.008"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "160.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Pricing adjustment due to inflation"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.913"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.913"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 Congressional reduction for FFRDC -$1.450\nFY 2019 Congressional add for Program Increase for T&E Infrastructure +$150M\nFY 2019 Congressional add for Advanced Satellite Navigation Receiver +$10M\nFY 2019 Congressional reduction for FFRDC -$4.008M\nFY 2020 Pricing adjustment due to inflation"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "000920"
                    },
                    "ProjectTitle": {
                        "val": "OTA&A"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "59.566"
                        },
                        "PriorYear": {
                            "val": "66.447"
                        },
                        "CurrentYear": {
                            "val": "226.984"
                        },
                        "BudgetYearOne": {
                            "val": "58.737"
                        },
                        "BudgetYearOneBase": {
                            "val": "58.737"
                        },
                        "BudgetYearTwo": {
                            "val": "59.028"
                        },
                        "BudgetYearThree": {
                            "val": "60.928"
                        },
                        "BudgetYearFour": {
                            "val": "51.027"
                        },
                        "BudgetYearFive": {
                            "val": "52.184"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Operational Test Activities and Analyses (OTA&A) programs are continuing efforts that provide management and oversight of test and evaluation functions and expertise to the Department of Defense (DoD).  The OTA&A programs consist of three activities:  Joint Test and Evaluation (JT&E); Threat Systems (TS); and, the Center for Countermeasures (CCM)."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase for T&E Infrastructure +$150M"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "150.000"
                                        },
                                        "Text": {
                                            "val": "DOT&E will develop critical test capabilities needed to test hypersonics, directed energy, advanced computing\/big data analytics, artificial intelligence\/machine learning, and autonomy\/robotics"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Satellite Navigation Receiver +$10M"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "DOT&E will develop, conduct a requirements review, and formulate preliminary design of 6 Degrees of Freedom Time Space Position Information (TSPI) Advanced Satellite Navigation Receiver (ASNR) for dynamic TSPI collection by DOT&E labs, facilities, ranges, and partners including \"Five Eyes\" (FVEY) and North American Treaty Organization (NATO) partners."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test Activities and Analyses"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "66.447"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E)\n\nIn FY 2018, JT&E plans to close one project that was started in FY 2016.  The Digitally Aided Close Air Support Joint Test is anticipated to close in May 2018.  It is developing and testing procedures so Joint Terminal Attack Controllers, Joint Fires Observers, and Close Air Support aircrew can realize the advantage of digital communications, including shared situational awareness, increased confidence prior to weapons release, and improved kill chain timeliness.  Two projects that started in FY 2017 will continue through FY 2018.  Four new feasibility studies are expected to be conducted in FY 2018 of which two will be selected to conduct joint tests.\n\nThreat Systems\n\nFY 2018, Threat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions based on the availability of funding. Threat Systems will:\n- Provide intelligence support to DOT&E staff to address specific questions on threat systems affecting programs on the OSD T&E\nOversight list and provide briefings and special intelligence reports when necessary.\n- Provide DOT&E representative support at the Threat Steering Group (TSG) in the transitioning of the System Threat Assessment\nReports (STARS) to the new Validated Online Lifecycle Threat (VOLT) report process.\n- Continue to represent DOT&E interests on Acquisition\/Intelligence\/ Requirement Task Force (AIRTF) and Executive Steering\nGroup (AIRESG) and provide access to the Intelligence Mission Data Management Analysis & Reporting System (IMARS).\n- Support the US warfighter by providing threat intelligence to ensure operational and developmental testing occurs against realistic threat representations.\n- Sustain and manage threat M&S to support test and evaluation by overseeing and coordinating intelligence community developed threat models, performing threat model anomaly resolution resolving differences from live fire testing, integrating threat models into T&E facilities and distributing performance and signature models to T&E users.\n- Review validation reports to independently ensure that correct threat data and critical parameters are presented in the report to assessment the threat representation’s capabilities to replicate a real world threat system.\n- Continue identifying initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, representative threat offensive and defensive cyber operations capabilities, and scalable cyberspace threat test environments that can interface with cyber test networks.\n- Manage Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) efforts supporting programs on the OSD\nT&E Oversight List by conducting intelligence “deep dives” to produce intelligence in sufficient detail to develop new threat test assets.\n- Initiate new ITEAMS efforts leading to the development of new threat systems for T&E.\n- Represent DOT&E at foreign material exchanges, inter-agency coordinating groups, and non-proliferation groups to raise awareness of T&E needs for foreign material, coordinate service requirements, and de-conflict and prioritize foreign material requirements for T&E.\n- Represent DOT&E at the Intelligence Mission Data Oversight Board responsible for development, production and sharing issues affecting the intelligence data supporting weapons systems acquisition.\n- Oversee legacy DOT&E investments and continue management and oversight of legacy and new Test Resource Management\nCenter-funded threat system investments.\n\nThreat Systems continues its efforts to maintain a standard set of threat performance models.  These activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs.\n\nThe Center\n\nThe Center has received 46 requests for support during FY18, which exceeds our support capacity.  The Center will assess the requests based on priority and schedule.  The Center will test, analyze, and report on more than 30 systems\/platforms, with emphasis on rotary wing survivability.  High priority test events will receive an independent assessment of our data\/findings for CM\/CCM evaluations.  The Center will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 weapons systems, aircraft survivability and hostile fire initiatives.\n\nThe Center will continue to conduct ongoing investigations towards determining and filling the gaps in EW and multimode system testing.  In addition to these test activities, the Center will continue to provide CM expertise in pre-deployment events and training, as well as CM\/CCM-focused tactics, techniques and procedures (TTP) development. Our support will be distributed across all the Services, as well as intelligence agencies and research and development activities.\n\nThe Center will complete the initial development of the RLS turret upgrade, which will be used in support of testing for both Title 10 programs and ASE urgent operational needs.  The Center will continue to improve and expand the JSIS to meet program data collection requirements.  Also, emitter upgrades are planned for the missile plume simulators to better replicate threat missile launches.  The Center will provide expertise to many organizations including program offices and other T&E agencies.  The Center will continue to be actively involved in the following panels:  JECM Integrated Product Team, Joint Infrared Countermeasures Multi Sensing Symposia Working Group (MSS IRCM WG), JASP, Foreign Material Exploitation Working Group, Foreign Material Program T&E Subcommittee, JCMT&E WG, and JCMT&E WG HFI subgroup lead."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "66.984"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E)\nIn FY 2019, JT&E will close one project that started in FY 2016 and two projects that started in FY 2017. The first is the Joint Counterair Integration Joint Test, which closed in November 2018. It developed and tested techniques, tactics, and procedures (TTP) for counterair shooter and command and control operators to effectively integrate joint defensive counterair resources in a contested, degraded, and operationally limited environment to protect defended assets from expected threats. The second project is the Joint Cyber Insider Threat Joint Test, which closed November 2018. It developed and tested procedures to proactively detect and respond to cyber insider threats before they have an adverse impact on military operations. The last project expected to close in FY 2019 is the Joint Interoperability for Medical Transport Missions Joint Test, which is anticipated to close in September 2019.  It is developing, testing, and evaluating TTP that enable access to medical information existing in various systems across the DoD and procedures for using that information in the patient movement coordination and validation process.  Two projects that started in FY 2018 will continue through FY 2019. Four new feasibility studies are expected to be conducted in FY 2019 of which two will be selected to conduct joint tests.\n\nThreat Systems\nIn FY 2019, Threat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions based on the availability of funding. Threat Systems will:\n- Continue to support the US warfighter by providing threat intelligence relevant to emerging threats such as artificial intelligence (AI), autonomy, robotics, machine learning (ML), quantum computing, lasers, nanotechnology, chemical and biological, directed energy, hypersonic and biotechnology to ensure operational and developmental testing occurs against realistic threat representations, including (but not limited to) threats from both revisionist powers such as China and Russia, threats from rogue regimes such as North Korea and Iran, and threats from non-state actors.\n- Continue to provide intelligence support to DOT&E staff to address specific questions on threat systems affecting programs on the OSD T&E Oversight list and provide briefings and special intelligence reports when necessary.\n- Continue to conduct threat intelligence investigations that support use of innovative technologies in the areas of AI, autonomy, robotics, ML, quantum computing, lasers, nanotechnology, chemical and biological, directed energy, hypersonic and biotechnology being developed by nation states to improve threat representation in the contested domain of air, land, sea, space and cyberspace.\n- Continue identifying initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, and scalable cyberspace threat test environments that can interface with cyber test networks.\n- Continue identifying initiatives to conduct offensive cyber operations (OCO) and defensive cyber operations (DCO) without significantly impacting critical operational capabilities.\n- Continue initiatives to improve satellite and space threat representations.\n- Continue to sustain and manage threat modelling and simulation (M&S) to support test and evaluation by overseeing and coordinating intelligence community developed threat models, performing threat model anomaly resolution resolving differences from live fire testing, integrating threat models into T&E facilities and distributing performance and signature models to T&E users.\n- Continue to represent DOT&E at foreign material exchanges, inter-agency coordinating groups, and non-proliferation groups to raise awareness of T&E needs for foreign materiel, coordinate service requirements, and de-conflict and prioritize foreign materiel requirements for T&E.\n- Continue providing DOT&E representative support at the Threat Steering Group (TSG) in the transitioning of the System Threat\nAssessment Reports (STARS) to the new Validated Online Lifecycle Threat (VOLT) Report process.\n- Continue to represent DOT&E interests on Acquisition\/Intelligence\/ Requirement Task Force (AIRTF) and Executive Steering\nGroup (AIRESG) and provide access to the Intelligence Mission Data Management Analysis & Reporting System (IMARS).\n- Manage Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) efforts supporting programs on the OSD\nOversight T&E List by conducting intelligence “deep dives” to produce intelligence in sufficient detail to develop new threat test assets.\n- Review validation reports to independently ensure the correct threat data and critical parameters are presented in the report to assess the threat representations’ capabilities to replicate a real world threat system.\n- Represent DOT&E at the Intelligence Mission Data Oversight Board responsible for development, production and sharing issues affecting the intelligence data supporting weapons systems acquisition.\n- Oversee legacy DOT&E investments and continue management and oversight of legacy and new Test Resource Management\nCenter-funded threat system investments.\n- Continue ITEAMS efforts leading to the development of new threat systems for T&E.\n- Continue reviewing Services’ Threat Systems investments to prevent any duplication of effort and encourage cost savings by the sharing or multi-service use of newly developed threat representations to T&E.\n- Continue to foster rapid technological advancements in the areas of threat representation for T&E and threat test resources by incorporating innovative technologies from the intelligence community into threat test assets to provide improved test fidelity and performance at lower cost\nThreat Systems will continue its efforts to maintain a standard set of threat performance models. These activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs.\n\nThe Center\nThe Center’s core mission to support T&E of aircraft survivability equipment (ASE) directly leads to a ‘more lethal force’ by enabling the survivability of aircraft in a threat environment. Survivability enables mission success. The Center expects to conduct, analyze, and report on more than 40 tests, with 31 requests for test support already under consideration or planned. Most testing will focus on aircraft survivability, with a focus on Joint Urgent Operational Needs Statement (JUONS) and Urgent Universal Needs Statement (UUNS), warning and targeting systems, warfighter training events, and precision guided weapons. The Center will provide the programs with an independent assessment of our data\/findings for CM\/CCM evaluations. The Center will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 oversight, aircraft survivability, and warfighter training events. Furthermore, the Center will continue to provide CM expertise in pre-deployment events and training, as well as CM\/CCM-focused training, tactics and procedures (TTP) development. Our support will be distributed across all the Services, as well as intelligence agencies and research and development activities. These activities will help to enhance and support the survivability of equipment, aircraft and personnel.  \n\nThe Center will continue to build upon Improvement and Modernization (I&M) efforts from FY 2018 to improve T&E capabilities. Specifically the emitters for the missile plume simulators will be upgraded to increase threat fidelity. The Center is undertaking the Joint Standard Instrumentation Suite (JSIS) project to collect threat signature and fly out data to improve infrared-guided threat models.  These models form the basis for a significant portion of ASE T&E.  JSIS reached initial operational capability this year to start initial data collection at threat live fire events. The JSIS full operational capability development will begin this fiscal year.\n\nIn addition, the Center supports each Service’s ASE programs with its unique test equipment, which reduces duplicate T&E capabilities.  This benefit, along with the transportability of the Center’s unique test equipment, provides DoD a cost savings that results in ‘greater performance and affordability’. The Center will provide expertise to many organizations, including program offices and other T&E agencies. \n\nInternationally, the Center will continue to \"Strengthen Alliances and attract new partners\" through collaborative international T&E efforts. The Center serves as the Steering Committee chair and actively participates in the Air Electronic Warfare Cooperative Test and Evaluation Project Arrangement with Australia, Canada, Great Britain and the U.S. Also, the Center supports international cooperative efforts through direct country-to-country T&E activities and continued involvement in the following groups:  NATO SUB-GROUP\/2 and NATO’s Aerospace Capabilities Group 3 (Air Survivability)\/Subgroup 2 (EW Self-Protection Measures for Joint Services Airborne Assets). \n\nDomestically, the Center will continue our involvement in the following panels, committees and working groups:  Joint Expendable Countermeasure (JECM) Integrated Product Team, Multi Sensing Symposia (MSS) Joint Infrared Countermeasures (IRCM) Working Group, JASP, Foreign Material Exploitation Working Group, Foreign Material Program T&E Subcommittee, and Joint Countermeasures T&E Working Group (JCMT&E WG)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "58.737"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "58.737"
                                            },
                                            "Text": {
                                                "val": "Joint Test and Evaluation (JT&E)\nIn FY 2020, JT&E plans to close one project that started in FY 2017 and one project that started in FY 2018. The first project is the Joint Laser Systems Effectiveness Joint Test, which is anticipated to close in December 2019.  It is developing and testing tactics, techniques, and procedures (TTP) for Joint Targeting Cycle, Capabilities Analysis - Weaponeering and Collateral Damage Estimation to adequately plan for and execute directed energy laser weapons in the joint battlespace.  The second project is the Multi (Enhanced) Domain Unified Situational Awareness Joint Test, which is anticipated to close in May 2020. It is developing and testing TTP for combatant command planners to identify, input, and migrate information from unclassified situational awareness tools (such as the unclassified common operational picture) to the classified domain (on the Global Command and Control System - Joint) in order to provide enhanced situational awareness to the commander.  Two new projects will start in FY 2019 and continue through FY 2020. Four new feasibility studies are expected to be conducted in FY 2020 of which two will be selected to conduct joint tests.\n\nThreat Systems\nIn FY 2020, Threat Systems will continue test planning working group participation and perform technical analyses to identify threat shortfalls; conduct special studies and provide current intelligence support tailored to specific U.S. weapon systems acquisitions based on the availability of funding. Threat Systems will:\n- Continue to support the US warfighter by providing threat intelligence relevant to emerging threats such as artificial intelligence (AI), autonomy, robotics, directed energy, hypersonic and biotechnology to ensure operational and developmental testing occurs against\nrealistic threat representations, including (but not limited to) threats from both revisionist powers such as China and Russia, threats from rogue regimes such as North Korea and Iran, and threats from non-state actors.\n- Continue to provide intelligence support to DOT&E staff to address specific questions on threat systems affecting programs on the OSD T&E Oversight list and provide briefings and special intelligence reports when necessary.\n- Continue to conduct threat intelligence investigations that support use of innovative technologies in the areas of artificial intelligence (AI), autonomy, robotics, machine learning (ML), quantum computing, lasers, nanotechnology, chemical and biological, directed energy, hypersonic and biotechnology being developed by nation states to improve threat representation in the contested domain of air, land, sea, space and cyberspace.\n- Continue identifying initiatives to improve cyberspace threat representation and prediction, cyber-economic threats to DoD systems, and scalable cyberspace threat test environments that can interface with cyber test networks.\n- Continue identifying initiatives to conduct offensive cyber operations (OCO) and defensive cyber operations (DCO) without significantly impacting critical operational capabilities.\n- Continue initiatives to improve satellite and space threat representations.\n- Continue to sustain and manage threat M&S to support test and evaluation by overseeing and coordinating intelligence community developed threat models, performing threat model anomaly resolution resolving differences from live fire testing, integrating threat models into T&E facilities and distributing performance and signature models to T&E users.\n- Continue to represent DOT&E at foreign material exchanges, inter-agency coordinating groups, and non-proliferation groups to raise awareness of T&E needs for foreign materiel, coordinate service requirements, and de-conflict and prioritize foreign materiel requirements for T&E.\n- Continue providing DOT&E representative support at the Threat Steering Group (TSG) in the transitioning of the System Threat\nAssessment Reports (STARS) to the new Validated Online Lifecycle Threat (VOLT) Report process.\n- Continue to represent DOT&E interests on Acquisition\/Intelligence\/ Requirement Task Force (AIRTF) and Executive Steering\nGroup (AIRESG) and provide access to the Intelligence Mission Data Management Analysis & Reporting System (IMARS).\n- Manage Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) efforts supporting programs on the OSD\nOversight T&E List by conducting intelligence “deep dives” to produce intelligence in sufficient detail to develop new threat test assets.\n- Review validation reports to independently ensure the correct threat data and critical parameters are presented in the report to assess the threat representations’ capabilities to replicate a real world threat system.\n- Represent DOT&E at the Intelligence Mission Data Oversight Board responsible for development, production and sharing issues affecting the intelligence data supporting weapons systems acquisition.\n- Oversee legacy DOT&E investments and continue management and oversight of legacy and new Test Resource Management\nCenter-funded threat system investments.\n- Continue ITEAMS efforts leading to the development of new threat systems for T&E.\n- Continue reviewing Services’ Threat Systems investments to prevent any duplication of effort and encourage cost savings by the sharing or multi-service use of newly developed threat representations to T&E.\n- Continue to foster rapid technological advancements in the areas of threat representation for T&E and threat test resources by incorporating innovative technologies from the intelligence community into threat test assets to provide improved test fidelity and performance at lower cost\n\nThreat Systems will continue its efforts to maintain a standard set of threat performance models. These activities help DOT&E carry out its Title 10 responsibilities to assess test adequacy and determine whether testing is realistic and suitable, and promotes common solutions to Service threat representation needs.\n\nThe Center\nThe Center will test, analyze, and report on more than 30 systems\/platforms. Most testing will focus on aircraft survivability, with a focus JUONS and UUNS, warning and targeting systems, warfighter training events, and precision guided weapons. High priority programs will receive an independent assessment of our data\/findings for CM\/ CCM evaluations. The Center will continue to emphasize support of the DOT&E enterprise, with a clear focus on Title 10 oversight, aircraft survivability, and warfighter training events. Furthermore, the Center will continue to provide CM expertise in pre-deployment events and training, as well as CM\/CCM-focused tactics, techniques, and procedures (TTP) development. Our support will be distributed across all the Services, as well as intelligence agencies and research and development activities. These activities will help to enhance and support the survivability of equipment, aircraft and personnel.\n\nThe Center will continue to build upon I&M efforts from fiscal year 2019 to improve T&E capabilities. Specifically, the missile plume simulator smart emitter upgrades are expected to be completed by the end of FY 2020.  The JSIS project will continue development with equipment being fielded as it becomes available.  \n\nThe Center will continue to support international T&E collaborative efforts. In addition, the Center will continue support of domestic panels, committees and working groups."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY 2019 to FY 2020 of $168.247 Million is consistent with planned program decreases in Fifth Generation Aerial Targets and not planning for the continuation of the $160M congressional adds for T&E Infrastructure and Advanced Satellite Navigation Receiver."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance Measure:  Percentage of required products, such as test planning documents, tactics, techniques, procedures, threat characteristics, assessments, and reports that are developed and delivered to program managers and customers on time.  The on-time completion rate was computed on the basis of the number of required products that were submitted within established time standards relative to the total number of such products that fell due during the fiscal year."
                        }
                    }
                }
            ]
        }
    }
}