{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-25",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603727D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Warfighting Program"
        },
        "R1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "40.477"
            },
            "PriorYear": {
                "val": "3.236"
            },
            "CurrentYear": {
                "val": "5.978"
            },
            "BudgetYearOne": {
                "val": "4.846"
            },
            "BudgetYearOneBase": {
                "val": "4.846"
            },
            "BudgetYearTwo": {
                "val": "4.977"
            },
            "BudgetYearThree": {
                "val": "5.097"
            },
            "BudgetYearFour": {
                "val": "5.201"
            },
            "BudgetYearFive": {
                "val": "5.260"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Warfighting Program (JWP) supports the Assistant Secretary of Defense for Acquisition, ASD(A)) responsibilities for acquisition and portfolio management analysis.  These efforts include independent analyses, studies, limited scope experiments, wargaming, and partnerships with joint customers that define joint capability gaps and develop credible requirements for follow-on acquisition efforts. It synchronizes acquisition processes with corresponding acquisition requirements. These analyses and assessments deliver independent perspectives on ways to align investments and potential solutions for capability gaps created by future warfighting environments and emerging threats. JWP enables portfolio management though these assessments in order to promote potential acquisition remedies to these critical capability gaps. JWP supports efforts to: synchronize the acquisition processes with corresponding acquisition requirements to enable acquisition portfolio management; conduct mission thread analysis; define joint capability gaps and develop credible requirements for follow-on acquisition efforts; deliver independent perspectives on ways to align investments and potential solutions for capability gaps created by evolving threats; seize opportunities to partner with joint customers on projects that inform technology and acquisition decisions; and implement analytic projects on key joint warfighting mission areas and challenges."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.349"
                },
                "CurrentYear": {
                    "val": "5.992"
                },
                "BudgetYearOne": {
                    "val": "5.028"
                },
                "BudgetYearOneBase": {
                    "val": "5.028"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.236"
                },
                "CurrentYear": {
                    "val": "5.978"
                },
                "BudgetYearOne": {
                    "val": "4.846"
                },
                "BudgetYearOneBase": {
                    "val": "4.846"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.113"
                },
                "CurrentYear": {
                    "val": "-0.014"
                },
                "BudgetYearOne": {
                    "val": "-0.182"
                },
                "BudgetYearOneBase": {
                    "val": "-0.182"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.232"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.012"
                                },
                                "CurrentYear": {
                                    "val": "-0.014"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Reprogramming Actions in FY18"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.869"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Biological and Chemical Threats Preparedness Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.182"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.182"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Joint Warfighting Program decrease by $5.5M FY20-24 due to reorganization decisions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "727"
                    },
                    "ProjectTitle": {
                        "val": "Joint Warfighting"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "40.477"
                        },
                        "PriorYear": {
                            "val": "3.236"
                        },
                        "CurrentYear": {
                            "val": "5.978"
                        },
                        "BudgetYearOne": {
                            "val": "4.846"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.846"
                        },
                        "BudgetYearTwo": {
                            "val": "4.977"
                        },
                        "BudgetYearThree": {
                            "val": "5.097"
                        },
                        "BudgetYearFour": {
                            "val": "5.201"
                        },
                        "BudgetYearFive": {
                            "val": "5.260"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Warfighting Program (JWP) supports the Assistant Secretary of Defense for Acquisition, ASD(A)) responsibilities for acquisition and portfolio management analysis.  These efforts include independent analyses, studies, limited scope experiments, wargaming, and partnerships with joint customers that define joint capability gaps and develop credible requirements for follow-on acquisition efforts. It synchronizes acquisition processes with corresponding acquisition requirements. These analyses and assessments deliver independent perspectives on ways to align investments and potential solutions for capability gaps created by future warfighting environments and emerging threats. JWP enables portfolio management though these assessments in order to promote potential acquisition remedies to these critical capability gaps. JWP supports efforts to: synchronize the acquisition processes with corresponding acquisition requirements to enable acquisition portfolio management; conduct mission thread analysis; define joint capability gaps and develop credible requirements for follow-on acquisition efforts; deliver independent perspectives on ways to align investments and potential solutions for capability gaps created by evolving threats; seize opportunities to partner with joint customers on projects that inform technology and acquisition decisions; and implement analytic projects on key joint warfighting mission areas and challenges. \n\nJWP projects will support identifying acquisition implication and remedies for critical warfighting challenge. These projects include a F-35 sustainment wargame to define the future state F-35 sustainment strategy that will enable DoD to realize readiness and sustainment goals;  a Cyber wargame on cyber resiliency; analysis of the long term acquisition and sustainment implications of proliferated low-earth orbit constellations; evaluation of the  feasibility and cost effectiveness of recent attempts to create open architecture for space systems; analysis\/study of MUOS Cyber Study\/Narrow-Band SATCOM and MUOS Enterprise Cyber to leverage the best of breed, best practices Cyber strategies and risk management approaches for prevention and detection of cyber threat activity; development of practical approaches to for game-changing software development and sustainment approaches that will catalyze greater mission impact to the warfighter while controlling cost and improving resilience; providing technical support to Software Provenance and Supply Chain Risk Management planning to mitigate risks of cybersecurity threats in DoD security systems and critical infrastructure from IT produces produced by adversaries; providing engineering \/technical assistance for designated agile pilot programs, develop policy, procedures and best practices to facilitate DoD adoption of Agile Pilot Software Piloting methodology.\n\nAnticipated Impact:\nProvides analytical support for acquisition efforts for ASD(A) staff elements and joint customers.  It promotes analyses and assessments for acquisition insights and decisions focused on capability development serving the needs of joint forces and the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Acquisition Analysis for Joint Capability Requirements Addressing Evolving Threats\/Missions"
                                    },
                                    "Description": {
                                        "val": "The Joint Warfighting Program (JWP) supports the Assistant Secretary of Defense for Acquisition responsibilities for acquisition and portfolio management analysis.  These efforts include independent analyses, studies, limited scope experiments, wargaming, and partnerships with joint customers that define joint capability gaps and develop credible requirements for follow-on acquisition efforts. It synchronizes acquisition processes with corresponding acquisition requirements. These analyses deliver independent perspectives on ways to align investments and potential solutions for capability gaps created by future warfighting environments and emerging threats. JWP enables portfolio management though these assessments in order to promote potential acquisition remedies to these critical capability gaps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.205"
                                            },
                                            "Text": {
                                                "val": "Provide direct analytical support responding to emergent joint military staffs to identify capability gaps and military needs for material solutions.  .  Continue to partner with joint military staffs, encouraging experimentation cells to address mission capability gaps, explore potential solutions, and improve understanding of new technologies and concepts in response to evolving missions and military threats.  Empower the joint military staffs to employ rigorous analysis and experimentation methodologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Synchronize the Acquisition processes with corresponding acquisition requirement needs to enable acquisition portfolio management and mission thread analysis; define joint capability gaps and develop credible requirements for follow-on acquisition efforts; deliver independent perspectives on ways to align investments and potential solutions for capability gaps created by evolving threats not aligned to single Component missions; seize opportunities to partner with joint customers on projects that inform technology and acquisition decisions; and implement analytic projects on key joint warfighting mission areas and challenges.\n\nSpecific Objectives: \n-F35 Sustainment Wargame. Define the future state F-35 sustainment strategy that will enable DoD to realize readiness and sustainment goals. Deliverables: Report to summarize the current F35 sustainment strategy, impediments to achieving the future state sustainment strategy with its corresponding readiness and affordability goals, and a plan of action to achieve goals.\n \n-Cyber Wargame. Conduct a joint wargame on cyber resiliency to identify gaps and remedies. Methodology will integrate systems engineering, and cyber vulnerability analysis with modeling and simulation. It includes a detailed analysis and assessment of vulnerabilities in a system of system architecture.\n\n-MOUS Cyber Study:Narrow-Band SATCOM and MOUS Enterprise Cyber Situational Awareness. Objective is to increase the cybersecurity posture of Internet Protocol based Military Satellite Communications systems. Study will leverage best of breed technologies and best practice cyber situational awareness strategies for prevention and detection of cyber threat activity.\n\n-Open Architecture Space Systems. Analysis\/study will evaluate the feasibility and cost effectiveness to create open systems and software architectures for space situational awareness, management, and command and control of space systems.\n\n-Constellation Management for Proliferated Low-Earth-Orbit (PLEO) Missions. The objective is to analyze the long term acquisition and sustainment implications of proliferated low-earth orbit constellations, analyze C2 concepts\/architectures for acquisition trade-offs and long term sustainability and assess survivability approaches to PLEO constellations.\n\n-Supply Chain Risk Mitigation. Support analysis for technical\/engineering efforts to support software provenance and supply chain risk management to mitigate cybersecurity threats in DoD National Security systems and critical infrastructure from IT products produced by potential adversaries.\n- Agile Community of Practice. Study supports acquisition reform area of preparing for, and piloting the implementation of best practices for Agile software development. It will support efforts to complete agile pilots, develop policy, procedures, and best practices to facilitate DoD adaptation of Agile Software Piloting methodology.\n\nAnticipated Impact:  \nProvides analytical support for acquisition efforts for ASD(A) staff elements and joint customers.  It promotes analyses and assessments for acquisition insights and decisions focused on capability development serving the needs of joint forces and the warfighter."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.846"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.846"
                                            },
                                            "Text": {
                                                "val": "Conduct acquisition analysis through a portfolio management lens to address the critical joint warfighting mission areas critical to national Defense. Major focus and project areas will include a continuation of cyber wargaming on cyber security challenges, threats and resiliency of systems and infrastructure to identify gaps and remedies. The methodology in the wargame will integrate systems engineering, and cyber vulnerability analysis with modeling and simulation. It will include a detailed analysis and assessment of vulnerabilities in a system of system architecture; a follow-on analysis on space open architecture of space systems in order to improve space acquisition to support space strategic vision.  The analysis\/study will evaluate challenges to create open systems and software architectures for space situational awareness, management, and command and control of space system for acquisition and long term sustainment..  An electronic warfare analysis of capability gaps and potential remedies for operating in the future joint environment. A follow-on to the F35 sustainment wargame to refine the sustainment strategy, affordability and readiness and plan of action . An analysis of the challenges to nuclear command and control and the implications for acquisition and sustainment of NC2 systems. Efforts will continue to synchronize the Acquisition processes with corresponding acquisition requirement needs to enable acquisition portfolio management and mission thread analysis; define joint capability gaps and develop credible requirements for follow-on acquisition efforts; deliver independent perspectives on ways to align investments and potential solutions for capability gaps created by evolving threats not aligned to single Component missions; seize opportunities to partner with joint customers on projects that inform technology and acquisition decisions; and implement analytic projects on key joint warfighting mission areas and challenges."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Under the directed split of USD AT&L into USD (A&S) and USD (R&E), ASD(A) leadership adjusted funding and focus to address mission priority areas. In FY2020, this segment is combined with Acquisition Analysis of Joint Capability Requirements Addressing Evolving Threats\/Missions"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analytic Development of Joint Military Requirements Addressing Evolving Threats \/ Missions"
                                    },
                                    "Description": {
                                        "val": "This segment underwrites innovative, responsive and timely analytic development of Joint Military requirements addressing evolving missions and threats.  It supports joint capability development serving the needs of joint warfighters in partnership with senior acquisition staffs.  It provides an independent source to examine potential remedies for mission capability gaps and can establish a framework for subsequent field experiments, capability demonstrations or accelerated acquisition.  Joint warfare independent analysis often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.    On a modest funding base, JWP forges collaborative analysis efforts across OSD and joint staffs to address  tough DoD-wide issues like ISR, cyber, EW and UAS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.031"
                                            },
                                            "Text": {
                                                "val": "This segment will provide independent analysis of joint issues and capability gaps.  It will provide responsive and timely capability development pathways and recommendations for rapid acquisition, field experiments conducted by joint military staffs and units.  It will provide an independent source for analysis and enabe capability development suitable for joint experimentation undertaken by joint authorities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.978"
                                            },
                                            "Text": {
                                                "val": "This segment will provide independent analysis of joint issues and capability gaps.  It will provide responsive and timely capability development pathways and recommendations for rapid acquisition, through wargames and analyses conducted by joint military staffs and units.  It will provide an independent source for analysis and enable capability development suitable for joint experimentation undertaken by joint authorities.\n\nSpecific Objectives: \n-F35 Sustainment Wargame. Define the future state F-35 sustainment strategy that will enable DoD to realize readiness and sustainment goals. Deliverables: Report to summarize the current F35 sustainment strategy, impediments to achieving the future state sustainment strategy with its corresponding readiness and affordability goals, and a plan of action to achieve goals.\n \n-Cyber Wargame. Conduct a joint wargame on cyber resiliency to identify gaps and remedies. Methodology will integrate systems engineering, and cyber vulnerability analysis with modeling and simulation. It includes a detailed analysis and assessment of vulnerabilities in a system of system architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Under the directed split of USD AT&L into USD (A&S) and USD (R&E), ASD(A) leadership adjusted funding and focus to address mission priority areas. In FY2020, this segment is combined with Acquisition Analysis of Joint Capability Requirements Addressing Evolving Threats\/Missions"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance is measured through metrics including (1) objective validation of enhanced CCMD capabilities to perform joint missions in their assigned theaters and areas of responsibility, (2) documented delivery effective joint operational concepts, (3) confirmed production of refined and validated capability descriptions."
                        }
                    }
                }
            ]
        }
    }
}