{
    "id": "2020-Army-PB-2040-JBOOK-8fe49b4c986f6d8357230baf1ceec92b6131841a97e0b6b68e62a85179b80ae2-0",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA1-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601101A"
        },
        "ProgramElementTitle": {
            "val": "In-House Laboratory Independent Research"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "11.783"
            },
            "CurrentYear": {
                "val": "11.579"
            },
            "BudgetYearOne": {
                "val": "0"
            },
            "BudgetYearOneBase": {
                "val": "0"
            },
            "BudgetYearTwo": {
                "val": "0"
            },
            "BudgetYearThree": {
                "val": "0"
            },
            "BudgetYearFour": {
                "val": "0"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In Fiscal Year (FY) 2020 this Program Element (PE) is realigned with continuity of effort to the following:\n?\tPE 0601102A Defense Research Sciences"
        },
        "ProgramElementMissionDescription": {
            "val": "This PE supports basic research at the Army laboratories through the In-House Laboratory Independent Research (ILIR) program.  Basic research lays the foundation for future developmental efforts by identifying fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge.  The ILIR program serves as a catalyst for major technology breakthroughs by providing laboratory directors flexibility in implementing novel research ideas, by nurturing promising young scientists and engineers, and is used to attract and retain top doctoral degreed scientists and engineers.  The ILIR program also provides a source of competitive funds for peer reviewed efforts at Army laboratories to stimulate high quality, innovative research with significant opportunity for payoff to Army warfighting capability.  \n\nThis PE supports ILIR at the Army Futures Command's six Research, Development, and Engineering Centers (Project 91A), and at the United States (US) Space and Missile Defense Command (SMDC)  (Project F16).\n\nWork in the PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.\n\nAll FY 2020 adjustments align program financial structure to Army Modernization Priorities in support of the National Defense Strategy.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.01"
                },
                "CurrentYear": {
                    "val": "11.585"
                },
                "BudgetYearOne": {
                    "val": "11.779"
                },
                "BudgetYearOneBase": {
                    "val": "11.779"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.783"
                },
                "CurrentYear": {
                    "val": "11.579"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.227"
                },
                "CurrentYear": {
                    "val": "-0.006"
                },
                "BudgetYearOne": {
                    "val": "-11.779"
                },
                "BudgetYearOneBase": {
                    "val": "-11.779"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.005"
                    },
                    "CurrentYear": {
                        "val": "-0.006"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.222"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-11.779"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.779"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY20 reduction related to Science and Technology financial restructuring."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "91A"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-AMC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.867"
                        },
                        "CurrentYear": {
                            "val": "10.62"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0601102A Defense Research Sciences\n* Project AA1 ILIR - AMC"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project funds basic research within the Army Materiel Command's (AMC) Research, Development, and Engineering Centers (RDECs) and lays the foundation for future developmental efforts by identifying the fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge. \n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Edgewood Chemical Biological Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in chemistry, biology, biotechnology, and aerosol for countering improvised explosive devices (IEDs), obscurants, and\/or target defeat.  Work in this Project provides theoretical underpinnings for PE 0602622A (Chemical, Smoke, and Equipment Defeating Technologies)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.071"
                                            },
                                            "Text": {
                                                "val": "Conducted fundamental research in synthetic biology focusing on understanding genetic drift, mutation rates, as well as the structure function relationships of proteins.  Explored molecular toxicology focused on developing the use of human and animal pluripotent stem cells to derive toxicological end points rather than using whole animal studies. Performed physical and mathematical investigations into aerosol particle behaviors to help develop knowledge on their behavior during deposition into the atmosphere as well as in the respiratory tract."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.955"
                                            },
                                            "Text": {
                                                "val": "Conduct fundamental research in hierarchical systems through selective deposition and growth of metal-organic frameworks; synthetic biology focuses on understanding genetic drift, mutation rates, as well as the structure function relationships of proteins; and extend physical and mathematical investigations into aerosol particle charge behaviors that will help develop knowledge on their behavior during deposition into the atmosphere as well as in the respiratory tract."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0601101A Project 91A will move to PE 0601102A Defense Research Sciences \/ Project AA1  ILIR - AMC in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armaments Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in weapons component development, explosives synthesis\/detection and area denial.  Work in this Project provides theoretical underpinnings for PE 0602307A (Advanced Weapons Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.386"
                                            },
                                            "Text": {
                                                "val": "Performed basic research in light-weight thermoplastic composites, compact and more lethal warheads, synthesis and characterization of more powerful and less sensitive explosives, area denial technologies, advanced structural materials and new materials for electronic sensing devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.409"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct basic research that provides the underpinnings necessary for developing new explosives and propellants, smaller and more lethal warheads, lighter and stronger composite materials for guns and weapon platforms, algorithms for future intelligent munitions, and area denial technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0601101A Project 91A will move to PE 0601102A Defense Research Sciences \/ Project AA1  ILIR - AMC in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tank-Automotive Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in ground vehicle technologies to include power, mobility, and unmanned systems.  Work in this Project provides theoretical underpinnings for PE 0602601A (Combat Vehicle and Automotive Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.277"
                                            },
                                            "Text": {
                                                "val": "Conducted efforts to further basic research in areas of strategic importance to Army ground vehicles such as increased control\/ mobility of autonomy enabled-systems involving latency compensation using innovative numerical techniques, teleoperation in high-speed, long distance scenarios, anticipatory dynamic Bayesian network for intelligent navigation, methods for detection of high velocity projectiles, real-time panorama generation in tele-immersive combat vehicle operations, deep incremental learning and trust algorithms, novel computationally-efficient numerical modeling of vehicle interactions with deformable terrain, diesel engine heat transfer model development, machine learning, and quantum modeling and computation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.208"
                                            },
                                            "Text": {
                                                "val": "Solicit research proposals to improve understanding and accelerate technology development focused on those topics of strategic importance to the Army ground vehicle community such as; semi-, fully-, and multiple autonomous vehicle operation and control, ground vehicle cybersecurity threat detection algorithms and resilience, lightweight materials and dissimilar material joining for thick section materials, advanced energy storage materials, corrosion modeling, and early detection mechanisms, and electrophoretic displays."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0601101A Project 91A will move to PE 0601102A Defense Research Sciences \/ Project AA1  ILIR - AMC in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Natick Soldier Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in food sciences, textiles, and lightweight materials with potential for individual protection. Work in this Project provides theoretical underpinnings for PE 0601102A (Defense Research Sciences), Project H52 (Equipment for the Soldier)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.125"
                                            },
                                            "Text": {
                                                "val": "Explored the feasibility of creating a conductive fibrous platform through the integration of iridium oxide nanoparticles; characterized the structure and electrochemical properties of the iridium oxide nanoparticles and explore applicability to wearable sensing and power; designed frequency selective surface antenna arrays tailored for chemical detection; explore discrimination of surface antenna arrays through numerical electromagnetic simulations that explore parameters such as individual antenna element shape\/ dimensions, spacing between antenna elements, choice of metal, and spectral shifts produced by metal oxides."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.102"
                                            },
                                            "Text": {
                                                "val": "Combine theoretical and experimental studies to investigate point contact antenna response to infrared\/visible laser beams and understand photon-assisted tunneling (PAT), conductance, and rectification to advance future capability of lightweight, tunable visible\/infrared Soldier borne power harvesting systems.  Explore creating liquid crystals with tunable melting points and establish an understanding of the phases, and phase transitions of liquid crystals when confined in polymer matrices to enable future development of lightweight ?smart? textiles that can efficiently respond to external stimuli."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0601101A Project 91A will move to PE 0601102A Defense Research Sciences \/ Project AA1  ILIR - AMC in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Missile Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in guided missile and rocket systems, directed energy weapons, unmanned vehicles, and related components.  Work in this Project provides theoretical underpinnings for PE 0602303A (Missile Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.388"
                                            },
                                            "Text": {
                                                "val": "Investigated chaotic dynamics in linear and piecewise linear systems; understood new paradigm in continuum electrodynamics by deriving self-consistent treatment that includes relativity and conservation of momentum and energy; concluded demonstration of proof-of-concept ultraviolet photocatalytic splitting of molecular bonds using plasmonic metal nanoparticles; completed investigation on polarization-sensitive terahertz holographic imaging (for mapping strain in opaque materials); and explore efficient opto-electro- plasmonic devices through electromagnetic interactions at artificial surfaces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.302"
                                            },
                                            "Text": {
                                                "val": "Investigate optimal signal detection using mutual information to improve radar performance; explore the connection between nonlinear dynamics and communication theory to engineer chaotic oscillators in wireless datalinks, radar, and acoustic sensor devices; design hybrid nano-antennas based on nested and nearly overlapping plasmonic resonant modes for enhanced sensing, detection, energy harvesting, and nanoscale light manipulation; explore effects of low pressure collision broadening and interatomic forces for atom-based inertial navigation sensors; investigate linear and nonlinear optical materials with dielectric constant near zero for accurate clocks used for Global Positioning System (GPS) and inertial navigation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0601101A Project 91A will move to PE 0601102A Defense Research Sciences \/ Project AA1  ILIR - AMC in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Aviation Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for aviation enabling technologies in the areas of aerodynamics, structural dynamics, and material science.  Work in this Project provides theoretical underpinnings for PE 0602211A (Aviation Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.38"
                                            },
                                            "Text": {
                                                "val": "Conducted interactional aerodynamics investigations of the wake physics and inflow dynamics of multiple rotor configurations; explored improved design of fluidic control actuators through boundary layer flow control studies; extended higher order unstructured grid solvers that leverage emerging exascale computer architecture to flow over complex geometries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.313"
                                            },
                                            "Text": {
                                                "val": "Conduct research on measurement techniques such as a hub-based camera system for rotor blade deformation measurements, microelectromechanical systems based sensors for unsteady airfoil pressure gradient measurements, and tomographic particle image velocimetry for volumetric flow measurements; conduct research on parallel-in-time computational fluid dynamics algorithms to realize the computation speed benefits of emerging peta-scale computer architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0601101A Project 91A will move to PE 0601102A Defense Research Sciences \/ Project AA1  ILIR - AMC in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications-Electronics Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for communication and network enabling technologies in the areas of antenna design, network management, power generation and storage, and sensors.  Work in this Project provides theoretical underpinnings for PE 0602705A (Electronics and Electronic Devices)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.24"
                                            },
                                            "Text": {
                                                "val": "Conducted research on the intrinsic efficiencies of non-foster matching methods at radio frequencies with a focus on full stability analysis; splitting of radio network traffic over multipath to maximize throughput performance for traffic flows by using new fluid- flow models to support dynamic topology; researched 3D printing of tunable coils and matching networks with precisely controlled impedance and resonant frequencies resulting in tunable structures that can be activated in a controlled manner to change the shape or configuration of the solid in response to an external stimulus; determined the most effective information visualization methods and\/or perspectives for commander understanding of the cyber domain and its relationship to mission command in the physical domain; researched high performance, rechargeable, safe Lithium Sulphur (LiS) battery chemistry; experimentally confirmed the performance of synthesized catalysts that can promote the production of synthesis gas (carbon monoxide (CO) and hydrogen (H2)) from carbon dioxide and hydrogen with high CO selectivity and high yield; researched novel optical properties of retro-reflections, with an emphasis on polarization, to characterize and discriminate between different objects; researched active and passive longwave infrared (LWIR) detection with a long term goal of produce focal plane arrays capable of passive longwave and active 3D imaging; researched novel molecular beam epitaxy growth techniques that mitigate antimony cross incorporation in Gallium-free superlattice detectors; researched novel characterization techniques, investigate the inherent materials issues, and associated processes that limit the performance of LWIR focal plane arrays with diffraction-limited pixel-pitch."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.143"
                                            },
                                            "Text": {
                                                "val": "Conduct research on techniques for reducing the computational complexity and burden associated with massive multiple input ? multiple output antenna arrays; will research the mathematical relationship between the electric permittivity, magnetic permeability and thickness of the metamaterial in a conformal antenna; research energy harvesting which has a net zero or net positive effect on the metabolic rate by only harvesting energy during certain stages of the gait cycle; research deep learning algorithms and confidence-based likelihoods associated with classification decisions; innovate and create new integrable material solutions to enable smaller, lower cost phase shifters and tunable filters for use in radar, electronic warfare and communications systems; research phase shifting diode networks to use with 2-dimensional planar phased array with integrated antennas that operate at 60GHz ~ 1 THz; and research material parameters and device models for high fidelity simulation of III-V and II-VI optoelectronics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0601101A Project 91A will move to PE 0601102A Defense Research Sciences \/ Project AA1  ILIR - AMC in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.188"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F16"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-SMDC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.916"
                        },
                        "CurrentYear": {
                            "val": "0.959"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020, this Project is being realigned to:\nProgram Element (PE) 0601102A Defense Research Sciences\n* Project AA2 ILIR - SMDC"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project provides In-house Laboratory Independent Research (ILIR) at the United States (US) Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT).  This basic research on lasers and directed energy lays the foundation for future developmental efforts on high energy lasers and directed energy systems by identifying the fundamental principles governing various directed energy phenomena.  \n\nWork in this Project is related to, and fully coordinated with, efforts in PE 0602307A (Advanced Weapons Technology).\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SMDC In-house Laboratory Independent Research"
                                    },
                                    "Description": {
                                        "val": "Funds basic research to investigate laser propagation phenomenology for application in modeling and simulation and future directed energy weapons design.  Activities in this Project transition to High Energy Laser Technology in PE 0602307A (Advanced Weapons Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.916"
                                            },
                                            "Text": {
                                                "val": "Completed experiments to understand the feasibility of a diode pumped Xenon gas laser; conducted an experiment of a direct diode concept to measure efficiency and beam quality and observed how the results compare to traditional solid state lasers; and completed analysis of the beaconless adaptive optics approach for correcting a laser beam for propagation in the presence of particulates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.959"
                                            },
                                            "Text": {
                                                "val": "Complete data analysis and verification of engineering models to understand the viability of increasing the power to 10?s of watts for a diode pumped Xenon gas laser; investigate a laboratory bench top experiment of a direct diode concept to combine 10?s of diode sources into a single laser beam at the milli-watt level to understand key laser metrics and begin to evaluate scalability of the approach to watt class; and complete investigation of the beaconless adaptive optics approach for correcting a high energy laser beam (greater than 10kW) for propagation in the presence of particulates beyond 1km."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PE 0601101A Project F16 will move to PE 0601102A Defense Research Sciences \/ Project AA2 ILIR - SMDC in FY20."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}