{
    "id": "2020-Army-PB-2040-JBOOK-8fe49b4c986f6d8357230baf1ceec92b6131841a97e0b6b68e62a85179b80ae2-2",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA1-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601103A"
        },
        "ProgramElementTitle": {
            "val": "University Research Initiatives"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "74.349"
            },
            "CurrentYear": {
                "val": "65.202"
            },
            "BudgetYearOne": {
                "val": "65.858"
            },
            "BudgetYearOneBase": {
                "val": "65.858"
            },
            "BudgetYearTwo": {
                "val": "67.214"
            },
            "BudgetYearThree": {
                "val": "68.552"
            },
            "BudgetYearFour": {
                "val": "69.923"
            },
            "BudgetYearFive": {
                "val": "70.704"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "481.802"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports the Multidisciplinary University Research Initiative (MURI), the Defense University Research Instrumentation Program (DURIP), the Presidential Early Career Awards for Scientists and Engineers (PECASE) program, and the Army's efforts in the Minerva Research Initiative (MRI). The MURI program funds university based basic research in a wide range of scientific and engineering disciplines pertinent to maintaining land combat technology superiority. Army MURI efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline (e.g., Intelligent Luminescence for Communication, Display, and Identification). For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.  The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research. The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.  The MRI is a university-based social science research program.\n\nWork in this PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "67.027"
                },
                "CurrentYear": {
                    "val": "65.283"
                },
                "BudgetYearOne": {
                    "val": "65.858"
                },
                "BudgetYearOneBase": {
                    "val": "65.858"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "74.349"
                },
                "CurrentYear": {
                    "val": "65.202"
                },
                "BudgetYearOne": {
                    "val": "65.858"
                },
                "BudgetYearOneBase": {
                    "val": "65.858"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.322"
                },
                "CurrentYear": {
                    "val": "-0.081"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.055"
                    },
                    "CurrentYear": {
                        "val": "-0.081"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.623"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY18 increase related to Congressional Adds totaling $10 million."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AB3"
                    },
                    "ProjectTitle": {
                        "val": "MURI\/PECASE\/DURIP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "65.858"
                        },
                        "BudgetYearOneBase": {
                            "val": "65.858"
                        },
                        "BudgetYearTwo": {
                            "val": "67.214"
                        },
                        "BudgetYearThree": {
                            "val": "68.552"
                        },
                        "BudgetYearFour": {
                            "val": "69.923"
                        },
                        "BudgetYearFive": {
                            "val": "70.704"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "342.251"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project was realigned from:\nProgram Element (PE) 0601103A University Research Initiatives\n* Project D55 University Research Initiative."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Multidisciplinary University Research Initiative (MURI), the Defense University Research Instrumentation Program (DURIP), and the Presidential Early Career Awards for Scientists and Engineers (PECASE) program. The MURI program funds university based basic research in a wide range of scientific and engineering disciplines pertinent to maintaining land combat technology superiority. Army MURI efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline. For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application. The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research. The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their research careers. Work in this Project provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.\n\nFY20 realignments are due to financial restructuring in support of Army Modernization Priorities\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multidisciplinary University Research Initiative (MURI)"
                                    },
                                    "Description": {
                                        "val": "MURI programs are typically 5 years in length at a cost of $1.25 million each per year."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "53.555"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "53.555"
                                            },
                                            "Text": {
                                                "val": "Will provide continued support for MURI awards made in prior years and will initiate six to eight new FY20 MURI efforts that will enable advances in select interdisciplinary basic science and\/or engineering research areas determined to be of critical importance to national defense."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This work was previously performed in PE 0601103A University Research Initiatives\/ Project D55 University Research Initiative."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Presidential Early Career Awards for Scientists and Engineers (PECASE)"
                                    },
                                    "Description": {
                                        "val": "Supports PECASE investigators started in prior years as well as new award recipients."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.5"
                                            },
                                            "Text": {
                                                "val": "Will support 12 existing PECASE awardees.  FY20 plans assume there are no new PECASE awards made during FY18 through FY20.  Funding for new awards is moved to DURIP.  If new PECASE awards are made during FY19 through FY20, funding to support the new PECASE awards will come from DURIP."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This work was previously performed in PE 0601103A University Research Initiatives\/ Project D55 University Research Initiative.  Since there have been no new PECASE awards, funding remains to support existing awards and the funding for new awards is moved to DURIP."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense University Research Instrumentation Program (DURIP)"
                                    },
                                    "Description": {
                                        "val": "Supports basic research through competitive grants for research instrumentation."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.803"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.803"
                                            },
                                            "Text": {
                                                "val": "Will evaluate and award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research and enhance educational capabilities critical to Army transformation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This work was previously performed in PE 0601103A University Research Initiatives\/ Project D55 University Research Initiative.  Funding for new PECASE awards has been moved to DURIP since there have been no new PECASE awards.  If new PECASE awards do occur during FY 2018 through FY 2020, funding for the awardees will come from DURIP funds."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D55"
                    },
                    "ProjectTitle": {
                        "val": "University Research Initiative"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "63.556"
                        },
                        "CurrentYear": {
                            "val": "65.202"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "128.758"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2020 this Project is being realigned to:\nProgram Element (PE) 0601103A University Research Initiatives\n* Project AB3 MURI\/PECASE\/DURIP"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Multidisciplinary University Research Initiative (MURI), the Defense University Research Instrumentation Program (DURIP) and the Presidential Early Career Awards for Scientists and Engineers (PECASE) program. The MURI program funds university based basic research in a wide range of scientific and engineering disciplines pertinent to maintaining land combat technology superiority. Army MURI efforts involve teams of researchers investigating high- priority, transformational topics that intersect more than one traditional technical discipline (e.g. Intelligent Luminescence for Communication, Display, and Identification). For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.  The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research. The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.\n\nWork in this Project provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers. \n\n.FY20 realignments are due to financial restructuring in support of Army Modernization Priorities\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multidisciplinary University Research Initiative (MURI)"
                                    },
                                    "Description": {
                                        "val": "MURI programs are typically 5 years in length at a cost of $1.25 million per year."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "51.032"
                                            },
                                            "Text": {
                                                "val": "Provided support for MURI awards made in prior years and identified six new FY18 MURI awards to support basic science and\/or engineering research at institutions of higher education that is of critical importance to national defense."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "51.093"
                                            },
                                            "Text": {
                                                "val": "Provide support for MURI awards made in prior years and will identify six to eight new FY19 MURI awards to enable advances in select interdisciplinary basic science and\/or engineering research areas determined to be of critical importance to national defense."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project will move to PE 0601103A \/ Project AB3 MURI\/PECASE\/DURIP in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Presidential Early Career Awards for Scientists and Engineers (PECASE)"
                                    },
                                    "Description": {
                                        "val": "Supports PECASE investigators started in prior years as well as new awards initiated in current year."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.39"
                                            },
                                            "Text": {
                                                "val": "Supported prior year awardees and selected four new PECASE candidates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.408"
                                            },
                                            "Text": {
                                                "val": "Support prior year awardees and will select four new PECASE candidates."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project will move to PE 0601103A \/ Project AB3 MURI\/PECASE\/DURIP in FY20."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense University Research Instrumentation Program (DURIP)"
                                    },
                                    "Description": {
                                        "val": "Supports basic research through competitive grants for research instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.134"
                                            },
                                            "Text": {
                                                "val": "Evaluated proposals to award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.312"
                                            },
                                            "Text": {
                                                "val": "Evaluate and award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research and enhance educational capabilities critical to Army transformation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This Project will move to PE 0601103A \/ Project AB3 MURI\/PECASE\/DURIP in FY20"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.389"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D58"
                    },
                    "ProjectTitle": {
                        "val": "URI ACTIVITIES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Interest Item"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for University Research Initiatives.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Congressional Add"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "V72"
                    },
                    "ProjectTitle": {
                        "val": "Minerva"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.793"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.793"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This Project ended in Fiscal Year (FY) 2018."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Minerva Research Initiative (MRI), a university-based social science research program initiated by the Secretary of Defense in FY09.  It focuses on areas in the social sciences that are of strategic importance to national security policy which have not been substantially pursued in the past.  The Minerva research effort will be performed to understand the internal military-political dynamics of repressive regimes, the vulnerabilities of regimes and institutions to various kinds of disruption and instability, the nature of crowd dynamics, group violence, community belief structures, the potential to influence public opinion and attitudes in diverse cultures, cultural effects on network security and military operations, the influence of technology on military capabilities of potential adversaries and allies, and other intersections of social-cultural issues with military activities and national security.  Predictive models and other analysis tools will be developed.  Leveraging the expertise in the social sciences within the academic community is needed to provide understanding of the roots of terrorist organizations and the challenges and opportunities for military operations in a culturally diverse environment.  Better understanding at a fundamental level and new computational tools will provide a beneficial impact on war fighting capabilities at the national policy, military strategy, operational, and tactical levels, and will enhance the capabilities of intelligence activities at all levels.  All research results are open source.\n\nThe cited work is consistent with the Under Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "The Minerva Research Initiative (MRI)"
                                    },
                                    "Description": {
                                        "val": "The MRI is a university-based social science research program initiated by the Secretary of Defense. It focuses on areas in the social sciences of strategic importance to national security policy. It seeks to increase the Department's intellectual capital in the social sciences and improve its ability to address future challenges and build bridges between the Department and the social science community. Minerva will bring together universities, research institutions, and individual scholars and support multidisciplinary and cross-institutional projects addressing specific topic areas determined by the Department."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.793"
                                            },
                                            "Text": {
                                                "val": "Created new quantitative models to detect vulnerabilities in government systems throughout the world that engender sociopolitical instability and susceptibility to hostile movements from both within a nation and from outside. The models focused on shifts in population movement that arose from interdependencies between economic markets, health, and natural resources needed to support social communities. This research enabled a capacity to detect emerging conflict zones before they erupt, and enabling an early capacity to stabilize at-risk regions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}