{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-26",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603769D8Z"
        },
        "ProgramElementTitle": {
            "val": "Advanced Distributed Learning"
        },
        "R1LineNumber": {
            "val": "58"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "10.384"
            },
            "PriorYear": {
                "val": "11.053"
            },
            "CurrentYear": {
                "val": "13.564"
            },
            "BudgetYearOne": {
                "val": "13.723"
            },
            "BudgetYearOneBase": {
                "val": "13.723"
            },
            "BudgetYearTwo": {
                "val": "13.493"
            },
            "BudgetYearThree": {
                "val": "13.204"
            },
            "BudgetYearFour": {
                "val": "12.425"
            },
            "BudgetYearFive": {
                "val": "12.425"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.157"
                },
                "CurrentYear": {
                    "val": "13.564"
                },
                "BudgetYearOne": {
                    "val": "13.723"
                },
                "BudgetYearOneBase": {
                    "val": "13.723"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.053"
                },
                "CurrentYear": {
                    "val": "13.564"
                },
                "BudgetYearOne": {
                    "val": "13.723"
                },
                "BudgetYearOneBase": {
                    "val": "13.723"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.104"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.104"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Funds reserved for special research programs, e.g., SBIR\/STTR."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "776"
                    },
                    "ProjectTitle": {
                        "val": "Advance Distributed Learning (ADL)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.384"
                        },
                        "PriorYear": {
                            "val": "11.053"
                        },
                        "CurrentYear": {
                            "val": "13.564"
                        },
                        "BudgetYearOne": {
                            "val": "13.723"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.723"
                        },
                        "BudgetYearTwo": {
                            "val": "13.493"
                        },
                        "BudgetYearThree": {
                            "val": "13.204"
                        },
                        "BudgetYearFour": {
                            "val": "12.425"
                        },
                        "BudgetYearFive": {
                            "val": "12.425"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) describes the Advanced Distributed Learning (ADL) Initiative. This program was originally established in the 1990s in response to the NDAA (FY99, Section 378 of Public Law 105-261) and granted additional authorities via Executive Orders (e.g., EO 13111) and other supporting publications (e.g., 10 U.S. Code §2249d). The ADL Initiative supports innovation and provides policy oversight to help the Services, Joint Staff, and partner agencies deliver their training and education more efficiently and cost effectively—anytime, anywhere. ADL provides policy oversight and coordination across DoD, Coalition partners, and other Federal agencies for distributed learning. Ultimately, this work supports DoD’s training and education mission, increases personnel readiness, saves resources, ensures the right people receive the right training and education, at the right time, and at the right cost, and facilitates interorganizational interoperability. Organizationally, this PE reports to the Deputy Assistant Secretary of Defense for Force Education and Training (DASD(FE&T)). \n\nThis PE provides policy oversight and guidance for distributed learning (e.g., online courses, smartphone-based learning, web browser–based simulations) and supports associated innovation, modernization, and coordination across DoD, Coalition partners (e.g., NATO), and other federal agencies. This work focuses on distributed learning interoperability (i.e., ensuring interagency technical and organizational systems function together), supports interagency\/interorganizational coordination for its implementation, and helps agencies acquire new distributed learning capabilities effectively and cost-efficiency. \n\nThis PE’s work falls into three interrelated categories: (1) Modernization, (2) Documentation, and (3) Coordination. The “modernization” work involves Advanced Technology Development (6.3) in technical areas such as e-learning, mobile learning, learner modeling and analytics, and software interoperability. These efforts inform the PE’s “documentation” work, including the authoring and upkeep of technical guidance and policy documents, such as DoD Instruction 1322.26 (“Distributed Learning”) and software interoperability specifications. Finally, the documentation work drives “coordination” efforts, which consist of implementation support and interagency\/interorganizational coordination. \n\nThis PE’s modernization investments are driven by requirements collected from the Defense ADL Advisory Committee, a working group of military personnel and DoD\/federal civilians (at the O-6 and GS-15 level) who represent their agencies’ distributed learning equities and are key stakeholders in shaping the direction of these agencies (refer to DoDI 1322.26). These requirements are also aligned to DoD\/federal strategic direction, such as the Army Learning Concept for Training and Education for 2020–2040 (TP 525-8-2), Navy’s Sailor 2025, and Air Force Strategic Master Plan, and they are considered against emerging industry trends and technologies. \n\nThis PE benefits DoD in three ways. (1) Interoperability: It strengthens interagency, interorganizational, and multinational interoperability by governing distributed learning interoperability policy, maintaining current technical reference guidelines, and fostering their implementation across communities of practice. (2) Efficiencies: It saves government resources by fostering unity of effort across DoD, other federal agencies, and Coalition Partners for distributed learning, eliminating duplications and identifying opportunities for interagency collaboration. (3) Learning Effectiveness: It helps improve training and education effectiveness by helping DoD, federal, and Coalition stakeholders acquire and implement emerging distributed learning capabilities effectively and cost-efficiently. In sum, this work supports the components’ training and education missions, helping them increase personnel readiness while driving down training and education portfolio costs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advance Distributed Learning (ADL)"
                                    },
                                    "Description": {
                                        "val": "This PE serves as the innovation hub for distributed learning across the DoD and other government agencies, enabling innovation, finding efficiencies, informing stakeholders’ modernization efforts, and fostering interoperability across defense, government, and industry. ADL Initiative supports DoD-wide initiatives for innovation, modernization, and advancement of DoD enterprise-level online and mobile electronic training capability and learning tools. Activities include advanced technology design and development, demonstrations, assessments, and associated policy stewardship. Results improve efficiencies and reduce costs by reducing time spent in face-to-face instruction, allowing more time for practical application and repetition; increasing interoperability, which enables discovery, retrieval, and reuse of distributed learning content; and researching and prototyping methods of distributed learning with superior motivational and learning outcomes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.053"
                                            },
                                            "Text": {
                                                "val": "Total Learning Architecture – All of the U.S. Services, Joint Staff, and many other federal programs have released publications calling for a modern “learning ecosystem” comprised of interconnected learning opportunities, supported by technology, driven by data, and integrated with other talent management capabilities. This program is supporting its development by investigating the specifications and web-based digital services needed to make training and education technologies interoperable. In FY17, an early “Total Learning Architecture” prototype was tested with 75 Special Operators at Ft. Bragg. In FY18, this project will enter its second phase of development and will include additional empirical testing. \n\nLearning Data – In FY17, this program led a revision to DoD Instruction 1322.26, after extensive coordination with the Services and Joint Staff. The revised Instruction recommends the use of the Experience Application Programming Interface (xAPI), a technical specification that enables data exchange across training and education technologies. In FY18, this program will continue to refine the xAPI specification for semantic interoperability and will coordinate with stakeholders to deliver the implementation guidance, conformance testing tools, learning analytics, and data visualization capabilities they need to make most use of it. In FY18, this work is also expected to inform updates to DoD Instruction 1322.26’s fungible technical references.\n\nCompetencies and Credentialing – In FY17, this program investigated competency and credentialing management technologies, and it prototyped a web-based competency framework tool as part of the Total Learning Architecture demonstration. In FY18, this PE will continue its coordination efforts across defense and federal agencies for competency-based learning, and it will continue working with professional specifications and standards bodies in development of associated interoperability specifications to aid permeability across organizational boundaries. \n\nPersonal Assistant for Learning – Adaptive learning tools promise to increase the effectiveness and efficiency of training and education, and these tools are critical parts of DoD’s modern “learning ecosystem” vision. This program examines the science and technology needed to design such capabilities, using open-architecture and open-source methods. In FY17, this PE successfully tested several frameworks, including a smartphone-based system with Defense Language students and a table-based e-book capability with Special Operators. In FY18, this program plans to work with other agencies to transition some of these capabilities into operational use, coordinate with professional specifications and standards bodies to author relevant technical guidelines, and to continue development of these emerging capabilities. \n\nInteragency and Interorganizational Coordination – In FY17, this program provided distributed learning modernization support to more than 40 defense agencies (e.g., The Army Distributed Learning Program, Naval Education and Training Command, Air Education and Training Command, Marine Corps Training and Education Command, Joint Knowledge Online, Defense Acquisition University), more than 15 international partners (e.g., NATO, The Technical Cooperation Program, Partnership for Peace Consortium), and other federal agencies (e.g., National Park Service, Customs and Border Protection). In FY18, this program will continue to coordinate with these stakeholders and with relevant working groups, such as the Defense ADL Advisory Committee, to create technical alignment of distributed learning systems and find efficiencies for the government."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.564"
                                            },
                                            "Text": {
                                                "val": "1.\tContinue implementation of revised DoDI 1322.26 requirements, while also providing coordination with Joint Services, and guidance on the incorporation of experience Application Programming Interface (xAPI) into distributed learning software systems.\n\n2.\tTotal Learning Architecture – The Total Learning Architecture (TLA) will enter its third phase of development, which is expected to incorporate multiple simultaneous application domains, building upon the FY18 Combat Profiling domain. It will also incorporate increased focus on learner records, competency specifications, and content metadata, to enable greater integration with broader talent management systems. This work also coincides with emerging DoD-wide learning technology reform efforts.\n\n3.\tLearner Profiles – The promise of new TLA applications stems from the ability to create, collect, transmit, process, and archive information on a massive scale. Collaborate with operational defense training and education organizations to help them implement at-scale instances of prototype learning data interoperability specifications, learning analytics, and visualization capabilities. Desired outcomes include developing a TLA-compliant, extensible, and open-source learner profile for use within the DoD and Government.\n\n4.\tCompetency and Credential Management - Coordinate efforts across defense and federal agencies for competency-based learning, with the associated technical guidance potentially informing DoD Instruction 1322.26’s fungible technical references. Seek a robust set of data, metadata, and interaction specifications to represent competencies and competency frameworks. Desired outcomes include an effective reference implementation of enterprise competency and credential management supporting DoD learning ecosystems; including a data strategy and associated lifecycle that creates a solid foundation for expansion of TLA.\n\n5.\tPersonal Assistant for Learning – Complete development cycles of tablet-based and web-based prototypes. Continue transition of mature specification into relevant technical guidelines and continue to investigate emerging capabilities. Initiate advanced research in preparation for immediate operational implementation of the PERvasive Learning System (PERLS), adaptive, micro-learning mobile application.\n6.\tLearning Science – Complete publication of a learning science scholarly book, summarizing best practices and specific guidance on modernizing training, education, and talent management, as an accompaniment to the emerging learning technologies. \n\n7.\tInteragency and Interorganizational Coordination – Continue coordination with defense, federal, and international stakeholders, and with relevant working groups, such as the Defense ADL Advisory Committee and NATO Training Group, to create technical alignment of distributed learning systems and find efficiencies for the government."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.723"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.723"
                                            },
                                            "Text": {
                                                "val": "1.\tContinue implementation of revised DoDI 1322.26 requirements, while also providing coordination with Joint Services, and guidance on the incorporation of xAPI into distributed learning software systems.  Integrate research efforts and findings, as necessary into updates to the DoDI 1322.26.\n\n2.\tTotal Learning Architecture – Research and development activities for this spiral of TLA will provide the ability to adapt across learning trajectories, careers, and experiences. It also incorporates various activity providers, as traditional e-learning content, a browser-based concept-map assessment application, e-book, micro-learning activities, a computer-based serious game, and a physical instructor-led learning activity. This work continues to coincide with the emerging DoD-wide learning technology reform efforts.\n\n3.\tLearner Science – Collaborate with operational defense training and education organizations to help them evolve effective learning methodologies and solutions. Implement prototype capability through empirical and theoretical analysis of neuroscience, cognitive science, instructional design, data analytics, anthropology, linguistics, computer science, psychology, and education. Use data and information to develop learning data interoperability specifications, learning analytics, and visualization capabilities. Ongoing efforts will also continue to inform the DoD Instruction 1322.26’s fungible technical references.\n\n4.\tCompetency and Credential Management – Continue coordinate efforts across defense and federal agencies for competency-based learning, with the associated technical guidance potentially informing DoD Instruction 1322.26’s fungible technical references. Evolve a robust set of data, metadata, and interaction specifications to represent competencies and competency frameworks. Desired outcomes include evolution of an effective reference implementation of enterprise competency and credential management supporting DoD learning ecosystems; including refinement of a data strategy and associated lifecycle that builds on a solid foundation for expansion of TLA.\n\n5.\tPersonal Assistant for Learning – PERvasive Learning System (PERLS) transition, sustainment and formalization as an R&D project subprogram. PERLS allows capitalization of “white space” outside of formal learning activities and training exercises.\n\n6.\tInteragency and Interorganizational Coordination – Continue coordination with defense, federal, and international stakeholders, and with relevant working groups, such as the Defense ADL Advisory Committee and NATO Training Group, to create technical alignment of distributed learning systems and find efficiencies for the government."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Delta between FY19-FY20 due to regular program growth\/inflation"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objectives of this PE are to inform distributed learning modernization efforts, to develop associated policy and guidance documents, and to coordinate across distributed learning agencies to create technical alignment of distributed learning systems and find efficiencies for the government. \n\nMODERNIZATION: The modernization work consists of a collection of smaller technical efforts, each with project metrics that reflect their unique technical goals. Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged by other defense and federal agencies, the increase in the number of interoperable training and education digital systems, the impact of these efforts on defense\/federal strategic planning, and downstream reductions in training and education portfolio costs. \n\nDOCUMENTATION: For the policy and documentation efforts, metrics include at-least annual update of published guidance, ensuring the documentation adheres to current technical\/industry standards. The policy and documentation utility are also judged based upon its use, including both number of vendors adopting the policy and number of defense\/federal acquisition efforts adhering to the guidance.\n\nCOORDINATION: For the interagency and interorganizational coordination efforts, performance is first measured based upon the number of agencies, international organizations, and professional groups directly supported. Success is measured based upon the number of requirements consolidated across defense and federal stakeholders, an increase in partnering between agencies for distributed learning resource sharing, and, ultimately, in improved return on investment for distributed learning efforts."
                        }
                    }
                }
            ]
        }
    }
}