{
    "id": "2020-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-a68dd9fef367b9c12cbc9abe43de0f366f7fa17ff175266a426863ca981e6b3b-2",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0602115E"
        },
        "ProgramElementTitle": {
            "val": "BIOMEDICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "88.962"
            },
            "CurrentYear": {
                "val": "101.300"
            },
            "BudgetYearOne": {
                "val": "97.771"
            },
            "BudgetYearOneBase": {
                "val": "97.771"
            },
            "BudgetYearTwo": {
                "val": "123.570"
            },
            "BudgetYearThree": {
                "val": "120.783"
            },
            "BudgetYearFour": {
                "val": "122.687"
            },
            "BudgetYearFive": {
                "val": "134.997"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "109.360"
                },
                "CurrentYear": {
                    "val": "101.300"
                },
                "BudgetYearOne": {
                    "val": "130.831"
                },
                "BudgetYearOneBase": {
                    "val": "130.831"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "88.962"
                },
                "CurrentYear": {
                    "val": "101.300"
                },
                "BudgetYearOne": {
                    "val": "97.771"
                },
                "BudgetYearOneBase": {
                    "val": "97.771"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-20.398"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-33.060"
                },
                "BudgetYearOneBase": {
                    "val": "-33.060"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-15.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.398"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-33.060"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-33.060"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018:  Decrease reflects Congressional reduction, SBIR\/STTR transfer and reprogrammings. \nFY 2019:  N\/A\nFY 2020:  Decrease reflects completion of the Neuro-Adaptive Technology and Enhanced Monitoring of Health and Disease programs in FY 2019."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BT-01"
                    },
                    "ProjectTitle": {
                        "val": "BIOMEDICAL TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "88.962"
                        },
                        "CurrentYear": {
                            "val": "101.300"
                        },
                        "BudgetYearOne": {
                            "val": "97.771"
                        },
                        "BudgetYearOneBase": {
                            "val": "97.771"
                        },
                        "BudgetYearTwo": {
                            "val": "123.570"
                        },
                        "BudgetYearThree": {
                            "val": "120.783"
                        },
                        "BudgetYearFour": {
                            "val": "122.687"
                        },
                        "BudgetYearFive": {
                            "val": "134.997"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Biomedical Technology Program Element focuses on applied research for medical related technology, information, processes, materials, systems, and devices.  Successful battlefield medical and neural interface technologies developed within this Program Element address a broad range of DoD challenges to ensure warfighter readiness, including both resilience to infectious disease and neurotechnology for improved warfighter performance.  To maintain warfighter health, battlefield medical technologies research in this project will investigate disease forecasting, detection, and therapeutic response.  Example programs include a predictive platform for forecasting disease outbreak, identification of early infection biomarkers to diagnose and prevent widespread infection in-theater, new methods to rapidly develop medical countermeasures in response to an emerging biothreat, and in-theater manufacturing capabilities for field-relevant pharmaceuticals to reduce the logistical burden and infrastructure requirements.  To improve warfighter performance, this project will develop new neural architectures and data processing algorithms to interface the nervous system with multiple devices, enabling control of robotic prosthetic-limb technology.  Additionally, advanced evidence-based techniques will be developed to supplement warfighter healthcare and the diagnosis of post-traumatic stress disorder (PTSD) and traumatic brain injury (TBI)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Restoration of Auditory and Visual Function After Injury*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Performance Optimization in Complex Environments\n\nThe Restoration of Auditory and Visual Function After Injury program is developing neurotechnology to mitigate the effects of physical injury to the auditory and visual systems of military personnel.  Research is also focusing on understanding various forms of sensing and actuation to improve outcomes and how biofeedback over time can alter human brain function.  Technologies developed through this program will provide foundational neural interface technology for restoring lost capability, improving situational awareness, and enhancing cognitive and physical effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.900"
                                            },
                                            "Text": {
                                                "val": "-  Finalized system designs for highly-scaled input-output of information, and pass a critical design review.\n-  Conducted a bench demonstration of system components.\n-  Performed in vivo demonstration of input-output techniques for individual neurons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.485"
                                            },
                                            "Text": {
                                                "val": "-  Validate system designs and safety methods against standard regulatory practices.\n-  Demonstrate large-scale neural read and write capabilities using a fully integrated system.\n-  Collect data for the development and refinement of neural decoding and encoding algorithms.\n-  Prepare regulatory documents for Food and Drug Administration approval."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.676"
                                            },
                                            "Text": {
                                                "val": "-  Validate system designs for prototyping and manufacture.\n-  Harden size, weight, and power of complete integrated system.\n-  Perform in vivo demonstration of the fully integrated input-output platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects completion of research activities to conduct final system validation and demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neural Signal Interfaces and Applications (NSIA)"
                                    },
                                    "Description": {
                                        "val": "As part of their daily duties, many military personnel must handle large volumes of data and interact with complex systems.  These tasks could be made less difficult with advanced neurotechnology platforms, but all such devices currently require invasive surgery to implement.  The Neural Signal Interfaces and Applications (NSIA) program will develop non-invasive neurotechnologies able to interface with the nervous system with high resolution and precision without surgery.  NSIA will utilize recent advances to transduce neural signals through tissue.  Resulting technologies will facilitate standard human-machine interfaces for improved workload balance between man and machine."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.140"
                                            },
                                            "Text": {
                                                "val": "-  Developed concepts for noninvasive and minutely invasive sensor\/stimulator systems design.\n-  Evaluated neural interface device designs for resolution, stability, and safety aspects.\n-  Initiated research efforts to build required sensors, stimulators, and transducers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.895"
                                            },
                                            "Text": {
                                                "val": "-  Finalize system level design to optimize power usage.\n-  Engineer prototypes of neural interface subcomponents and neural transducers.\n-  Assess neural read and write subcomponents and neural transducers in vitro.\n-  Verify and validate the safety, resolution, and stability of subcomponents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.125"
                                            },
                                            "Text": {
                                                "val": "-  Integrate neural read and write subcomponents.\n-  Optimize neural transducer delivery plan.\n-  Initiate experiments toward achieving regulatory approval for clinical studies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects integration of all subcomponents into final prototype device as well as demonstration in animal models."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pandemic Prevention"
                                    },
                                    "Description": {
                                        "val": "Military personnel are deployed all over the world for traditional operations, and are often specifically called upon in response to emerging or re-emerging disease outbreaks with pandemic potential (e.g., Ebola).  In both instances, the DoD needs effective countermeasures to protect its deployed forces and maintain warfighter readiness.  The Pandemic Prevention program is focusing on novel methods to rapidly accelerate countermeasure discovery, pre-clinical testing, and manufacturing.  This program seeks to advance and integrate newly developed approaches including bioinformatics assessment of genetic sequencing and nucleic acid-based vaccines and to address technology bottlenecks associated with each stage of medical countermeasure development.  Additional research will investigate new methods improving the manufacturability, distribution, and delivery of novel therapeutics.  Pandemic Prevention will enable an integrated therapeutic development platform that leverages state-of-the-art technologies to prevent disease outbreaks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.100"
                                            },
                                            "Text": {
                                                "val": "-  Developed high-throughput screening technologies to rapidly identify appropriate medical countermeasures against a diversity of biological threats.\n-  Began developing tools to scale the manufacturability of medical countermeasures.\n-  Initiated development of a validated system for medical countermeasure production."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.985"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ability to rapidly discover and mature antibodies against viral infections.\n-  Establish gene-encoded antibody delivery methods in animal models.\n-  Demonstrate protection from pathogen challenge in animal models.\n-  Conduct, in under 90 days, preliminary demonstration of integrated technologies identifying, maturing, and delivering a gene-encoded antibody to provide protection against viral challenge in animal models.\n-  Initiate development and testing of nucleic acid constructs to encode for multiple antibody targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.450"
                                            },
                                            "Text": {
                                                "val": "-  Investigate the kinetic profile of gene-encoded antibodies in large animal models.\n-  Conduct, in under 60 days, a demonstration of integrated technologies identifying, maturing, and delivering a gene-encoded antibody to provide protection against viral challenge in animal models.\n-  Demonstrate, in less than 20 days, the ability to identify a highly potent antibody, targeting a viral pathogen.\n-  File an Investigational New Drug (IND) application with the Food and Drug Administration for a gene-encoded antibody product.\n-  Initiate a Phase I human clinical safety study of a gene-encoded antibody.\n-  Initiate IND enabling studies for a nucleic acid construct encoding multiple antibodies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Indicators of Threat Exposure (FITE)"
                                    },
                                    "Description": {
                                        "val": "Based on initial research conducted under the Enhanced Monitoring of Health and Disease program, the Forensic Indicators of Threat Exposure (FITE) program is developing a field-deployable resource for indicators of an individual's exposure history to Weapons of Mass Destruction (WMD) and WMD precursors.  FITE will investigate the ability to characterize epigenetic signatures in an individual's genome caused by specific exposures.  The program will create the framework for modular technology capable of performing forensic analysis using epigenetic information to provide high specificity of the type of exposure and when it occurred.  This novel capability could serve as a field-forward forensic tool for use by the DoD to assist in chemical, biological, radiological, and nuclear (CBRN) threat detection and response."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Text": {
                                                "val": "-  Defined the type of the samples (e.g., blood, serum, plasma, oral and nasal swabs, saliva) and exposure signature that would be used to enable forensic and diagnostic assessment of exposure.\n-  Investigated approaches to build signatures of exposure that would later be used for forensic and diagnostic applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.995"
                                            },
                                            "Text": {
                                                "val": "-  Identify exposure-specific epigenetic marks that reflect WMD or WMD precursor exposure events.\n-  Create bioinformatics algorithms to decode and characterize differences in the complex epigenetic marks associated with each exposure event.\n-  Validate sensitivity and specificity of the forensic and diagnostics signatures when combined with detection algorithms.\n-  Develop a platform prototype to integrate multiple molecular analysis techniques and perform forensic and diagnostic assessment of exposure.\n-  Initiate research to understand connections between genotype and phenotype to inform impact on human performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.404"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.404"
                                            },
                                            "Text": {
                                                "val": "-  Generate epigenetic signatures that reveal temporal resolution of exposure events from WMD or WMD precursor exposure events.\n-  Refine bioinformatics algorithms for increased sensitivity and specificity of the epigenetic signatures. \n-  Perform pressure tests to assess the ability to distinguish viral from bacterial signatures in clinical samples.\n-  Select molecular analysis methods for integration into the deployable platform.  \n-  Finalize selection of module components and complete system design for deployable platform prototype."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prosthetic Hand Proprioception & Touch Interfaces (HAPTIX)"
                                    },
                                    "Description": {
                                        "val": "Wounded warriors often suffer from neural injury due to spinal cord injury or amputations.  Military personnel with amputated limbs get limited benefit from recent advances in prosthetic-limb technology because the user interface for controlling the limb is low-performance and unreliable.  Through investments in the DARPA Reliable Neural-Interface Technology (RE-NET) program, novel interface systems have been developed that overcome these issues and are designed to last for the lifetime of the patient.  The goal of the Prosthetic Hand Proprioception & Touch Interfaces (HAPTIX) program is to create the first bi-directional (motor & sensory) peripheral nerve implant for controlling and sensing advanced prosthetic limb systems.  With a strong focus on transition, the HAPTIX program will create and transition clinically relevant technology in support of wounded warriors suffering from single or multiple limb loss.  Research in this area will also address similar interface technologies with other nerve pathways such as the spinal cord.  The anticipated transition partner is the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.074"
                                            },
                                            "Text": {
                                                "val": "-  Validated novel outcome metrics for quantifying effects of sensory prosthetic technologies.\n-  Initiated testing of advanced sensorized prosthetic limbs.\n-  Refined models for sensorimotor function in prosthetic technologies.\n-  Prepared prototype device design documents for regulatory feedback."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.985"
                                            },
                                            "Text": {
                                                "val": "-  Obtain regulatory approval for HAPTIX technology.\n-  Conduct novel outcome metric testing on HAPTIX amputee participants.\n-  Initiate take-home studies of the HAPTIX system.\n-  Initiate algorithm development, hardware manufacturing, and system integration for spinal cord injury."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.149"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.149"
                                            },
                                            "Text": {
                                                "val": "-  Complete take-home studies utilizing HAPTIX technology and sensorized prosthetic limbs.\n-  Complete surgical implants and perform proof of concept of a percutaneous implementation for spinal cord injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects completion of take-home studies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Personnel Placement (IPP)"
                                    },
                                    "Description": {
                                        "val": "Building upon work initiated under the Forensic Indicators of Threat Exposure (FITE) program, the Improved Personnel Placement (IPP) program will aim to improve force lethality and overmatch by identifying and training candidates for specialized military positions in order to maximize performance and minimize attrition. IPP will study the relationships between genotype and phenotype to identify unique physical, cognitive, and behavioral traits associated with elite military specialties. The program will develop technology to sense real time gene activity associated with those identified performance traits and leverage this information to provide warfighters with training options to maximize their potential. Maximizing an individual's biological aptitude will enable placement choices that facilitate readiness and resilience for the DoD."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.967"
                                            },
                                            "Text": {
                                                "val": "-  Compare attributes of specialized warfighters to identify biomarkers associated with specialized military roles.\n-  Design in silico and in vitro testbeds to emulate extreme training or performance conditions. \n-  Build data analysis approaches that can integrate proteomic, genomic, and epigenomic results to characterize elite performers.\n-  Develop initial real-time indicators for gene expression."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neuro-Adaptive Technology"
                                    },
                                    "Description": {
                                        "val": "The Neuro-Adaptive Technology program is exploring and developing advanced technologies for real-time detection and monitoring of neural activity.  One shortcoming of today's brain functional mapping technologies is the inability to obtain real-time correlation data that links neural function to human activity and behavior.  Understanding the structure-function relationship as well as the underlying mechanisms that link brain and behavior is a critical step in providing real-time, closed-loop therapies for military personnel suffering from a variety of brain disorders.  Efforts under this program examine the networks of neurons involved in post-traumatic stress disorder (PTSD), traumatic brain injury (TBI), depression, and anxiety as well as determine how to best ameliorate these disorders.  The objective for this program is to develop new hardware and modeling tools to better discriminate the relationship between human behavioral expression and neural function and to provide relief through novel devices.  These tools will allow for an improved understanding of how the brain regulates behavior and will enable new, disorder-specific, dynamic neuro-therapies for treating neuropsychiatric and neurological disorders in military personnel.  Technologies of interest under this program include devices for real-time detection of brain activity during operational tasks, time synchronized acquisition of brain activity and behavior, and statistical models that correlate neural activity with human behavioral expression."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.210"
                                            },
                                            "Text": {
                                                "val": "-  Completed integration of computational model software with prototype device hardware.\n-  Fabricated complete prototype device for use in acute clinical studies.\n-  Submitted prototype device design for regulatory feedback.\n-  Used prototype device components in clinical patients to demonstrate reduction of disorder-specific psychiatric or neurologic symptoms through real-time, closed-loop stimulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.955"
                                            },
                                            "Text": {
                                                "val": "-  Utilize clinical data to further refine biomarkers, computational models, and stimulation paradigms for closed-loop modulation of psychiatric or neurologic conditions. \n-  Integrate approaches targeting psychiatric or neurologic conditions with complementary biomarkers, neural targets, and computational models. \n-  Demonstrate use of the prototype neural device in a clinical setting to reduce relevant psychiatric or neurologic symptoms through real-time, closed-loop, biomarker-driven stimulation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Monitoring of Health and Disease"
                                    },
                                    "Description": {
                                        "val": "The Enhanced Monitoring of Health and Disease program is improving military health and force readiness by leveraging advanced data collection methods and prognostic capabilities to predict changes in health and spread of infectious disease from the individual to the population scale.  While new technology platforms have enhanced our ability to respond to illness and disease, there is a need for predictive and pre-emptive technologies that enable us to correctly prepare a response prior to its obvious need, such as in a barracks or in a confined environment (e.g., submarine).  Research in this program will investigate new methods for the collection and detection of multiplexed biological markers as well as the analysis, correlation, and ultimate integration of vast personalized data into the clinical care information technology infrastructure.  Additionally, this program will develop new approaches to integrate multi-source data streams to create effective predictive models of disease outbreak and spread.  Technologies developed in this program will enable clinically actionable information, even when an individual has no awareness of symptoms, and extend infectious disease forecasting into a real-time, accurate capability for decision support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.460"
                                            },
                                            "Text": {
                                                "val": "-  Selected a minimal set of biomarkers that accurately predict contagiousness.\n-  Initiated development of a prognostic assay that predicts contagiousness using the minimal set of biomarkers.\n-  Initiated evaluation of models and prognostic tests for accuracy prospectively."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate additional clinical cohort studies that represent secondary transmission events for biomarker and contagiousness measurements.\n-  Evaluate performance of the minimal set of biomarkers for the ability to predict contagiousness outcomes against the clinical cohort data.\n-  Complete development of a prognostic assay that predicts contagiousness using the minimal set of biomarkers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Restoration of Brain Function Following Trauma"
                                    },
                                    "Description": {
                                        "val": "The Restoration of Brain Function Following Trauma program exploited recent advances in the understanding and modeling of brain activity and organization to develop approaches to treat traumatic brain injury (TBI).  Critical to success was the ability to detect and quantify functional changes that occur in the human brain during the formation of distinct new memories, and to correlate those changes with subsequent recall of those memories during performance of behavioral tasks.  This program also developed neural interface hardware for monitoring and modulating neural activity responsible for successful memory formation in a human clinical population.  The ultimate goal was identification of efficacious therapeutic approaches that could bypass and\/or recover the neural functions underlying memory, which are often disrupted as a consequence of TBI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.828"
                                            },
                                            "Text": {
                                                "val": "-  Refined stimulation parameters to optimize closed-loop, biomarker-driven stimulation for restoration of verbal and spatial memories.\n-  Used an integrated device to demonstrate facilitation of performance on memory tasks through real-time, closed-loop, biomarker-driven stimulation.\n-  Used a computational model of integrated neural, physiological, and environmental signals to quantify the influence of memory replay parameters on subsequent performance of skills relevant to military training and\/or operations.\n-  Demonstrated use of a closed-loop, non-invasive intervention to facilitate neural replay and subsequent performance of skills."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT)"
                                    },
                                    "Description": {
                                        "val": "The overarching goal of the Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program was to increase our ability to rapidly respond to a disease or threat and improve individual readiness and total force health protection by providing centralized laboratory capabilities at non-tertiary care settings.  ADEPT focused on the development of Ribonucleic Acid (RNA)-based vaccines, potentially eliminating the time and labor required for traditional manufacture of a vaccine while at the same time improving efficacy.  Additionally, ADEPT developed methods to transiently deliver nucleic acids for vaccines and therapeutics, and kinetically control the timing and levels of gene expression so that these drugs will be safe and effective for use in healthy subjects.  ADEPT also focused on advanced development of key elements for simple-to-operate diagnostic devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Initiated the demonstration of safety of gene-encoded antibodies in a dose escalation study against a viral pathogen."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}