{
    "id": "2020-DefenseInformationSystemsAgency-PB-0400-MJBOOK-0-3-20c9efcf6d605b32d3d5f083f831185effe1f78c53559fcdc9809c2a22add379-5",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0208045K"
        },
        "ProgramElementTitle": {
            "val": "C4I Interoperability"
        },
        "R1LineNumber": {
            "val": "204"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "750.929"
            },
            "PriorYear": {
                "val": "58.235"
            },
            "CurrentYear": {
                "val": "62.814"
            },
            "BudgetYearOne": {
                "val": "64.122"
            },
            "BudgetYearOneBase": {
                "val": "64.122"
            },
            "BudgetYearTwo": {
                "val": "62.364"
            },
            "BudgetYearThree": {
                "val": "61.644"
            },
            "BudgetYearFour": {
                "val": "63.201"
            },
            "BudgetYearFive": {
                "val": "63.840"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Information Systems Agency’s Joint Interoperability Test Command (JITC) serves as the only joint element of the Department of Defense’s (DoD’s) Major Range and Test Facility Base (MRTFB) that is operated primarily for Information Technology and National Security Systems (IT\/NSS) Test and Evaluation (T&E) support missions. JITC executes the T&E mission in support of Command, Control, Communications, Computers and Intelligence (C4I), and is the DoD’s Sole Interoperability Certifier and the only Non-Service Operational Test Agency.\n\nWith a focus on T&E for IT, JITC has the unique mission to provide consistent, structured, and effective T&E services that include converged information environment, Cyber, Cloud services, Mobility and NSS.  JITC also has the responsibility for ensuring Joint\/Coalition interoperability; issuing interoperability certifications; conducting operational evaluations; maintaining a federated IT infrastructure as a MRTFB activity and providing direct interoperability support to the warfighter by ensuring Joint warfighting capabilities are interoperable and support mission needs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "59.490"
                },
                "CurrentYear": {
                    "val": "62.814"
                },
                "BudgetYearOne": {
                    "val": "61.074"
                },
                "BudgetYearOneBase": {
                    "val": "61.074"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "58.235"
                },
                "CurrentYear": {
                    "val": "62.814"
                },
                "BudgetYearOne": {
                    "val": "64.122"
                },
                "BudgetYearOneBase": {
                    "val": "64.122"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.255"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.048"
                },
                "BudgetYearOneBase": {
                    "val": "3.048"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.928"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.327"
                                },
                                "BudgetYearOne": {
                                    "val": "3.048"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.048"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease of -$0.928 in FY 2018 reflects a transfer of funding to Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) programs and -$0.327 is for the reduction costs by employing automation technologies to include cloud services to conduct testing and data analysis in the operational environment.  \n\nThe increase of +$3.048 in FY 2020 will provide additional infrastructure, network bandwidth and instrumentation to support development and testing of enterprise systems and Cyber capabilities in a replicated DODIN environment (+$2.748).  This increase is offset by a reduction required to offset civilian personnel requirements for departmental priorities and a transfer of 2 FTEs to the DISA Working Capital Fund in support of the Fourth Estate IT Optimization."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "T30"
                    },
                    "ProjectTitle": {
                        "val": "MRTFB Test and Evaluation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "174.304"
                        },
                        "PriorYear": {
                            "val": "10.757"
                        },
                        "CurrentYear": {
                            "val": "7.809"
                        },
                        "BudgetYearOne": {
                            "val": "7.584"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.584"
                        },
                        "BudgetYearTwo": {
                            "val": "7.713"
                        },
                        "BudgetYearThree": {
                            "val": "7.712"
                        },
                        "BudgetYearFour": {
                            "val": "7.927"
                        },
                        "BudgetYearFive": {
                            "val": "7.964"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Information Systems Agency (DISA), through the Joint Interoperability Test Command (JITC), manages the Department’s Interoperability Test, Evaluation, and Certification process that is structured to provide meaningful and independent test results in order to increase stakeholder confidence.  The objectives, of the Test and Evaluation (T&E) activities, are to validate that DISA’s (and the Department’s, where appropriate) deliverables have met operational requirements.  The T&E activities target evaluation strategies in the design, development, operational, integration and\/or sustainment aspects of every program requiring support.  DISA’s T&E efforts span a variety of test categories supporting DISA’s delivery of Department-wide enterprise solutions as well as Service, Agency, and mission partner developmental, operational, Information Assurance, and interoperability testing, validation and certification efforts. These efforts are focused on T&E for Information Technology (IT) that includes the Joint Information Environment (JIE), Cyber, Cloud services, and Mobility. \n\nAs the Department of Defense (DoD) Joint Interoperability Certification Authority, JITC annually: \n  •  Issues hundreds of interoperability testing and certification related products.\n  •  Manages the scheduling and executes multiple annual distributed Joint Tactical Data Link hardware in the loop interoperability test events.  These events are designed to evaluate, certify and re-certify Service\/Agency Tactical Data systems.\n  •  Reviews hundreds of Joint Capabilities Integration and Development System documents, interoperability support plans and Legacy Waiver requests on behalf of the DoD Chief Information Officer (CIO) and the Joint Staff. \n  •  Serves as executive agent to DoD Interoperability Steering Group, in support of the DoD CIO, and uses this forum to coordinate policy, adjudicate issues, and to process Interim Certificates to Operate.\n  •  Ensures interoperability test and certification standard practices and procedures are in accordance with DoD policy, and reviews and issues over 600 Joint interoperability certifications annually for DoD’s Information Technology and National Security Systems (IT\/NSS). \n  •  Manages the scheduling and prioritization of multiple annual distributed Joint Tactical Data Link simulated test events using real components (hardware in the loop interoperability test events) designed to evaluate, certify and re-certify Service\/Agency Tactical systems.\n\nJITC provides interoperability test support to Joint, Coalition and Allied operations in theater by providing Interoperability test support within the area of responsibility and supports exercises intended to evaluate Joint, Coalition and Allied operations in, or planning to deploy to theater by: \n  •  Providing on-demand rapid response contingency support to Regional Combatant Commands (COCOMs) as required, and conducting assessments of interoperability exercises.  \n  •  Conducting assessments during one of the largest interoperability exercises (the Endeavors).\n  •  Broadening its support to the Joint Staff and functional COCOMs with a multitude of interoperability assessment services. \n  •  Maintaining a 24x7 Warfighter Command, Control, Communications, Computers and Intelligence (C4I) Interoperability Hotline that connects warfighters to subject matter experts to resolve IT interoperability challenges. \n  •  Establishing the framework for the conduct of annual independent evaluations and the status of interoperability through DoD Interoperability Communications Exercises (DICE).\n  •  Emulating a distributed Joint Task Force network, providing realism and operational significance during the assessments and evaluations of data integrity, interfacing and responsiveness coupled with efficient configuration tactics, techniques, and procedures. \n  •  Including first responder local and federal communications as part of the task force. \n \nAs the only non-Service Operational Test Agency (OTA) within DoD, JITC conducts operational testing of IT\/NSS under realistic conditions to determine the operational effectiveness, suitability, interoperability, and security; and independently assesses the operational impact of system issues on mission accomplishment.  JITC is the OTA for DISA-managed programs, and also upon request serves as the OTA for other Agencies such as the Defense Logistics Agency, Department of Homeland Security, and the National Security Agency.\n\nJITC designs Operational Test and Evaluation (OT&E) events to determine if IT\/NSS meet user requirements, offering sustaining support services to users to assist Acquisition Program Managers with meeting their overall milestone objectives.  \n\nJITC focuses its efforts towards core T&E improvements, better T&E policy for IT\/NSS and designing new test methodologies to better assess Enterprise Service systems, aligning with the Information Technology Service Management model evaluating fulfillment services for suitability.\n\nThe T&E project supports the strategy development and investment plans in support of maintaining, improving and operating the DISA Major Range and Test Facility Base (MRTFB).  Specific goals for DISA’s MRTFB each year are to:  \n  •  Integrate evolving technologies that are able to leverage efficiencies such as virtualization, enterprise elements such as Infrastructure as a Service and Platform as a Service, and the foundational Cyber assets mandated by the JIE.\n  •  Expand test infrastructure and operations to allow for rapid, on-demand provisioning, and federation across the DoD and Cyber integration with enterprise environments. \n  •  Design consistent, repeatable test methodologies that ensure efficient T&E on changing or emerging technologies. \n  •  Provide T&E guidance\/oversight to nearly 130 DISA programs, creating synergy and efficiencies across the large DISA IT portfolio, gaining insight in new technologies and commercial best practices."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD’s Joint Interoperability Certification Authority"
                                    },
                                    "Description": {
                                        "val": "Plans and executes interoperability certifications for Department of Defense’s (DoD)) Information Technology and National Security Systems (IT\/NSS) by evaluating joint military operations, conformance to standards, and participating in developmental testing or executing purposefully planned Interoperability Test Events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.837"
                                            },
                                            "Text": {
                                                "val": "Increase customer accessability through enhanced T&E capabilities by employing automation technologies via the cloud in a self-service mode.  Continue to reduce risk and identify\/analyze trends by employing new technology and methodology to conduct data analysis in the operational environment. \n\nThe reduction of -$6.337 from FY 2017 to FY 2018 is due to realignment between T30 MRTFB Test & Evaluation and T40 Major\nRange Test Facility Base Operations to improve the expansion of automation and virtualization capabilities of DISA IT testing and\nevaluation services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.889"
                                            },
                                            "Text": {
                                                "val": "Continue to evolve customer accessibility through enhanced T&E capabilities by employing automation technologies to include cloud services.  Continue to reduce risk and identify\/analyze trends by employing new technology and methodology to conduct data analysis in the operational environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.664"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.664"
                                            },
                                            "Text": {
                                                "val": "Continue to evolve customer accessibility through enhanced T&E capabilities by employing automation technologies to include\ncloud services. Continue to reduce risk and identify\/analyze trends by employing new technology and methodology to conduct\ndata analysis in the operational environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease of -$0.225 from FY 2019 to FY 2020 is due to reduced costs resulting from employing automation technologies to include cloud services to conduct testing and data analysis in the operational environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Conduct operational testing of IT\/NSS under realistic operational conditions to determine the operational effectiveness, suitability, interoperability, and security of a particular system. Independently assesses the operational impact of system issues on mission accomplishment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Will continue to  enhance OT&E processes, procedures, and tools by increasing automation and utilizing virtualization as needed, to better evaluate performance and to improve operational testing capabilities for  evolving requirements.  Will continue to provide  OT&E support to COCOMs, Military Services, and Defense Agencies as requested."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Will continue to enhance OT&E processes, procedures, training, and tools by increasing automation, data collection and management, and better analysis utilizing virtualization to better evaluate performance and to improve operational testing capabilities for evolving requirements.  Will continue to provide OT&E support to COCOMs, Military Services, and Defense Agencies as requested."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Will continue to enhance OT&E processes, procedures, and tools by increasing automation and utilizing virtualization as needed,\nto better evaluate performance and to improve operational testing capabilities for evolving requirements. Will continue to provide OT&E support to COCOMs, Military Services, and Defense Agencies as requested."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support to Warfighter"
                                    },
                                    "Description": {
                                        "val": "Provides pre\/post-production evaluations including: collecting relevant data during a continuous monitoring effort, and providing on-the-spot evaluations of problem areas and viable mission-oriented solutions to warfighting COCOMs during exercises and contingency operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.120"
                                            },
                                            "Text": {
                                                "val": "Support will continue to be focused primarily on the Asia Pacific region, consistent with the National Defense Strategy. Will sustain a Warfighter Support capability sufficient to respond to critical fielded system issues only."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.120"
                                            },
                                            "Text": {
                                                "val": "Support will continue to be focused primarily on the Asia Pacific region, consistent with the National Defense Strategy. Will sustain a Warfighter Support capability sufficient to respond to critical fielded system issues only."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.120"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.120"
                                            },
                                            "Text": {
                                                "val": "Support will continue to be focused primarily on the Asia Pacific region, consistent with the National Defense Strategy. Will sustain a Warfighter Support capability sufficient to respond to critical fielded system issues only."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "T&E Mission Support Services (MSS) cost plus and firm fixed price contract provides T&E support by performing a wide range of non-personal services to encompass testing, scientific, engineering, logistic, administrative, and ancillary support of the DISA T&E missions. The T&E MSS contract provides for expansion and contraction of staff years as workload dictates."
                        },
                        "PerformanceMetrics": {
                            "val": "JITC manages the Department's Joint Interoperability Test, Evaluation, and Certification process and Operational testing for Information Technology (IT)\/National Security Systems (NSS) as well as test and evaluation activities for DISA's deliverables ensuring they have met operational requirements.  JITC develops test and evaluation strategies, plan, and reports in the design, development, operational, integration and\/or sustainment aspects of every program requiring support.  Specific metrics are described below:    \n\n1. Metric:  Provide operational test plans prior to the start date of a test for all customers where JITC is the OTA.\nMeasure\/Goal:  90% \nFY18 Actual:  100%  \nFY19 Target:  90%\nFY20 Target:  90%\n\n2. Metric:  Provide operational test reports no later than 60 days after the completion of a test event  when JITC is the responsible OTA.   \nMeasure\/Goal: 90%  \nFY18 Actual: 66%\nFY19 Target:  90%\nFY20 Target:  90%\n\n3. Provide a interoperability certification letter to customers (Joint Staff (JS), COCOMS, OUSD (R&E), etc) no later than 60 days from the completion of the test event\/effort.  \nMeasure\/Goal: 80%\nFY18 Actual: 83%\nFY19 Target:  80%\nFY20Target:  80%\n\n4. JITC surveys customers for each product that is delivered (Plan of Action and Milestones (POA&Ms), Test Plans, Test Reports, etc.) in terms of cost, schedule, and overall performance on a 1-5 scale with 5 being the highest rating.\nMeasure\/Goal:  4.5\nFY18 Actual: 4.8\nFY19 Target: 4.5\nFY20 Target: N\/A no longer reported on after FY19"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northop Grumman Mission System"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "36.487"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "36.487"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Interop Joint Venture"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "44.342"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "44.342"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northop Grumman Technology"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "25.831"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "25.831"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.076"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.529"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.529"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ALION SCIENCE & TECH CORP"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.008"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.018"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.010"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.036"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMERICAN SYSTEMS CORP"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.129"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.217"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.080"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.426"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MANTECH TELECOMMUNICATIONS AND INFORMATION"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.570"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.838"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.305"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.713"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OBERON ASSOCIATES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.109"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.176"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.072"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.357"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.887"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.223"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.132"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.242"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Managment Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Information Systems Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "49.865"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.285"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.210"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.055"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.055"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "MRTFB Test and Evalauation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Provide Operational Test & Evaluation (OT&E) of DISA acquired systems"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Conduct Joint interoperability test and certification on IT\/NSS using the Joint Family of Tactical Data Link (TDL)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operate 24\/7 Interoperability Hotline"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Provide Joint\/Combined Interoperability Test support to Combatant Commanders"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Provide JIE Compliance Test and Evaluation framework and infrastructure"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Provide Cyberspace Test and Evaluation framework and infrastructure"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Plan and conduct the Defense Interoperability Communications Exercise (DICE)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2024"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T40"
                    },
                    "ProjectTitle": {
                        "val": "Major Range Test Facility Base Operations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "576.625"
                        },
                        "PriorYear": {
                            "val": "47.478"
                        },
                        "CurrentYear": {
                            "val": "55.005"
                        },
                        "BudgetYearOne": {
                            "val": "56.538"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.538"
                        },
                        "BudgetYearTwo": {
                            "val": "54.651"
                        },
                        "BudgetYearThree": {
                            "val": "53.932"
                        },
                        "BudgetYearFour": {
                            "val": "55.274"
                        },
                        "BudgetYearFive": {
                            "val": "55.876"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "As the only non-Service activity of the Department of Defense (DoD) Major Range and Test Facility Base (MRTFB), Defense Information Systems Agency (DISA) provides the only dedicated Information Technology (IT) environment investing in a single end-to-end infrastructure for testing the Enterprise Edge to the Tactical Edge.  As an MRTFB, Joint Interoperability Test Command (JITC) provides tested IT infrastructure products to the DoD, Federal\/non-Federal Government, Commercial vendors, and Allied partners.  \n\nThe DISA MRTFB infrastructure:\n\n  •  Encompasses two geographic locations (Ft. Huachuca, AZ; Ft. Meade, MD). \n\n  •  116K square feet of raised floor space comprised of multiple test environments and test networks supporting over 100 programs on an annual basis.\n  \n  •  Complies with multiple levels of security and is scaled to support approximately 1,000 annual testing events to evaluate the DoD's converged information environment, Cyber, Cloud services, Mobility, and National Security Systems (NSS).\n\n  •  Encompasses a significant portfolio of reference implementations, test tools, and supporting IT systems to aid both test execution and data collection\/analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MRTFB Improvements and Operations"
                                    },
                                    "Description": {
                                        "val": "Information Technology and National Security Systems (IT\/NSS), Command and Control (C2), Defense reform initiatives, and the Department of Defense’s (DoD’s) migration towards more agile development and acquisition of IT capabilities by providing Test and Evaluation (T&E) support, including infrastructure, testing capabilities and events, policies and processes to Regional Combatant Commands (COCOMS), Military Services, DoD Agencies, other Federal Government agencies, private industry, Coalition partners and allies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.478"
                                            },
                                            "Text": {
                                                "val": "As an MRTFB, JITC will continue to operate the DISA IT Test infrastructure standarized test bed at Fort George G. Meade, MD and Fort Huachuca, AZ.  JITC will continue to support the Agency and the Department by expanding the use of cloud technologies to provide seamless distributed testing services and efficient use of testing equipment and resources.  JITC will continue to maintain technical workforce, support base operations, communications, and operating expenses at each location.\n                     \nThe increase of +$9.356 from FY 2017 to FY 2018 will adapt additional cloud technologies through rapid re-configurations resulting in the development of a single DoDIN Lab Test-bed.  This increase is partially offset by a decrease of -$0.822 attributed to the Service Requirements Review Board (SSRB) contract reduction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "55.005"
                                            },
                                            "Text": {
                                                "val": "As an MRTFB, JITC will continue to operate the DISA IT Test infrastructure standarized test bed at Fort George G. Meade, MD and Fort Huachuca, AZ.  JITC will continue to support the Agency and the Department by expanding the use of cloud technologies to provide seamless distributed testing services and efficient use of testing equipment and resources.  JITC will continue to maintain technical workforce, support base operations, communications, and operating expenses at each location."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.538"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.538"
                                            },
                                            "Text": {
                                                "val": "As an MRTFB, JITC will continue to operate the DISA IT Test infrastructure standarized test bed at Fort George G. Meade, MD\nand Fort Huachuca, AZ. JITC will continue to support the Agency and the Department by expanding the use of cloud technologies\nto provide seamless distributed testing services and efficient use of testing equipment and resources. JITC will continue to\nmaintain technical workforce, support base operations, communications, and operating expenses at each location."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase of +$1.533 from FY 2019 to FY 2020 will provide additonal infrastructure, network bandwidth and instrumentation to support development and testing of enterprise systems and Cyber capabilities in a replicated DODIN environment."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A T&E Mission Support Services (MSS) cost plus and firm fixed price contract provides T&E support by performing a wide range of non-personal services to encompass testing, scientific, engineering, logistic, administrative, and ancillary support of the DISA T&E missions. The T&E MSS contract provides maximum flexibility and allow for expansion and contraction of staff years as workload dictates. An additional contract is a Federal Preferential Sole Source Procurement set-aside which provides consolidated facilities support."
                        },
                        "PerformanceMetrics": {
                            "val": "Major Range Test Facility Base (MRTFB) Operations sustain the infrastructure, capabilities and services of DISA’s MRTFB. While maintaining a focus on improving automation, instrumentation and virtualization, this MRTFB is working toward ensuring assets support customers with testing on demand services to enable rapid delivery of enhanced military capabilities. Specific metrics are described below:  \n\n5. Provide configuration changes to the MRTFB infrastructure NLT 5 days after formal customer service request received.\nMeasure\/Goal:  90%\nFY 2018 Actual: 91%\nFY 2019 Target: 95%\nFY 2020 Target: 90%\n\n6. Complete new configuration additions (equipment installs) NLT 14 days after receipt of customer requirements form.\nMeasure\/Goal:  90%\nFY 2018 Actual: 50%\nFY 2019 Target: 95%\nFY 2020 Target: 90%\n\n7. Availability of enterprise service test capabilities T&E enclave.\nMeasure\/Goal:  95%\nFY 2018 Actual: 100%\nFY 2019 Target: 95%\nFY 2020 Target: 95%\n\n8. Availability of the Tactical Data Link Standard Conformance test tool to various DoD platforms (e.g., weapons systems).\nMeasure\/Goal:  100%\nFY 2018 Actual:  95%\nFY 2019 Target: 95%\nFY 2020 Target: 95%"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 1"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Mission System"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "75.279"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "75.279"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Interop Joint Venture"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "99.188"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "99.188"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 3"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Information Technology"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "49.746"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "49.746"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 4"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS - pending development of query"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "VARIOUS"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "54.481"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "54.481"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 5"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ALION SCIENCE & TECHNOLOGY CORP"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.410"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.207"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.617"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 6"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AMERICAN SYSTEMS COPR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.036"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.523"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.559"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 7"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MANTECH TELECOMMUNICATIONS AND INFORMATION"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.583"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.320"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.903"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 8"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OBERON ASSOCIATES"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.957"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.023"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.980"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 9"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC, INC."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.626"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.325"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.951"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 10"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BEACON GROUP SW, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.193"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.170"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.711"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "29.074"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 11"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.001"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "30.226"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "30.226"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation 12"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.728"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.658"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.961"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "34.347"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Defense Information Systems Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "244.398"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "25.252"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "25.332"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "26.312"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "26.312"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Develop and Implement Interoperability test systems to support warfighters"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2024"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}