{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-3",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602000D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Munitions Technology"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.053"
            },
            "CurrentYear": {
                "val": "19.126"
            },
            "BudgetYearOne": {
                "val": "19.306"
            },
            "BudgetYearOneBase": {
                "val": "19.306"
            },
            "BudgetYearTwo": {
                "val": "19.589"
            },
            "BudgetYearThree": {
                "val": "19.930"
            },
            "BudgetYearFour": {
                "val": "20.303"
            },
            "BudgetYearFive": {
                "val": "20.733"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program addresses applied research associated with improving the lethality, reliability, safety, and survivability of munitions and weapon systems.  The goal is to develop joint enabling technologies that can be used by the Program Executive Officers (PEOs) as they develop their specific weapon programs.  The program invests in research of technologies from a Joint Service perspective, thus maximizing efficiencies, ensuring the development of technologies with the broadest applicability while avoiding duplication of efforts.  Increasing the lethality, range, and performance of munitions, while striving to increase the safety for our warfighters for munitions in procurement and under development guide program investments.  \n\nMunition Area Technology Groups (MATGs) and Fuze Area Technology Groups (FATGs) have been established for each munition and capability area and are tasked with: 1) coordinating, establishing, and maintaining 2023 and 2028 year technology development plans and roadmaps, 2) coordinating biannual meetings to review technical and programmatic details of each funded and proposed effort, 3) developing and submitting Technology Transition Agreements in coordination with appropriate PEOs for insertion in their Insensitive Munitions (IM) Strategic Plans \/ Fuze Technology Development Plan, and 4) interfacing with other MATGs \/ FATGs and IM \/ fuze science and technology projects as appropriate.  The Joint Insensitive Munitions Technology Program (JIMTP) and Joint Fuze Technology Program (JFTP) will utilize a Technical Advisory Board (TAB) and Technical Advisory Committee (TAC) (consisting of senior Department of Defense (DoD) and Department of Energy (DOE) technology experts and laboratory representatives, plus senior Munitions PEO representatives), to provide program oversight, policy, direction, and priorities during its annual meeting."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.111"
                },
                "CurrentYear": {
                    "val": "19.170"
                },
                "BudgetYearOne": {
                    "val": "19.361"
                },
                "BudgetYearOneBase": {
                    "val": "19.361"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.053"
                },
                "CurrentYear": {
                    "val": "19.126"
                },
                "BudgetYearOne": {
                    "val": "19.306"
                },
                "BudgetYearOneBase": {
                    "val": "19.306"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.058"
                },
                "CurrentYear": {
                    "val": "-0.044"
                },
                "BudgetYearOne": {
                    "val": "-0.055"
                },
                "BudgetYearOneBase": {
                    "val": "-0.055"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.021"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.037"
                                },
                                "CurrentYear": {
                                    "val": "-0.044"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.055"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.055"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "000"
                    },
                    "ProjectTitle": {
                        "val": "Insensitive Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.867"
                        },
                        "CurrentYear": {
                            "val": "12.942"
                        },
                        "BudgetYearOne": {
                            "val": "13.069"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.069"
                        },
                        "BudgetYearTwo": {
                            "val": "13.249"
                        },
                        "BudgetYearThree": {
                            "val": "13.497"
                        },
                        "BudgetYearFour": {
                            "val": "13.756"
                        },
                        "BudgetYearFive": {
                            "val": "14.048"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Insensitive Munitions (IM) Technology Program (JIMTP) aims to develop the enabling technologies needed to build weapons in compliance with statutory requirements (United States Code, Title 10, Chapter 141, Section 2389) and regulation (DoDI 5000.1 and 5000.02, and CJCSI 3170.01F).  This effort will take promising technologies developed at the laboratory scale and mature them for transition into advanced technology (Budget Activity (BA) 6.3) programs based on the priority munitions identified in the DoD IM Strategic Plans.  Mature and demonstrated IM technology can be transitioned to the Program Executive Officers (PEOs), thereby decreasing the program costs and schedule risk.  This will additionally promote spin-offs to other non-compliant munitions within the DoD portfolio.  Without new technologies and new increased performance explosive materials and propellants, future variants of current weapon systems will have the same, or worse, response to IM stimuli.  New weapon developments will face similar challenges and the US will be outgunned and outranged on the battlefield of the future.  This is especially true with increased performance requirements for improved and new systems. \n\nThe JIMTP investments focus on five Munition Areas: 1) High Performance Rocket Propulsion, 2) Minimum Signature Rocket Propulsion, 3) Blast and Fragmentation Warheads, 4) Anti-Armor Warheads, and 5) Gun Propulsion.  Munition Area Technology Groups (MATGs), under tri-service leadership, have developed technology roadmaps for each Munition Area that are used to guide investments based on goals consistent with the DoD IM Strategic Plans.  The program is structured around these five areas with clear cross-cutting tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Performance Rocket Propulsion (HPP)"
                                    },
                                    "Description": {
                                        "val": "HPP focuses on the development of technologies to improve the IM response of HPP systems, rocket motors with Ammonium Perchlorate and with or without a metal fuel, for rockets and missiles launched from air, ground, and sea platforms.  These technologies, when applied to rocket motors, improve to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, rocket propellant ingredients, including synthesis, characterization, and scale-up; reduced smoke or smoky propellants, including formulation, characterization and scale-up; rocket motor case design; materials for active and passive thermal mitigation; shock mitigation materials and techniques; passive and active coatings; active and passive venting techniques for motor cases or containers; ignition systems; sensors; and thrust mitigation techniques.  Operating conditions may be controlled or widely varying in both temperature and vibration.  The 2023 and 2028 year goals of the HPP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment and Bullet Impacts and Slow Cook Off for the majority of HPP rocket motors, and solving the Fast Cook Off response of very large HPP motors.  Additional goal is to improve range to 2 times our current capabilities, with improvements in the IM responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.448"
                                            },
                                            "Text": {
                                                "val": "-  Determine the IM response of missile propulsion systems due to Fragment Impacts and Slow Cook Off using small scale testing.\n-  Examine the Fast Cook Off response of very large HPP motor formulation with modified properties. \n-  Complete pint scale propellant formulation and scale up to one gallon mixes. \n-  Begin work on novel rocket motor case assembly with ability to reduce fast and slow cookoff reactions, as well as fragment and bullet impact responses. \n-  Conduct thermal testing of heat suppression materials for fast and slow cookoff protection of shipboard munitions and develop sub-scale tests to determine coating ability of materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.466"
                                            },
                                            "Text": {
                                                "val": "Complete thermal and aging study on propellant formulation; conduct mini-scale rocket motor testing and sub-scale fragment impact testing to determine propellant response.\nConduct mechanical properties and test various designs for novel rocket motor case, and complete down-selection of materials. \nConduct scaled-up testing of thermal suppression material to determine optimal placement of system within shipboard container."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.491"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.491"
                                            },
                                            "Text": {
                                                "val": "Conduct mechanical properties and test various designs for novel rocket motor case, and complete down-selection of materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minimum Signature Rocket Propulsion (MSP)"
                                    },
                                    "Description": {
                                        "val": "MSP focuses on the development and demonstration of technologies to improve the IM response of MSP systems.  The development and demonstration of minimum signature (MS) rocket technologies, when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, MS rocket propellant formulations, ingredients for MS propellant formulations (including synthesis, characterization and scale-up), case and packaging design, active and passive venting techniques, rocket motor case design, ignition systems, and thrust mitigation techniques.  Of particular interest are technologies that provide a higher burning rate minimum signature propellant with state-of-the-art energy and reduced shock sensitivity.  The 2023 and 2028 year goals of the MSP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment Impact, Slow Cook Off, and Shaped Charge Jet (SCJ) threats, as well as improving range to 1.5 times our current capabilities in the near term and 2 times our current capabilities in the out years, with improvements in the IM responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.428"
                                            },
                                            "Text": {
                                                "val": "-  Determine the IM response of missile propulsion systems due to Fragment Impact, Slow Cook Off, and SCJ threats.\n-  Prepare preliminary propellant formulations, conduct sensitivity testing, downselect to best candidate materials, and scale up to one gallon mixes.\n-  Prepare environmentally safe propellant formulations and downselect to best formulation, after conducting standard small scale tests. \n-  Scale up from pint to gallon mixes of novel propellant and conduct sensitivity testing to mini-fragment test.\n-  Synthesize 100 gram quantities of three precursor materials to formulate a reduced shock sensitive propellant formulation and conduct baseline tests.\n-  Modify high sensitivity propellant formulations to obtain desired properties, scale up to pint mixes to conduct testing, and verify processing characteristics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.437"
                                            },
                                            "Text": {
                                                "val": "Scale up downslected propellant formulation from one to five gallon mixes, and conduct sub-scale rocket motor firing.\nScale up 100 gram quantities to 20 pound samples, conduct mechanical properties and sensitivity testing, to downselect to best candidate material. \nDownselect modified high sensitivity formulations to six candidates to compare against baseline propellant, and conduct performance as well as fragment insult testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.462"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.462"
                                            },
                                            "Text": {
                                                "val": "Downselect modified high sensitivity formulations to six candidates to compare against baseline propellant, and conduct performance as well as fragment insult testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast and Fragmentation Warheads (BFW)"
                                    },
                                    "Description": {
                                        "val": "BFW focuses on the development of technologies to improve the IM response of Blast\/Fragmentation munitions.  These technologies, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintain munition performance.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability and reliability may be critically important depending on the intended munition application.  Technologies include, but are not limited to, new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection or packaging materials and systems, shock mitigation liners, initiation devices, techniques, and technologies.  Applications vary but include high performance warhead fills, booster explosives, bulk demolition charges, and bulk fills for blast and\/or fragmentation charges.  The 2023 and 2028 year goals of the BFW MATG are concentrated on solving the IM response of blast fragment warheads to the Sympathetic Detonation, Fragment Impact, Slow Cookoff, and SCJ threats, seeking increased performance and lethality of warheads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.688"
                                            },
                                            "Text": {
                                                "val": "-  Determine the IM response of blast fragment warheads to the Sympathetic Detonation, Fragment Impact, and SCJ threats.\n-  Produce 25 pounds of energetic material to serve as baseline for comparison testing against new energetic material produced using a novel method.  Produce 10 pounds of the material and conduct sensitivity testing and mechanical properties tests. \n-  Conduct small scale testing on insensitive explosive materials to validate new testing procedure.\n-  Use modeling to further understand explosive reformulation efforts and warhead liner optimization results, and prepare for prepare for small-scale environmental testing. \n-  Synthesize novel explosive materials to mitigate sympathetic reaction of cast cured munitions; conduct mechanical property testing on new materials. \n-  Conduct modeling and simulation to better understand the current booster material performance in sympathetic reaction, in order to tailor new booster material formulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.723"
                                            },
                                            "Text": {
                                                "val": "Use novel energetic material to complete performance and larger scale sensitivity tests.\nConduct small-scale environmental testing on explosive reformulations to downselect and pair with the optimized warhead liner.  \nConduct larger scale testing on selected formulations and prepare for sub-scale sympathetic reaction testing. \nScale up synthesis of novel energetic, conduct hazard and testing and characterization, and small scale sensitivity testing to prepare for pilot scale-up and testing.\nOptimize new booster material formulations, fabricate hardware to conduct testing, and down-select to best performing material to prepare to integrated testing with new explosive material under development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.747"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.747"
                                            },
                                            "Text": {
                                                "val": "Conduct larger scale testing on selected formulations and prepare for sub-scale sympathetic reaction testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding will be used for the 1000 pound general purpose bomb formulation work to improve performance and decrease sensitivity over currently available explosive fills."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Armor Warheads (AAW)"
                                    },
                                    "Description": {
                                        "val": "AAW focuses on the development of explosive ingredients, explosives, and warhead and fuze technologies for improving IM of AAW munitions.  The development of explosive ingredients, explosives, and warhead and fuze technologies, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintain munition performance.  Technologies include, but are not limited to, new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection\/packaging materials and systems, shock mitigation liners, and initiation devices, techniques, and technologies.  Applications vary but include high performance warhead fills, booster explosives, and all other technology to mitigate the violent response of AAW munitions to IM threats.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability, and reliability may be critically important depending on the intended munition application.  The 2023 and 2028 year goals of the AAW MATGs are concentrated on solving the IM response of anti-armor warheads to the Fragment Impact and Slow Cook-off, threats for larger and Medium Caliber Munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.358"
                                            },
                                            "Text": {
                                                "val": "-  Solve the IM response of anti-armor warheads to the Fragment Impact, Sympathetic Reaction, and Shaped Charge Jet threats for larger munitions and the Fragment Impact, Slow Cook-off, and Sympathetic Reaction \/ Shaped Charge Jet threats for Medium Caliber Munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.366"
                                            },
                                            "Text": {
                                                "val": "Work on solutions to improve the IM response of anti-armor warheads to the Fragment Impact, Sympathetic Reaction, and Shaped Charge Jet threats for larger munitions and the Fragment Impact, Slow Cook-off, and Sympathetic Reaction \/ Shaped Charge Jet threats for Medium Caliber Munitions.\nComplete design of experiments on pressed explosive formulation for multi-use material, scale-up material formulations, and start to conduct characterization studies.  \nDown-select nano explosive composites for medium caliber ammunition, conduct pressing study, and begin scale-up production of composite material to kilogram batches.\nProduce precursor materials for new novel explosive material and produce 10 kg of new material, then conduct studies to ensure viability and optimize material."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.390"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.390"
                                            },
                                            "Text": {
                                                "val": "Produce precursor materials for new novel explosive material and produce 10 kg of new material, then conduct studies to ensure viability and optimize material."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gun Propulsion (GP)"
                                    },
                                    "Description": {
                                        "val": "GP focuses on the development and demonstration of technologies in the area of GP systems.  The development and demonstration of gun propulsion technologies, when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, gun propellant formulations, ingredients for gun propellant formulations, including synthesis, characterization and scale-up, cartridge case and packaging design, active and passive venting techniques, reduced sensitivity primer propellant and primer systems, and robust primers for insensitive propellants.  Applications vary, but include both large and medium caliber munitions, as well as propelling charges for mortars and shoulder launched munitions.  Operating requirements vary, and other factors such as barrel life and operation over varying environmental conditions may be critically important depending on the intended munition application.  The 2023 and 2028 year goals of the GP MATG are concentrated on solving the IM response of gun propulsion munitions to Fragment Impact and Slow and Fast Cook Off threats, with a focus on high performance gun propulsion systems designed for extended range and increased lethality in 2028 and 2033."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.945"
                                            },
                                            "Text": {
                                                "val": "-  Develop solutions to improve the IM response of gun propulsion munitions to Fragment Impact and Slow Cook Off threats.\n-  Develop small scale process using novel materials to produce improved cartridge case for larger gun propulsion system and begin aging study on materials. \n-  Scale up to 2.5 kilogram batches the down-selected new large caliber propellant formulation, begin stability, mechanical properties, and prepare for small scale cookoff and fragment testing.\n-  Development of small scale test for gun propellant bed characterization for fragment impact testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.950"
                                            },
                                            "Text": {
                                                "val": "Fabricate improved cartridge cases for larger gun propulsion system, down-select prototypes after fast cookoff and fragment impact tests to complete loaded cartridges in a Budget Activity 3 project. \nComplete small scale cookoff and fragment testing for new large caliber propellant formulation and scale-up to 10 kilogram batches to prepare for large scale cookoff and fragment impact testing. \nConduct intermediate scale fragment testing on gun propellant grains to verify results against expectations for testing new propellants in small scale samples."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.979"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.979"
                                            },
                                            "Text": {
                                                "val": "Conduct intermediate scale fragment testing on gun propellant grains to verify results against expectations for testing new propellants in small scale samples."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P002"
                                    },
                                    "Title": {
                                        "val": "BA 3 Insensitive Munitions Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "19.037"
                                        },
                                        "CurrentYear": {
                                            "val": "19.052"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.205"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.205"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.480"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.801"
                                        },
                                        "BudgetYearFour": {
                                            "val": "20.208"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.637"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "1)  Transition of technologies developed by the Program are tracked and documented by technology maturity. \n2)  Munition Area Technology Group (MATG) Technology Roadmaps are prepared, evaluated, and analyzed by Joint Insensitive Munitions Technology Program management and technical staff. \n3)  Chairman's Annual Assessments for each MATG are critically reviewed by the Technical Advisory Committee to determine progress, transition plans, and relevance of each project.  \n4)  Project progress toward goals and milestones is assessed at each MATG meeting.  \n5)  Annual technical reports and papers are tracked and documented for the Program. \n6)  External peer review of projects conducted as part of Joint Army\/Navy\/NASA\/Air Force meetings."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "204"
                    },
                    "ProjectTitle": {
                        "val": "Enabling Fuze Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.186"
                        },
                        "CurrentYear": {
                            "val": "6.184"
                        },
                        "BudgetYearOne": {
                            "val": "6.237"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.237"
                        },
                        "BudgetYearTwo": {
                            "val": "6.340"
                        },
                        "BudgetYearThree": {
                            "val": "6.433"
                        },
                        "BudgetYearFour": {
                            "val": "6.547"
                        },
                        "BudgetYearFive": {
                            "val": "6.685"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This RDT&E effort will demonstrate fuze enabling technologies needed to develop weapons that address Joint priority capability areas including ones highlighted by OSD R&E Technology-Focused Modernization and Service S&T priorities including  Hypersonics, Long Range Precision Fires, Air Defense and Scalable Lethality. This effort will develop enabling technologies at the laboratory scale and transition them into Budget Activity (BA) 6.3 demonstration programs for weapons where priority  capabilities and technology needs have been identified and validated by the Program Executive Officers (PEOs) and the Heads of the Service Science and Technology (S&T) communities. Mature BA 6.2 fuze technologies will be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other munitions within their portfolios.  \n\nThe Joint Fuze Technology Program (JFTP) investments are focused on capability areas that have been validated by the PEOs and Heads of the Service S&T communities. The four capability areas are: \n1) Hard Target Survivable Fuzing, 2) Tailorable Effects (TE) Weapon Fuzing, 3) High Reliability Fuzing, and 4) Enabling Fuze Technologies and Common Architecture."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hard Target Fuzing"
                                    },
                                    "Description": {
                                        "val": "The Hard Target Fuzing challenges are grouped into three technology areas.  First, improved modeling and simulation (M&S) capabilities provide the validated computational tools necessary for hard target applications.  Second, basic phenomenology and understanding of the fuze environment is the science-based endeavor of providing the test equipment, instrumentation, and analysis techniques for experimentation and data gathering necessary for next generation fuzing.  Third, hard target survivable fuze components are developed to increase the effectiveness of facility denial munitions by improving the prediction tools and testing methodologies to evaluate the survivability and functionality of legacy and future fuzes.  Development of these technologies will enable next generation boosted and hypersonic penetrators to execute missions against hardened and deeply buried targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.549"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate modeling and simulation tool for predicting the dynamic response of hard target embedded fuze systems for shock environments.\n-  Complete demonstration of a low cost multi-G level fuze sensor suite that will discern penetration of concrete, sand\/soil, and voids."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.552"
                                            },
                                            "Text": {
                                                "val": "Complete and release modeling and simulation tools to Service weapon designers that improve the prediction of the dynamic response of embedded fuze systems for High G shock environments.\nConduct High G characterization testing for establishing design guidelines of ruggedizing fuzes in high shock environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.562"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.562"
                                            },
                                            "Text": {
                                                "val": "Conduct High G characterization testing for establishing design guidelines of ruggedizing fuzes in high shock environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tailorable Effects Fuzing"
                                    },
                                    "Description": {
                                        "val": "Develop fuzing for tailorable effects weapons that encompasses the ability to selectively vary the output of the weapon (Dial-a-Yield) and\/or the ability to generate selectable effects (e.g., directed blast, fragmentation).  Develop initiation and multi-point technologies; electronic safe and arm based multi-point initiators for tunable output – scalable yield warheads; MicroElectro-Mechanical Systems (MEMS) based multi-point initiators for tunable output\/scalable yield warheads; and smart fuzing for tailorable effects weapons.  These technologies will enable weapons that can effectively defeat a variety of targets while minimizing unintentional collateral effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.413"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate wirelessly powering and functioning distributed detonating output technology in a multi-output safe, arm, and fire system.\n-  Demonstrate fuze micro-detonator for application in medium caliber and area effects weapons that provides 20% increase in performance and 30% decrease in size over current technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.415"
                                            },
                                            "Text": {
                                                "val": "Demonstrate government owned detonator formulation for in-line electronic safe arm device (ESAD) used in conventional and High G weapon applications.\nDevelop fuze critical component technologies for in-line ESADs such as high voltage switches that provide alternatives to current single point solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.425"
                                            },
                                            "Text": {
                                                "val": "Develop fuze critical component technologies for in-line ESADs such as high voltage switches that provide alternatives to current single point solutions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Reliability Fuzing"
                                    },
                                    "Description": {
                                        "val": "Develop high reliability fuzing architectures, fuzing components, and Unexploded Ordnance (UXO) reduction features.  These technologies will enable the next generation of cluster munitions to achieve the required greater than 99 percent reliability goal.  Evolving DoD emphasis on increased weapon system reliability is driving the need to consider new and novel approaches for achieving increased fuze reliability while maintaining or enhancing fuze design safety.  DoD policy, higher weapon reliability expectations and harsher weapon system operational requirements are dictating the need for higher fuze reliability than available using current technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.647"
                                            },
                                            "Text": {
                                                "val": "-  Develop liquid reserve lithium oxyhalide battery technology with fast rise time and maintain low temperature performance in weapon applications.\n-  Develop MEMS scale stab detonator and micro-scale firetrain technologies for miniature fuzing applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.649"
                                            },
                                            "Text": {
                                                "val": "Complete development for miniature power source components for area effects weapons.\nDemonstrate a highly reliable and robust opto-electrical fuze indicator technology to provide safety status of the munitions for weapon handlers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.658"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.658"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a highly reliable and robust opto-electrical fuze indicator technology to provide safety status of the munitions for weapon handlers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in FY 2019 funding will allow transition of critical fuze components technologies needed to address fuze base single point failures."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Fuze Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop common\/modular fuze architecture; innovative fuze component technologies; sensors; next generation fuze setting capability, tools and modeling; and fuzing power sources.  These fuzing technologies will provide smaller, more cost effective solutions while meeting or exceeding the performance of existing technologies.  Development of these technologies will enable future weapon applications to be more mission adaptive and smaller along with improved target detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.577"
                                            },
                                            "Text": {
                                                "val": "-  Conduct testing on advanced proximity RF algorithms with wideband operation to provide improved weapon target detection accuracy and range.\n-  Develop miniature thermal battery technology to yield fast rise time and high power density required for small munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.568"
                                            },
                                            "Text": {
                                                "val": "Develop, through additive manufacturing, conformal antennas with wideband operation to provide fuze sensor waveforms for target detection.\nDevelop non-RF detection and advanced algorithm technologies for fuzing applications for Counter-UAS weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.592"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.592"
                                            },
                                            "Text": {
                                                "val": "Develop non-RF detection and advanced algorithm technologies for fuzing applications for Counter-UAS weapons."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P301"
                                    },
                                    "Title": {
                                        "val": "BA 3 Enabling Fuze Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.588"
                                        },
                                        "CurrentYear": {
                                            "val": "6.627"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.678"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.678"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.781"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.949"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1)  Transition of technologies developed by the Program are tracked and documented by technology maturity.\n2)  Fuze Area Technology Group (FATG) Technology Roadmaps are prepared, evaluated, and analyzed by Joint Fuze Technology Program management and technical staff.\n3)  Chairman's Annual Assessments for each FATG are critically reviewed by the Technology Assessment Group and Technology Advisory Committee to ensure the JFTP is strategic focused and strong transitions are taking place.\n4)  Project progress toward goals and milestones is assessed at each FATG meeting.\n5)  Annual technical reports and papers are tracked and documented for the Program.\n6)  Technology Transition Agreements in place with Munitions programs."
                        }
                    }
                }
            ]
        }
    }
}