{
    "id": "2020-AirForce-PB-3600-MJBOOK-3-0-dae65ec315c4e8a6016da9aad32868ad9d723aca22c2ec6866c6d33ef17d1a4a-80",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1206423F"
        },
        "ProgramElementTitle": {
            "val": "Global Positioning System III - Operational Control Segment"
        },
        "R1LineNumber": {
            "val": "310"
        },
        "MdapCode": {
            "val": "456"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "3520.831"
            },
            "PriorYear": {
                "val": "492.986"
            },
            "CurrentYear": {
                "val": "509.258"
            },
            "BudgetYearOne": {
                "val": "445.302"
            },
            "BudgetYearOneBase": {
                "val": "445.302"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "487.440"
            },
            "BudgetYearThree": {
                "val": "406.336"
            },
            "BudgetYearFour": {
                "val": "291.066"
            },
            "BudgetYearFive": {
                "val": "125.857"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "6279.076"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Global Positioning System (GPS) is a space based Positioning, Navigation and Timing (PNT) distribution system which operates through all weather. GPS supports both civil and military users in air, space, sea and land operations. GPS is a satellite-based radio navigation system that serves military and civil users worldwide. GPS users process satellite signals to determine accurate position, velocity and time. GPS must comply with Title 10 United States Code (USC) Sec 2281 which requires that the Secretary of Defense (SECDEF) ensures the continued sustainment and operation of GPS for military and civilian purposes, and 51 USC Sec 50112, which requires that GPS complies with certain standards and facilitates international cooperation.\n\nProgram Element (PE) 1206423F funds Research, Development, Test and Evaluation (RDT&E) for the GPS Next Generation Operational Control System (OCX) and the GPS Enterprise Integrator (EI). This includes advanced concept development such as support for Regional Military Protection (RMP), systems analysis, modernized control segment development, modernization\/deployment of 17 monitoring stations, mission planning development, training simulators, integrated logistics support products, test resources, systems engineering required to meet the Government's obligations to the international, military and civil communities, and system requirements verification. OCX acquisition was established to 1) provide command and control of legacy and GPS III satellites, 2) incorporate situational awareness to support Navigation Warfare (NAVWAR) and signal monitoring, 3) enable mission capability upgrades to support a warfighter effects-based approach to operations, and 4) integrate Department of Defense (DoD) information assurance and cybersecurity controls and capabilities. GPS EI is responsible for architecture and system definition (the analysis and definition, management, maintenance, and evolution of the GPS Enterprise requirements and interface technical documents) as well as for the planning, execution, and fielding of the GPS Enterprise.\n\nOCX funds support efforts such as engineering studies and analyses, architectural engineering studies, trade studies, technology needs forecasting, modernization initiatives, systems engineering, system development, resolving obsolescence issues, test and evaluation efforts, and mission operations. These activities support upgrades and product improvements for military and civil applications necessary to enable efforts to protect United States (U.S.) Military and Allies' use of GPS. Additionally, funds ensure OCX efforts meet current and future Joint Requirements Oversight Council (JROC) approved required capabilities.\n\nThe GPS Enterprise consists of Space, Ground Control, Nuclear Detonation (NUDET) Detection System (NDS) and User Equipment Segments. The Government is responsible for the integration of the GPS Segments such that they provide worldwide GPS capability to support the warfighter and over a billion national security, civil, Allied, and commercial GPS users.\n\nThe GPS EI project includes the efforts associated with the Government's prime contract tasks necessary to accomplish critical integrating function with the three GPS enterprise material segments along with the logistics, operational and transition communities. The GPS EI maintains the GPS current architecture and system definition, controls and validates interfaces, ensures compatibility of Generation II and III systems, and develops\/manages plans for execution and fielding of the GPS Enterprise. Further, GPS EI provides modeling, simulation, and technical analyses of impacts for Government directed enterprise level trades among the GPS segments leading to definition, management, maintenance, and evolution of the GPS Enterprise requirements and interface technical documents to build and ensure the integrity of the enterprise technical baseline, and perform system requirements verification.\n\nIn addition, the GPS EI project funds the technical evolution, risk reduction, enterprise-level testing and delivery of all GPS Enterprise capabilities. Examples for Generation II include electronic protection; for Generation III, additional anti-jamming protection and additional civil signals. To accomplish this, GPS EI delivers Test and Verification capabilities, Requirements and Interface Management, and Systems Integration support across the Space, Control, and User Segments. In this capacity, GPS EI is responsible for managing this cross-program work to provide these and other capabilities.\n\nGPS EI's analyses guides Government decisions to ensure efficient and effective synchronization and execution across all Generation II and III GPS programs. For Enterprise-wide integration to be successful, the GPS EI: works with the GPS and NDS prime contractor teams to develop plans for early risk reduction System Integration Demonstrations to ensure system interfaces and functionality meet user and system requirements; ensures all equipment and documentation is ready when needed; integrates and analyzes enterprise schedules; and conducts formal test and verification, including Requirement Verification Plans and System Test Plans and Procedures. GPS EI performs all these efforts across all GPS programs in all acquisition phases. The Government owns the GPS Enterprise system requirements and integration, and highly leverages the GPS EI team to eliminate the need to fund a development prime contractor to perform these functions. This enhances Government control, oversight and program accountability.\n\nSpace acquisition must respond with speed and agility to emerging adversary threats.  Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture.  Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n\nThis PE may include necessary civilian pay expenses required to manage, execute, and deliver OCX weapon system capability. The use of such program funds would be in addition to the civilian pay expenses budgeted in PEs 1206392F and 1206398F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "510.938"
                },
                "CurrentYear": {
                    "val": "513.235"
                },
                "BudgetYearOne": {
                    "val": "402.102"
                },
                "BudgetYearOneBase": {
                    "val": "402.102"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "492.986"
                },
                "CurrentYear": {
                    "val": "509.258"
                },
                "BudgetYearOne": {
                    "val": "445.302"
                },
                "BudgetYearOneBase": {
                    "val": "445.302"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-17.952"
                },
                "CurrentYear": {
                    "val": "-3.977"
                },
                "BudgetYearOne": {
                    "val": "43.200"
                },
                "BudgetYearOneBase": {
                    "val": "43.200"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-3.977"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-17.952"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "43.200"
                                },
                                "BudgetYearOneBase": {
                                    "val": "43.200"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2020: +$43.200M fund to the June 2018 Independent Cost Estimate (ICE)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "67A021"
                    },
                    "ProjectTitle": {
                        "val": "OCX"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3116.549"
                        },
                        "PriorYear": {
                            "val": "435.930"
                        },
                        "CurrentYear": {
                            "val": "445.365"
                        },
                        "BudgetYearOne": {
                            "val": "380.342"
                        },
                        "BudgetYearOneBase": {
                            "val": "380.342"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "420.635"
                        },
                        "BudgetYearThree": {
                            "val": "341.416"
                        },
                        "BudgetYearFour": {
                            "val": "291.066"
                        },
                        "BudgetYearFive": {
                            "val": "125.857"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5557.160"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "GPS is a space based PNT distribution system which operates through all weather. This project funds the research and development for OCX. This includes, but is not limited to, advanced concept development, systems engineering and analysis, modernized control segment and mission planning development, modernization\/deployment of 17 monitoring stations, training simulators, integrated logistics support products, and test resources.\n\nOCX acquisition was established to: 1) provide command and control of legacy and GPS III satellites; 2) incorporate situational awareness to support NAVWAR and signal monitoring; 3) enable mission capability upgrades to support a warfighter effects-based approach to operations; and 4) integrate DoD information assurance and cybersecurity controls and capabilities. OCX funds will support efforts such as engineering studies and analyses, architectural engineering studies, trade studies, technology needs forecasting, technology development, systems engineering, system development, test and evaluation efforts and mission operations in support of upgrades and product improvements for military and civil applications necessary to support efforts to protect U.S. military and Allies' use of GPS. Additionally, funds will ensure efforts to meet current and future JROC approved required capabilities. \n\nFunding will also support new capabilities being developed by the GPS III Follow-On (GPS IIIF) production program along with RMP.  This effort will research potential impacts and develop solutions due to the GPS IIIF modifications, upgrade monitoring stations, and implement advances in collection and integration of RMP high-power regional Military Code (M-Code) signals.\n\nOCX Block 0 (through Iteration 1.5) is the Launch and Control System (LCS) intended to conduct Launch and Early Orbit (LEO) operations and the on-orbit checkout of all GPS III satellites. OCX Block 0 is a subset of OCX Block 1.\n\nOCX Block 1 (adds Iterations 1.6, 1.7 and 2.1 to Block 0) fields the operational capability to control all legacy satellites and civil signals (L1C\/A), military signals (L1P(Y), L2P(Y)) as well as the GPS III satellites and the modernized civil signal (L2C) and the aviation safety-of-flight signal (L5). In addition, Block 1 will field the basic operational capability to control the modernized military signals (L1M and L2M M-Code), and the globally compatible signal (L1C). It also fully meets information assurance\/cyber defense requirements.\n\nOCX Block 2 fields the advanced operational capability to control the advanced features of the modernized military signals (L1M and L2M M-Code). Blocks 1 & 2 are being delivered concurrently as a result of the Oct 2016 Nunn-McCurdy review."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OCX Development"
                                    },
                                    "Description": {
                                        "val": "Development of GPS OCX system to launch GPS III, operate a mixed GPS II and GPS III constellation, and provide for a robust Information Assurance system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "411.734"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "410.435"
                                            },
                                            "Text": {
                                                "val": "Continue contractor support of Block 0. Complete Iteration 1.7 and 2.1 software coding and start integration and test activities. Complete 1.7 and 2.1 Security Test and Evaluation activities. Start installation and integration of the monitoring stations equipment and OCX Monitor Station Receiver Equipment (OMSRE). Begin OMSRE Positioning Signal Integrity Continuity Assurance (PSICA) data collecting and Network Interface Module (NIM) tuning. Continue security certification leading to Authorization to Operate (ATO). Continue program office support and other related support activities that may include, but are not limited to studies, technical analysis, prototyping, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "342.142"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "342.142"
                                            },
                                            "Text": {
                                                "val": "Continue Iteration 1.7 and 2.1 integration and test activities Continue contractor support of the Block 0 baseline that is supporting GPS III satellite launch and checkout. Complete system level Factory Qualification Testing (FQT) and Site Acceptance Testing (SAT). Continue system maturity demonstrations, known as Transition Risk Reduction Operations (TRROs), in support of transition from the legacy Operational Control Segment (OCS) to OCX. Complete OMSRE PSICA data collecting and NIM tuning. Submit ATO packages for the Block 0 and Operational Block 1. Rapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, experimentation, prototyping, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 decreased compared to FY 2019 by $68.293M. Justification for this decrease is described in plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Support"
                                    },
                                    "Description": {
                                        "val": "Development of the Standardized Space Trainer (SST) to provide GPS III operator training. Development of Enterprise Mission Planning Systems. Facilities upgrades for Control Stations and associated equipment and servers. Systems Engineering (SE) including Technical Mission Analysis, Modernization SE and Technical Support, and Test and Evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.196"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.930"
                                            },
                                            "Text": {
                                                "val": "Complete work on the SST and development demonstration of capabilities. Complete installation and integration. Continue data collection, and tuning of the monitoring stations equipment and OMSRE. Complete facility upgrades and testing to include the Master Control Station (MCS), Alternate Master Control Station (AMCS), and remote monitor station sites."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.200"
                                            },
                                            "Text": {
                                                "val": "Complete work on the SST and development demonstration of capabilities. Complete installation and integration. Continue data collection, and tuning of the monitoring stations equipment and OMSRE. Complete facility upgrades and testing to include the MCS, AMCS, and remote monitor station sites."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $3.270M. Justification for this increase is described in plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 PE 1203265F"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "233.043"
                                        },
                                        "CurrentYear": {
                                            "val": "141.892"
                                        },
                                        "BudgetYearOne": {
                                            "val": "42.440"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "42.440"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.780"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.296"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.451"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.585"
                                        },
                                        "CostToComplete": {
                                            "val": "26.700"
                                        },
                                        "TotalCost": {
                                            "val": "477.187"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 05 PE 1203269F"
                                    },
                                    "Title": {
                                        "val": "GPS III Follow-On"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "426.889"
                                        },
                                        "BudgetYearOne": {
                                            "val": "462.875"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "462.875"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "279.423"
                                        },
                                        "BudgetYearThree": {
                                            "val": "258.041"
                                        },
                                        "BudgetYearFour": {
                                            "val": "294.800"
                                        },
                                        "BudgetYearFive": {
                                            "val": "286.368"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPAF 01 Line Item GPSIII"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "84.064"
                                        },
                                        "CurrentYear": {
                                            "val": "69.386"
                                        },
                                        "BudgetYearOne": {
                                            "val": "31.466"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "31.466"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.143"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.320"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.332"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.680"
                                        },
                                        "CostToComplete": {
                                            "val": "87.300"
                                        },
                                        "TotalCost": {
                                            "val": "352.691"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DOT"
                                    },
                                    "Title": {
                                        "val": "DOT (FAA) Civil Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.400"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "11.400"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Air Force is pursuing a \"Block\" approach for OCX in order to respond to warfighter capability requirements.  The strategy calls for capability (e.g., better signal maintainability, Unified S-Band (USB), Search and Rescue (SAR) GPS, and near-real time Command and Control (C2)), on-ramps for the follow-on contract for GPS III Space Vehicles (SVs) (starting no earlier than SV11) which will require updates to the OCX ground segment. Enterprise studies will ensure GPS Enterprise synchronization across space and ground segments."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Phase B OCX Block 1 & 2 Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aurora, CO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2392.664"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "388.550"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "377.976"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "321.639"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "321.639"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1041.585"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4522.414"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4522.414"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Technical Mission Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "31.614"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.467"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.909"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "15.124"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "15.124"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "44.750"
                                                    },
                                                    "TotalCost": {
                                                        "val": "119.864"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Enterprise SE&I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "53.503"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.429"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.841"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.795"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.795"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "9.087"
                                                    },
                                                    "TotalCost": {
                                                        "val": "76.655"
                                                    },
                                                    "TargetValue": {
                                                        "val": "76.655"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Modernization\/SE & Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "62.921"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.114"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.650"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.650"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "5.100"
                                                    },
                                                    "TotalCost": {
                                                        "val": "73.585"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX AMCS Facility Dev"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.777"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.615"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.392"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Standard Space Trainer (SST)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sonalyst, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Waterford, CT"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.500"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "5.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "32.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "32.500"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Enterprise Mission Planning"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton Eng Services"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.300"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "33.700"
                                                    },
                                                    "TargetValue": {
                                                        "val": "33.700"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Phase A Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "289.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "289.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "289.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS OCX T&E"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.672"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.421"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.626"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.626"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "22.919"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS OCX FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "133.502"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.913"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.730"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.949"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.949"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "17.158"
                                                    },
                                                    "TotalCost": {
                                                        "val": "171.252"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "112.419"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.156"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "18.948"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.919"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.919"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "54.170"
                                                    },
                                                    "TotalCost": {
                                                        "val": "204.612"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS OCX Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.677"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.686"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.940"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.840"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.840"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.125"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.268"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "OCX"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Block 0 Interim Contractor Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "1.7\/2.1 Design, Code & Unit Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GPS System Simulator (GSYS) Product Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "OCX Milestone B"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Software Iteration 1.7 Incremental Critical Design Review (CDR) (Include Iteration 1.6 CDR and update dates)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Software Iteration 2.1 Incremental CDR"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SV01 Launch (LCS Support)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "1.7\/2.1 Integration and Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GSYS Factory Qualification Test (FQT)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Monitor Station \/Legacy Ground Antenna Installs"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GSYS Accreditation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Iteration 1.7\/2.1 FQT Test Readiness Review (TRR)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Block 1 FQT"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "DD 250"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "OCX Block 1 Ready to Operate (RTO)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67A025"
                    },
                    "ProjectTitle": {
                        "val": "GPS Enterprise Integrator"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "404.282"
                        },
                        "PriorYear": {
                            "val": "57.056"
                        },
                        "CurrentYear": {
                            "val": "63.893"
                        },
                        "BudgetYearOne": {
                            "val": "64.960"
                        },
                        "BudgetYearOneBase": {
                            "val": "64.960"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "66.805"
                        },
                        "BudgetYearThree": {
                            "val": "64.920"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "721.916"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "GPS EI is responsible for technical baseline management, integration, synchronizing, testing, and verifying GPS III, OCX, Military Global Positioning System User Equipment (MGUE), M-Code Early Use (MCEU) and Contingency Operations (COps) programs that constitute the GPS Enterprise. Moreover, GPS EI is responsible for delivering a reliable PNT signal capability to military operators, the civil user community, and international partners. Similarly, the Government Joint Program Office owns and approves the technical baseline and is responsible for the successful fielding of all the GPS Segments (space, control, and user). In order to successfully execute its responsibilities, the Government relies on GPS EI's specific expertise to create an enterprise architecture, integrate segment products, and verify the enterprise requirements are adequately met.\n\nThe GPS EI is also responsible for developing and managing the Enterprise technical baseline, which reflects multiple stakeholders' requirements. Such stakeholders include the Department of Defense (DoD), foreign governments, industry, and the general public (through four public interface specifications). Furthermore, GPS EI ensures GPS capabilities meet the warfighter's, civil agencies', commercial entities', international treaties', and over four billion global GPS users' needs. The GPS EI also manages the process through which the JROC validated requirements are matured and flowed down to the system segments, while remaining consistent with various interfaces. This enables the GPS system to meet Title 10 of the USC, Sec 2281, mandated GPS capabilities, and various other obligations to the international community that provide inter-operable PNT signals. GPS EI is also responsible for all aspects of schedule and technical alignment across the segments. Additionally, GPS EI is responsible for creating and managing plans that provide early exercise of the products under development, compatibility analysis, and inter-segment testing. The inter-segment tests are required to prove OCX interoperability with GPS III satellites and modernized user equipment. More importantly, it ensures backwards compatibility with GPS Block II satellites and legacy user equipment.\n\nGPS EI activity supports the Government Joint Program Office's GPS spectrum protection at international forums such as the International Telecommunications Union. Such support consists of advocating on behalf of the United States Government when negotiating with foreign partners. In addition, GPS EI provides technical expertise to maintain relationships with other U.S. government agencies that include the Federal Aviation Administration (FAA), National Geospatial-Intelligence Agency (NGA), National Aeronautics and Space Administration (NASA), Departments of State (DOS), Transportation (DoT), Homeland Security (DHS), and Commerce (DOC).\n\nSpectrum expertise also ensures GPS priority for eight essential spectrum signals, including those required for civil air navigation and safety of life. Spectrum Protection prevents encroachment from commercial or foreign entities, which results in the preservation of warfighter's reliable signal. As a result, military operations and the integrity of the global economic infrastructure are protected. GPS EI also provides the GPS enterprise expertise in System Safety, Enterprise level System Security Engineering covering Acquisition Systems Program Security (i.e., personnel, industrial, operations, information, sensitive compartmented information, communication, and physical), Program Protection, Foreign Disclosure, Public Release reviews, Mission System Certification and Accreditation, and Enterprise Cybersecurity. GPS EI is accountable for the development, execution, and analysis of OCX, cybersecurity, and associated test cases necessary to deliver a secure operational system.\n\nGPS EI supports the Government development and implementation of various Systems Engineering documents, defines the methods of verification, conducts the analyses or tests, and assists the Government in conducting Integrated System Tests. In addition, GPS EI validates the system performance in various mission threat scenarios during its development. GPS EI provides in-depth technical expertise to enhance government control, oversight and program accountability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GPS Enterprise Integrator"
                                    },
                                    "Description": {
                                        "val": "The integration and technical baseline control of all elements of the GPS system (space\/control\/user) in support of both military and civil users.  Test and verification of integrated system performance in preparation for operational test and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "57.056"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "63.893"
                                            },
                                            "Text": {
                                                "val": "Continue execution of MGUE Developmental Testing (DT) (Integrated System Test 3-3 Phases 2-4). Execute MGUE lead platform tests. Support MGUE Operational Test and Evaluation (OT&E) test planning. Conduct integrated cyber test of the GPS MCS Architecture Evolution Program (AEP) in preparation for fielding of GPS III satellite. Conduct integrated system test of GPS III satellite with the GPS III COps upgrade to AEP (Integrated System Test 2-5) in preparation for OT&E and operational acceptance of GPS III. Conduct M-Code LiveSky tests in preparation for Core M-Code fielding. Support contractor cybersecurity test of OCX Block 1. Continue cybersecurity tests across all GPS segments (space\/ control\/user). Conduct test planning for Integrated System Test (IST) 2-6 (Core M-Code), IST 3-1 (OCX Block 1 and GPS Ill) and IST 3-2 (OCX Block 1, satellite constellation, and MGUE). Support launch and on-orbit checkout testing of GPS III SVs 01 and 02. Support planning and execution of test events for SVs 02 and 03. Execute testing for Selective Availability Anti-Spoofing Module (SAASM) Mission Planning System (SMPS) 5.B.3. Test and integrate M-Code monitoring for Early Use integration and Command and Control of M-Code on the existing OCS AEP.  Conduct tests and analyses to protect GPS users from interference sources that threaten performance of GPS receivers. Participate in international Global Navigation Satellite System (GNSS) forums to advocate for GPS regulatory and technical interests. Continue program office support and other related support activities that may include, but are not limited to studies, technical analysis, prototyping, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "64.960"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "64.960"
                                            },
                                            "Text": {
                                                "val": "Conduct integrated system test of Core M-Code capability (Integrated System Test 2-6) in preparation for OT&E and operational acceptance of M-Code Early Use (MCEU). Conduct government security test of OCX Block 1. Continue test planning for IST 3-1 (OCX Block 1 and GPS Ill) and IST 3-2 (OCX Block 1, satellite constellation, and MGUE). Continue to support MGUE operational test planning. Continue execution of MGUE DT (IST 3-3 Phases 2-4). Continue execution of MGUE lead platform tests in preparation for MGUE OT&E. Conduct M-Code LiveSky tests in support of MGUE field testing. Support launch and on-orbit checkout testing of SVs 03-05. Support planning and execution of test events for SVs 04-05. Execute testing for SMPS 5.C. Support AEP ground antennas and Commercial Off-The-Shelf (COTS) upgrades. Test and integrate M-Code monitoring stations upgrades. Continue cybersecurity tests across all GPS segments (space\/control\/user). Continue to conduct tests and analyses to protect GPS users from interference sources that threaten performance of GPS receivers. Participate in international GNSS forums to advocate for GPS regulatory and technical interests. Rapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, experimentation, prototyping, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increased compared to FY 2019 by $1.067M. Justification for this increase is described in plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 04 PE 1203164F"
                                    },
                                    "Title": {
                                        "val": "NAVSTAR Global Positioning System (User Equipment) (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "321.186"
                                        },
                                        "CurrentYear": {
                                            "val": "252.834"
                                        },
                                        "BudgetYearOne": {
                                            "val": "329.948"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "329.948"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "160.139"
                                        },
                                        "BudgetYearThree": {
                                            "val": "47.178"
                                        },
                                        "BudgetYearFour": {
                                            "val": "71.686"
                                        },
                                        "BudgetYearFive": {
                                            "val": "116.771"
                                        },
                                        "CostToComplete": {
                                            "val": "107.755"
                                        },
                                        "TotalCost": {
                                            "val": "1407.497"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 PE 1203265F"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "233.043"
                                        },
                                        "CurrentYear": {
                                            "val": "141.892"
                                        },
                                        "BudgetYearOne": {
                                            "val": "42.440"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "42.440"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.780"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.296"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.451"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.585"
                                        },
                                        "CostToComplete": {
                                            "val": "5.900"
                                        },
                                        "TotalCost": {
                                            "val": "456.387"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 05 PE 1203269F"
                                    },
                                    "Title": {
                                        "val": "GPS III Follow-On"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "426.889"
                                        },
                                        "BudgetYearOne": {
                                            "val": "462.875"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "462.875"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "279.423"
                                        },
                                        "BudgetYearThree": {
                                            "val": "258.041"
                                        },
                                        "BudgetYearFour": {
                                            "val": "294.800"
                                        },
                                        "BudgetYearFive": {
                                            "val": "286.368"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 PE 1203913F"
                                    },
                                    "Title": {
                                        "val": "NUDET Detection System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "31.304"
                                        },
                                        "CurrentYear": {
                                            "val": "19.778"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.300"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "49.300"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.162"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.456"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.719"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPAF 01 Line Item GPSIII"
                                    },
                                    "Title": {
                                        "val": "GPS III Space Segment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "63.664"
                                        },
                                        "CurrentYear": {
                                            "val": "69.386"
                                        },
                                        "BudgetYearOne": {
                                            "val": "31.466"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "31.466"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.143"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.320"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.332"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.680"
                                        },
                                        "CostToComplete": {
                                            "val": "26.400"
                                        },
                                        "TotalCost": {
                                            "val": "271.391"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SPAF 01 GPS IIIF SPAF"
                                    },
                                    "Title": {
                                        "val": "GPS IIIF SPAF"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "414.625"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "414.625"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "628.445"
                                        },
                                        "BudgetYearThree": {
                                            "val": "890.355"
                                        },
                                        "BudgetYearFour": {
                                            "val": "897.544"
                                        },
                                        "BudgetYearFive": {
                                            "val": "962.300"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In accordance with a \"back to basics\" acquisition approach and the exercise of strong oversight of development contractors, the Air Force is required to exercise complete ownership of the architecture, system definition, technical baseline, and integration of the GPS space, ground, and user segments. While this complex inter- segment integration is traditionally performed by a prime contractor under a systems development contract, for GPS, this approach requires the government to be the integrator. To execute this responsibility, the government leverages systems engineering and integration expertise from both Federally Funded Research and Development Center (FFRDC) contractors and a Systems Engineering & Integration (SE&I) contractor. The GPS EI function of the SE&I contractor is currently funded within this PE. The SE&I effort was originally procured in 2007 through a full and open competition, as was the new follow-on SE&I contract awarded in 2015. The SE&I follow-on strategy builds in year over year cost reductions as requirements stabilize. In FY 2023, the GPS EI budget will transition from PE 1206423F to PE 1203269F."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS EI Enterprise SE&I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "194.598"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "18.605"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "23.198"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "24.248"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "24.248"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "48.777"
                                                    },
                                                    "TotalCost": {
                                                        "val": "309.426"
                                                    },
                                                    "TargetValue": {
                                                        "val": "309.426"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Technical Mission Analysis 1"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "83.555"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.865"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.592"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "19.797"
                                                    },
                                                    "TotalCost": {
                                                        "val": "136.909"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Technical Mission Analysis 2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "80.219"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.703"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.075"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.827"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.827"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "22.942"
                                                    },
                                                    "TotalCost": {
                                                        "val": "138.766"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI MRTA\/MSTA"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Draper  Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambridge, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.446"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.436"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "6.800"
                                                    },
                                                    "TotalCost": {
                                                        "val": "25.332"
                                                    },
                                                    "TargetValue": {
                                                        "val": "25.332"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Enterprise Mission Planning"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.320"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.320"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.320"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Cybersecurity"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.158"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.745"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.982"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.985"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.985"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "15.929"
                                                    },
                                                    "TotalCost": {
                                                        "val": "48.799"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Additonal Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.082"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.236"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.511"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "6.974"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.003"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "EI Integrated Systems Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.294"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.294"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GPS EI FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.583"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.165"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.165"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.165"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.250"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.163"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.922"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.720"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.635"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.635"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "9.456"
                                                    },
                                                    "TotalCost": {
                                                        "val": "39.833"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GPS EI Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.105"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.366"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.800"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.071"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "GPS III AFL"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "GPS III SV03 Available for Launch"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GPS III SV04 Available for Launch"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GPS III SV05 Available for Launch"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "GPS III SV06 Available for Launch"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IST"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "IST 3-3\/MGUE Verification Testing (Phase II)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IST 3-3\/MGUE Verification Testing (Phase III)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IST 3-3\/MGUE Verification Testing (Phase IV)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IST 2-5\/GPS III and COps Verification Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IST 2-6\/MCEU Verification Testing"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "M-Code Early Use"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Support OCX Block 1 Ready to Transition to Operations (RTO)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}