{
    "id": "2020-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-a68dd9fef367b9c12cbc9abe43de0f366f7fa17ff175266a426863ca981e6b3b-1",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0601117E"
        },
        "ProgramElementTitle": {
            "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "42.129"
            },
            "CurrentYear": {
                "val": "46.575"
            },
            "BudgetYearOne": {
                "val": "54.122"
            },
            "BudgetYearOneBase": {
                "val": "54.122"
            },
            "BudgetYearTwo": {
                "val": "51.337"
            },
            "BudgetYearThree": {
                "val": "48.516"
            },
            "BudgetYearFour": {
                "val": "47.456"
            },
            "BudgetYearFive": {
                "val": "47.456"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.126"
                },
                "CurrentYear": {
                    "val": "47.825"
                },
                "BudgetYearOne": {
                    "val": "44.771"
                },
                "BudgetYearOneBase": {
                    "val": "44.771"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "42.129"
                },
                "CurrentYear": {
                    "val": "46.575"
                },
                "BudgetYearOne": {
                    "val": "54.122"
                },
                "BudgetYearOneBase": {
                    "val": "54.122"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.997"
                },
                "CurrentYear": {
                    "val": "-1.250"
                },
                "BudgetYearOne": {
                    "val": "9.351"
                },
                "BudgetYearOneBase": {
                    "val": "9.351"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-6.250"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.600"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.597"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "9.351"
                                },
                                "BudgetYearOneBase": {
                                    "val": "9.351"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018:  Decrease reflects SBIR\/STTR transfer offset by reprogrammings.\nFY 2019:  Decrease reflects Congressional adjustments.\nFY 2020:  Increase reflects the initiation of the Improved Interventions program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MED-01"
                    },
                    "ProjectTitle": {
                        "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.129"
                        },
                        "CurrentYear": {
                            "val": "46.575"
                        },
                        "BudgetYearOne": {
                            "val": "54.122"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.122"
                        },
                        "BudgetYearTwo": {
                            "val": "51.337"
                        },
                        "BudgetYearThree": {
                            "val": "48.516"
                        },
                        "BudgetYearFour": {
                            "val": "47.456"
                        },
                        "BudgetYearFive": {
                            "val": "47.456"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Operational Medical Science Program Element will explore and develop basic research in medical-related information and technology leading to fundamental discoveries, tools, and applications critical to solving DoD challenges.  Programs in this project address the Department's identified medical gaps in warfighter care related to health monitoring and preventing the spread of infectious disease.  Efforts will draw upon the information, computational modeling, and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  To enable in-theater, continuous analysis and treatment of warfighters, this project will explore multiple diagnostic and therapeutic approaches, including the use of bacterial predators as therapeutics against infections caused by antibiotic-resistant pathogens; developing techniques to enable rapid transient immunity for emerging pathogens; exploring methods to slow damage from pathological infection or traumatic injury; and leveraging fundamental biological mechanisms that enable certain species to be tolerant to various environmental insults.  Advances in this area may be used as a preventative measure to mitigate widespread disease."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "TBI Treatment for Blast Injuries"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct research in TBI treatment for blast injuries."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Outpacing Infectious Disease"
                                    },
                                    "Description": {
                                        "val": "Military readiness and national security depend on the health and well-being of military service members.  Unfortunately, today's antivirals and vaccines are often circumvented by fast-mutating viruses that evolve to develop drug resistance.  Military service members often deploy to areas with such diseases that require new protective measures to maintain readiness.  The Outpacing Infectious Disease thrust will investigate fundamental methods for using biology as a technology to create adaptive therapeutic response mechanisms to outpace viral diseases such as enabling co-evolution and co-transmission of newly developed therapeutics to ultimately outcompete the pathogen.  Key advances expected from this research include identifying methods to discover and develop new classes of dynamic therapeutics for fast-mutating viruses.  This approach represents a significant departure from conventional antiviral therapies, which typically rely on static solutions and continuous re-formulation and re-development in attempt to keep pace with emerging strains and disease variants.  Advances in this area may be applied to the mitigation of known, new, or emerging diseases that impact military readiness and pose a National Security risk as a potential pandemic."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.976"
                                            },
                                            "Text": {
                                                "val": "-  Performed screening, optimization, and generalization of therapeutic interfering particles (TIPs) to other virus cases using dynamic in vitro platforms.\n-  Demonstrated proof of concept TIP co-evolution in vitro.\n-  Performed initial in vivo assessment of TIP safety and efficacy for selected viruses.\n-  Demonstrated initial proof of concept of TIP efficacy and co-evolution in silico."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.190"
                                            },
                                            "Text": {
                                                "val": "-  Apply predictive mathematical models to optimize therapeutic interfering particle (TIP) packaging and mobilization for increased efficacy.\n-  Investigate factors that determine TIP long-term stability.\n-  Optimize TIPs for selected viruses and evaluate in relevant animal models of infection.\n-  Optimize TIP production, purification, and scale-up."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.894"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.894"
                                            },
                                            "Text": {
                                                "val": "-  Assess optimal route, dose, and timing of treatment for selected virus TIP candidates in relevant animal models. \n-  Determine the broad spectrum efficacy against multiple viral strains.\n-  Assess TIP transmission dynamics in animal models.\n-  Prepare regulatory package for first-in-human pre-clinical trial for TIPs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Preventing the Emergence of Disease (PED)"
                                    },
                                    "Description": {
                                        "val": "Many emerging infectious disease outbreaks have origins in animal reservoirs and occur in areas where DoD personnel are deployed, putting them at high risk of endemic and emerging diseases.  The Preventing the Emergence of Disease (PED) program will investigate how animal pathogens are transmitted to humans and explore novel approaches to prevent these events.  Tools such as detailed molecular analysis and bioinformatics will be leveraged. Researchers will develop models to quantify the probability of pathogen disease transmission from animals to humans.  Promising intervention approaches will be developed to prevent viral species jumps from animal reservoirs to humans. Predicting such jumps is a key capability to mitigating outbreaks originating in animal reservoirs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.789"
                                            },
                                            "Text": {
                                                "val": "-  Researched design of multiscale modeling framework to quantify risk of viral spillover that includes molecular, host-viral dynamics, ecological, and epidemiological components.\n-  Assessed zoonotic hotspots and established surveillance plan for selected viruses for longitudinal sampling of reservoir and vector species."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.040"
                                            },
                                            "Text": {
                                                "val": "-  Develop initial risk models of species jumps for selected viruses using biosurveillance data, geographic location, and animal-animal and\/or animal-human interactions.\n-  Develop preliminary mathematical models that predict parameters responsible for virus species jump and models that link viral genetics to transmission dynamics.\n-  Establish experimental testbeds to validate model predictions and to test preemptive approaches.\n-  Determine virus competence (ability to infect) in different vector species.\n-  Initiate in vitro testing of preemptive approaches for suppressing viral jump."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.598"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.598"
                                            },
                                            "Text": {
                                                "val": "-  Refine mathematical models of virus dynamics within and between two host species, and initiate validation with data from the field.\n-  Integrate virus transmission dynamics, environmental data, and viral fitness metrics into spillover risk model for selected viruses.\n-  Demonstrate proof-of-concept preemptive approaches for suppressing virus jump from one species to another in a relevant animal model."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Early Battlefield Interventions (EBI)"
                                    },
                                    "Description": {
                                        "val": "Based on initial research conducted under the Analysis and Adaptation of Human Resilience program, the Early Battlefield Interventions (EBI) program will explore new methods to slow and limit damage caused by acute trauma and infection often suffered by our warfighters under far-forward conditions.  Research efforts will apply advances in molecular and cellular biology, cell signaling, and biomaterials to develop new tools to alter the time course of pathological processes associated with infection and tissue damage.  This tactic is a departure from traditional therapeutic approaches that seek to control symptoms associated with active infections or innate physiological responses to tissue trauma.  Advances in this area may be applied to the creation of both prophylactic and therapeutic medical countermeasures to forward-deployed service members."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Identified approaches for new chemical biology methods for reversibly slowing biological processes in cells.\n-  Identified desired high-throughput methods to evaluate molecular mechanisms of novel approaches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.965"
                                            },
                                            "Text": {
                                                "val": "-  Develop chemical biology methods to reversibly slow biological processes in cells.\n-  Test interventions in human cells or enzymes.\n-  Begin to investigate delivery methods to successfully implement interventions in multi-cellular systems.\n-  Initiate software development for molecular design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.348"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.348"
                                            },
                                            "Text": {
                                                "val": "-  Characterize the molecular mechanisms for reversibly slowing biological processes in cells.\n-  Begin to test novel interventions to reversibly slow biochemical processes in multicellular biological systems (e.g., organoids, tissues).\n-  Evaluate protein stabilization induced by interventions in multicellular biological systems.\n-  Characterize intervention formulations to enhance cell penetration and reversibility."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 increase reflects concurrent tests conducted at the cellular and multicellular level and the evaluation and characterization of the results."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Interventions"
                                    },
                                    "Description": {
                                        "val": "The Improved Interventions program seeks to develop novel pharmacological interventions to quickly and holistically optimize the performance of the healthy warfighter.  The status quo for pharmacological intervention is one drug, one target, which often has many undesirable side effects. This program will create a platform to develop pharmacological interventions capable of modulating multiple targets within biological systems of the body, which will reduce side effects and promote safety.  Research will focus on the integration of novel bioinformatics approaches, high-content physiological model systems, and new bio-orthogonal chemical synthesis methods to treat the system in order to achieve desired physiological effects. Progress in this area will lead to new pharmacological discovery and design principles that will lead to products that can be used to augment physical fitness training and maintenance for military populations.  The Improved Interventions program builds upon the genomic and physiological analyses conducted under the Analysis and Adaptation of Human Resilience program."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.282"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.282"
                                            },
                                            "Text": {
                                                "val": "-  Generate preliminary datasets of proteins involved in a complex physiological process. \n-  Begin to build computational tools that model complex physiological processes.\n-  Begin development of informatics pipeline to predict targets regardless of prior knowledge.\n-  Analyze biochemical processes associated with proteins of unknown function.\n-  Identify chemical synthesis methods to build novel small molecules to target any protein or combination of proteins in the human proteome."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2020 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis and Adaptation of Human Resilience"
                                    },
                                    "Description": {
                                        "val": "The Analysis and Adaptation of Human Resilience program will explore new methods to maintain and optimize warfighter health in response to environmental insults such as new and emerging infectious diseases.  Research efforts in this area will apply recent advances in comparative biology, genetic sequencing, omics technologies, and bioinformatics to develop new tools for modulating health to ensure warfighter readiness.  One approach to achieve this goal is identifying the fundamental mechanisms that enable certain species to be tolerant to various environmental insults.  Genomic and physiological analyses of a wide array of resilient animal species may be combined with sophisticated algorithms to identify important patterns of survival.  By analyzing patterns in the underlying variability of host responses for resilient animals, one may formulate a survival blueprint to restore and maintain warfighter homeostasis in response to infection.  This approach is orthogonal to traditional infectious disease research, which primarily relies on reducing the pathogen load through drug intervention.  Research efforts within this program may enable discovery of novel methods to optimize human health against infectious diseases caused by multi-drug resistant pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.864"
                                            },
                                            "Text": {
                                                "val": "-  Screened susceptibility and tolerance to infection in different animal species.\n-  Completed an analysis of the host response to infection in different animal species.\n-  Applied validated algorithms and tools towards the discovery of tolerance mechanisms.\n-  Generated a preliminary set of tolerance-based interventions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.380"
                                            },
                                            "Text": {
                                                "val": "-  Analyze the tolerance response across different animal species, infection models and those discovered in animals using open source human data sets.\n-  Validate tolerance mechanisms in resilient animal models.\n-  Test tolerance-based interventions in susceptible animal models.\n-  Identify strategies for further developing interventions to improve warfighter health and performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2020 decrease reflects program completion."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}