{
    "id": "2020-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2da06648be01af3e3586c70d627e29e7f571c412db103c0685f2e8b518a81021-4",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602234D8Z"
        },
        "ProgramElementTitle": {
            "val": "Lincoln Laboratory"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "47.891"
            },
            "CurrentYear": {
                "val": "51.479"
            },
            "BudgetYearOne": {
                "val": "52.317"
            },
            "BudgetYearOneBase": {
                "val": "52.317"
            },
            "BudgetYearTwo": {
                "val": "53.317"
            },
            "BudgetYearThree": {
                "val": "54.338"
            },
            "BudgetYearFour": {
                "val": "55.376"
            },
            "BudgetYearFive": {
                "val": "56.551"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2018, $5.253 million of the $47.891 million is being executed under the Technical Intelligence, Project code 535."
        },
        "ProgramElementMissionDescription": {
            "val": "The Lincoln Laboratory (LL) research project 534 is an advanced technology research and development effort conducted through a cost reimbursable contract with the Massachusetts Institute of Technology (MIT). The LL project supports innovative, multi-disciplined research that addresses critical national security problems. The LL project funds innovations that directly lead to the development of new system concepts, technologies, components, and materials in support of Department of Defense (DoD) missions. Funding supports high-risk, high-payoff research, which provides unique and specialized capabilities for the current and emerging needs of the DoD.  The project funds ten technology areas.  Note: In FY 2019, the Cyber efforts moved to an individual project code 815.\n\nOf the technology areas, there are five core-technology areas:  Advanced Devices; Optical Systems and Technology; Information, Computation and Exploitation; Radio-Frequency (RF) Systems and Technology; and Cyber Security, Science and Engineering.  There are four emerging-technology initiatives:  Advanced Materials and Processes; Quantum System Sciences; Biomedical Sciences and Technology; and Autonomous Systems.  There is one Integrated Systems technology area, which focuses on combining novel component-level technologies to create system-level technology solutions for important DoD problems. \n\nThese ten technology areas provide critical capabilities that support all DoD mission areas pursued at the Laboratory. The categories are selected in consultation with the Office of the Under Secretary of Defense, Research and Engineering (OUSD(R&E)), are aligned with DoD Communities of Interest (CoI), and with guidance from other DoD agencies to address technology as well as system needs. The research in these categories adapts to solve emerging DoD problems as well as longstanding problems to which new technology advances can be applied. The individual projects in each area are selected with the goal of enhancing DoD capabilities significantly, rather than incrementally.\n\nSupporting these and other priority technology and capability areas are work efforts titled Technical Intelligence, project 535.  The Technical Intelligence Program provides global science and technology (S&T) awareness and context in order to assist the DoD decision-makers plan for an uncertain future. The program uses intelligence-based and open-source information to characterize today’s global S&T environment, exploiting novel technology watch and horizon scanning (TW\/HS) tools to identify nascent and disruptive technologies that will shape tomorrow’s future. The program complements this with tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations for emerging and disruptive technologies.\n\nSupporting these and other priority technology and capability areas are work efforts titled Cyber Security, Science and Engineering under project code 815 starting in FY 2019.  The Cyber Security, Science and Engineering research project 815 supports innovative research that addresses critical national security problems in cyber. The project funds innovations that directly lead to the development of new system concepts, technologies, and algorithms in support of Department of Defense (DoD) missions. Funding supports high-risk, high-payoff research, which provides unique and specialized capabilities for the current and emerging needs of the DoD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.748"
                },
                "CurrentYear": {
                    "val": "51.596"
                },
                "BudgetYearOne": {
                    "val": "52.467"
                },
                "BudgetYearOneBase": {
                    "val": "52.467"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "47.891"
                },
                "CurrentYear": {
                    "val": "51.479"
                },
                "BudgetYearOne": {
                    "val": "52.317"
                },
                "BudgetYearOneBase": {
                    "val": "52.317"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.857"
                },
                "CurrentYear": {
                    "val": "-0.117"
                },
                "BudgetYearOne": {
                    "val": "-0.150"
                },
                "BudgetYearOneBase": {
                    "val": "-0.150"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.761"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.096"
                                },
                                "CurrentYear": {
                                    "val": "-0.117"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.150"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.150"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "534"
                    },
                    "ProjectTitle": {
                        "val": "Lincoln Laboratory"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "47.891"
                        },
                        "CurrentYear": {
                            "val": "41.265"
                        },
                        "BudgetYearOne": {
                            "val": "42.101"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.101"
                        },
                        "BudgetYearTwo": {
                            "val": "43.005"
                        },
                        "BudgetYearThree": {
                            "val": "43.906"
                        },
                        "BudgetYearFour": {
                            "val": "44.812"
                        },
                        "BudgetYearFive": {
                            "val": "45.846"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The ten Lincoln Laboratory (LL) research areas that comprise the overall research and development portfolio are described below.  Note that the Cyber efforts move to an individual project code 815 in FY 2019.\n\nFive core-technology areas:\n• Advanced Devices emphasizes the development of devices and subsystems utilizing microelectronic, photonic, biological, and chemical technologies to enable new approaches to Department of Defense (DoD) systems. Efforts include technologies for high power Radio Frequency (RF) devices; multi-function, highly integrated lasers; fast and sensitive imagers; and mechanical microsystems for autonomous systems.\n• Optical Systems and Technology focuses on developing optical technologies for visible, infrared, and wide band spectroscopic sensing as well as communications systems. The efforts include high energy lasers; scalable focal plane imaging technology; photonic integrated circuits; optical system prototypes; and associated phenomenology measurements. \n• Information, Computation and Exploitation develops novel architectures, tools, and techniques for the processing, fusion, interpretation, computation, and exploitation of multi-sensor, multi-intelligence data. Efforts include innovative hardware and software technologies for graph processors and cloud computing; artificial intelligence (AI) and graph algorithms for analytics, including deep learning algorithms; multi-intelligence analytics, including open-source data processing techniques; and human-machine interfacing and automation technologies to enhance warfighter effectiveness and ability to work with advanced computing systems. \n• Radio Frequency (RF) Systems and Technology focuses on RF technologies to enhance warfighting capabilities in radars, electronic warfare (EW), and communications. Efforts include development of next generation phased arrays; ultra-wideband RF systems; compact RF systems; small satellite RF payload; and advanced algorithms for jammer mitigation and EW. \n• Cyber Security Science and Engineering Program focuses on the development of technologies and new techniques for the protection of systems against cyber-attack and exploitation. Efforts include research into technologies for cyber situational awareness, command and control; technology to improve resilience of systems to cyber-attack; and technologies for system exploitation research. \n\nFour emerging-technology areas:\n• Advanced Materials and Processes emphasizes research in new materials for additive manufacturing and emerging nanoscale materials. Efforts include research in understanding and controlling diamond chemical vapor deposition to support emerging and future applications; novel growth and transfer strategies for low-defect III-V devices; microwave circuits built with 3D printing; programmable shape change materials; and microsystems using metamaterials.\n• Quantum System Sciences focuses on the development of quantum-based technologies that support sensing, communication, computation, and algorithms using quantum information. Efforts include the demonstration of scalable computation platforms, magnetic field sensing using highly-compact, atomic-like defects in diamond, prototyping revolutionary quantum networking systems and technology, and research into advanced quantum algorithms and their applications.\n• Biomedical Sciences and Technology supports the development of bio-engineered and biomedical technologies to aid the warfighter. Efforts include brain imaging technologies; relevant research in brain and cognitive sciences including brain-computer interfacing (BCI); engineered biological systems to aid physiology understanding; and technologies to assess physical performance and enhance injury recovery. \n• Autonomous Systems has the objective of developing mobile, autonomous, robotic platforms, as well as sensors and algorithms that support key capabilities needed for a wide range of DoD applications. Efforts span advanced AI and processing; sensors and communications for unmanned platforms; platform designs and energy systems; human-machine interactions; and verification and validation of autonomous systems.\n\nOne system technology area:\n• Integrated Systems technology efforts use multiple new technologies to solve important national problems. Efforts selected for funding have an applied research component focused on integrated technology capability or technologies that facilitate greater levels of integrated capability. Projects target key Department of Defense (DoD) warfare domains, including space, air, land, sea surface, and undersea."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Devices"
                                    },
                                    "Description": {
                                        "val": "This project area targets the research and development of unique and innovative components, subsystems, and sensing concepts or methodologies that enable new solutions to important DoD problems. Activities under this technology area include specialized silicon and compound semiconductor-based devices for (Radio Frequency) RF, analog, mixed-signal, and digital electronics; photonics, optoelectronics, and laser technologies; novel devices and concepts for chemical, biological, and radiation sensing; and micro-hydraulic devices for motors and actuation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "More sensitive prototypes of larger format imagers integrated with small-pitch read-out integrated circuits (ROICs) will be developed. Subsystem demonstrations of photonic-integrated gyroscopes will measure the gyroscope accuracy and reliability.  Prototype circuits of a new class of high-power, diamond-based wideband transistors will help evaluate the promise of this technology. Gallium nitride (Ga N)-based photonic components operating at blue-green wavelengths will be matured and demonstrated in system prototypes. Projects for FY 2018 include developing higher performing substrates for infrared devices; developing pixel arrays that integrate germanium detectors with silicon integrated circuits for more capability at each pixel; and prototyping a new, highly compact clock that will aid in navigation and timing for small platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.005"
                                            },
                                            "Text": {
                                                "val": "Chemical sensing technology and blue-green laser developments began in FY 2017 and will conclude in FY 2019 with the demonstration of technology prototypes. This project area expects new applied research in more flexible and higher performing optical sensors, superconducting electronics, micro-hydraulic devices, power transistors, atomic clocks, and other advanced devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.032"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.032"
                                            },
                                            "Text": {
                                                "val": "Efforts will include developing new devices for advanced computing and new imaging devices with greater levels of digital integration and larger formats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2019 and FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Systems and Technologies"
                                    },
                                    "Description": {
                                        "val": "This project area conducts applied research and develops novel concepts, technologies, and systems to be used in next-generation optical systems for the DoD. Investments in optical-based technologies can fill the critical technology gaps in emerging DoD threat areas, such as anti-access\/area denial (A2\/AD), counter–weapons of mass destruction (C-WMD), and asymmetric warfare. Optical systems and technologies will also improve capabilities using new tactics, techniques, and procedures (TTPs) in traditional DoD mission areas such as intelligence, surveillance, and reconnaissance (ISR), space control, communications, and ballistic missile defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.344"
                                            },
                                            "Text": {
                                                "val": "Optical Systems and Technology will continue to develop technologies for high-energy lasers (HEL) that are finding many defensive and offensive DoD applications including blinding sensors and other countermeasures. Research in computing-intensive algorithms as well as more capable focal plane arrays will demonstrate higher resolution images. Until now, a laser radar on a large aircraft produced three-dimensional (3D) images only after hours of processing on the ground. Development of a small laser radar in FY 2018 will allow real-time 3D images on a small unmanned air vehicle. Microwave radars with multiple receivers have many advantages including multiple look angles, stealthy receivers, and higher resolution. Research with simultaneous microwave beams and optical beacons will explore techniques to overcome synchronization and coherent combining difficulties. The ability for wavelength agility will become as important in the optical domain as it is for microwave electronic warfare. So, development of multi-wavelength imaging spectrometers, long-wavelength infrared laser radars, and wavelength-agile short pulse lasers will provide continued capability growth while ensuring that deployed countermeasures in overused optical regions will not thwart DoD capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.600"
                                            },
                                            "Text": {
                                                "val": "Continue development on optical coherent combining and polarized lasers, which will enable a wide variety of applications in areas of HELs, optical imaging, multi-wavelength signal processing, and communications. Continue revolutionary work on computational design of free form optics. Develop technology for advanced spectrometers and optical communications. Begin seminal research into directed energy technologies. Continue development of advanced Lidar."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.379"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.379"
                                            },
                                            "Text": {
                                                "val": "Efforts will include research in photonic integrated circuits integration with microwave electronics, and new optical systems using meta-materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2019 and FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency (RF) Systems and Technologies"
                                    },
                                    "Description": {
                                        "val": "This project area focuses on research, development, and evaluation of innovative Radio Frequency (RF) technologies and system concepts for radar, signals intelligence, electronic warfare, and communications. Emerging national security challenges include a rapidly expanding threat spectrum, the increasing need to integrate sensors on platforms with severely constrained payloads, military operations in strong clutter and interference environments, detection and long duration tracking of difficult targets, and robustness against sophisticated electronic countermeasures. To address these new mission requirements, future RF systems will need to operate with increased bandwidth, higher dynamic range, higher-frequency bands, and lower size, weight and power (SWAP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.045"
                                            },
                                            "Text": {
                                                "val": "RF Systems and Technology will continue to focus research on advanced RF technologies in support of emerging needs for radar, electronic intelligence (ELINT) communications, and electronic warfare (EW) systems. The major research areas include: advanced RF arrays that deliver higher power and efficiency; wideband receivers for ELINT applications; simultaneous transmit and receive technology to enable multifunction RF systems; micro-hydraulic-jet technology for RF electronics cooling; and algorithm techniques for RF countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "The GaN on Si CMOS technology development will continue with improvements to advance prototypes. The fiber-combining RF array effort will develop critical enabling components. This project area expects new applied research in electronic warfare algorithms, transmit beam processing to increase RF system flexibility and performance, applications of 3D manufacturing to RF components, and other RF capability areas. Continue research on ultra-lightweight, flexible antennae arrays.  Begin research into conformal antennas. Explore wideband geolocation concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.178"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.178"
                                            },
                                            "Text": {
                                                "val": "Efforts will prioritize compact high power pulse generation and new techniques in broadband radar."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2019 and FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information, Computation, and Exploitation Sciences"
                                    },
                                    "Description": {
                                        "val": "This project area achieves technical gains in data processing, computation, exploitation, and information visualization for DoD applications. The volume, velocity, and variety of information production and consumption are growing at exponential rates. Novel computing architectures, hardware and analytical techniques provide tools to process “big data”. These tools for high throughput processing, fusion, interpretation, and exploitation of “big data” are applied to both real-time and stored multi-sensor, multi-intelligence data sets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.533"
                                            },
                                            "Text": {
                                                "val": "Several highly publicized attacks on computer networks were promulgated using unsecured Internet of Things (IoT). In FY 2018, an IoT project will prototype resilient cloud computing techniques in IoT networks to protect military systems. Advanced machine learning efforts will expand to national security environments where tagged training data are sparse. Sparse data introduces hurdles that are not being addressed in the commercial world. The new techniques will help the warfighter make better decisions based on current knowledge in a timely way. New real-time processing approaches such as the graph processor effort will reduce size, weight, and power (SWAP) to allow advanced analytics to be deployed at the tactical edge."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.860"
                                            },
                                            "Text": {
                                                "val": "Continue transition of the graph processor technology to use in the Supercomputing Center with a focus on end-to-end architecture design. Continue work that focuses on providing enough information for decision making at the tactical edge through increased efficiency of available information and machine learning techniques. Continue applied research on the use of deep learning techniques for data exploitation, with an emphasis on designing algorithms that are both efficient and that can explain their decision processes to humans. New research will focus on advances in networks, computing and technologies to support operations at the tactical edge."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.676"
                                            },
                                            "Text": {
                                                "val": "Projects will prioritize the application of Artificial Intelligence (AI) to tactical edge decision support systems, and new technologies in explainable AI and machine learning in low-resourced domains."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2019 and FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomedical Sciences and Technology"
                                    },
                                    "Description": {
                                        "val": "This project area develops advanced biomedical technology and systems to address health needs to enhance warfighter resilience and sustainability. The project area exploits expertise in advanced signal processing, optoelectronics, systems engineering and analysis, biology and chemistry, and other fields to develop novel methods and devices for interrogating and understanding physiological and cognitive aspects of the human domain. The overarching goal of these efforts is to increase human performance and prevent or predict injury through improved understanding of the biological mechanisms of disease and injury and through individualized biological monitoring, analysis, and interventions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.642"
                                            },
                                            "Text": {
                                                "val": "Advance understanding of the human brain, developing better diagnostics for cognitive load assessment and illnesses like mild Traumatic Brain Injury (mTBI), and improving field forward casualty care will facilitate diagnostics for and improvements in warfighter health and resilience. Several efforts are augmenting the Brain Research through Advancing Innovative Neuro-technologies (BRAIN) initiative being led by the Defense Advanced Research Projects Agency (DARPA) and The National Institutes of Health (NIH), and include the development of algorithms for cellular resolution brain mapping, the design and prototyping of neuron-size, biocompatible sensors for in-vivo neural monitoring, as well as the design and development of novel sensors for imaging systems to make them portable for use in the field and office to diagnose post-traumatic stress or brain injury, and to conduct real time cognitive load assessment for the warfighter. Sensorimotor tracking of neurological disorders in a large virtual reality environment is informing the detection of mTBI, with a focus on transitioning a simplified version of the capability to clinical settings. Other efforts are targeted at developing and implementing novel model systems and sensors, medical support tools, and the application of big data analytics to areas such as medical image analysis. Novel model systems and sensors include: the Lincoln Laboratory Artificial Gut that is helping to decipher the complex relationship between the nervous system and the microbiome, which has been correlated with depression and stress, as well as neuro-generative diseases including Parkinson’s Disease; and development, design and prototyping of an engineered sensor platform capable of real-time monitoring of health biomarkers in the body or in body fluids. Novel medical support tools include: a novel hearing aid design that uses deep neural networks to reduce the cognitive burden of isolating a single speaker in background noise, which is of relevance for normal and hearing impaired warfighters; and implementation of artificial intelligence to develop a system for field forward casualty care that reduces the burden on medics providing combat casualty care."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "All efforts are aligned with emergent science trends and anticipated DoD needs. Several efforts support developing a better understanding of and harnessing the brain-computer interface (BCI). Simultaneously, the Laboratory is finalizing its BCI strategy, based on its FY 2018 BCI systems analysis study. AI and machine learning play increasingly important roles in many projects. To address field forward needs, decision support tools and highly capable portable versions of sophisticated high-end laboratory-based imagers are being explored. Continue to place increasing emphasis on multimodal data collection and analysis in diverse application areas including cognitive and neuroscience, microbiome-related, and tissue healing. Continue to develop concepts and technologies in medical sensing, imaging, and diagnostics, cognitive analytics, and cellular and molecular engineering to inform multimodal approaches to understanding physiological and psychological status. Continue work on novel tool and platform development focused on accelerating and improving biotechnology research. Continue to explore medical image processing and rehabilitation tools by leveraging existing Laboratory expertise in image processing, signal analysis, and decision support algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.868"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.868"
                                            },
                                            "Text": {
                                                "val": "Continue development of brain-computer interface (BCI) hearing aid, and sensor platform capable of continuous real-time monitoring of health biomarkers. Develop exoskeleton hierarchical control structure, fluency metrics and individualization, and perform controls demonstration. Continue to create tools to engineer the native microbiome for controlled expression of therapeutic molecules. Continue to improve medical imaging and computational methods for tissue imaging. Continue to design and build a portable\/wearable near infrared brain imaging system, and develop a quantum-enhanced diamond based magnetic imaging microscope. Begin development of capabilities to support rapid virus countermeasures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in funding will be offset by the plan to move the future BCI effort to the Integrated Systems area."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "This project area addresses current and anticipated DoD mission needs in autonomous robotics. In DoD environments, unmanned systems must perform useful tasks as trusted, capable agents without continuous human operator control. These capabilities must be adapted to low-size, weight and power (SWAP) systems. Efforts include development of autonomy algorithms and technologies, such as perception and world modeling, planning, human-robot interaction, manipulation, learning and adaptation, and robotic platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.764"
                                            },
                                            "Text": {
                                                "val": "Coordination of robot swarms will continue to add features that allow optimization of goals even with a great deal of uncertainty for example, “the fog of war”. These improvements rely on continuing research in multi-agent coordination and machine learning algorithms. One learning algorithm project will emulate biological thinking for adapting to changing knowledge. Advances in autonomous systems rely not only on improved algorithms, but also better interfaces between hardware and algorithms, as well as more suitable hardware. This project area will conduct research into better tactile interfaces for grasping and manipulation, with an additional focus on building autonomous systems that will perform within prescribed performance bounds. These research thrusts will have important applications in autonomous robot augmentation for the warfighter. Also, being aware that the noise of an autonomous Unmanned Aerial Vehicle (UAV) can compromise its mission, work on an electroaerodynamic (EAD) propulsion system will lead to sustained noiseless flight. In addition, a study will provide an autonomous undersea mapping framework for future efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Autonomous systems are playing an increasingly important role in the DoD. A concept for autonomous undersea mapping, developed in FY 2018, will be tested in a tank, and then in an initial ocean test, in FY 2019. As swarms become more important work on algorithms, for resilience in degraded environments and risk taking by one for the good of all, are being developed. Work on human machine teaming, including algorithm and scenario development, can begin to enable robots to learn, co-adapt to their human counterparts, and share decision-making authority dynamically. Facilitate operations in uncertain, complex and dynamic environments by algorithm development for 3D semantic map construction and for autonomous task execution in simulated environments. Finally, another new effort is bringing tools from AI to complex air and missile defense scenarios to help facilitate the effective allocation and coordination of heterogeneous resources in real time against a large number of threats, with infrequent direct war fighter input. Incorporation of algorithms from the commercial world will hasten the development of autonomous systems for the DoD. Incorporation of technology improvements from the commercial world will lead to improvements in lower Size, Weight, Power and Cost (SWaP-C) systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.978"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.978"
                                            },
                                            "Text": {
                                                "val": "A majority of the FY 2019 projects will continue in FY 2020, including wide area ocean floor mapping, resilient perception for degraded environments, co-adaptive human and robotic teaming, and inter- and intra-team coordination. New efforts will focus on countering intelligent adversaries and integrating micro-robotics and micro-hydraulics for micro-Unmanned Air Vehicles (UAV)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2019 and FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantum System Sciences"
                                    },
                                    "Description": {
                                        "val": "This project area develops methods for sensing, communicating, and processing information using quantum mechanical manipulation not possible with classical computing techniques. Collaborations with major university quantum system science efforts are establishing a robust scientific foundation. On this foundation, application-oriented developments important for national security are being fostered."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.975"
                                            },
                                            "Text": {
                                                "val": "A unique feature of quantum mechanical manipulation is the correlation property, particularly for entangled states. Research takes advantage of these states to produce secure quantum networks and quantum computers, which, in principle, can do calculations far beyond the ability of any classical computer. A quantum communications system has been built over an in-ground fiber in the Boston metropolitan area. This system will continue to develop and test a robust and secure quantum network with applicability to a secure core network for the DoD. Quantum computing could have important implications for solving DoD problems that are intractable on classical computers. Multiple techniques for overcoming technical difficulties are being investigated. For example, advances in control and measurement of trapped ion and superconducting qubits will enable the development of noise correlation measurements and error correction techniques. These advances are a requirement for quantum computers. FY 2018 plans also include design of a fieldable, high-precision vector magnetometer based on advances in quantum magnetometry. This project area will also investigate electric field measurements that are based on the same physics and that employ much the same hardware as used for the magnetometer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "Research will place an emphasis on approaches to do quantum state transfer between a trapped ion and photon and leverage the ions for quantum sensing and quantum clocks. A linchpin for both quantum networks and quantum computers is the ability to manipulate robust quantum memories. Advances in quantum memories will build on the improved control and measurement techniques of FY 2018. Work on the majority of projects from FY 2018 will continue in FY 2019 and includes the following efforts. Develop 3D integration capability for superconducting transmon qubits, and demonstrate near term algorithms. Leverage initial quantum network testbed to perform preliminary demonstrations, and develop memory capabilities and PNT and sensing applications. Leverage and improve on demonstrated ultrasensitive sensing of vector magnetic and electric fields using nitrogen-vacancy pairs in diamond, develop algorithm and integrate into deployable geometry to increase TRL for sponsor transfer. Plans also include scaling quantum computer prototypes and investigating improved control and error correction mechanisms, and the continued analysis of quantum algorithms. A new effort will develop a simulation framework to support assessing biochemistry algorithms for real applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.973"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.973"
                                            },
                                            "Text": {
                                                "val": "Continue the research agenda from FY 2019, and include extended capability in quantum communications. In addition, novel materials and devices for topologically protected qubits will be developed."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2019 and FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials and Processes"
                                    },
                                    "Description": {
                                        "val": "This project area develops materials and processes that make a transformative impact on enduring national challenges. Areas of strategic focus are material property customization and material enablers for much lower Size, Weight, and Power (SWaP) systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.960"
                                            },
                                            "Text": {
                                                "val": "Lincoln Laboratory leverages additive manufacturing for materials discovery and property customization. Research into multimaterial fibers showed in FY 2017 unique long-wavelength properties. When woven into cloth in FY 2018, the cloth should make soldiers significantly less visible to heat-sensing cameras. This project area recently developed materials with large optical property changes in sub-millisecond times. Lincoln Laboratory continues to FY 2018, we will develop prototypes to improve this capability. Further work in FY 2018 will apply these materials to DoD and IC applications. This project area will conduct research into ”valleytronic” materials, which have the potential  to deliver extremely low-power memory and computing capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Develop new materials and architectures with novel programmable capabilities, including shape\/micro-movement and optical phase change. Develop novel material deposition\/printing\/manufacturing capabilities to support future DoD technology development. A new effort focuses on understanding and controlling diamond material synthesis, leveraging growth and characterization capabilities already developed under the Line, to take advantage of diamond’s unique chemical and physical properties. Develop critical control capabilities over diamond synthesis and rapid critical feedback capabilities via material characterization of the synthesized diamond.  Another new effort is developing the capability to grow GaN on a substrate, and then peel and transfer it, to enable low-defect III-V devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.161"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.161"
                                            },
                                            "Text": {
                                                "val": "Continue developing capability to build novel diamond-based devices to push transformative advances in a wide array of fields. Explore new applications for functional fabrics and fibers. Continue to develop advanced techniques for additive manufacturing of ceramics, metamaterials, and other new structures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2019 and FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Systems"
                                    },
                                    "Description": {
                                        "val": "This project area combines multiple new technologies to solve important national needs. Projects selected for funding have an applied research component focused on integrated technology capability or technologies that facilitate greater levels of integrated capability. Projects target key DoD warfare domains, including space, air, land, sea surface, and undersea. The intent is to support early work on systems that cut across the conventional categories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.805"
                                            },
                                            "Text": {
                                                "val": "This project area will continue two projects from FY 2017 and evolve two projects from other technology areas. The undersea laser communications project will refine the pointing-and-tracking technology needed to accomplish narrow beam communications, and will do in-water testing of a communication network between multiple moving platforms. The 3D space-based ladar effort will continue with risk reduction in key areas, including data-registration for forming 3D image and space optics technology. The project will accelerate the design of a future generation micro-air vehicle (MAV) for integrating advanced power, guidance, control, and payloads. Maturation of wafer-scale integration processes will lead to development of designs for applying these processes to small satellite systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "There are four efforts being supported. Technology development for agile low altitude (~200 kilometers) microsatellites is new, and has a focus on reducing risk for key enabling technologies including low Size, Weight, and Power (SWaP) propulsion and optical communications. Also new is the development and demonstration of a mobile diamond magnetometer, with quantum stability and solid-state vector measurement capability, to provide a jam resistant, navigation alternative for GPS-denied environments. The wafer-scale small satellite bus effort will continue to focus on system and payload design toward wafer-scale integration, and propulsion system design, fabrication, test and incorporation. The plan is to develop a highly integrated wafer-scale small satellite bus with a basic payload. The future generation Micro Air Vehicle project will continue to focus on integrating advanced sensing payloads and advanced autonomous system processing control algorithms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.856"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.856"
                                            },
                                            "Text": {
                                                "val": "In FY 2020 a project in brain-computer interfacing (BCI) will be transitioned to the Integrated System portfolio from the Biomedical Sciences and Technology area. The other projects in the portfolio will continue their research agendas from FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in funding in FY 2020 will accommodate increased development costs of maturing efforts and the plan to move a brain-computer interface (BCI) effort to the Integrated Systems area."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Security, Science and Engineering"
                                    },
                                    "Description": {
                                        "val": "The Cyber Security Science and Engineering Program focuses on the development of technologies and new techniques for the protection of systems against cyber-attack and exploitation. Projects include research into technologies for cyber situational awareness, command and control; technology to improve resilience of systems to cyber-attack; and technologies for system exploitation research."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.370"
                                            },
                                            "Text": {
                                                "val": "Plans include advancing the capability to discover and rapidly respond to cyber vulnerabilities, as well as improving significantly the design and architecture of embedded computer systems and data management systems, which will facilitate improvements in DoD cyber security and resilience. Research into novel approaches for computer hardware\/software design will guide the design and development of a fundamentally new computing system that is inherently secure and can ensure mission success even when compromised. This effort will be complemented by developing a data-centric approach to ensuring self-protection of data throughout storage, computation and transit. Research into cyber resilient approaches for mission assurance includes the development and implementation of a secure processing engine for autonomous systems, and the development and validation of an automated capability for contested environments where a host may be disabled or compromised. Other cyber efforts include further developing the capability to automatically generate effective cyber courses of action for evolving threat environments such as damage by an attacker after network penetration, securing small satellites against the growing threat of cyber-attack, and securing the ability to compute on private data without revealing it and demonstrating this capability for a Department of Homeland Security (DHS) application."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Cyber efforts moved to an individual project code in FY 2019."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Cyber efforts moved to an individual project code in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Cyber efforts moved to an individual project code starting in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Intelligence"
                                    },
                                    "Description": {
                                        "val": "The Technical Intelligence Program supports strategic intelligence analysis by providing global science and technology (S&T) awareness and context in order to inform Defense technology, engineering & acquisition planning for decision-makers in an uncertain future. The program’s primary objectives are to 1) Identify and contextualize emerging disruptive technologies (EDT) for senior leadership; and 2) Track global technology trends that challenge fundamental assumptions underpinning current operations and shaping the future of war. Leveraging technology watch and horizon scanning (TW\/HS) tools, and scouting areas of global technology development, the program’s end-state is to inform senior leadership on where best to invest resources in technology areas to maintain or regain global competitive advantage. The program complements this with tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations for emerging and disruptive technologies.  In FY 2018, $5.253 million is being executed for this effort, but it is erroneously shown under project code 534.  This effort is shown funded in FY 2019 and out under project code 535."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.253"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "535"
                    },
                    "ProjectTitle": {
                        "val": "Technical Intelligence"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "6.722"
                        },
                        "BudgetYearOne": {
                            "val": "6.716"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.716"
                        },
                        "BudgetYearTwo": {
                            "val": "6.812"
                        },
                        "BudgetYearThree": {
                            "val": "6.932"
                        },
                        "BudgetYearFour": {
                            "val": "7.064"
                        },
                        "BudgetYearFive": {
                            "val": "7.205"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Technical Intelligence Program supports strategic intelligence analysis by providing global science and technology (S&T) awareness and context in order to inform Defense technology, engineering & acquisition planning for decision-makers in an uncertain future. The program’s primary objectives are to 1) Identify and contextualize emerging disruptive technologies (EDT) for senior leadership; and 2) Track global technology trends that challenge fundamental assumptions underpinning current operations and shaping the future of war. Leveraging technology watch and horizon scanning (TW\/HS) tools, and scouting areas of global technology development, the program’s end-state is to inform senior leadership on where best to invest resources in technology areas to maintain or regain global competitive advantage. The program complements this with tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations for emerging and disruptive technologies.The Technical Intelligence Program supports the strategic intelligence analysis through providing global science and technology (S&T) awareness and context in order to inform Defense technology, engineering & acquisition decision-makers planning for an uncertain future. The program exploits novel technology watch and horizon scanning (TW\/HS) tools to identify nascent and disruptive technologies that will shape tomorrow’s future by integrating intelligence-based and open-source information to characterize today’s global S&T environment, this characterization, in combination with other technical analysis, will inform strategic decisions for capability development. The program complements this with tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations for emerging and disruptive technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technical Intelligence"
                                    },
                                    "Description": {
                                        "val": "The Technical Intelligence Program supports strategic intelligence analysis by providing global science and technology (S&T) awareness and context in order to inform Defense technology, engineering & acquisition planning for decision-makers in an uncertain future. The program’s primary objectives are to 1) Identify and contextualize emerging disruptive technologies (EDT) for senior leadership; and 2) Track global technology trends that challenge fundamental assumptions underpinning current operations and shaping the future of war. Leveraging technology watch and horizon scanning (TW\/HS) tools, and scouting areas of global technology development, the program’s end-state is to inform senior leadership on where best to invest resources in technology areas to maintain or regain global competitive advantage. The program complements this with tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations for emerging and disruptive technologies.  Note:  In FY 2018, $5.253 million is being executed for this effort, but erroneously shown under Project code 534."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, the Technical Intelligence program will continue to support efforts characterizing today’s global S&T environment, exploiting novel TW\/HS tools to identify nascent and disruptive technologies that will shape tomorrow’s future, and developing tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations of emerging and disruptive technologies. Specifically:\n• TW\/HS Tool Exploitation: ($3.5M) will continue to support the operational TW\/HS toolkit, TechSight, which is available to DoD researchers and scientists, and focus on expanding it to provide quicker data analytics for TW\/HS to support decision making through the inclusion of DoD contract, small business innovation research (SBIR) and grant award information. These developments will allow for strategic analysis of S&T and acquisition investments to inform technology, engineering, & acquisition decisions. The program will identify outreach opportunities to inform and train DoD S&T organizations in the usage of analytical tools and methodologies to support “in-house” decision making and expand organizational knowledge into emerging technology areas of strategic interest.\n• Technical Assessment Program: ($0.5M) will sponsor multiple technical assessment activities that support the community of interest topic areas and more emphasis will be placed on conducting impact assessments of emerging technologies. These assessments will inform the S&T community on direction for future capabilities to support joint and cross domain missions. \n• Intel Support to S&T: ($1.0M) will provide a bridge between the intelligence community (IC) and the S&T community to access the most relevant intelligence analysis, coordinate integration of intelligence with capability development, and conduct Red Cell assessments to inform technology investment shaping and strategic direction. An additional function will be to produce an annual S&T Intelligence Needs Plan providing the IC a formal understanding of intelligence requirements for the R&D community. \n• Wargaming: ($0.5M) will integrate emerging threats from kill chain analysis and potentially disruptive technologies from horizon scanning efforts through the DoD wargaming community to better understand the potential of emerging technologies to better inform both the DoD requirements process and the technical capability development process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.722"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, the Technical Intelligence program will conduct efforts to achieve its primary objectives: 1) Identify and contextualize emerging disruptive technologies (EDT) for senior leadership; and 2) Track global technology trends that challenge fundamental assumptions underpinning current operations and shaping the future of war.  Specifically:\n•\tTW\/HS Tool Exploitation: Continue operationalization of the TW\/HS toolkit, which includes its data analytics tool, ability to conduct two technology Horizon Scans a year, and identify, and ability to track investment data from public, private, and venture capital sources to identify where both US and foreign industries are investing resources in promising areas of capability development. \n•\tTechnical Assessment Program: Sponsor multiple technical assessment activities that support the community of interest topic areas and more emphasis will be placed on conducting impact assessments of emerging technologies. These assessments will inform the S&T community on direction for future capabilities to support joint and cross domain missions.\n•\tIntel Support to S&T: Provide a bridge between the intelligence community (IC) and the S&T community to access the most relevant intelligence analysis, coordinate integration of intelligence with capability development, and conduct Red Cell assessments to inform technology investment shaping and strategic direction. An additional function will be to produce an annual\nS&T Intelligence Needs Plan providing the IC a formal understanding of intelligence requirements for the R&D community.\n•\tWargaming: Integrate emerging threats from kill chain analysis and potentially disruptive technologies from horizon scanning efforts through the DoD wargaming community to better understand the potential of emerging technologies to better inform both the DoD requirements process and the technical capability development process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.716"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.716"
                                            },
                                            "Text": {
                                                "val": "In FY 2020, the Technical Intelligence program will continue to conduct efforts to achieve its primary objectives: 1) Identify and contextualize emerging disruptive technologies (EDT) for senior leadership; and 2) Track global technology trends that challenge fundamental assumptions underpinning current operations and shaping the future of war.  Specifically:\n•\tTW\/HS Tool Exploitation: Continue operationalization of the TW\/HS toolkit, which includes its data analytics tool, ability to conduct two technology Horizon Scans a year, and identify, and ability to track investment data from public, private, and venture capital sources to identify where both US and foreign industries are investing resources in promising areas of capability development. \n•\tTechnical Assessment Program: Sponsor multiple technical assessment activities that support the community of interest topic areas and more emphasis will be placed on conducting impact assessments of emerging technologies. These assessments will inform the S&T community on direction for future capabilities to support joint and cross domain missions.\n•\tIntel Support to S&T: Provide a bridge between the IC and the S&T community to access the most relevant intelligence analysis, coordinate integration of intelligence with capability development, and conduct Red Cell assessments to inform technology investment shaping and strategic direction. An additional function will be to produce an annual\nS&T Intelligence Needs Plan providing the IC a formal understanding of intelligence requirements for the R&D community.\n•\tWargaming: Integrate emerging threats from kill chain analysis and potentially disruptive technologies from horizon scanning efforts through the DoD wargaming community to better understand the potential of emerging technologies to better inform both the DoD requirements process and the technical capability development process."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase resources to support technology watch and horizon scanning in order to inform the DoD R&D investments."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "815"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Security, Science and Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.492"
                        },
                        "BudgetYearOne": {
                            "val": "3.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.500"
                        },
                        "BudgetYearTwo": {
                            "val": "3.500"
                        },
                        "BudgetYearThree": {
                            "val": "3.500"
                        },
                        "BudgetYearFour": {
                            "val": "3.500"
                        },
                        "BudgetYearFive": {
                            "val": "3.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Starting in FY 2019, the Cyber Security, Science and Engineering effort split off from project code 534 to become its own individual project code 815."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Cyber Security Science and Engineering Program focuses on the development of technologies and new techniques for the protection of systems against cyber- attack and exploitation. Efforts include research into technologies for cyber situational awareness, command and control; technology to improve resilience of systems to cyber-attack; and technologies for system exploitation research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security, Science and Engineering"
                                    },
                                    "Description": {
                                        "val": "The Cyber Security, Science and Engineering Program conducts research, development, evaluation, and deployment of prototype components and systems designed to improve the security of computer networks, hosts, and applications, thereby assuring the resilience of Department of Defense (DoD) missions against cyber-attack and exploitation.  A particular focus is the overlap between the DoD mission areas and the cyber domain. Efforts include cyber analysis; creation and demonstration of robust architectures that can operate through cyber-attacks; development of prototypes that demonstrate the practicality and value of new techniques for cryptography, cyber sensing, automated threat analysis and course of action selection, anti-tamper systems, and malicious code detection; demonstrations of the impact of cyber on traditional kinetic systems; quantitative, repeatable evaluation of these prototypes; and, where appropriate, deployment of prototype technology to national- and international-level exercises and DoD and intelligence community operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Cyber efforts were previously funded under Project P534 in FY 2018 and prior."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.492"
                                            },
                                            "Text": {
                                                "val": "Plan to continue improving the capability to rapidly respond to evolving cyber threats and new technology trends, and guide future plans for cyber security. Further develop the design and architecture of novel cyber resilient computer systems and data management systems, as well as capabilities and tools to support mission assurance. Plan is to focus on big data analytics in support of cyber situational understanding and effective, timely decision making; these capabilities will play a key role in future applied research. Continue to develop prototype cyber decision support systems that can automatically generate effective cyber security courses of action to protect systems under attack. Start work toward developing a technology to securely patch and monitor Industrial Control Systems that control industrial processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Continue to improve the capability to rapidly respond to evolving cyber threats and new technology trends, and guide future plans for cyber security. Continue to develop “clean slate” architectural approaches to mission computing and data protection, and applications of artificial intelligence techniques to cyber security."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minimal change between FY 2019 and FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}