{
    "id": "2020-Army-PB-2040-JBOOK-6862ccffed1a667db11cb620e9184b2662501ed68aad7c3c768162a310d4d712-8",
    "meta": {
        "filename": "2020-BASE_RDTE-2020-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2020.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605602A"
        },
        "ProgramElementTitle": {
            "val": "Army Technical Test Instrumentation and Targets"
        },
        "R1LineNumber": {
            "val": "184"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "57.395"
            },
            "CurrentYear": {
                "val": "84.805"
            },
            "BudgetYearOne": {
                "val": "46.974"
            },
            "BudgetYearOneBase": {
                "val": "46.974"
            },
            "BudgetYearTwo": {
                "val": "48.132"
            },
            "BudgetYearThree": {
                "val": "49.559"
            },
            "BudgetYearFour": {
                "val": "50.338"
            },
            "BudgetYearFive": {
                "val": "51.547"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "388.750"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides critical front-end investments for development of: new test methodologies; test standards; advanced test technology concepts for long range requirements; future test capabilities; advanced development of Modeling and Simulation and Instrumentation (MS&I) prototypes; and the full development of test instrumentation for the United States Army Test and Evaluation Command (ATEC), which includes the Operational Test Command (OTC) at Ft Hood, Texas; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Yuma Test Center (YTC) at Yuma Proving Grounds (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska and the Tropics Regions Test Center (TRTC), at various locations); and Redstone Test Center (RTC), Redstone Arsenal, Alabama. OTC consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Air Defense Artillery Test Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas. These activities support the development and fielding cycle of all Army acquisition programs including rapid fielding initiatives. Sustainment funding maintains existing testing capabilities at all locations by replacing unreliable, uneconomical, and irreparable instrumentation, as well as incremental upgrades of hardware and software for MS&I systems to assure adequate test data collection capabilities. This data supports acquisition milestone decisions for all commodity areas throughout the Army including programs such as the Joint Light Tactical Vehicle (JLTV), Advanced Multi-Purpose Vehicle (AMPV),  Network Integration Evaluation (NIE), Patriot Advance Capability Phase 3 (PAC-3), Warfighter Information Network - Tactical (WIN-T), Stryker, Bradley, Abrams, Guided Multiple Launch Rocket System (GMLRS), Joint Tactical Radio System (JTRS),and the Distributed Common Ground System - Army (DCGS-A)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.242"
                },
                "CurrentYear": {
                    "val": "62.379"
                },
                "BudgetYearOne": {
                    "val": "50.257"
                },
                "BudgetYearOneBase": {
                    "val": "50.257"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "57.395"
                },
                "CurrentYear": {
                    "val": "84.805"
                },
                "BudgetYearOne": {
                    "val": "46.974"
                },
                "BudgetYearOneBase": {
                    "val": "46.974"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "8.153"
                },
                "CurrentYear": {
                    "val": "22.426"
                },
                "BudgetYearOne": {
                    "val": "-3.283"
                },
                "BudgetYearOneBase": {
                    "val": "-3.283"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.037"
                    },
                    "CurrentYear": {
                        "val": "-0.074"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10"
                    },
                    "CurrentYear": {
                        "val": "22.5"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.81"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.283"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.283"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2018 congressional add ($10.000 million) for Cybersecurity of space and missile defense assets. \nFY19 congressional add ($22.500 million) for Cybersecurity of space and missile defense assets."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "628"
                    },
                    "ProjectTitle": {
                        "val": "Developmental Test Technology & Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.712"
                        },
                        "CurrentYear": {
                            "val": "68.072"
                        },
                        "BudgetYearOne": {
                            "val": "33.215"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.215"
                        },
                        "BudgetYearTwo": {
                            "val": "33.894"
                        },
                        "BudgetYearThree": {
                            "val": "34.851"
                        },
                        "BudgetYearFour": {
                            "val": "35.261"
                        },
                        "BudgetYearFive": {
                            "val": "36.064"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "284.069"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides critical front-end investments for development of new test methodologies, test standards, advanced test technology concepts for long range requirements, future test capabilities, and advanced instrumentation prototypes for subordinate commands of the Army Test and Evaluation Command (ATEC). These capabilities are required to support developmental testing requirements of high priority Army systems supporting Army modernization efforts. Where practical, efficiencies will be gained through the common use of developmental instrumentation in operational testing. A key element is sustaining aging instrumentation which maintains existing capabilities at test facilities by replacing unreliable, uneconomical and irreparable instrumentation, as well as lifecycle replacement and incremental upgrades of instrumentation and software, reducing their average age to assure adequate testing capabilities. This Project develops and sustains developmental test instrumentation and capabilities that provide the data necessary to support acquisition milestone decisions for all commodity areas throughout the Army. Significant examples include new instrumentation for the testing of Command, Control, Communication and Computer (C4) systems, upgrades to existing radars to extend their economic life, common data collection and analysis tools, non-intrusive instrumentation to test Unmanned Ground Vehicles and sensors, high speed - high definition digital imaging systems to capture missile flight events, and automation software to improve data collection of reliability, availability, and maintainability (RAM) testing."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Developmental Test Techology & Sustainment"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "Developmental Test Techology & Sustainment"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "22.5"
                                        },
                                        "Text": {
                                            "val": "Developmental Test Techology & Sustainment"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Developmental Test Technology Investment"
                                    },
                                    "Description": {
                                        "val": "Develops, acquires, and sustains critical test technology and instrumentation. Provides the necessary test instrumentation, computer and communications systems, data collection, analysis and reporting equipment, and other special test capabilities to successfully develop and test Army weapons and equipment. Provides the necessary live, virtual and constructive environment, hardware-in-the-loop capabilities, and modeling and simulation (M&S) needed for testing Army materiel solutions. Acquires instrumentation to measure performance of C4 systems; reliability, availability, and maintainability (RAM) data collection on tracked and wheeled vehicles; ballistic transducers for measuring chamber pressures during ammunition and barrel tests; supports development of common data collection instrumentation and data management systems used in testing across all test commodity areas and lifecycles; continues replacement and upgrade of range control instrumentation, radar, optics and telemetry used in missile testing; acquires data recorders, signal conditioning equipment, data processing equipment and other instrumentation for various aircraft tests; upgrades natural environments test instrumentation used for testing weapon systems, vehicles, munitions and support equipment in extreme hot desert environments as well as extreme cold conditions; continues upgrade of survivability\/vulnerability test capabilities in support of live fire testing; upgrades and replaces mobile range communications equipment and digital end devices; and improves test efficiency through the use of smart devices as data collectors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.712"
                                            },
                                            "Text": {
                                                "val": "Test centers provided, acquired, and upgraded instrumentation for C4, RAM, ballistics, missile, aviation and environmental testing across all test commodity areas and enhanced\/expanded the use of common data collectors, smart devices, and enterprise data management tools. Redstone Test Center (RTC) continued the procurement of critical hardware in support of their ongoing aviation and missile flight test telemetry enhancements. This Project greatly supported the testing of the UH-60V, AH-64E, CH-47F, and Joint Air-to-Ground missile programs. Aberdeen Test Center (ATC) continued procuring body armor test instrumentation and crew survivability instrumentation. Electronic Proving Ground (EPG) initiated the development of a system that enables test engineers to collect data from C4 systems with high fidelity and allows evaluators to correlate information for complete network analysis. White Sands Test Center (WSTC) continued updating, replacing, and modifying the obsolete ground stations and control infrastructure in support of the surrogate threat target capabilities (QF-4, QF-16, and subscale drones) at the test range. Yuma Test Center (YTC) continued to procure essential test support equipment to maintain machine shop capabilities that support test programs utilizing ballistic pressure transducers and adapters. This program continued to support ballistics testing at Aberdeen Proving Ground, Dugway Proving Ground, and Picatinny Arsenal."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "43.998"
                                            },
                                            "Text": {
                                                "val": "Test centers continue to provide, acquire and upgrade instrumentation for C4; RAM; ballistics, missile, aviation and environmental testing across all test commodity areas and enhance\/expand the use of common data collectors, smart devices, and enterprise data management tools. This includes the continuation and completion of previous fiscal year initiatives in addition to the execution of new initiatives to modernize test infrastructure. The Redstone Test Center (RTC) will complete a critical storage backup system modernization program that will permit RTC to store the substantial developmental test data. The Aberdeen Test Center (ATC) will continue its vehicle Crew Survivability Instrumentation and small arms instrumentation developments. The Electronic Proving Ground (EPG) will continue the development of Phoenix Architecture for data collection systems to store, analyze, and fully characterize the increased volume of data from high throughput network systems. The White Sands Test Center (WSTC) and the Yuma Test Center (YTC) will develop Counter-Unmanned Aerial System (cUAS) testing capabilities. WSTC will modernize test support equipment for Long Range Precision Fires and Air and Missile Defense and will continue its Flight Termination Systems Modernization program. YTC will continue service life extension programs for close-in and fly-out radars."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.215"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.215"
                                            },
                                            "Text": {
                                                "val": "Test centers will continue to provide, acquire, and upgrade instrumentation for C4, RAM, ballistics, missile, aviation and environmental testing across all test commodity areas and enhance\/expand the use of common data collectors, smart devices, and enterprise data management tools. Examples include ATC Crew Survivability Instrumentation during Live Fire Test and Evaluation (LFT&E); EPG Phoenix Architecture project for future data demand; RTC Aircraft Survivability Equipment (ASE) Data Processing and Analysis; WSMR Aerial Cable Lifecycle Replacement project to replace critical components reaching the end of their useful lives; and YTC cUAS test capability for anticipated cUAS technology systems which can detect, track, identify and collect data on hostile UAS systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding adjustments align program requirements with Army modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.574"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62C"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation Instrumentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.683"
                        },
                        "CurrentYear": {
                            "val": "16.733"
                        },
                        "BudgetYearOne": {
                            "val": "13.759"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.759"
                        },
                        "BudgetYearTwo": {
                            "val": "14.238"
                        },
                        "BudgetYearThree": {
                            "val": "14.708"
                        },
                        "BudgetYearFour": {
                            "val": "15.077"
                        },
                        "BudgetYearFive": {
                            "val": "15.483"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "104.681"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The United States (U.S.) Army Test and Evaluation Command (ATEC) plans, conducts and reports on operational tests, assessments and experiments in order to provide essential information for the acquisition and fielding of War Fighting Systems. Operational Test (OT) Modeling Simulation and Instrumentation (MS&I) collects required data from systems under test and the systems which they integrate with to support effectiveness, survivability, and suitability analyses. These systems also provide real-time position location and status tracking to support test control. The Army's Operations Tempo (OPTEMPO) has reduced the number of tactical units and vehicles available to support OT, making enhancement of live forces through simulation essential for testing in realistic, operational environments by simulating tactical engagements, additional units, message traffic, effects, and terrain. ATEC OT MS&I funding is used to adapt capabilities from other organizations (including within ATEC), purchase commercial off-the-shelf systems, and develop and sustain OT-unique simulation and instrumentation systems. As required, the Program Executive Office for Simulation, Training, and Instrumentation (PEO STRI) Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) provides development and integration of major simulation and instrumentation systems such as Integrated Live, Virtual, and Constructive (LVC) Test Environment (ILTE). The MS&I (Sustainment and Minor Development) program funds the expertise and the adaptation, purchases, minor development and sustainment requirements that support systems undergoing OT. Costs unique to specific systems under test may require Program Manager (PM) funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling, Simulation and Instrumentation"
                                    },
                                    "Description": {
                                        "val": "Develops and enhances ATEC's simulation\/stimulation of Mission Command; Fire Support; Air Defense; Command, Control, Communications, and Computers Intelligence, Surveillance and Reconnaissance (C4ISR); and Network systems. Improves and sustains Real-Time Casualty Assessment (RTCA) (including ILTE capabilities). Also develops, enhances, and sustains Performance Instrumentation Systems, Time Space Positioning Information (TSPI), Telemetry Systems, and Imaging Systems together with their associated data management enabling capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.683"
                                            },
                                            "Text": {
                                                "val": "Continued to sustain ATEC's Fire Support, Air Defense, C4ISR, and Network OT tools. Improved OTC's Real Time Casualty Assessment (RTCA), secure networks and tactical engagement capabilities to support JLTV, Apache Block III, M109 Family of Vehicles, Gray Eagle, Spider, and Stryker Performance Improvement Program (PIP) OTs. Prepared for the Abrams and the Bradley PIP, AN\/TPQ-53 Radar, Distributed Common Ground System - Army (DCGS-A), and Joint Warning and Reporting Network (JWARN) OTs. Sustained Performance Instrumentation including data collection and reduction systems, TSPI, Telemetry and Imaging Systems and associated data management enabling capabilities. Transitioned to Windows 10, replaced IT systems not compliant with new and emerging cyber security requirements, and acquired additional Airborne Position Location System (APLS) to sustain Airborne and Special Operation OTs. Executed life cycle replacement of legacy MS&I systems which have reached end of useful life."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.119"
                                            },
                                            "Text": {
                                                "val": "Continue to sustain ATEC's Fire Support, Air and Missile Defense, C4ISR, and Network OT tools. Will improve OTC's RTCA secure network and tactical engagement simulation system capabilities to support future Army Integrated Air and Missile Defense (AIAMD), Joint Tactical Radio System (JTRS), Leaders Radio, Mid-Tier Networking Vehicular Radio (MNVR), Joint Enterprise Network Manager (JENM), and Shadow (RQ-7BVN) Tactical Unmanned Aerial System (TUAS) Operational Tests (OTs). Will support the Abrams and Bradley PIP, AN\/TPQ-53, Distributed Common Ground System - Army (DCGS-A), and Joint Warning and Reporting Network (JWARN) OTs. Will sustain Performance Instrumentation Systems, TSPI, and Telemetry and Imaging Systems and associated data management (e.g. collection, reduction, analysis, and visualization) enabling capabilities. Will execute life cycle replacement of legacy MS&I systems which have reached end of useful life. Will sustain and upgrade MS&I systems used for operational tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.759"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.759"
                                            },
                                            "Text": {
                                                "val": "Will continue to sustain ATEC's Fire Support, Air and Missile Defense, C4ISR, and Network OT tools. Will improve OTC's RTCA secure network and tactical engagement simulation system capabilities to support future Bradley, Global Position System III, Indirect Fire Protection Capability (IFPC), Patriot PDB-8, and Integrated Air and Missile Defense (IAMD) OTs. Will support the AIAMD, DCGS-A, Manpack, Joint Enterprise Network Manager (JENM), Leaders Radio, and Shadow (RQ-7BVN) TUAS OTs. Will sustain Performance Instrumentation Systems, TSPI, and Telemetry and Imaging Systems and associated data management (e.g. collection, reduction, analysis, and visualization) enabling capabilities. Will execute life cycle replacement of legacy MS&I systems which have reached end of useful life. Will sustain and upgrade MS&I systems used for operational tests."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY20 funding was adjusted to align program requirements with Army modernization priorities in support of the National Defense Strategy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "Description": {
                                        "val": "FY 2019 SBIR \/ STTR Transfer"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.614"
                                            },
                                            "Text": {
                                                "val": "FY 2019 SBIR \/ STTR Transfer"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 SBIR \/ STTR Transfer"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}